Repository: 25hours/openstack-manuals
Catalog: doc/install-guide/source/locale/*/LC_MESSAGES/install-guide.po
Languages: de, fr, id

source: This guide uses the Apache HTTP server with ``mod_wsgi`` to serve Identity service requests on ports 5000 and 35357. By default, the keystone service still listens on these ports. Therefore, this guide manually disables the keystone service.
de: Dieser Leitfaden verwendet den Apache HTTP-Server mit ``mod_wsgi`` um die Anfragen des Identitätsdienstes auf den Ports 5000 und 35357 zu verarbeiten. Standardmäßig lauscht der Keystone-Dienst weiterhin auf diesen Ports, deshalb wird der Dienst in diesem Leitfaden deaktiviert.
fr: Ce guide utilise le serveur HTTP Apache avec l'option ``mod_wsgi`` pour répondre aux requêtes de service d'Identité sur les ports 5000 et 35357. Par défaut, le service keystone écoute toujours sur ces ports. Par conséquent, ce guide désactive manuellement le service keystone.
id: Panduan ini menggunakan server Apache HTTP dengan ``mod_wsgi`` untuk melayani rute Identity permintaan pada port 5000 dan 35357. Secara default, layanan keystone masih mendengarkan pada port ini. Oleh karena itu, buku ini secara manual menonaktifkan layanan keystone.

source: This guide walks through an installation by using packages available through Debian 8 (code name: Jessie).
de: Dieser Leitfaden führt durch eine Installation unter Verwendung von Paketen, die von Debian 8 zur Verfügung gestellt werden (Codename: Jessie).
fr: Ce guide présente une installation à l'aide des packages disponibles avec Debian 8 (nom de code: Jessie).
id: Panduan ini berjalan melalui instalasi dengan menggunakan paket yang tersedia melalui Debian 8 (kode nama: Jessie).

source: This guide will show you how to install OpenStack by using packages available on Red Hat Enterprise Linux 7 and its derivatives through the RDO repository.
de: Dieser Leitfaden beschreibt wie Sie OpenStack mit Hilfe von Paketen installieren, die unter Red Hat Enterprise Linux 7 und seinen Derivaten durch das RDO-Repository verfügbar sind.
fr: Ce guide vous montre comment installer OpenStack à l'aide des packages disponibles sur Red Hat Enterprise Linux 7 et ses dérivés via les dépôts RDO.
id: Panduan ini akan menunjukkan cara untuk menginstal OpenStack dengan menggunakan paket yang tersedia pada Red Hat Enterprise Linux 7 dan turunannya melalui repositori RDO.

source: This guide will show you how to install OpenStack by using packages on openSUSE Leap 42.1 and SUSE Linux Enterprise Server 12 SP1 through the Open Build Service Cloud repository.
de: Dieser Leitfaden beschreibt wie Sie OpenStack mit Hilfe von Paketen installieren, die unter openSUSE Leap 42.1 und SUSE Linux Enterprise Server 12 SP1 im Open Build Service Cloud Repository verfügbar sind.
fr: Ce guide vous indique comment installer OpenStack à l'aide des packages de openSUSE Leap 42.1 et de SUSE Linux Enterprise Server 12 SP1 via le dépôt Cloud Open Build Service.
id: Panduan ini akan menunjukkan cara untuk menginstal OpenStack dengan menggunakan paket di openSUSE Leap 42.1 dan SUSE Linux Enterprise Server 12 SP1 melalui repositori Open Build Service.

source: This guide will walk through an installation by using packages available through Canonical's Ubuntu Cloud archive repository.
de: Dieser Leitfaden führt durch eine Installation mit Paketen aus dem Ubuntu Cloud Archiv-Repository von Canonical.
fr: Ce guide présente une installation à l'aide des packages disponibles via le dépôt d'archive Cloud Ubuntu de Canonical.
id: Panduan ini akan berjalan melalui instalasi dengan menggunakan paket yang tersedia melalui repositori arsip Canonical Ubuntu Cloud .

source: This image must have the trove guest agent installed.
fr: Cette image doit avoir l'agent guest trove installé.
id: Image ini harus memiliki trove guest agent diinstal.

source: This instance uses the ``cirros`` image.
de: Diese Instanz verwendet das ``cirros`` Abbild.
fr: Cette instance utilise l'image ``cirros``.
id: Instance ini menggunakan image ``cirros``.

source: This instance uses the ``default`` security group.
de: Diese Instanz verwendet die Sicherheitsgruppe ``default``.
fr: Cette instance utilise le groupe de sécurité ``default``.
id: Instance ini menggunakan security group ``default``.

source: This instance uses the ``m1.tiny`` flavor. If you created the optional ``m1.nano`` flavor, use it instead of the ``m1.tiny`` flavor.
de: Diese Instanz verwendet die Variante ``m1.tiny``. Wenn Sie optional die Variante ``m1.nano`` erstellt haben, verwenden Sie diese.
fr: Cette instance utilise le gabarit ``m1.tiny``. Si vous avez créé le gabarit optionnel ``m1.nano``, utilisez-le à la place de ``m1.tiny``.
id: Instance ini menggunakan flavor ``m1.tiny``. Jika Anda menciptakan opsi flavor ``m1.nano``, menggunakannya sebagai pengganti flavor ``m1.tiny``.

source: This instance uses the ``provider`` provider network. However, you must reference this network using the ID instead of the name.
de: Diese Instanz verwendet das ``provider`` Anbieternetzwerk. Sie müssen allerdings dieses Netzwerk über die ID und nicht den Namen referenzieren.
fr: Cette instance utilise le réseau fournisseur ``provider``. Néanmoins, vous devez référencer ce réseau en utilisant l'ID à la place du nom.
id: Instance ini menggunakan jaringan provider ``provider``. Namun, Anda harus referensi jaringan ini menggunakan ID bukan nama.

source: This instance uses the ``selfservice`` self-service network. However, you must reference this network using the ID instead of the name.
de: Diese Instanz verwendet das ``selfservice`` self-service Netzwerk. Sie müssen dieses Netzwerk aber mittels der ID und nicht des Namens angeben.
fr: Cette instance utilise le réseau self-service ``selfservice``. Néanmoins, vous devez référencer ce réseau en utilisant l'ID à la place du nom.
id: Instance ini menggunakan jaringan self-service ``selfservice``. Namun, Anda harus referensi jaringan ini menggunakan ID bukan nama.

source: This network requires a gateway to provide Internet access to all nodes for administrative purposes such as package installation, security updates, :term:`DNS`, and :term:`NTP`.
de: Dieses Netzwerk benötigt ein Gateway um allen Knoten Internetzugang für administrative Zwecke wie z.B. Paketinstallation, Sicherheitsupdates, :term:`DNS`, und :term:`NTP` zur Verfügung zu stellen.
fr: Ce réseau nécessite une passerelle pour fournir un accès Internet à tous les nœuds pour des besoins administratifs comme l'installation de package, de mises à jour de sécurité, le :term:`DNS`, et :term:`NTP`.
id: Jaringan ini memerlukan gateway untuk menyediakan akses Internet untuk semua node tujuan administratif seperti instalasi paket, update keamanan, :term:`DNS`, dan :term:`NTP`.

source: This network requires a gateway to provide Internet access to instances in your OpenStack environment.
de: Dieses Netzwerk benötigt ein Gateway um allen Instanzen in Ihrer OpenStack-Umgebung den Zugang zum Internet zur Verfügung zu stellen.
fr: Ce réseau nécessite une passerelle pour fournir un accès Internet aux instances de votre environnement OpenStack.
id: Jaringan ini memerlukan gateway untuk menyediakan akses Internet untuk instance di lingkungan OpenStack Anda.

source: This option lacks support for self-service (private) networks, layer-3 (routing) services, and advanced services such as :term:`LBaaS` and :term:`FWaaS`. Consider the self-service networks option if you desire these features.
fr: Cette option ne permet pas le support des réseaux self-service (privés), des services de niveau-3 (routage), et des services avancés comme :term:`LBaaS` et :term:`FWaaS`. Envisager l'option des réseaux self-service si vous souhaitez ces fonctionnalités.
id: Opsi ini tidak memiliki dukungan untuk self-service jaringan (private), layanan lapisan-3 (routing), dan layanan canggih seperti: istilah: `LBaaS` dan :term:` FWaaS`. Pertimbangkan opsi jaringan self-service jika Anda menginginkan fitur ini.

source: This output may differ from your environment.
de: Diese Ausgabe kann in Ihrer Umgebung abweichen.
fr: La sortie peut être différente sur votre environnement.
id: Output ini mungkin berbeda dari lingkungan Anda.

source: This output should indicate four ``heat-engine`` components on the controller node.
de: Die Ausgabe sollte auf dem Controller-Knoten vier ``heat-engine``-Komponenten anzeigen.
fr: La sortie devrait indiquer quatre composants "head-engine" sur le nœud contrôleur.
id: Output ini harus menunjukkan empat komponen ``heat-engine`` pada controller node.

source: This output should indicate three service components enabled on the controller node and one service component enabled on the compute node.
fr: La sortie d'écran devrait indiquer trois composants de service activés sur le nœud contrôleur et un composant de service activé sur le nœud compute.
id: Output ini harus menunjukkan tiga komponen layanan diaktifkan pada controller node dan satu komponen layanan diaktifkan pada compute node.

source: This section assumes proper installation, configuration, and operation of the Identity service using the Apache HTTP server and Memcached service as described in the :ref:`Install and configure the Identity service <keystone-install>` section.
de: Dieser Abschnitt setzt voraus, dass der Identitätsdienst unter Verwendung des Apache HTTP-Servers und des Memcached-Dienstes korrekt installiert und konfiguriert wurde und auch funktioniert, wie in Abschnitt :ref:`Install and configure the Identity service <keystone-install>` beschrieben.
fr: Cette section suppose la bonne installation, configuration, et fonctionnement du service d'Identité utilisant le serveur HTTP Apache et le service Memcached comme décrit dans la section :ref:`Installer et configurer le service d'Identité <keystone-install>`.
id: Bagian ini mengasumsikan instalasi, konfigurasi, dan operasi layanan Identity yang tepat menggunakan server Apache HTTP dan layanan Memcached seperti yang dijelaskan dalam bagian :ref:`Install and configure the Identity service <keystone-install>`.

source: This section assumes that you already have a working OpenStack environment with at least the following components installed: Compute, Image Service, Identity.
fr: Cette section suppose que vous avez déjà un environnement OpenStack fonctionnel avec au minimum les composants suivants d'installés: Compute, Service d'Image, Identité.
id: Bagian ini mengasumsikan bahwa Anda sudah memiliki lingkungan OpenStack bekerja, dengan setidaknya komponen berikut diinstal: Compute, Image Service, Identity.

source: This section assumes that you are following the instructions in this guide step-by-step to configure the first compute node. If you want to configure additional compute nodes, prepare them in a similar fashion to the first compute node in the :ref:`example architectures <overview-example-architectures>` section. Each additional compute node requires a unique IP address.
de: Im folgenden Abschnitt wird davon ausgegangen, dass Sie diese Anleitung Schritt für Schritt befolgen, um den ersten Compute-Node zu konfigurieren. Zur Konfiguration weiterer Compute-Nodes bereiten Sie sie wie den ersten Compute-Node wie im Abschnitt :ref:`Beispielarchitekturen <overview-example-architectures>` vor. Jeder zusätzliche Compute-Node benötigt eine eineindeutige IP-Adresse.
fr: Cette section suppose que vous suiviez pas à pas les instructions dans ce guide pour configurer le premier nœud compute. Si vous souhaitez configurer des nœuds compute supplémentaires, préparez-les de la même façon que le premier nœud compute dans la section :ref:`exemples d'architecture <overview-example-architectures>`. Chaque nœud supplémentaire nécessite une adresse IP unique.
id: Bagian ini mengasumsikan bahwa Anda mengikuti petunjuk dalam panduan ini langkah-demi-langkah untuk mengkonfigurasi compute node pertama. Jika Anda ingin mengkonfigurasi compute node tambahan, siapkanlah mereka dengan cara yang sama ke compute node pertama dalam bagian :ref:`example architectures <overview-example-architectures>`. Setiap compute node tambahan membutuhkan alamat IP yang unik.

source: This section creates the necessary virtual networks to support launching instances. Networking option 1 includes one provider (external) network with one instance that uses it. Networking option 2 includes one provider network with one instance that uses it and one self-service (private) network with one instance that uses it. The instructions in this section use command-line interface (CLI) tools on the controller node. For more information on the CLI tools, see the `OpenStack End User Guide <http://docs.openstack.org/user-guide/cli-launch-instances.html>`__. To use the dashboard, see the `OpenStack End User Guide <http://docs.openstack.org/user-guide/dashboard.html>`__.
de: Diese Sektion erzeugt die notwendigen Virtuellen Netzwerke, die den Start von Instanzen unterstützen. Netzwerk Option 1 beinhaltet ein Anbieternetzwwerk (external) mit einer Instanz, die es verwendet. Netzwerk Option 2 beinhaltet ein Anbieternetzwerk mit einer Instanz, die es benutzt, sowie einem self-service Netzwerk (privat) mit einer Instanz, die es verwendet. Die Anweisungen in dieser Sektion verwenden Kommandozeileninterface (CLI) Werkzeuge auf dem Kontrollknoten. Für weitere Informationen zu den CLI Werkzeugen lesen Sie den `OpenStack End User Guide <http://docs.openstack.org/user-guide/cli-launch-instances.html>`__. Zur Verwendung des Dashboards lesen Sie `OpenStack End User Guide <http://docs.openstack.org/user-guide/dashboard.html>`__.
fr: Cette section crée les réseaux virtuels nécessaires pour pouvoir lancer des instances. Le Réseau option 1 inclut un réseau fournisseur (externe) avec une instance qui l'utilise. Le Réseau option 2 inclut un réseau fournisseur avec une instance qui l'utilise et un réseau self-service (privé) avec une instance qui l'utilise. Les instructions de cette section utilise les outils de commande en ligne (CLI) sur le nœud contrôleur. Pour plus d'informations sur les outils de commande en ligne, voir le `Guide de l'Utilisateur Final OpenStack <http://docs.openstack.org/user-guide/cli-launch-instances.html>`__. Pour utiliser le dashboard, voir le `Guide de l'Utilisateur Final OpenStack <http://docs.openstack.org/user-guide/dashboard.html>`__.

source: This section describes how to install and configure a share node for the Shared File Systems service.
fr: Cette section décrit comment installer et configurer un nœud de partage pour le service de Systèmes de Fichiers Partagé.
id: Bagian ini menjelaskan cara menginstal dan mengkonfigurasi share bersama untuk layanan Shared File Systems.

source: This section describes how to install and configure storage nodes for the Block Storage service. For simplicity, this configuration references one storage node with an empty local block storage device. The instructions use ``/dev/sdb``, but you can substitute a different value for your particular node.
de: Dieser Abschnitt beschreibt wie Storage Nodes für die Nutzung des Block-Storage-Dienstes installiert und konfiguriert werden. Zur Vereinfachung bezieht sich diese Konfiguration auf einen Storage Node mit einem leeren Block-Storage-Gerät. In der Anleitung wird ``/dev/sdb`` verwendet, Sie können für Ihren Node jedoch auch andere Werte verwenden.
fr: Cette section décrit comment installer et configurer les nœuds de stockage pour le service de Stockage par Blocs. Pour simplifier, cette configuration référence un nœud de stockage avec un device bloc local vide. Les instructions indiquent ``/dev/sdb``, mais vous pouvez le substituer par une valeur différente correspondant à votre nœud en particulier.
id: Bagian ini menjelaskan cara menginstal dan mengkonfigurasi storage nodes untuk layanan Block Storage. Untuk mempermudah, konfigurasi ini referensi satu storage node dengan perangkat penyimpanan blok lokal kosong. Petunjuk menggunakan ``/dev/sdb``, tetapi Anda dapat mengganti nilai yang berbeda untuk simpul tertentu.

source: This section describes how to install and configure storage nodes that operate the account, container, and object services. For simplicity, this configuration references two storage nodes, each containing two empty local block storage devices. The instructions use ``/dev/sdb`` and ``/dev/sdc``, but you can substitute different values for your particular nodes.
fr: Cette section décrit comment installer et configurer les nœuds de stockage qui font tourner les services compte, conteneur, et objet. Pour simplifier, cette configuration référence deux nœuds de stockage, chacun contenant deux devices locales de stockage blocs vides. Les instructions utilisent ``/dev/sdb`` et ``/dev/sdc``, mais vous pouvez les substituer par des valeurs différentes en fonction de la configuration de vos nœuds.
id: Bagian ini menjelaskan cara menginstal dan mengkonfigurasi node penyimpanan yang mengoperasikan layanan account, kontainer, dan objek. Untuk mempermudah, konfigurasi ini me-referensi dua node penyimpanan, masing-masing berisi dua perangkat penyimpanan blok lokal kosong. Petunjuk menggunakan ``/dev/sdb`` dan ``/dev/sdc``, tetapi Anda dapat mengganti nilai yang berbeda untuk node tertentu.

source: This section describes how to install and configure the Block Storage service, code-named cinder, on the controller node. This service requires at least one additional storage node that provides volumes to instances.
de: Dieser Abschnitt beschreibt wie der Dienst Block-Storage auf dem Controller Node zu installieren und zu konfigurieren ist, Codename cinder. Dieser Dienst benötigt mindestens einen zusätzlichen Storage Node, der Datenräger für Instanzen zur Verfügung stellt.
fr: Cette section décrit comment installer et configurer le service de Stockage par Blocs, nom de code cinder, sur le nœud contrôleur. Ce service nécessite au minimum un nœud de stockage supplémentaire pour fournir les volumes aux instances.
id: Bagian ini menjelaskan cara menginstal dan mengkonfigurasi layanan Block Storage, code-named cinder, pada controller node. Layanan ini memerlukan setidaknya satu node storage tambahan yang memberikan volume untuk instance.

source: This section describes how to install and configure the Compute service on a compute node. The service supports several :term:`hypervisors <hypervisor>` to deploy :term:`instances <instance>` or :term:`VMs <virtual machine (VM)>`. For simplicity, this configuration uses the :term:`QEMU <Quick EMUlator (QEMU)>` hypervisor with the :term:`KVM <kernel-based VM (KVM)>` extension on compute nodes that support hardware acceleration for virtual machines. On legacy hardware, this configuration uses the generic QEMU hypervisor. You can follow these instructions with minor modifications to horizontally scale your environment with additional compute nodes.
de: Dieser Abschnitt beschreibt wie der Compute-Dienst auf einem Compute-Node installiert und konfiguriert wird. Der Dienst unterstützt verschiedene :term:`Hypervisoren <hypervisor>`zur Erzeugung von :term:`Instanzen <instance>` oder term:`VMs <virtual machine (VM)>`. Zur Vereinfachung verwendet diese Konfiguration den :term:`QEMU <Quick EMUlator (QEMU)>`-Hypervisor mit der :term:`KVM <kernel-based VM (KVM)>`-Erweiterung auf Compute-Nodes, die Hardwarebeschleunigung für virtuelle Maschinen unterstützen. Auf Legacy-Hardware verwendet diese Konfiguration den generischen QEMU-Hypervisor. Mit wenigen Änderungen können Sie diese Anleitungen dazu verwenden, Ihre Umgebung mit zusätzlichen Compute-Nodes horizontal zu skalieren.
fr: Cette section décrit comment installer et configurer le service Compute sur un nœud compute. Le service supporte plusieurs :term:`hyperviseurs <hypervisor>` pour déployer les :term:`instances <instance>` ou :term:`VMs <virtual machine (VM)>`. Pour simplifier, cette configuration utilise l'hyperviseur :term:`QEMU <Quick EMUlator (QEMU)>` avec l'extension :term:`KVM <kernel-based VM (KVM)>` sur des nœuds compute qui supportent l'accélération hardware pour les machines virtuelles. Sur du matériel ancien, cette configuration utilise l'hyperviseur générique QEMU. Vous pouvez aussi suivre ces instructions avec peu de modifications pour scaler horizontalement votre environnement avec des nœuds compute additionnels.
id: Bagian ini menjelaskan cara menginstal dan mengkonfigurasi layanan Compute pada node komputasi. Layanan ini mendukung beberapa :term:`hypervisors <hypervisor>` untuk pengerahan :term:`instances <instance>` atau :term:`VMs <virtual machine (VM)>`. Untuk mempermudah, konfigurasi ini menggunakan :term:`QEMU <Quick EMUlator (QEMU)>` hypervisor dengan :term:`KVM <kernel-based VM (KVM)>` ekstensi pada node komputasi yang mendukung akselerasi hardware untuk mesin virtual. Pada legacy hardware, konfigurasi ini menggunakan generik QEMU hypervisor. Anda dapat mengikuti petunjuk ini dengan sedikit modifikasi untuk horizontal skala lingkungan Anda dengan tambahan compute nodes.

source: This section describes how to install and configure the Compute service, code-named nova, on the controller node.
de: Dieser Abschnitt beschreibt, wie der Compute-Dienst auf dem Controller-Node zu installieren und zu konfigurieren ist, der Codename lautet Nova.
fr: Cette section décrit comment installer et configurer le service Compute , nom de code nova, sur le nœud contrôleur.
id: Bagian ini menjelaskan cara menginstal dan mengkonfigurasi layanan Compute, code-named nova, pada controller node.

source: This section describes how to install and configure the Database service, code-named trove, on the controller node.
fr: Cette section décrit comment installer et configurer le service de Base de Données, nom de code trove, sur le nœud contrôleur.
id: Bagian ini menjelaskan cara menginstal dan mengkonfigurasi layanan Database, code-named trove, pada controller node.

source: This section describes how to install and configure the Image service, code-named glance, on the controller node. For simplicity, this configuration stores images on the local file system.
de: Dieser Abschnitt beschreibt, wie der Abbilddienst auf dem Controller-Knoten zu installieren und zu konfigurieren ist, der Codename lautet Glance. Der Einfachheit halber werden Abbilder in dieser Konfiguration auf dem lokalen Dateisystem gespeichert.
fr: Cette section décrit comme installer et configurer le service d'Image, nom de code glance, sur le nœud contrôleur. Pour simplifier, cette configuration stocke les images sur le système de fichier local.
id: Bagian ini menjelaskan cara menginstal dan mengkonfigurasi layanan Image, code-named glance, pada controller node. Untuk mempermudah, konfigurasi ini menyimpan images pada sistem file lokal.

source: This section describes how to install and configure the OpenStack Identity service, code-named keystone, on the controller node. For performance, this configuration deploys Fernet tokens and the Apache HTTP server to handle requests.
de: Dieser Abschnitt beschreibt, wie der Identitätsdienst auf dem Controller-Knoten zu installieren und zu konfigurieren ist, der Codename lautet Keystone. Aus Performancegründen verwendet diese Konfiguration Fernet-Token und den Apache HTTP-Server zur Verarbeitung von Anfragen.
fr: Cette section décrit l'installation et la configuration du Service d'Identité OpenStack, nom de code keystone, sur le nœud contrôleur. Pour une question de performance, cette configuration déploie des tokens Fernet et le serveur HTTP Apache pour traiter les requêtes.
id: Bagian ini menjelaskan cara menginstal dan mengkonfigurasi layanan OpenStack Identity, code-named keystone, pada controller node. Untuk kinerja, konfigurasi ini mengerahkan Fernet token dan server Apache HTTP untuk menangani permintaan.
