Repository: 25hours/openstack-manuals
Catalog: doc/install-guide/source/locale/*/LC_MESSAGES/install-guide.po
Languages: de, fr, id

source: The CirrOS image includes conventional user name/password authentication and provides these credentials at the login prompt. After logging into CirrOS, we recommend that you verify network connectivity using ``ping``.
de: Das CirrOS Abbild beinhaltet konventionelle Benutzername/Passwort-Authentifizierung und stellt die Anmeldeinformationen an der Anmeldeeingabeaufforderung zur Verfügung. Nach der Anmeldung in CirrOS empfehlen wir die Verifizierung der Netzwerkverbindung mittels ``ping``.
fr: L'image CirrOS inclut une authentification classique nom d'utilisateur/mot de passe et fournit ces credentials à l'invite de connexion. Une fois connecté à Cirros, il est recommandé de vérifier la connectivité réseau à l'aide de la commande ``ping``.
id: Image CirrOS termasuk nama user / sandi otentikasi konvensional dan memberikan mandat ini pada prompt login. Setelah masuk ke CirrOS, kami sarankan Anda memverifikasi konektivitas jaringan menggunakan ``ping``.

source: The Dashboard (horizon) is a web interface that enables cloud administrators and users to manage various OpenStack resources and services.
de: Das Dashboard (Horizon) ist ein eine Webschnittstelle, die es Cloud-Administratoren und -Benutzern ermöglicht, verschiedene OpenStack-Ressourcen und -Dienste zu verwalten.
fr: Le Dashboard (horizon) est une interface web qui permet aux administrateurs et aux utilisateurs du cloud de gérer les différentes ressources et services OpenStack.
id: Dashboard (horizon) adalah antarmuka web yang memungkinkan administrator cloud dan user untuk mengelola berbagai sumber daya OpenStack dan layanan.

source: The Database service (trove) provides cloud provisioning functionality for database engines.
de: Der Datenbankdienst (Trove) bietet die Funktionalität, Datenbank-Engines für die Cloud zur Verfügung zu stellen.
fr: Le service de Base de Données (trove) fournit une fonctionnalité de provisionning Cloud pour les moteur de base de données (Database-as-a-Service).
id: Layanan Database (trove) menyediakan fungsionalitas cloud provisioning untuk database engines.

source: The Identity service authentication mechanism for services uses Memcached to cache tokens. The memcached service typically runs on the controller node. For production deployments, we recommend enabling a combination of firewalling, authentication, and encryption to secure it.
de: Der Authentifizierungsdienst für den Identitätsdienst verwendet memchached zum Zwischenspeichern von Tokens. Der memchached-Dienst läuft üblicherweise auf einem Controller-Knoten. Für Produktionsumgebungen empfehlen wir zur Absicherung eine Kombination aus Firewall, Authentifizierung und Verschlüsselung.
fr: Le mécanisme d'authentification du service d'Identité pour les services utilise Memcached pour mettre les jetons en cache. Le service memcached s’exécute généralement sur le nœud contrôleur. Pour les déploiements en production, il est recommandé de mettre en oeuvre une combinaison de fonctions pare-feu, authentification et chiffrement pour le sécuriser.
id: Mekanisme otentikasi layanan Identity untuk pelayanan menggunakan Memcached untuk cache token. Layanan Memcached biasanya berjalan pada controller node. Untuk pengerahan produksi, sebaiknya aktifkan kombinasi firewall, otentikasi, dan enkripsi untuk mengamankan itu.

source: The Identity service manages a catalog of API endpoints associated with the services in your OpenStack environment. Services use this catalog to determine how to communicate with other services in your environment.
de: Der Identitätsdienst verwaltet einen Katalog für API-Endpunkte, die den Diensten in Ihrer OpenStack-Umgebung zugeordnet sind. Dienste verwenden diesen Katalog um zu bestimmen, wie mit anderen Diensten in Ihrer Umgebung kommuniziert werden soll.
fr: Le service d'Identité gère un catalogue de endpoints API associés aux services dans votre environnement OpenStack. Les services utilisent ce catalogue pour déterminer comment communiquer avec les autres services dans votre environnement.
id: Layanan Identity mengelola katalog API endpoint terkait dengan layanan di lingkungan OpenStack Anda. Layanan menggunakan katalog ini untuk menentukan bagaimana berkomunikasi dengan layanan lain di lingkungan Anda.

source: The Identity service manages a catalog of services in your OpenStack environment. Services use this catalog to determine the other services available in your environment.
de: Der Identitätsdienst verwaltet einen Dienstekatalog in Ihrer OpenStack-Umgebung. Dienste verwenden diesen Katalog zur Identifikation weiterer verfügbarer Dienste in Ihrer Umgebung.
fr: Le service d'Identité gère un catalogue de services dans votre environnement OpenStack. Les services utilisent ce catalogue pour connaitre les autres services disponibles dans votre environnement.
id: Layanan Identity mengelola katalog layanan di lingkungan OpenStack Anda. Layanan menggunakan katalog ini untuk menentukan layanan lain yang tersedia di lingkungan Anda.

source: The Identity service provides a catalog of services and their locations. Each service that you add to your OpenStack environment requires a :term:`service` entity and several :term:`API endpoints<API endpoint>` in the catalog.
de: Der Identitätsdienst stellt einen Katalog an Diensten und Speicherorten zur Verfügung. Jeder Dienst, den Sie in Ihre OpenStack-Umgebung aufnehmen, benötigt eine :term:`service`-Entität und mehrere :term:`API- Endpunkte <API endpoint>` im Katalog.
fr: Le service d'Identité fournit un catalogue de services et leur emplacement. Chaque service ajouté à votre environnement OpenStack nécessite une entité de :term:`service` et plusieurs :term:`endpoints API<API endpoint>` dans le catalogue.
id: Layanan Identity menyediakan katalog layanan dan lokasi mereka. Setiap layanan yang Anda tambahkan ke lingkungan OpenStack Anda memerlukan :term:`service` entity dan beberapa :term:` API endpoint <API endpoint> ` dalam katalog.

source: The Identity service provides authentication services for each OpenStack service. The authentication service uses a combination of :term:`domains <domain>`, :term:`projects<project>` (tenants), :term:`users<user>`, and :term:`roles<role>`.
de: Der Identitätsdienst stellt für jeden OpenStack-Dienst Authentifizierungsdienste bereit. Der Authentifizierungsdienst verwendet eine Kombination aus :term:`Domänen <domain>`, :term:`Projekten <project>` (Mandanten), :term:`Benutzern <user>` und :term:`Rollen <role>`.
fr: Le service d'Identité fournit les services authentification pour chaque service OpenStack. Le service d'authentification utilise une combinaison de :term:`domaines <domain>`, :term:`projets<project>` (tenants), :term:`utilisateurs<user>`, et :term:`rôles<role>`.
id: Layanan Identity menyediakan layanan otentikasi untuk setiap layanan OpenStack. Layanan otentikasi menggunakan kombinasi: istilah: `domain <domain>`,: istilah: `proyek <project>` (penyewa),: istilah: `pengguna <user>`, dan: istilah: `peran <peran>` .

source: The Image service (glance) enables users to discover, register, and retrieve virtual machine images. It offers a :term:`REST <RESTful>` API that enables you to query virtual machine image metadata and retrieve an actual image. You can store virtual machine images made available through the Image service in a variety of locations, from simple file systems to object-storage systems like OpenStack Object Storage.
de: Der Abbilddienst (Glance) ermöglicht Benutzern das Entdecken, Registrieren und Abrufen von Abbildern von virtuellen Maschinen (VM). Es stellt eine :term:`REST <RESTful>` API zur Verfügung, die das Abfragen von Metadaten aus VM-Abbildern sowie das Abrufen von tatsächlichen Abbildern ermöglicht. Sie können vom Abbilddienst bereitgestellte VM-Abbilder auf verschiedene Arten speichern, vom einfachen Dateisystem bis zu Objektspeichersystemen wie dem OpenStack Objektspeicher.
fr: Le service d'Image (glance) permet aux utilisateurs de découvrir, enregistrer et récupérer les images de machines virtuelles. Il offre une API :term:`REST <RESTful>` qui permet d'interroger les metadata des images de machine virtuelle et de récupérer une image. Vous pouvez stocker les images de machine virtuelle mises à disposition par le service d'Image dans différents emplacements, du simple système de fichiers au systèmes de stockage objet comme le service de Stockage Objet OpenStack.
id: Layanan Image (glance) memungkinkan users untuk menemukan, daftar, dan mengambil image VM. Ia menawarkan :term:`REST <RESTful>` API yang memungkinkan Anda untuk query metadata image VM dan mengambil image yang sebenarnya. Anda dapat menyimpan image VM yang tersedia melalui layanan Image di berbagai lokasi, dari sistem file sederhana sampai sistem object-storage seperti Object Storage di OpenStack.

source: The Linux bridge agent builds layer-2 (bridging and switching) virtual networking infrastructure for instances and handles security groups.
fr: L'agent Linux bridge construit l'infrastructure de réseau virtuel de niveau-2 (bridging and switching) pour les instances incluant des tunnels VXLAN pour les réseaux privés et gère les groupes de sécurité.
id: Linux bridge agent membangun lapisan-2 (bridging dan switching) infrastruktur jaringan virtual untuk instances dan menangani security groups.

source: The Linux bridge agent only supports VXLAN overlay networks.
de: Der Linux Bridge Agent unterstützt nur VXLAN Overlay Netzwerke.
fr: L'agent Linux bridge supporte uniquement la superposition de réseaux VXLAN.
id: Linux bridge agent hanya mendukung jaringan overlay VXLAN.

source: The ML2 plug-in uses the Linux bridge mechanism to build layer-2 (bridging and switching) virtual networking infrastructure for instances.
de: Das ML2 Plug-in verwendet die Linux Bridge Mechanismen, um die layer-2 (bridging and switching) Infrastruktur des virtuellen Netzwerkes für Instanzen zu erstellen.
fr: Le plugin ML2 utilise le mécanisme Linux bridge pour construire l'infrastructure réseau virtuel de niveau-2 (bridging and switching) pour les instances.
id: ML2 plug-in menggunakan Linux bridge mechanism untuk membangun infrastruktur jaringan virtual lapisan-2 (bridging dan switching) untuk instances.

source: The Mitaka release is available directly through the official Debian backports repository. To use this repository, follow the instruction from the official `Debian website <http://backports.debian.org/Instructions/>`_, which basically suggest doing the following steps:
de: Das Mitaka Release ist direkt über das offizielle Debian Backport Repository verfügbar. Um dieses Repository zu verwenden folgen Sie den Anweisungen der offiziellen `Debian Website <http://backports.debian.org/Instructions/>`_, welche prinzipiell die folgenden Schritte vorschlägt:
fr: La livraison Mitaka est disponible directement via les dépôts backports Debian officiels. Pour utiliser ces dépôts, suivre les instructions du `site Debian officiel <http://backports.debian.org/Instructions/>`_, qui suggère principalement de suivre les étapes suivantes:
id: Rilis Mitaka rilis tersedia langsung melalui resmi repositori backport Debian. Untuk menggunakan repositori ini, ikuti instruksi dari situs resmi `Debian website <http://backports.debian.org/Instructions/>` _, yang pada dasarnya menyarankan melakukan langkah-langkah berikut:

source: The Networking common component configuration includes the authentication mechanism, message queue, and plug-in.
de: Die allgemeine Konfiguration der Netzwerkkomponenten beinhaltet den Authentifizierungsmechanismus, die Nachrichtenwarteschlange und Plugin.
fr: La configuration des composants communs du Réseau inclut le mécanisme d'authentification, la file de messages, et le plugin.
id: Konfigurasi komponen umum Networking termasuk authentication mechanism, message queue, dan plug-in.

source: The Networking server component configuration includes the database, authentication mechanism, message queue, topology change notifications, and plug-in.
de: Die Netzwerkserver-Komponentenkonfiguration beinhaltet die Datenbank, den Authentifizierungsmechanismus, die Nachrichtenwarteschlange, Topologieänderungsbenachrichtigngen und Plug-in.
fr: La configuration du composant serveur de Réseau inclut la base de données, le mécanisme d'authentification, la file de messages, les notifications de changement de topologie, et les plugins.
id: Konfigurasi komponen server Networking termasuk database, mekanisme otentikasi, antrian pesan, pemberitahuan perubahan topologi, dan plug-in.

source: The Networking service initialization scripts expect a symbolic link ``/etc/neutron/plugin.ini`` pointing to the ML2 plug-in configuration file, ``/etc/neutron/plugins/ml2/ml2_conf.ini``. If this symbolic link does not exist, create it using the following command:
de: Die Initialisierungsskripten des Netzwerkdienstes erwarten einen symbolischen Link ``/etc/neutron/plugin.ini``, der zur ML2 Plug-in Konfigurationsdatei ``/etc/neutron/plugins/ml2/ml2_conf.ini`` zeigt. Wenn der symbolische Link nicht existiert, erzeugen Sie ihn mittels des folgenden Kommandos:
fr: Les scripts d'initialisation du service Réseau s'attendent à trouver un lien symbolique ``/etc/neutron/plugin.ini`` pointant vers le fichier de configuration du plugin ML2, ``/etc/neutron/plugins/ml2/ml2_conf.ini``. Si ce lien symbolique n'existe pas, le créer à l'aide de la commande suivante:
id: Script inisialisasi layanan Networking mengharapkan symbolic link `` / etc / neutron / plugin.ini`` menunjuk ke plug-in file konfigurasi ML2, `` / etc / neutron / plugins / ML2 / ml2_conf.ini``. Jika link simbolik ini tidak ada, buatlah dengan menggunakan perintah berikut:

source: The Networking service initialization scripts expect the variable ``NEUTRON_PLUGIN_CONF`` in the ``/etc/sysconfig/neutron`` file to reference the ML2 plug-in configuration file. Ensure that the ``/etc/sysconfig/neutron`` file contains the following:
de: Die Initialisierungsskripten des Netzwerkdienstes erwarten die Variable ``NEUTRON_PLUGIN_CONF`` in der ``/etc/sysconfig/neutron`` Datei zur Angabe der ML2 Plug-in Konfigurationsdatei. Stellen Sie sicher, dass die ``/etc/sysconfig/neutron`` Datei das Folgende enthält:
fr: Les scripts d'initialisation du service de Réseau s'attendent à ce que la variable ``NEUTRON_PLUGIN_CONF`` dans le fichier ``/etc/sysconfig/neutron`` référence le fichier de configuration du plugin ML2. Assurez-vous que le fichier ``/etc/sysconfig/neutron`` contienne ce qui suit:
id: Script inisialisasi layanan Networking mengharapkan variabel ``NEUTRON_PLUGIN_CONF`` di file ``/etc/sysconfig/neutron`` untuk referensi file konfigurasi ML2 plug-in. Pastikan bahwa file ``/etc/sysconfig/neutron`` berisi berikut:

source: The Object Storage service does not use an SQL database on the controller node. Instead, it uses distributed SQLite databases on each storage node.
fr: Le service de Stockage Objet n'utilise pas de base de données SQL sur le nœud contrôleur. A la place, il utilise des bases de données SQLite réparties sur chaque nœud de stockage.
id: Layanan Object Storage tidak menggunakan database SQL pada controller node. Sebaliknya, menggunakan database SQLite didistribusikan pada setiap storage node.

source: The Object Storage services (swift) work together to provide object storage and retrieval through a :term:`REST API <RESTful>`.
fr: Les services de Stockage Objet (swift) collaborent pour permettre le stockage et la récupération d'objets à travers une :term:`API REST <RESTful>`.
id: Layanan Object Storage (swift) bekerja sama untuk menyediakan penyimpanan objek dan pengambilan melalui :term:`REST API <RESTful>`.

source: The OpenStack system consists of several key services that are separately installed. These services work together depending on your cloud needs. These services include Compute service, Identity service, Networking service, Image service, Block Storage service, Object Storage service, Telemetry service, Orchestration service, and Database service. You can install any of these projects separately and configure them stand-alone or as connected entities.
de: Das OpenStack-System besteht aus einigen getrennt installierten Schlüsseldiensten. Diese Dienste arbeiten abhängig von Ihren Cloud-Anforderungen zusammen. Diese Dienste schließen ein den Computedienst, den Identitätsdienst, den Netzwerkdienst, den Abbilddienst, den Blockspeicherdienst, den Objektspeicherdienst, den Telemetriedienst, den Orchestraionsdienst und den Datenbankdienst. Sie können jedes dieser Projekte separat installieren und einzeln oder als verbundene Einheiten konfigurieren.
fr: La solution OpenStack est constituée de plusieurs services clé qui s'installent séparément. Ces services interagissent en fonction de vos besoins en cloud. On dénombre notamment le service Compute, le service d'Identité, le service Réseau, le service d'Image, le stockage par Blocs, le stockage Object, le service de Télémétrie, le service d'Orchestration, et le service de Base de Données. Vous pouvez installer chacun de ces projets indépendamment et les configurer de façon autonome ou en tant qu'entité connectées.
id: Sistem OpenStack terdiri dari beberapa layanan utama yang terpisah diinstal. Layanan ini bekerja sama tergantung pada kebutuhan cloud Anda. Layanan tersebut meliputi layanan Compute, layanan Identity, layanan Networking, layanan Image, layanan Block Storage, layanan Object Storage, layanan Telemetry, layanan Orchestration, dan layanan Database. Anda dapat menginstal proyek ini secara terpisah dan mengkonfigurasi mereka berdiri sendiri atau sebagai entitas yang terhubung.

source: The Orchestration service (heat) uses a `Heat Orchestration Template (HOT) <http://docs.openstack.org/developer/heat/template_guide/hot_guide.html>`_ to create and manage cloud resources.
de: Der Orchestrierungsdienst (Heat) verwendet ein `Heat Orchestration Template (HOT) <http://docs.openstack.org/developer/heat/template_guide/hot_guide.html>`_ zum Erstellen und Verwalten von Cloud-Ressourcen.
fr: Le service d'Orchestration (heat) utilise un `Template d'Orchestration Heat (HOT) <http://docs.openstack.org/developer/heat/template_guide/hot_guide.html>`_ pour créer et gérer les ressources du cloud.
id: Layanan Orchestration (heat) menggunakan `Heat Orchestration Template (HOT)<http://docs.openstack.org/developer/heat/template_guide/hot_guide.html>`_untuk membuat dan mengelola sumber daya cloud.

source: The Orchestration service automatically assigns the ``heat_stack_user`` role to users that it creates during stack deployment. By default, this role restricts :term:`API <Application Programming Interface (API)>` operations. To avoid conflicts, do not add this role to users with the ``heat_stack_owner`` role.
de: Der Orchestrierungsdienst weist die Rolle ``heat_stack_user`` automatisch den Benutzern zu, die er während der Stack-Installation anlegt. Standardmäßig schränkt diese Rolle :term:`API <Application Programming Interface (API)>`-Operationen ein. Um Konflikte zu vermeiden, sollte diese Rolle Benutzern mit der Rolle ``heat_stack_owner`` nicht zugewiesen werden.
fr: Le service d'Orchestration assigne automatiquement le rôle ``heat_stack_user`` aux utilisateurs qu'il créé pendant le déploiement de stack. Par défaut, ce rôle restreint les opérations :term:`API <Application Programming Interface (API)>`. Pour éviter les conflits, ne pas ajouter ce rôle à des utilisateurs ayant le rôle ``heat_stack_owner``.
id: Layanan Orchestration secara otomatis memberikan peran ``heat_stack_user`` untuk user yang menciptakan selama pengerahan stack. Secara default, peran ini membatasi operasi :term: `API <Application Programming Interface (API)>`. Untuk menghindari konflik, jangan menambahkan peran ini untuk user dengan peran ``heat_stack_owner``.

source: The Orchestration service uses templates to describe stacks. To learn about the template language, see `the Template Guide <http://docs.openstack.org/developer/heat/template_guide/index.html>`__ in the `Heat developer documentation <http://docs.openstack.org/developer/heat/index.html>`__.
de: Der Orchestrierungsdienst verwendet Vorlagen zur Beschreibung von Stacks. Um die Ausdrucksweise von Vorlagen zu verstehen, lesen Sie den `the Template Guide <http://docs.openstack.org/developer/heat/template_guide/index.html>`__ in der `Heat Entwickler-Dokumentation <http://docs.openstack.org/developer/heat/index.html>`__.
fr: Le service d'Orchestration utilise des templates pour décrire les stacks. Pour connaitre le langage des templates, voir `le Guide des Templaces <http://docs.openstack.org/developer/heat/template_guide/index.html>`__ dans la `documentation développeur Heat <http://docs.openstack.org/developer/heat/index.html>`__.
id: Layanan Orchestration menggunakan template untuk menggambarkan stack. Untuk mempelajari tentang bahasa template, lihat `the Template Guide <http://docs.openstack.org/developer/heat/template_guide/index.html>`__ in the `Heat developer documentation <http://docs.openstack.org/developer/heat/index.html>`__.

source: The Share File System services require endpoints for each service entity.
fr: Les services de Systèmes de Fichiers Partagés nécessitent un endpoint pour chaque entité de service.
id: Layanan Share File System memerlukan endpoints untuk setiap entitas layanan.

source: The Share File System services require two service entities.
fr: Les services de Systèmes de Fichiers Partagés nécessitent deux entités de service.
id: Layanan Share File System memerlukan dua entitas layanan.

source: The Shared File Systems API and scheduler services typically run on the controller nodes. Depending upon the drivers used, the share service can run on controllers, compute nodes, or storage nodes.
fr: Les services d'API du Systèmes de Fichiers Partagés et le scheduler tournent généralement sur les nœuds contrôleurs. En fonction des drivers utilisés, le service de partage peut tourner sur les nœuds contrôleurs, sur les nœuds compute, ou sur des nœuds de stockage.
id: Layanan Shared File Systems API dan scheduler biasanya dijalankan pada controller nodes. Tergantung pada driver yang digunakan, layanan share dapat berjalan pada controllers, compute nodes, atau storage nodes.

source: The Shared File Systems service (manila) provides coordinated access to shared or distributed file systems. The method in which the share is provisioned and consumed is determined by the Shared File Systems driver, or drivers in the case of a multi-driver configuration. There are a variety of drivers that support NFS, CIFS, HDFS and/or protocols as well.
fr: Le service de Systèmes de Fichiers Partagés (manila) fournit un accès coordonné à des systèmes de fichiers partagés ou distribués. La méthode avec laquelle le partage est provisionné et consommé est déterminé par le driver de Systèmes de Fichiers Partagés, ou les drivers dans le cas d'une configuration multi-driver. Différents drivers existent pour supporter NFS, CIFS, HDFS et/ou les protocoles également.
id: Layanan The Shared File Systems (manila) menyediakan akses terkoordinasi dengan sistem file share atau distributed. Metode dimana share tersebut ditetapkan dan dikonsumsi, ditentukan oleh driver Shared File Systems, atau driver-driver dalam kasus konfigurasi multi-driver. Ada berbagai driver yang juga mendukung NFS, CIFS, HDFS dan / atau protokol.

source: The Shared File Systems service creates logical volumes in this volume group.
fr: Le service de Système de Fichiers Partagé crée des volumes logiques dans ce groupe de volume.
id: Layanan Shared File Systems menciptakan volume logis dalam kelompok volume ini.
