Repository: 25hours/openstack-manuals
Catalog: doc/install-guide/source/locale/*/LC_MESSAGES/install-guide.po
Languages: de, fr, id

source: Only instances can access Shared File Systems service volumes. However, the underlying operating system manages the devices associated with the volumes. By default, the LVM volume scanning tool scans the ``/dev`` directory for block storage devices that contain volumes. If projects use LVM on their volumes, the scanning tool detects these volumes and attempts to cache them which can cause a variety of problems with both the underlying operating system and project volumes. You must reconfigure LVM to scan only the devices that contain the ``cinder-volume`` and ``manila-volumes`` volume groups. Edit the ``/etc/lvm/lvm.conf`` file and complete the following actions:
de: Nur Instanzen haben Zugriff auf Dienst-Datenträger von freigegebenen Dateisystemen. Das darunterliegende Betriebssystem verwaltet die den Datenträgern zugewiesenen Geräte. Standardmäßig scannt das LVM Datenträger Scan-Werkzeug das Verzeichnis ``/dev`` nach Block-Storage-geräten, die Datenträger enthalten. Wenn Projekte LVM auf ihren Datenträgern verwenden, erkennt das Scan-Werkzeug diese und speichert sie zwischen, was zu verschiedenen Problemen sowohl im darunterliegenden Betriebssystem als auch auf dem Projektdatenträger führen kann. Sie müssen LVM so konfigurieren, dass nur Geräte gescannt werden, die die Datenträgergruppen ``cinder-volume`` und ``manila-volumes`` enthalten. Bearbeiten Sie die Datei ``/etc/lvm/lvm.conf`` und vervollständigen Sie folgende Aktionen:
fr: Seules les instances peuvent accéder aux volumes du service de Système de Fichiers Partagé. Néanmoins, le système d'exploitation sous-jacent gère les devices associés avec les volumes. Par défaut, l'outil d'analyse des volumes LVM scanne le répertoire ``/dev`` pour trouver des devices de stockage par blocs qui contiennent des volumes. Si les projets utilisent LVM sur leurs volumes, l'outil d'analyse détecte ces volumes et essaie de les mettre en cache ce qui peut causer différents problèmes avec à la fois le système d'exploitation sous-jacent et les volumes des projets. Vous devez reconfigurer LVM pour analyser seulement les devices qui contiennent le volume group ``cinder-volume``. Éditez le fichier ``/etc/lvm/lvm.conf`` et effectuer les modifications suivantes:
id: Hanya instances dapat mengakses layanan Shared File Systems. Namun, sistem operasi yang mendasari mengelola perangkat yang terkait dengan volume. Secara default, alat pemindaian volume LVM men-scan direktori ``/dev`` untuk perangkat penyimpanan blok yang berisi volume. Jika proyek menggunakan LVM pada volume mereka, alat scanning mendeteksi volume ini dan mencoba untuk cache mereka yang dapat menyebabkan berbagai masalah dengan sistem operasi yang mendasari maupun volume proyek. Anda harus mengkonfigurasi ulang LVM untuk memindai hanya perangkat yang berisi group volume ``cinder-volume`` dan ``manila-volumes``. Edit file ``/etc/lvm/lvm.conf`` dan menyelesaikan tindakan berikut:

source: OpenStack Installation Guide for Debian
de: OpenStack-Installationsleitfaden für Debian
fr: Guide d'Installation OpenStack pour Debian
id: Panduan Instalasi OpenStack untuk Debian

source: OpenStack Installation Guide for Red Hat Enterprise Linux and CentOS
de: OpenStack-Installationsleitfaden für Red Hat Enterprise Linux und CentOS
fr: Guide d'Installation OpenStack pour Red Hat Enterprise Linux et CentOS
id: Panduan Instalasi OpenStack untuk Red Hat Enterprise Linux dan CentOS

source: OpenStack Installation Guide for Ubuntu
de: OpenStack-Installationsleitfaden für Ubuntu
fr: Guide d'Installation OpenStack pour Ubuntu
id: Panduan Instalasi OpenStack untuk Ubuntu

source: OpenStack Installation Guide for openSUSE and SUSE Linux Enterprise
de: OpenStack-Installationsleitfaden für openSUSE und SUSE Linux Enterprise
fr: Guide d'Installation OpenStack pour openSUSE et SUSE Linux Enterprise
id: Panduan Instalasi OpenStack untuk openSUSE dan SUSE Linux Enterprise

source: OpenStack Networking (neutron) manages all networking facets for the Virtual Networking Infrastructure (VNI) and the access layer aspects of the Physical Networking Infrastructure (PNI) in your OpenStack environment. OpenStack Networking enables tenants to create advanced virtual network topologies which may include services such as a :term:`firewall`, a :term:`load balancer`, and a :term:`virtual private network (VPN)`.
de: OpenStack Netzwerk (neutron) verwaltet alle Netzwerkfacetten der virtuellen Netzwerkinfrastruktur (VNI) und die die Zugriffsebenen betreffenden Aspekte der physikalischen Netzwerkinfrastruktur (PNI) in Ihrer OpenStack Umgebung. OpenStack Netzwerke ermöglicht es Mandanten fortgeschrittene virtuelle Netzwerktopologien zu erzeugen, die Dienste wie :term:`Firewall`, :term:`Load Balancer` und :term:`virtuelle private Netzwerke (VPN)` beinhalten können.
fr: Le composant Réseau OpenStack (neutron) gère tous les aspects réseau pour l'infrastructure de Réseau Virtuel (VNI) et les aspects de la couche d'accès à l'infrastructure de Réseau Physique (PNI) dans votre environnement OpenStack. Le réseau OpenStack permet aux tenants de créer des topologie de réseau virtuel avancées qui peuvent inclure des services comme un :term:`firewall`, un :term:`load balancer`, et un :term:`réseau privé virtuel (VPN)`.
id: OpenStack Networking (neutron) mengelola semua aspek jaringan untuk Virtual Networking Infrastructure (VNI) dan aspek lapisan akses dari Physical Networking Infrastructure (PNI) di lingkungan OpenStack Anda. OpenStack Networking memungkinkan tenants untuk membuat topologi jaringan virtual maju yang dapat mencakup layanan seperti :term:`firewall`, :term:`load balancer`, dan :term:`virtual private network (VPN)`.

source: OpenStack and supporting services require administrative privileges during installation and operation. In some cases, services perform modifications to the host that can interfere with deployment automation tools such as Ansible, Chef, and Puppet. For example, some OpenStack services add a root wrapper to ``sudo`` that can interfere with security policies. See the `Administrator Guide <http://docs.openstack.org/ admin-guide/compute-root-wrap-reference.html>`__ for more information.
de: OpenStack und unterstützende Dienste benötigen administrative Privilegien während der Installation und des Betriebs. In einigen Fällen können durch Dienste ausgeführte Änderungen auf dem Host zu Konflikten mit automatischen Konfigurationswerkzeugen wie Ansible, Chef und Puppet führen. Zum Beispiel fügen einige OpenStack-Dienste einen Root-Wrapper zu ``sudo`` hinzu, was mit Sicherheitsregeln kollidieren kann. Lesen Sie `Administrator Guide <http://docs.openstack.org/ admin-guide/compute-root-wrap-reference.html>`__ für weitere Informationen.
fr: OpenStack et les services support requièrent des privilèges administrateur pendant l'installation et le fonctionnement. Dans certains cas, les services effectuent des modifications sur l'hôte qui peuvent interférer avec des outils de déploiement automatisés comme Ansible, Chef, et Puppet. Par exemple, certains services OpenStack ajoutent un wrapper root à ``sudo`` qui peut interférer avec les politiques de sécurité. Voir le `Guide de l'Administrateur <http://docs.openstack.org/ admin-guide/compute-root-wrap-reference.html>`__ pour plus d'informations.
id: OpenStack dan layanan pendukung memerlukan hak akses administratif selama instalasi dan operasi. Dalam beberapa kasus, layanan melakukan modifikasi ke host yang dapat mengganggu alat otomatisasi pengerahan seperti Ansible, Chef, dan Puppet. Sebagai contoh, beberapa layanan OpenStack menambahkan wrapper root untuk `` sudo`` yang dapat mengganggu kebijakan keamanan. Lihat `Administrator Guide <http://docs.openstack.org/ admin-guide/compute-root-wrap-reference.html>`__ untuk informasi lebih lanjut.

source: OpenStack generates IDs dynamically, so you will see different values in the example command output.
de: OpenStack erzeugt IDs dynamisch, deshalb werden Ihre Werte von denen im Beispiel abweichen.
fr: OpenStack génère dynamiquement les IDs, c'est pourquoi vous verrez des valeurs différentes dans la sortie des commandes montrées en exemple.
id: OpenStack menghasilkan ID secara dinamis, sehingga Anda akan melihat nilai yang berbeda dalam output command example.

source: OpenStack packages
de: OpenStack Pakete
fr: Packages OpenStack
id: Paket OpenStack

source: OpenStack provides an :term:`Infrastructure-as-a-Service (IaaS)<IaaS>` solution through a variety of complemental services. Each service offers an :term:`Application Programming Interface (API)` that facilitates this integration.
fr: OpenStack fournit une solution d':term:`Infrastructure-as-a-Service (IaaS)<IaaS>` à travers un éventail de services complémentaires. Chaque service offre une :term:`Application Programming Interface (API)` qui facilite cette intégration.
id: OpenStack menyediakan: term: `Infrastruktur-as-a-Service (IaaS) <IaaS>` solusi melalui berbagai layanan complemental. Setiap layanan menawarkan :term: `Application Programming Interface (API)` yang memfasilitasi integrasi ini.

source: OpenStack services support various security methods including password, policy, and encryption. Additionally, supporting services including the database server and message broker support at least password security.
de: OpenStack-Dienste unterstützen unterschiedliche Sicherheitsverfahren, z.B. Passwörter, Policy und Verschlüsselung. Unterstützende Dienste einschließlich des Datenbankservers und Message Brokers unterstützen mindestens Passwortsicherheit.
fr: Les services OpenStack supportent différentes méthodes de sécurité incluant mot de passe, police, et cryptage. De plus, les services support comme le serveur de base de données et le service de file de message supportent au minimum la sécurité par mot de passe.
id: Layanan OpenStack mendukung berbagai metode keamanan termasuk password, kebijakan, dan enkripsi. Selain itu, layanan pendukung termasuk server database dan dukungan perantara pesan setidaknya keamanan password.

source: OpenStack uses a :term:`message queue` to coordinate operations and status information among services. The message queue service typically runs on the controller node. OpenStack supports several message queue services including `RabbitMQ <http://www.rabbitmq.com>`__, `Qpid <http://qpid.apache.org>`__, and `ZeroMQ <http://zeromq.org>`__. However, most distributions that package OpenStack support a particular message queue service. This guide implements the RabbitMQ message queue service because most distributions support it. If you prefer to implement a different message queue service, consult the documentation associated with it.
de: OpenStack verwendet eine :term:`message queue` zur Koordination von Operationen und Statusinformationen innerhalb der Dienste. Der Nachrichtenwarteschlangen-Dienst läuft üblicherweise auf dem Controller-Knoten. OpenStack unterstützt verschiedene Nachrichtendienste, u.a. `RabbitMQ <http://www.rabbitmq.com>`__, `Qpid <http://qpid.apache.org>`__, und `ZeroMQ <http://zeromq.org>`__. Allerdings unterstützen die meisten Distributionen mit kompletten OpenStack-Paketen einen bestimmten Nachrichtendienst. Dieser Leitfaden implementiert den RabbitMQ Nachrichtendienst, weil dieser von den meisten Distributionen unterstützt wird. Wenn Sie einen anderen Dienst bevorzugen, beachten Sie die entsprechende Dokumentation dazu.
fr: OpenStack utilise une :term:`file de messages` pour coordonner les opérations et les informations de statut entre les services. Le service de file de messages tourne en général sur le nœud contrôleur. OpenStack supporte plusieurs services de file de messages dont `RabbitMQ <http://www.rabbitmq.com>`__, `Qpid <http://qpid.apache.org>`__, et `ZeroMQ <http://zeromq.org>`__. Néanmoins, la plupart des distributions qui packagent OpenStack supportent un service particulier de file de message. Ce guide implémente le service de file de messages RabbitMQ car la plupart des distributions le supporte. Si vous préférez implémenter un autre service de file de messages, consultez sa documentation.
id: OpenStack menggunakan :term: `message queue` untuk mengkoordinasikan operasi dan informasi status antara layanan. Layanan `message queue` biasanya berjalan pada controller node. OpenStack mendukung beberapa layanan message queue termasuk `RabbitMQ <http://www.rabbitmq.com>` __, `Qpid <http://qpid.apache.org>` __, dan `ZeroMQ <http://zeromq.org > `__. Namun, kebanyakan distribusi yang mendukung paket OpenStack layanan message queue tertentu. Panduan ini mengimplementasikan layanan message queue RabbitMQ karena sebagian besar distribusi mendukungnya. Jika Anda lebih memilih untuk mengimplementasikan layanan message queue yang berbeda, konsultasi dengan dokumentasi yang terkait dengan itu.

source: OpenStack uses three API endpoint variants for each service: admin, internal, and public. The admin API endpoint allows modifying users and tenants by default, while the public and internal APIs do not allow these operations. In a production environment, the variants might reside on separate networks that service different types of users for security reasons. For instance, the public API network might be visible from the Internet so customers can manage their clouds. The admin API network might be restricted to operators within the organization that manages cloud infrastructure. The internal API network might be restricted to the hosts that contain OpenStack services. Also, OpenStack supports multiple regions for scalability. For simplicity, this guide uses the management network for all endpoint variations and the default ``RegionOne`` region.
de: OpenStack verwendet für jeden Dienst drei verschiedene API-Endpunkt-Varianten: admin, internal und public. Der API-Endpunkt admin erlaubt standardmäßig das Verändern von Mandanten und Benutzern, während die APIs public und internal diese Operationen nicht erlauben. In einem Produktivumfeld können diese Variationen aus Sicherheitsgründen in unterschiedlichen Netzwerken liegen, um verschiedene Arten von Benutzern zu verwalten. Zum Beispiel könnte das API-Netzwerk public aus dem Internet erreichbar sein, um Kunden das Verwalten Ihrer Clouds zu ermöglichen. Das API-Netzwerk admin könnte auf Anwender innerhalb der Organisation beschränkt sein, die die Cloud-Infrastruktur verwalten. Das API-Netzwerk internal könnte auf die Hosts beschränkt sein, die OpenStack-Dienste enthalten. Außerdem unterstüzt OpenStack mehrere Regionen zugunsten der Skalierbarkeit. Der Einfachheit halber verwendet dieser Leitfaden das Managementnetzwerk für alle Endpunkt-Variationen und die Standardregion ``RegionOne``.
fr: OpenStack utilise trois variantes du endpoint API pour chaque service: admin, interne, et publique. Le endpoint API admin permet de modifier les utilisateurs et les tenants par défaut, alors que les endpoints APIs publique et interne ne permettent pas ces opérations. Dans un environnement de production, ces variantes doivent résider sur des réseaux séparés qui servent différents types d'utilisateurs pour des raisons de sécurité. Par exemple, le réseau des API publiques pourra être visible d'internet pour que les clients puissent gérer leur cloud. Le réseau des API admin pourra être restreint aux opérateurs dans l'organisation qui gèrent l'infrastructure cloud. Le réseau des API interne pourra être restreint aux hosts qui contiennent des services OpenStack. De plus, OpenStack supporte le multi régions pour la scalabilité. Par simplification, ce guide utilises le management network pour tous les endpoints et la région ``RegionOne``.
id: OpenStack menggunakan tiga varian API endpoint untuk setiap layanan: admin, internal dan publik. Admin API endpoint memungkinkan memodifikasi user dan tenant secara default, sedangkan API publik dan internal yang tidak memungkinkan operasi ini. Dalam lingkungan produksi, varian mungkin berada di jaringan yang terpisah yang melayani berbagai jenis user untuk alasan keamanan. Misalnya, jaringan API publik mungkin terlihat dari internet sehingga custumer dapat mengelola awan mereka. Jaringan API admin mungkin dibatasi untuk operator dalam organisasi yang mengelola infrastruktur awan. Jaringan API internal yang mungkin dibatasi untuk host yang berisi layanan OpenStack. Juga, OpenStack mendukung beberapa daerah untuk skalabilitas. Untuk mempermudah, panduan ini menggunakan jaringan manajemen untuk semua variasi endpoint dan wilayah ``RegionOne`` default.

source: Option 1 - Create shares without share servers management support
de: Option 1 - Erstellen von Freigaben ohne Unterstützung des Freigabenmanagementservers
fr: Option 1 - Créer les partages sans support de la gestion des serveurs de partage.
id: Opsi 1 - Buat share tanpa dukungan manajemen server berbagi

source: Option 1 deploys the service without driver support for share management. In this mode, the service does not do anything related to networking. The operator must ensure network connectivity between instances and the NFS server. This option uses LVM driver that requires LVM and NFS packages as well as an additional disk for the ``manila-share`` LVM volume group.
fr: L'option 1 déploie le service sans support de driver pour la gestion des partages. Dans ce mode, le service n'a rien à faire en rapport avec le réseau. L'opérateur doit s'assurer de la connectivité entre les instances et le serveur NFS. Cette option utilise le driver LVM qui nécessite les packages LVM et NFS ainsi qu'un disque supplémentaire pour le groupe de volumes LVM ``manila-share``.
id: Opsi 1 pengerahan layanan tanpa dukungan driver untuk share management. Dalam mode ini, layanan tidak melakukan apa-apa terkait dengan jaringan. Operator harus memastikan konektivitas jaringan antar instances dan server NFS. Opsi ini menggunakan driver LVM yang membutuhkan paket LVM dan NFS serta tambahan disk untuk ``manila-share`` kelompok volume LVM.

source: Option 1 deploys the simplest possible architecture that only supports attaching instances to provider (external) networks. No self-service (private) networks, routers, or floating IP addresses. Only the ``admin`` or other privileged user can manage provider networks.
de: Option 1 stellt die einfachste Architektur bereit und unterstützt nur das Hinzufügen von Instanzen zu (externen) Anbieternetzwerken. Es gibt keine (privaten) self-service Netzwerke, Router oder Floating IP-Adressen. Nur der ``admin`` oder andere privilegierte Benutzer können Anbieternetzwerke verwalten.
fr: L'option 1 déploie l'architecture la plus simple possible qui supporte uniquement d'attacher les instances en direct aux réseaux fournisseurs (externes). Pas de réseaux self-service (privés), routeurs, ou adresses IP flottantes. Seul l'utilisateur ``admin`` ou tout autre utilisateur à privilège peut gérer les réseaux fournisseurs.
id: Opsi 1 mengerahkan arsitektur yang paling sederhana yang hanya mendukung attaching instance untuk jaringan provider (eksternal). Tidak ada jaringan self-service (private), router, atau floating IP addresses. Hanya `` admin`` atau user istimewa lainnya dapat mengelola jaringan provider.

source: Option 2 - Create shares with share servers management support
de: Option 2 - Erstellen von Freigaben mit Unterstützung des Freigabenmanagementservers
fr: Option 2 - Créer les partages avec support de la gestion des serveurs de partage.
id: Opsi 2 - Buat share dengan dukungan manajemen server share

source: Option 2 also supports attaching instances to provider networks.
de: Option 2 unterstützt auch das hinzufügen von Instanzen zu Anbieternetzwerken.
fr: L'option 2 supporte également le rattachement d'instances aux réseaux fournisseurs.
id: Opsi 2 juga mendukung attaching instances ke jaringan provider.

source: Option 2 augments option 1 with layer-3 services that support attaching instances to self-service networks. The ``demo`` or other unprivileged user can manage self-service networks including routers that provide connectivity between self-service and provider networks. Additionally, floating IP addresses provide connectivity to instances using self-service networks from external networks such as the Internet.
de: Option 2 erweitert Option 1 mit layer-3 Diensten die unterstützen, dass Instanzen zu self-service Netzwerken hinzugefügt werden. Der ``demo`` Benutzer oder andere unprivilegierte Benutzer können self-service Netzwerke verwalten, einschließlich Router, die die Verbindung zwischen self-service und Anbieternetzwerken erlauben. Zusätzlich bieten Floating IP-Adressen die Möglichkeit der Erreichbarkeit von Instanzen über self-service Netzwerke von externen Netzwerken wie z.B. dem Internet.
fr: L'option 2 ajoute à l'option 1 des services de couche-3 qui supporte l'attachement des instances à des réseaux self-services. L'utilisateur ``demo`` ou tout autre utilisateur sans privilège peut gérer des réseaux self-service incluant les routeurs qui fournissent la connectivité entre les réseaux self-service et fournisseur. De plus, des adresses IP flottantes fournissent la connectivité aux instances utilisant les réseaux self-service à partir de réseaux externes comme Internet.
id: Opsi 2 menambah opsi 1 dengan layanan lapisan-3 yang mendukung attaching instances untuk jaringan self-service. The `` demo`` atau user biasa lainnya dapat mengelola jaringan self-service termasuk router yang menyediakan konektivitas antara jaringan self-service dan provider. Selain itu, floating IP addresses menyediakan konektivitas ke instances menggunakan jaringan self-service dari jaringan eksternal seperti Internet.

source: Option 2 deploys the service with driver support for share management. In this mode, the service requires Compute (nova), Networking (neutron) and Block storage (cinder) services for managing share servers. The information used for creating share servers is configured as share networks. This option uses the generic driver with the handling of share servers capacity and requires attaching the ``selfservice`` network to a router.
fr: L'option 2 déploie le service avec le support de driver pour la gestion des partages. Dans ce mode, le service nécessite les services Compute (nova), Réseau (neutron) et Stockage par Blocs (cinder) pour gérer les serveurs de partage. L'information utilisée pour créer les serveurs de partage est configuré comme réseaux partagés. Cette option utilise le driver générique avec la prise en charge de la capacité des serveurs de partage et nécessite d'attacher le réseau ``selfservice`` à un router.
id: Opsi 2 mengerahkan layanan dengan dukungan driver untuk share management. Dalam mode ini, layanan membutuhkan layanan Compute (nova), Jaringan (neutron) dan Block storage (cinder) untuk mengelola share server. Informasi yang digunakan untuk membuat share servers dikonfigurasi sebagai share networks. Opsi ini menggunakan driver generik dengan penanganan share servers capacity dan membutuhkan pemasangan jaringan ``selfservice`` ke router.

source: Optionally, configure the time zone:
de: Konfigurieren Sie optional die Zeitzone:
fr: Éventuellement, configurer la timezone:
id: Opsional, mengkonfigurasi zona waktu:

source: Optionally, the controller node runs portions of Block Storage, Object Storage, Orchestration, and Telemetry services.
fr: En option, le nœud contrôleur peut faire tourner des parties de services de Stockage par Blocs, de Stockage Objet, d'Orchestration et de Télémétrie.
id: Opsional, controller node berjalan bagian dari Block Storage, Object Storage, Orchestration, dan layanan Telemetry.
