Repository: 25hours/openstack-manuals
Catalog: doc/install-guide/source/locale/*/LC_MESSAGES/install-guide.po
Languages: de, fr, id

source: This section describes how to install and configure the Orchestration service, code-named heat, on the controller node.
de: Dieser Abschnitt beschreibt, wie der Orchestrierungsdienst auf dem Controller Node zu installieren und zu konfigurieren ist, der Codename lautet heat.
fr: Cette section décrit comment installer et configurer le service d'Orchestration, nom de code heat, sur le nœud contrôleur.
id: Bagian ini menjelaskan cara menginstal dan mengkonfigurasi layanan Orchestration, code-named heat, pada controller node.

source: This section describes how to install and configure the Shared File Systems service, code-named manila, on the controller node. This service requires at least one additional share node that manages file storage drivers.
fr: Cette section décrit comment installer et configurer le service de Systèmes de Fichiers Partagés, nom de code manila, sur le nœud contrôleur. Ce service nécessite au minimum un nœud de partage supplémentaire pour gérer les drivers de stockage de fichiers.
id: Bagian ini menjelaskan cara menginstal dan mengkonfigurasi layanan Shared File Systems, code-named manila, pada controller node. Layanan ini memerlukan setidaknya satu share node tambahan yang mengelola driver penyimpanan file.

source: This section describes how to install and configure the Telemetry Alarming service, code-named aodh.
de: Dieser Abschnitt beschreibt, wie der Telemetrie-Benachrichtigungsdienst (Codename aodh) zu installieren und zu konfigurieren ist.
fr: Cette section décrit comment installer et configurer le service d'Alarme de Télémétrie, nom de code aodh.
id: Bagian ini menjelaskan cara menginstal dan mengkonfigurasi layanan Telemetry Alarming, code-named aodh.

source: This section describes how to install and configure the Telemetry service, code-named ceilometer, on the controller node. The Telemetry service collects measurements from most OpenStack services and optionally triggers alarms.
de: Dieser Abschnitt beschreibt, wie der Telemetriedienst auf dem Controller Node zu installieren und zu konfigurieren ist, der Codename lautet Ceilometer. Der Telemetriedienst sammelt Messwerte von den meisten OpenStack-Diensten und löst wahlweise Alarme aus.
fr: Cette section décrit comment installer et configurer le service de Télémétrie, nom de code ceilometer, sur le nœud contrôleur. Le service de Télémétrie collecte les mesures de la plupart des services OpenStack et éventuellement déclenche des alarmes.
id: Bagian ini menjelaskan cara menginstal dan mengkonfigurasi layanan Telemetry, code-named ceilometer, pada controller node. Layanan Telemetry mengumpulkan pengukuran dari sebagian besar layanan OpenStack dan memicu alarm opsional.

source: This section describes how to install and configure the dashboard on the controller node.
de: Dieser Abschnitt beschreibt, wie das Dashboard auf dem Controller Node zu installieren und zu konfigurieren ist.
fr: Cette section décrit comment installer et configurer le dashboard sur le nœud contrôleur.
id: Bagian ini menjelaskan cara menginstal dan mengkonfigurasi dashboard pada controller node.

source: This section describes how to install and configure the proxy service that handles requests for the account, container, and object services operating on the storage nodes. For simplicity, this guide installs and configures the proxy service on the controller node. However, you can run the proxy service on any node with network connectivity to the storage nodes. Additionally, you can install and configure the proxy service on multiple nodes to increase performance and redundancy. For more information, see the `Deployment Guide <http://docs.openstack.org/developer/swift/deployment_guide.html>`__.
fr: Cette section décrit comment installer et configurer le service proxy qui traite les requêtes pour les services de compte, de conteneur, et d'objet fonctionnant sur les nœuds de stockage. Pour plus de simplicité, ce guide installe et configure le service proxy sur le nœud contrôleur. Néanmoins, vous pouvez faire tourner le service proxy sur tout nœud ayant une connectivité avec les nœuds de stockage. De plus, vous pouvez installer et configurer le service proxy sur plusieurs nœuds pour améliorer les performances et la redondance. Pour plus d'information, voir le `Guide de Déploiement <http://docs.openstack.org/developer/swift/deployment_guide.html>`__.
id: Bagian ini menjelaskan cara menginstal dan mengkonfigurasi layanan proxy yang menangani permintaan untuk layanan account, container, and object yang beroperasi pada storage nodes. Untuk mempermudah, panduan ini akan menginstal dan mengkonfigurasi layanan proxy pada controller node. Namun, Anda dapat menjalankan layanan proxy pada setiap node dengan konektivitas jaringan ke storage nodes. Selain itu, Anda dapat menginstal dan mengkonfigurasi layanan proxy pada beberapa node untuk meningkatkan kinerja dan redundansi. Untuk informasi lebih lanjut, lihat `Deployment Guide <http://docs.openstack.org/developer/swift/deployment_guide.html>`__.

source: This section explains how to configure the controller and one compute node using the example architecture.
de: Dieser Abschnitt erläutert, wie der Controller-Knoten und ein Compute-Knoten auf Grundlage der Beispielarchitektur konfiguriert werden.
fr: Cette section explique comment configurer le contrôleur et un nœud compute en utilisant l'architecture en exemple.
id: Bagian ini menjelaskan cara mengkonfigurasi controller dan satu compute node menggunakan arsitektur contoh.

source: This section uses ``manila-service-image`` image as an instance for mounting shares.
fr: Cette section utilises l'image ``manila-service-image`` comme instance pour monter les partages.
id: Bagian ini menggunakan image ``manila-service-image`` sebagai instance untuk mounting share.

source: This service requires two nodes. Each node requires a minimum of one network interface. You can deploy more than two object storage nodes.
fr: Ce service nécessite deux nœuds. Chaque nœud doit avoir au minimum une interface réseau. Vous pouvez déployer plus de deux nœuds de stockage objet.
id: Layanan ini memerlukan dua node. Setiap node membutuhkan minimal satu interface jaringan. Anda dapat menyebarkan lebih dari dua node penyimpanan objek.

source: To create the Identity service credentials, complete these steps:
fr: Pour créer les credentials du service Identity , suivre les étapes suivantes:
id: Untuk membuat kredensial layanan Identity, menyelesaikan langkah-langkah ini:

source: To create the database, complete the following actions:
de: Führen Sie diese Schritte zum Erstellen der Datenbank aus:
fr: Pour créer la base de données, effectuer les opérations suivantes:
id: Untuk membuat database, selesaikan tindakan berikut:

source: To create the database, complete these steps:
de: Führen Sie diese Schritte zum Erstellen der Datenbank aus:
fr: Pour créer la base de données, réalisez les étapes suivantes :
id: Untuk membuat database, lakukan langkah-langkah berikut:

source: To create the databases, complete these steps:
de: Führen Sie diese Schritte zum Erstellen der Datenbanken aus:
fr: Pour créer les bases de données, suivre ces étapes :
id: Untuk membuat database, lakukan langkah-langkah berikut:

source: To create the service credentials, complete these steps:
de: Um die Dienstanmeldeinformationen zu erstellen, vervollständigen Sie folgende Schritte:
fr: Pour créer les crédentiels du service, réalisez les étapes suivantes :
id: Untuk membuat kredensial layanan, selesaikanlah langkah-langkah ini:

source: To do this, navigate to ``/etc/init`` and edit the following files as described below:
fr: Pour ce faire, aller dans ``/etc/init`` et éditer les fichiers suivants comme décrit ci-dessous:
id: Untuk melakukan hal ini, arahkan ke ``/etc/init`` dan mengedit file-file berikut seperti yang dijelaskan di bawah ini:

source: To ease the installation process, this guide only covers password security where applicable. You can create secure passwords manually, generate them using a tool such as `pwgen <http://sourceforge.net/projects/pwgen/>`__, or by running the following command:
de: Um den Installationsprozess zu vereinfachen, werden in diesem Leitfaden nur Passwörter als Sicherheitsmaßnahme verwendet. Sichere Passwörter können entweder manuell vergeben werden, mit Hilfe von Werkzeugen wie `pwgen <http://sourceforge.net/projects/pwgen/>`__ generiert werden oder mit folgendem Befehl erstellt werden:
fr: Pour faciliter le processus d'installation, ce guide couvre uniquement les sécurité par mot de passe quand c'est applicable. Vous pouvez créer des mots de passe sécurisés manuellement, les générer à l'aide d'un outil comme `pwgen <http://sourceforge.net/projects/pwgen/>`__, ou en exécutant la commande suivante:
id: Untuk memudahkan proses instalasi, panduan ini hanya mencakup keamanan password dimana yang berlaku. Anda dapat membuat password yang aman secara manual, bangkitkanlah mereka menggunakan alat seperti `pwgen <http://sourceforge.net/projects/pwgen/>` __, atau dengan menjalankan command berikut:

source: To enable other nodes to connect to the chrony daemon on the controller, add the following key to the ``/etc/chrony.conf`` file:
de: Um anderen Knoten die Verbindung zum chrony-Daemon auf dem Controller zu ermöglichen, ergänzen Sie diesen Wert in der Datei ``/etc/chrony.conf``:
fr: Pour permettre aux autres nœuds de se connecter au daemon chrony sur le contrôleur, ajouter la clé suivante dans le fichier ``/etc/chrony.conf``:
id: Untuk mengaktifkan node lain untuk terhubung ke daemon chrony pada controller, tambahkan key berikut ke file ``/etc/chrony.conf``:

source: To launch an instance, you must at least specify the flavor, image name, network, security group, key, and instance name.
de: Zum Starten einer Instanz müssen Sie mindestens die Variante, den Abbildnamen, ein Netzwerk, eine Sicherheitsgruppe, einen SSH-Schlüssel sowie einen Namen vergeben.
fr: Pour lancer une instance, vous devez au minimum spécifier le gabarit, le nom de l'image, le réseau, le groupe de sécurité, la clé et le nom de l'instance.
id: Untuk memulai sebuah instance, Anda harus setidaknya menentukan flavor, nama image, jaringan, security group, key, dan name instance.

source: To minimize clutter and provide more resources for OpenStack, we recommend a minimal installation of your Linux distribution. Also, you must install a 64-bit version of your distribution on each node.
de: Um Unordnung zu vermeiden und mehr Ressourcen für OpenStack zur Verfügung zu haben, wird eine Minimalinstallation Ihrer Linux-Distribution empfohlen. Außerdem müssen Sie auf jedem Ihrer Knoten eine 64-Bit-Version Ihrer Distribution installieren.
fr: Pour réduire l'encombrement et laisser plus de ressources pour OpenStack, il est recommandé de faire une installation minimale de votre distribution Linux. De même, vous devez installer une version 64-bit de votre distribution sur chaque nœud.
id: Untuk meminimalkan kekacauan dan menyediakan lebih banyak sumber daya untuk OpenStack, kami menyarankan instalasi minimal distribusi Linux Anda. Juga, Anda harus menginstal versi 64-bit dari distribusi Anda pada setiap node.

source: To reduce complexity of this guide, we add host entries for optional services regardless of whether you choose to deploy them.
fr: Pour simplifier ce guide, on ajoute des entrées pour les services optionnels, même si vous pouvez choisir de ne pas les déployer.
id: Untuk mengurangi kompleksitas panduan ini, kami menambahkan entri host untuk layanan opsional terlepas dari apakah Anda memilih untuk mengerahkan mereka.

source: To run clients as a specific project and user, you can simply load the associated client environment script prior to running them. For example:
de: Um Clients als bestimmter Benutzer eines bestimmten Projektes auszuführen, laden Sie das entsprechende Client-Umgebungsskript bevor Sie sie starten. Zum Beispiel:
fr: Pour exécuter les clients en tant que projet et utilisateur spécifique, il suffit de charger le script d'environnement client associé avant de les lancer. Par exemple:
id: Untuk menjalankan klien sebagai proyek dan user tertentu, Anda hanya dapat memuat klien skrip lingkungan terkait sebelum menjalankan mereka. Sebagai contoh:

source: To use the VNC client with the dashboard, the browser must support HTML5 Canvas and HTML5 WebSockets.
de: Um Ihr Dashboard mit dem VNC Client benutzen zu können, muß der Browser HTML5 Canvas und HTML5 WebSockets unterstützen.
fr: Pour utiliser le client VNC avec le tableau de bord, le navigateur doit supporter les canvas et les WebSockets d'HTML5.
id: Untuk menggunakan klien VNC dengan dashboard, browser harus mendukung HTML5 Canvas dan HTML5 WebSockets.

source: Unless you intend to use the exact configuration provided in this example architecture, you must modify the networks in this procedure to match your environment. Also, each node must resolve the other nodes by name in addition to IP address. For example, the ``controller`` name must resolve to ``10.0.0.11``, the IP address of the management interface on the controller node.
de: So lange Sie nicht exakt der Konfiguration in diesem Beispiel folgen möchten, sollten Sie die Netzwerke entsprechend Ihrer Umgebung anpassen. Außerdem muss jeder Knoten die anderen über ihre Namen und IP-Adressen auflösen können. Zum Beispiel muss der Name ``controller`` zu ``10.0.0.11`` aufgelöst werden können, die IP-Adresse der Managementschnittstelle auf dem Controller-Knoten.
fr: A moins que vous ne comptiez utiliser exactement la configuration présentée dans cette architecture exemple, vous devez modifier les réseaux dans cette procédure pour les adapter à votre environnement. Également, chaque nœud doit pouvoir résoudre les autres nœuds par leur nom, en plus de leur adresse IP. Par exemple, le nom ``controller`` doit être résolu en ``10.0.0.11``, l'adresse IP de l'interface de management du nœud contrôleur.
id: Kecuali Anda berniat untuk menggunakan konfigurasi yang tepat tersedia dalam contoh arsitektur ini, Anda harus memodifikasi jaringan dalam prosedur ini untuk mencocokkan lingkungan Anda. Juga, setiap node harus resolve node lainnya dengan nama selain alamat IP. Sebagai contoh, nama ``controller`` harus resolve untuk ``10.0.0.11``, alamat IP dari interface manajemen pada controller node.

source: Unset the temporary ``OS_TOKEN`` and ``OS_URL`` environment variables:
de: Entfernen Sie die Umgebungsvariablen ``OS_TOKEN`` und ``OS_URL``:
fr: Vider les variables d'environnement temporaires ``OS_TOKEN`` et ``OS_URL``:
id: 'Unset' sementara variabel lingkungan`` OS_TOKEN`` dan `` OS_URL``:

source: Update the datastore to use the new image.
fr: Réffraichir le datastore pour utiliser la nouvelle image.
id: Update datastore untuk menggunakan image baru.

source: Upgrade the packages on your host:
de: Führen Sie auf Ihrem Host ein Upgrade der Pakete durch:
fr: Upgrader les packages sur votre hôte:
id: Upgrade paket pada host Anda:

source: Upload a test file to the ``container1`` container:
de: Laden Sie eine Testdatei zum Container ``container1`` hoch:
fr: Charger un fichier de test vers le conteneur ``container1``:
id: Upload file test ke container ``container1``:

source: Upload the image to glance. Example:
fr: Charger l'image dans glance. Exemple:
id: Upload image to glance. Contoh:

source: Upload the image to the Image service using the :term:`QCOW2 <QEMU Copy On Write 2 (QCOW2)>` disk format, :term:`bare` container format, and public visibility so all projects can access it:
de: Laden Sie das Abbild zum Abbilddienst mit dem Festplattenformat :term:`QCOW2 <QEMU Copy On Write 2 (QCOW2)>`, dem Containerformat :term:`bare` und öffentlich hoch, damit alle Projekte darauf zugreifen dürfen:
fr: Charger l'image dans le service d'Image en utilisant le format de disque :term:`QCOW2 <QEMU Copy On Write 2 (QCOW2)>`, le format de conteneur :term:`bare`, et une visibilité publique pour que tous les projets puissent y accéder:
id: Upload image ke layanan Image menggunakan disk format :term:`QCOW2 <QEMU Copy On Write 2 (QCOW2)>` , format kontainer : term:`bare`, dan visibilitas publik sehingga semua proyek dapat mengaksesnya:

source: Use the ``cinder-volume-usage-audit`` command on Block Storage nodes to retrieve meters on demand. For more information, see the `Administrator Guide <http://docs.openstack.org/admin-guide/ telemetry-data-collection.html#block-storage-audit-script-setup-to-get- notifications>`__.
de: Verwenden Sie den Befehl ``cinder-volume-usage-audit`` auf den Blockspeicherknoten, um auf Abruf Zählerdaten zu erhalten. Für weitere Informationen schauen Sie in den `Administrator Guide <http://docs.openstack.org/admin-guide/ telemetry-data-collection.html#block-storage-audit-script-setup-to-get- notifications>`__.
fr: Utiliser la commande ``cinder-volume-usage-audit`` sur les noeuds de Stockage par Blocs pour récupérer les compteurs à la demande. Pour plus d'informations, voir le `Guide de l'Administrateur <http://docs.openstack.org/admin-guide/ telemetry-data-collection.html#block-storage-audit-script-setup-to-get- notifications>`__.
id: Gunakan command ``cinder-volume-usage-audit`` pada node Block Storage untuk mengambil meter pada permintaan. Untuk informasi lebih lanjut, lihat `Administrator Guide <http://docs.openstack.org/admin-guide/ telemetry-data-collection.html#block-storage-audit-script-setup-to-get- notifications>`__.

source: Use the database access client to connect to the database server as the ``root`` user:
de: Benutzen Sie den Datenbank-Client zur Verbindung zum Datenbank-Server als Benutzer ``root`` :
fr: Utilisez le client d'accès à la base de données pour vous connecter au serveur de base de données en tant qu'utilisateur ``root``:
id: Gunakan klien akses database untuk berhubung ke server database sebagai ``root`` user:

source: Use the pool identifiers found in the previous step to attach your RHEL entitlements:
fr: Utiliser les identifiants de pool trouvés à l'étape précédente pour attacher vos habilitations RHEL:
id: Gunakanlah pengenal (identifiers) yang ditemukan dalam pool pada langkah sebelumnya untuk memberikan hak (entitlement) RHEL Anda:

source: Use the random value that you generated in a previous step. If you install using non-interactive mode or you do not specify this token, the configuration tool generates a random value.
de: Verwenden Sie den Zufallswert, den Sie im vorherigen Schritt generiert haben. Wenn Sie den nicht-interaktiven Installationsmodus verwenden oder diesen Token nicht belegen, wird das Konfigurationswerkzeug einen zufälligen Wert generieren.
fr: Utiliser la valeur aléatoire générée précédemment. Si vous faite une installation en mode non-interactif ou si vous ne spécifiez pas ce token, l'outil de configuration génère une valeur aléatoire.
id: Gunakan nilai acak yang Anda buat di langkah sebelumnya. Jika Anda menginstal menggunakan modus non-interaktif atau Anda tidak menentukan token ini, alat konfigurasi akan menghasilkan nilai acak.

source: Use the verification section for the networking option that you chose to deploy.
de: Verwenden Sie die Verifikations-Sektion für die Netzwerkoption, die Sie für die Bereitstellung gewählt haben.
fr: Utiliser la section de vérification pour l'option réseau que vous avez choisie de déployer.
id: Gunakan bagian verifikasi untuk opsi jaringan yang Anda pilih untuk mengerahkan.

source: Using the scripts
de: Anwenden der Skripte
fr: Utilisation des scripts
id: Menggunakan script

source: Verify access to the internet:
de: Prüfen Sie die Verbindung zum Internet:
fr: Vérifier l'accès à internet:
id: Verifikasi akses ke internet:

source: Verify access to the provider physical network gateway:
de: Überprüfen des Zugangs zum physischen Gateway des Anbieternetzwerkes:
fr: Vérifier l'accès à la passerelle du réseau physique fournisseur:
id: Verifikasi akses ke gateway jaringan fisik provider:

source: Verify access to the self-service network gateway:
de: Überprüfen des Zugriffs auf das self-service Netzwerk Gateway:
fr: Vérifier l'accès à la passerelle du réseau self-service:
id: Verifikasi akses ke gateway jaringan self-service:

source: Verify addition of the key pair:
de: Überprüfen Sie das Hinzufügen des Schlüsselpaares:
fr: Vérifier l'ajout de la paire de clés:
id: Verifikasi penambahan key pair:

source: Verify connectivity
de: Überprüfen Sie die Verbindungsfähigkeit
fr: Vérifier la connectivité
id: Verifikasi konektivitas

source: Verify connectivity to the instance from the controller node or any host on the provider physical network:
de: Überprüfen der Verbindung zu einer Instanz von einem Controllerknoten oder einem beliebigen Host aus dem physischen Anbieternetzwerk:
fr: Vérifier la connectivité à l'instance à partir du nœud contrôleur ou tout autre host sur le réseau physique fournisseur:
id: Memverifikasi konektivitas ke instance dari controller node atau semua host pada jaringan fisik provider:

source: Verify connectivity to the instance via floating IP address from the controller node or any host on the provider physical network:
de: Überprüfen der Verbindung zu einer Instanz über die Floating IP-Adresse von einem Controllerknoten oder einem beliebigen Host aus dem physischen Anbieternetzwerk:
fr: Vérifier la connectivité à l'adresse IP flottante de l'instance à partir du nœud contrôleur ou tout autre host sur le réseau physique fournisseur:
id: Memverifikasi konektivitas untuk instance melalui floating IP address dari controller node atau semua host pada jaringan fisik provider:

source: Verify operation
de: Überprüfen Sie den Betrieb
fr: Vérifier le fonctionnement
id: Verifikasi operasi

source: Verify operation of the Block Storage service.
de: Verifizieren Sie die Funktionalität des Block-Storage-Dienstes.
fr: Vérifier le fonctionnement du service de Stockage par Blocs.
id: Verifikasi pengoperasian layanan Block Storage.

source: Verify operation of the Compute service.
fr: Vérifier le fonctionnement du service Compute.
id: Verifikasi pengoperasian layanan Compute.

source: Verify operation of the Database service.
fr: Vérifier le fonctionnement du service de Base de Données.
id: Verifikasi pengoperasian layanan Database.

source: Verify operation of the Identity service before installing other services.
de: Überprüfen ob der Identitätsdienst funktioniert, bevor Sie weitere Dienste installieren.
fr: Vérifier le fonctionnement du service d'Identité avant d'installer d'autres services.
id: Verifikasi pengoperasian layanan Identity sebelum menginstal layanan lainnya.

source: Verify operation of the Image service using `CirrOS <http://launchpad.net/cirros>`__, a small Linux image that helps you test your OpenStack deployment.
de: Überprüfen Sie, ob der Abbilddienst funktioniert, indem Sie `CirrOS <http://launchpad.net/cirros>`__ verwenden, ein kleines Linuxabbild zum Testen Ihrer OpenStack-Implementierung.
fr: Vérifier le fonctionnement du service d'Image en utilisant `CirrOS <http://launchpad.net/cirros>`__, une image linux minimale qui vous permettra de tester votre déploiement OpenStack.
id: Verifikasi pengoperasian layanan Image menggunakan `CirrOS <http://launchpad.net/cirros>` __, image Linux kecil yang membantu Anda menguji pengerahan OpenStack Anda.

source: Verify operation of the Object Storage service.
fr: Vérifier le fonctionnement du service de Stockage Objet.
id: Verifikasi pengoperasian layanan Object Storage.

source: Verify operation of the Orchestration service.
de: Überprüfen des Betriebs des Orchestrierungsdienstes.
fr: Vérifier le fonctionnement du service d'Orchestration.
id: Verifikasi pengoperasian layanan Orchestration.
