Repository: 25hours/openstack-manuals
Catalog: doc/install-guide/source/locale/*/LC_MESSAGES/install-guide.po
Languages: de, fr, id

source: List network namespaces. You should see one ``qrouter`` namespace and two ``qdhcp`` namespaces.
de: Lassen Sie die Netzwerk-Namensräume auflisten. Sie sollten einen Namensraum ``qrouter`` und zwei Namensräume ``qdhcp`` sehen.
fr: Lister les espaces de nommage réseau. Vous devriez voir un espace de nommage ``qrouter`` et deux espaces de nommage ``qdhcp``.
id: Daftar namespaces jaringan. Anda akan melihat salah satu namespace ``qrouter`` dan dua namespace ``qdhcp``.

source: List ports on the router to determine the gateway IP address on the provider network:
de: Liste alle Ports auf dem Router auf, um die Gateway IP-Adresse im Anbieternetzwerk zu bestimmen:
fr: Lister les ports sur le routeur pour déterminer l'adresse IP de la passerelle sur le réseau fournisseur:
id: Daftar port pada router untuk menentukan alamat IP gateway di jaringan provider:

source: List service components to verify successful launch and registration of each process:
de: Lassen Sie die Dienstkomponenten anzeigen um zu überprüfen, ob alle Prozesse erfolgreich gestartet wurden:
fr: Lister les composants du service pour vérifier le bon lancement et enregistrement de chaque processus:
id: Daftar komponen layanan untuk memverifikasi peluncuran sukses dan pendaftaran setiap proses:

source: List service components to verify successful launch of each process:
de: Zeigen Sie die Dienstkomponenten an um den erfolgreichen Start aller Prozesse zu prüfen:
fr: Lister les composants du service pour vérifier le bon lancement de chaque processus:
id: Daftarlah komponen layanan untuk memverifikasi peluncuran suskses setiap proses:

source: List volumes:
de: Lassen alle Datenträger anzeigen:
fr: Listez les volumes:
id: Mendaftarkan volume:

source: Load the ``admin-openrc`` file to populate environment variables with the location of the Identity service and the ``admin`` project and user credentials:
de: Laden Sie die Datei ``admin-openrc`` zum Setzen der Umgebungsvariablen mit dem Verweis zum Identitätsdienst und den Anmeldeinformationen für das Projekt und den Benutzer ``admin``:
fr: Charger le fichier ``admin-openrc`` pour renseigner les variables d'environnement avec l'emplacement du service d'Identité et les credentials du projet et utilisateur ``admin``:
id: Memuat file ``admin-openrc`` untuk mengisi variabel lingkungan dengan lokasi layanan Identitas dan proyek ``admin`` dan kredensial user:

source: Log into the instance using ``manila`` as the username and password.
fr: Se connecter à l'instance en utilisant ``manila`` comme nom d'utilisateur et comme mot de passe.
id: Masuk ke instance menggunakan ``manila`` sebagai username dan password.

source: Management on 10.0.0.0/24 with gateway 10.0.0.1
de: Management auf 10.0.0.0/24 mit Gateway 10.0.0.1
fr: Management sur 10.0.0.0/24 avec la passerelle 10.0.0.1
id: Manajemen pada 10.0.0.0/24 dengan gateway 10.0.0.1

source: Manages the lifecycle of compute instances in an OpenStack environment. Responsibilities include spawning, scheduling and decommissioning of virtual machines on demand.
fr: Gère le cycle de vie d'instances de compute dans un environnement OpenStack. Les responsabilités incluent la génération dynamique, la planification et la mise hors service de machines virtuelles à la demande.
id: Mengelola siklus hidup dari instances komputasi di lingkungan OpenStack. Tanggung jawabnya meliputi spawning, penjadwalan dan dekomisioning mesin virtual pada permintaan.

source: Message queue
de: Nachrichtenwarteschlange
fr: File de messages

source: Monitors and meters the OpenStack cloud for billing, benchmarking, scalability, and statistical purposes.
fr: Surveille et mesure le cloud OpenStack dans l'optique de la facturation, du benchmark, de la scalabilité et pour des statistiques.
id: Monitor dan meter cloud OpenStack untuk penagihan, benchmarking, skalabilitas, dan keperluan statistik.

source: Most OpenStack services use an SQL database to store information. The database typically runs on the controller node. The procedures in this guide use MariaDB or MySQL depending on the distribution. OpenStack services also support other SQL databases including `PostgreSQL <http://www.postgresql.org/>`__.
de: Die meisten OpenStack-Dienste nutzen eine SQL-Datenbank zum Speichern der Informationen. Die Datenbank läuft normalerweise auf dem Controller-Knoten. Abhängig von der Distribution wird in diesem Leitfaden MariaDB oder MySQL verwendet. OpenStack-Dienste unterstützen außerdem weitere SQL-Datenbanken, unter anderen auch `PostgreSQL <http://www.postgresql.org/>`__.
fr: La plupart des services OpenStack utilisent une base de données SQL pour stocker des informations. La base de données tourne généralement sur le nœud contrôleur. Les procédures dans ce guide utilisent MariaDB ou MySQL en fonction de la distribution. Les services OpenStack supportent également d'autres bases de données SQL dont `PostgreSQL <http://www.postgresql.org/>`__.
id: Kebanyakan layanan OpenStack menggunakan database SQL untuk menyimpan informasi. Database biasanya berjalan pada controller node. Prosedur dalam panduan ini menggunakan MariaDB atau MySQL tergantung pada distribusi. Layanan OpenStack juga mendukung selain database SQL termasuk `PostgreSQL <http://www.postgresql.org/>` __.

source: Most cloud images support :term:`public key authentication` rather than conventional password authentication. Before launching an instance, you must add a public key to the Compute service.
de: Die meisten Cloudabbilder unterstützen eher :term:`public key authentication` als konventionelle Passwortauthentifizierung. Fügen Sie dem Compute Dienst einen öffentlichen Schlüssel hinzu, bevor Sie eine Instanz starten.
fr: La plupart des images cloud supportent l':term:`authentification par clé publique` plutôt que l'authentification classique par mot de passe. Avant de lancer une instance, vous devez ajouter une clé publique au service Compute.
id: Kebanyakan images cloud mendukung :term:`public key authentication` daripada otentikasi password konvensional. Sebelum meluncurkan sebuah instance, Anda harus menambahkan public key untuk layanan Compute.

source: Mount the NFS share in the instance using the export location of the share:
fr: Monter le partage NFS dans l'instance en utilisant le chemin exporté du partage:
id: Mount share NFS dalam instance menggunakan lokasi ekspor share:

source: Mount the devices:
de: Einhängen der Geräte:
fr: Monter les devices:
id: Mount perangkat:

source: Mount the share from an instance
de: Freigabe in einer Instanz mounten
fr: Monter le partage à partir d'une instance
id: Me-mount share dari sebuah instance

source: Network interface names vary by distribution. Traditionally, interfaces use "eth" followed by a sequential number. To cover all variations, this guide simply refers to the first interface as the interface with the lowest number and the second interface as the interface with the highest number.
de: Die Namen der Netzwerkschnittstellen variieren je nach Distribution. Traditionell wird "eth" mit einer fortlaufenden Nummer versehen. Um alle Variationen abzudecken, verwendet dieser Leitfaden die Schnittstelle mit der niedrigsten Nummer als erste Schnittstelle und die mit der höchsten Nummer als zweite Schnittstelle.
fr: Les noms des interface réseau varient d'une distribution à l'autre. Traditionnellement, les interfaces utilisent "eth" suivi d'un numéro. Pour couvrir toutes les variantes, ce guide nomme première interface celle qui possède le plus petit numéro et seconde interface celle qui possède le plus grand numéro.
id: Nama-nama antarmuka jaringan bervariasi menurut distribusi. Secara tradisional, interface menggunakan "eth" diikuti dengan nomor urut. Untuk mencakup semua variasi, panduan ini hanya mengacu pada antarmuka pertama sebagai antarmuka dengan nomor terendah dan antarmuka kedua sebagai antarmuka dengan jumlah tertinggi.

source: Network mask: 255.255.255.0 (or /24)
de: Netzwerk Maske: 255.255.255.0 (oder /24)
fr: Netmask: 255.255.255.0 (ou /24)

source: Network mask: ``255.255.255.0`` (or ``/24``)
de: Netzwerkmaske: ``255.255.255.0`` (oder ``/24``)
fr: Netmask: ``255.255.255.0`` (ou ``/24``)

source: Networking
de: Netzwerk
fr: Réseaux

source: Networking (neutron) concepts
de: Netzwerkkonzepte (Neutron)
fr: Concepts Réseau (neutron)

source: Networking Option 1: Provider networks
de: Netzwerk Option 1: Anbieternetzwerke
fr: Réseau Option 1: Réseaux fournisseurs

source: Networking Option 2: Self-service networks
de: Netzwerk Option 2: Self-service Netzwerke
fr: Réseau Option 2: Réseaux libre-service

source: Networking agents reside on the controller node instead of one or more dedicated network nodes.
fr: Les agents réseau tournent sur le nœud contrôleur plutôt que sur un ou plusieurs nœuds réseau dédiés.
id: Agen Networking berada pada controller node bukan satu atau lebih dedicated network nodes.

source: Networking also supports *security groups*. Security groups enable administrators to define firewall rules in groups. A VM can belong to one or more security groups, and Networking applies the rules in those security groups to block or unblock ports, port ranges, or traffic types for that VM.
de: Das Netzwerk unterstützt Sicherheitsgruppen. Sicherheitsgruppen erlauben Administratoren Firewall-Regeln in Gruppen zu definieren. Eine VM kann zu einer oder mehreren Sicherheitsgruppen gehören und das Netzwerk wendet die Regeln dieser Sicherheitsgruppen zum blockieren oder erlauben von einzelnen Ports, Portbereichen sowie Verkehrstypen für die VM an.
fr: Le composant Réseau supporte aussi les *groupes de sécurité*. Les Groupe de Sécurité permettent aux administrateurs de définir des règles firewall groupées. Une VM peut appartenir à un ou plusieurs groupes de sécurité, et le composant Réseau applique les règles dans ces groupes de sécurité pour bloquer ou autoriser des ports, des plages de ports, ou des types de trafic pour cette VM.
id: Jaringan juga mendukung *security groups*. Security groups memungkinkan administrator untuk menentukan aturan firewall dalam kelompok. Sebuah VM dapat menjadi milik satu atau lebih security group, dan Jaringan menerapkan aturan dalam security groups untuk memblokir atau membuka blokir port, port range, atau traffic types untuk itu VM.

source: Networking provides networks, subnets, and routers as object abstractions. Each abstraction has functionality that mimics its physical counterpart: networks contain subnets, and routers route traffic between different subnets and networks.
de: Das Netzwerk bietet Netze, Subnetze und Router als abstrahierte Objekte. Jede Abstraktion hat Funktionen, die ihre physikalischen Gegenstücken entsprechen: Netzwerke enthalten Subnetze, Router routen Datenverkehr zwischen Subnetzen und Netzwerken.
fr: Le composant Réseau fournit des réseaux, sous-réseaux et routeurs comme des abstractions objet. Chaque abstraction a des fonctionnalités qui imitent son homologue physique: les réseaux contiennent des sous-réseaux, et les routeurs dirige le trafic entre les différents sous-réseaux et réseaux.
id: Networking menyediakan jaringan, subnet, dan router sebagai abstraksi objek. Setiap abstraksi memiliki fungsi yang meniru ujud fisiknya: jaringan mengandung subnet, dan router me-rute traffic antara berbagai subnet dan jaringan.

source: Networking service
de: Netzwerkdienst
fr: Service Réseau
id: Layanan Networking

source: Next steps
de: Nächste Schritte
fr: Prochaines étapes
id: Langkah selanjutnya

source: NoSQL database
de: NoSQL-Datenbank
fr: Base de données NoSQL
id: Database NoSQL

source: Non-privileged users typically cannot supply additional parameters to this command. The service automatically chooses parameters using information from the following files:
de: Nicht-privilegierte Benutzer können diesem Kommando üblicherweise keine zusätzlichen Parameter hinzufügen. Der Dienst wählt automatisch Parameter mittels Informationen aus den folgenden Dateien:
fr: Les utilisateurs sans privilège ne peuvent en général pas fournir de paramètres supplémentaires à cette commande. Le service choisit automatiquement les paramètres en utilisant les informations des fichiers suivants:
id: User non-privileged biasanya tidak dapat menyediakan parameter tambahan untuk command ini. Layanan ini secara otomatis memilih parameter menggunakan informasi dari file-file berikut:

source: Note that ``--config-file`` incorrectly points to ``trove.conf``.
fr: A noter que ``--config-file`` pointe de façon erronée vers ``trove.conf``.
id: Perhatikan bahwa ``--config-file`` salah menunjuk ke ``trove.conf``.

source: Object Storage
fr: Stockage Objet

source: Object Storage service
fr: Service de Stockage Objet:
id: Layanan Object Storage

source: Object storage nodes (Optional)
de: Objektspeicherknoten (optional)
fr: Nœuds de stockage objet (Optionnel)
id: Node Object storage (Opsional)

source: Obtain a :term:`Virtual Network Computing (VNC)` session URL for your instance and access it from a web browser:
de: Rufen Sie eine :term:`Virtual Network Computing (VNC)` Sitzungs-URL für Ihre Instanz ab und greifen Sie von einem Webbrowser aus zu:
fr: Obtenir une URL de session :term:`Virtual Network Computing (VNC)` pour votre instance et y accéder via un navigateur web:
id: Mendapatkan :term:`Virtual Network Computing (VNC)` URL sesi instance Anda dan mengaksesnya dari web browser:

source: Obtain the ``/etc/swift/swift.conf`` file from the Object Storage source repository:
fr: Obtenir le fichier ``/etc/swift/swift.conf`` à partir du dépôt source du Stockage Objet:
id: Dapatkan file ``/etc/swift/swift.conf``` dari repositori sumber Object Storage:

source: Obtain the accounting, container, and object service configuration files from the Object Storage source repository:
fr: Obtenir les fichier de configuration des services de compte, de conteneur et d'objet à partir du répertoire source du Stockage d'Objet:
id: Dapatkan ile konfigurasi layanan accounting, container, dan object, dari repositori sumber Object Storage:

source: Obtain the proxy service configuration file from the Object Storage source repository:
fr: Obtenir le fichier de configuration du service proxy à partir du dépôt source du Stockage Objet:
id: Mendapatkan layanan proxy file konfigurasi dari repositori sumber Object Storage:

source: On CentOS, the ``extras`` repository provides the RPM that enables the OpenStack repository. CentOS includes the ``extras`` repository by default, so you can simply install the package to enable the OpenStack repository.
de: Unter CentOS wird das RPM zur Aktivierung des OpenStack-Repositories durch das Repository ``extras`` zur Verfügung gestellt. CentOS enthält das Resporitory ``extras`` standardmäßig, Sie können das Paket zur Aktivierung des OpenStack-Repositories also einfach installieren.
fr: Sur CentOS, le dépôt ``extras`` contient le RPM qui fournit le dépôt OpenStack. CentOS inclut par défaut le dépôt ``extras``, donc vous pouvez simplement installer le package pour activer le dépôt OpenStack.
id: Pada CentOS, repository ``extras`` menyediakan RPM yang memungkinkan repositori OpenStack. CentOS memasukkan `` extras`` repositori secara default, sehingga Anda dengan mudah dapat menginstal paket untuk memperoleh repositori OpenStack.

source: On RHEL, download and install the RDO repository RPM to enable the OpenStack repository.
de: Laden Sie unter RHEL das RDO-Repository-RPM herunter und installieren Sie es zur Aktivierung des OpenStack-Repositories.
fr: Sur RHEL, télécharger et installer le RPM dépôt RDO pour activer le dépôt OpenStack.
id: Pada RHEL, men-download dan menginstal RDO repository RPM untuk mengaktifkan repositori OpenStack.

source: On RHEL, register your system with Red Hat Subscription Management, using your Customer Portal user name and password:
de: Registrieren Sie Ihr RHEL mittels Red Hat Subscription Management und verwenden Sie Name und Passwort des Kundenportals:
fr: Sur RHEL, enregistrer votre système auprès du Gestionnaire de Souscription Red Hat, en utilisant vos nom d'utilisateur et mot de passe du portail client.
id: Pada RHEL, daftarkanlah sistem anda dengan Red Hat Subscription Management, menggunakan nama user dan password Anda di Customer Portal:

source: On SLES:
de: Unter SLES:
fr: Sur SLES:
id: Pada SLES:

source: On all nodes, adding the Debian 8 (Jessie) backport repository to the source list:
de: Auf allen Knoten sollte das Debian 8 (Jessie) Backport-Repository zur Quellenliste hinzugefügt werden:
fr: Sur tous les nœuds, ajouter le dépôt backport Debian 8 (Jessie) à la liste des sources:
id: Pada semua node, tambahkan repositori backport Debian 8 (Jessie) ke daftar sumber:

source: On all nodes, ensure proper ownership of the configuration directory:
fr: Sur tous les nœuds, veiller à ce que le répertoire de configuration possède les bons droits:
id: Pada semua node, pastikan kepemilikan yang tepat dari direktori konfigurasi:

source: On openSUSE:
de: Unter openSUSE:
fr: Sur openSUSE:
id: Pada openSUSE:

source: On the controller node and any other nodes running the proxy service, restart the Object Storage proxy service including its dependencies:
fr: Sur le nœud contrôleur et sur tout autre nœud où tourne le service proxy, redémarrer le service proxy du Stockage Objet, en incluant ses dépendances:
id: Pada kontroler node dan setiap node lain yang menjalankan layanan proxy, restart layanan proxy Object Storage termasuk dependensinya:

source: On the controller node and any other nodes running the proxy service, start the Object Storage proxy service including its dependencies and configure them to start when the system boots:
fr: Sur le nœud contrôleur et sur tout autre nœud où tourne le service proxy, démarrer le service proxy du Stockage Objet, en incluant ses dépendances et le configurer pour s'exécuter au démarrage du système:
id: Pada kontroler node dan setiap node lain menjalankan layanan proxy, mulai layanan proxy Object Storage termasuk dependensinya dan mengkonfigurasi mereka untuk memulai ketika sistem boot:

source: On the controller node, source the ``admin`` credentials to gain access to admin-only CLI commands:
de: Sourcen Sie die ``admin`` Anmeldeinformationen auf dem Controller-Knoten, um Zugriff auf Admin-CLI-Befehle zu erhalten:
fr: Sur le nœud contrôleur, sourcer les credentials ``admin`` pour obtenir l'accès aux commandes en ligne réservées à l'administrateur:
id: Pada kontroler node, dapatkan sumber kredensial ``admin`` untuk mendapatkan akses ke commands CLI admin-only:

source: On the controller node, source the ``demo`` credentials to gain access to user-only CLI commands:
de: Sourcen Sie die ``demo``-Anmeldeinformationen um Zugriff auf Benutzer-CLI Kommandos zu bekommen:
fr: Sur le nœud contrôleur, sourcer les credentials ``demo`` pour obtenir l'accès aux commandes en ligne simple-utilisateur:
id: Pada kontroler node, source kredensial ``demo`` untuk mendapatkan akses ke command CLI user-only:

source: On the storage nodes, start the Object Storage services and configure them to start when the system boots:
fr: Sur les nœuds de stockage, démarrer les services de Stockage Objet et les configurer pour s'exécuter au démarrage du système:
id: Pada node penyimpanan, memulai layanan Object Storage dan mengkonfigurasi mereka untuk memulai ketika sistem boot:

source: On the storage nodes, start the Object Storage services:
fr: Sur les nœuds de stockage, démarrer les services de Stockage Objet:
id: Pada node penyimpanan, memulai layanan Object Storage:

source: One physical server can support multiple nodes, each with almost any number of network interfaces.
de: Ein physischer Server kann mehrere Knoten unterstützen, jeder mit einer fast beliebigen Zahl von Netzwerk Interfaces.
fr: Un serveur physique peut supporter de multiples nœuds, chacun avec autant d'interfaces réseau que nécessaire.
id: Satu server fisik dapat mendukung beberapa node, masing-masing dengan hampir semua jumlah antarmuka jaringan.

source: Only instances can access Block Storage volumes. However, the underlying operating system manages the devices associated with the volumes. By default, the LVM volume scanning tool scans the ``/dev`` directory for block storage devices that contain volumes. If projects use LVM on their volumes, the scanning tool detects these volumes and attempts to cache them which can cause a variety of problems with both the underlying operating system and project volumes. You must reconfigure LVM to scan only the devices that contain the ``cinder-volume`` volume group. Edit the ``/etc/lvm/lvm.conf`` file and complete the following actions:
de: Nur Instanzen haben Zugriff auf Block-Storage-Datenträger. Das darunterliegende Betriebssystem verwaltet die den Datenträgern zugewiesenen Geräte. Standardmäßig scannt das LVM Datenträger Scan-Werkzeug das Verzeichnis ``/dev`` nach Block-Storage-geräten, die Datenträger enthalten. Wenn Projekte LVM auf ihren Datenträgern verwenden, erkennt das Scan-Werkzeug diese und speichert sie zwischen, was zu verschiedenen Problemen sowohl im darunterliegenden Betriebssystem als auch auf dem Projektdatenträger führen kann. Sie müssen LVM so konfigurieren, dass nur Geräte gescannt werden, die die Datenträgergruppe ``cinder-volume`` enthalten. Bearbeiten Sie die Datei ``/etc/lvm/lvm.conf`` und vervollständigen Sie folgende Aktionen:
fr: Seules les instances peuvent accéder aux volumes de Stockage par Blocs. Néanmoins, le système d'exploitation sous-jacent gère les devices associés aux volumes. Par défaut, l'outil d'analyse des volumes LVM scanne le répertoire ``/dev`` pour trouver des devices de stockage par blocs qui contiennent des volumes. Si les projets utilisent LVM sur leurs volumes, l'outil d'analyse détecte ces volumes et essaie de les mettre en cache, ce qui peut causer différents problèmes avec à la fois le système d'exploitation sous-jacent et les volumes des projets. Vous devez reconfigurer LVM pour analyser seulement les devices qui contiennent le volume group ``cinder-volume``. Éditez le fichier ``/etc/lvm/lvm.conf`` et effectuer les opérations suivantes:
id: Hanya instance dapat mengakses volume Block Storage. Namun, sistem operasi yang mendasari mengelola perangkat yang terkait dengan volume. Secara default, alat penindaian volume LVM menindai direktori ``/dev`` untuk perangkat penyimpanan blok yang berisi volume. Jika proyek menggunakan LVM pada volume mereka, alat scanning ini mendeteksi volume ini dan mencoba untuk cache mereka yang dapat menyebabkan berbagai masalah dengan sistem operasi yang mendasari maupun volume proyek. Anda harus mengkonfigurasi ulang LVM untuk memindai hanya perangkat yang berisi kelompok volume ``cinder-volume``. Editlah file ``/etc/lvm/lvm.conf``` dan menyelesaikan tindakan berikut:
