Repository: 25hours/openstack-manuals
Catalog: doc/install-guide/source/locale/*/LC_MESSAGES/install-guide.po
Languages: de, fr, id

source: After installing the operating system on each node for the architecture that you choose to deploy, you must configure the network interfaces. We recommend that you disable any automated network management tools and manually edit the appropriate configuration files for your distribution. For more information on how to configure networking on your distribution, see the `documentation <https://help.ubuntu.com/lts/serverguide/network-configuration.html>`__ .
de: Nachdem das Betriebssystem auf jedem Knoten mit der gewünschten Architektur installiert wurde, müssen die Netzwerkschnittstellen konfiguriert werden. Es wird empfohlen, alle automatisierten Netzwerkverwaltungshilfsmittel zu deaktivieren und die entsprechenden Konfigurationsdateien für Ihre Distribution manuell anzupassen. Für weitere Informationen zum Konfigurieren der Netzwerke auf Ihrer Distribution lesen Sie die `Dokumentation <https://help.ubuntu.com/lts/serverguide/network-configuration.html>`__ .
fr: Après avoir installé le système d'exploitation sur chaque nœud de l'architecture que vous avez choisie de déployer, vous devez configurer les interfaces réseau. Nous recommandons de désactiver tout outil de gestion automatisée du réseau et d'éditer manuellement les fichiers de configuration appropriés à votre distribution. Pour plus d'informations sur la configuration réseau de votre distribution, voir la `documentation <https://help.ubuntu.com/lts/serverguide/network-configuration.html>`__ .
id: Setelah menginstal sistem operasi pada setiap node untuk arsitektur yang Anda pilih untuk mengerahkan, Anda harus mengkonfigurasi interface jaringan. Kami menyarankan Anda menonaktifkan perangkat manajemen jaringan otomatis ,dan mengedit secara manual file konfigurasi yang sesuai untuk distribusi Anda. Untuk informasi lebih lanjut tentang cara mengkonfigurasi jaringan distribusi Anda, lihat `documentation <https://help.ubuntu.com/lts/serverguide/network-configuration.html>`__ .

source: After installing the operating system on each node for the architecture that you choose to deploy, you must configure the network interfaces. We recommend that you disable any automated network management tools and manually edit the appropriate configuration files for your distribution. For more information on how to configure networking on your distribution, see the `documentation <https://wiki.debian.org/NetworkConfiguration>`__ .
de: Nachdem das Betriebssystem auf jedem Knoten mit der gewünschten Architektur installiert wurde, müssen die Netzwerkschnittstellen konfiguriert werden. Es wird empfohlen, alle automatisierten Netzwerkverwaltungshilfsmittel zu deaktivieren und die entsprechenden Konfigurationsdateien für Ihre Distribution manuell anzupassen. Für weitere Informationen zum Konfigurieren der Netzwerke auf Ihrer Distribution lesen Sie die `Dokumentation <https://wiki.debian.org/NetworkConfiguration>`__ .
fr: Après avoir installé le système d'exploitation sur chaque nœud de l'architecture que vous avez choisie de déployer, vous devez configurer les interfaces réseau. Nous recommandons de désactiver tout outil de gestion automatisée du réseau et d'éditer manuellement les fichiers de configuration appropriés à votre distribution. Pour plus d'informations sur la configuration réseau de votre distribution, voir la `documentation <https://wiki.debian.org/NetworkConfiguration>`__
id: Setelah menginstal sistem operasi pada setiap node untuk arsitektur yang Anda pilih untuk mengerahkan, Anda harus mengkonfigurasi interface jaringan. Kami menyarankan Anda menonaktifkan perangkat manajemen jaringan otomatis ,dan mengedit secara manual file konfigurasi yang sesuai untuk distribusi Anda. Untuk informasi lebih lanjut tentang cara mengkonfigurasi jaringan distribusi Anda, lihat `documentation <https://wiki.debian.org/NetworkConfiguration>`__ .

source: After some time, the share status should change from ``creating`` to ``available``:
de: Nach kurzer Zeit sollte sich der Freigabestatus von ``Erzeuge`` in ``Verfügbar`` ändern:
fr: au bout d'un moment, le statut du share devrait passer de ``en création`` à ``disponible``:
id: Setelah beberapa waktu, status share harus berubah dari ``creating`` untuk ``available``:

source: After you configure the ML2 plug-in, removing values in the ``type_drivers`` option can lead to database inconsistency.
de: Wenn Sie Einträge in der ``type_drivers``-Option entfernen nachdem das ML2-Plugin konfiguriert wurde, können Inkonstitenzen in der Datenbank auftreten.
fr: Après avoir configuré le plugin ML2, la suppression de valeurs dans l'option ``type_drivers`` peut conduire à une incohérence de la base de données.
id: Setelah Anda mengkonfigurasi ML2 plug-in, menghapus nilai-nilai dalam opsi ``type_drivers`` dapat menyebabkan inkonsistensi database

source: After you install and configure the dashboard, you can complete the following tasks:
de: Nachdem Sie das Dashboard installiert und konfiguriert haben, können Sie folgende Aufgaben durchführen:
fr: Après avoir installé et configuré le dashboard, vous pouvez effectuer les actions suivantes:
id: Setelah Anda menginstal dan mengkonfigurasi dashboard, Anda dapat menyelesaikan tugas-tugas berikut:

source: Alarming service
de: Benachrichtigungsdienst
fr: Service d'alarme

source: All nodes require Internet access for administrative purposes such as package installation, security updates, :term:`DNS`, and :term:`NTP`. In most cases, nodes should obtain internet access through the management network interface. To highlight the importance of network separation, the example architectures use `private address space <https://tools.ietf.org/html/rfc1918>`__ for the management network and assume that the physical network infrastructure provides Internet access via :term:`NAT` or other method. The example architectures use routable IP address space for the provider (external) network and assume that the physical network infrastructure provides direct Internet access.
de: Alle Knoten benötigen Internetzugang für administrative Zwecke, z.B. Paketinstallation, Sicherheitsupdates, :term:`DNS`, und :term:`NTP`. In den meisten Fällen sollten Knoten ihren Internetzugang über die Management-Netzwerkschnittstelle beziehen. Um die Bedeutung der Trennung von Netzwerken zu verdeutlichen, werden im Beispiel `private Adressbereiche <https://tools.ietf.org/html/rfc1918>`__ für das Managementnetzwerk genutzt und angenommen, dass die physische Netzwerkinfrastruktur den Internetzugang mittels :term:`NAT` oder anderen Methoden zur Verfügung stellt. Die Beispielarchitektur nutzt einen routingfähigen IP-Adressbereich für das Provider-Netzwerk (extern) und es wird angenommen, dass die physische Netzwerkinfrastruktur direkten Internetzugang gewährleistet.
fr: Tous les nœuds nécessitent un accès Internet pour des besoins administratifs comme l'installation de package, de mises à jour de sécurité, le :term:`DNS`, et le :term:`NTP`. Dans la plupart des cas, les nœuds doivent avoir accès à Internet via l'interface réseau de management. Pour souligner l'importance de la séparation des réseaux, les architectures en exemple utilisent un `espace d'adresses privé <https://tools.ietf.org/html/rfc1918>`__ pour le réseau de management et suppose que l'infrastructure réseau physique fournit l'accès à Internet via du :term:`NAT` ou tout autre méthode. Les architectures en exemple utilisent un espace d'adresses IP routable pour le réseau fournisseur (externe) et suppose que l'infrastructure réseau physique fournit un accès Internet direct.
id: Semua node membutuhkan akses internet untuk tujuan administratif seperti instalasi paket, update keamanan,: istilah: `DNS`, dan: istilah:` NTP`. Dalam kebanyakan kasus, node harus mendapatkan akses internet melalui interface jaringan manajemen. Untuk menyoroti pentingnya pemisahan jaringan, arsitektur contoh menggunakan `private address space <https://tools.ietf.org/html/rfc1918>`__ untuk jaringan manajemen dan menganggap bahwa infrastruktur jaringan fisik menyediakan akses internet melalui :term:`NAT` atau metode lainnya. Arsitektur contoh menggunakan routable IP address space untuk penyedia jaringan (eksternal) dan menganggap bahwa infrastruktur jaringan fisik menyediakan akses internet langsung.

source: Allow all hosts to access the dashboard:
de: Erlauben Sie allen Hosts den Zugriff auf das Dashboard:
fr: Autoriser tous les hosts à accéder au dashboard:
id: Membolehkan semua host untuk mengakses dashboard:

source: Also, the Networking service assumes default values for kernel network parameters and modifies firewall rules. To avoid most issues during your initial installation, we recommend using a stock deployment of a supported distribution on your hosts. However, if you choose to automate deployment of your hosts, review the configuration and policies applied to them before proceeding further.
de: Außerdem setzt der Netzwerkdienst Standardwerte für Kernel-Netzwerkparameter voraus und modifiziert Firewallregeln. Um möglichst viele Probleme während der Erstinstallation zu vermeiden, wird empfohlen eine Komplettinstallation einer unterstützten Distribution auf Ihren Hosts durchzuführen. Trotzdem sollten Sie für den Fall der automatischen Installation Ihrer Hosts die angewandten Konfigurationen und Richtlinien überprüfen, bevor Sie fortfahren.
fr: De même, le service de réseau assume que les paramètres réseau du noyau sont par défaut et modifie les règles firewall. Pour éviter des problèmes pendant l'installation initiale, il est recommandé d'utiliser un nouveau déploiement d'une distribution supportée sur vos hôtes. Néanmoins, si vous choisissez d'automatiser le déploiement sur vos hôtes existants, revoir leur configuration et les polices qui leurs sont appliquées avant de poursuivre.
id: Juga, layanan Networking mengasumsikan nilai default untuk parameter jaringan kernel dan memodifikasi aturan firewall. Untuk menghindari sebagian besar masalah selama instalasi awal Anda, kami sarankan menggunakan pengerahan stok distribusi didukung pada host Anda. Namun, jika Anda memilih untuk mengotomatisasi pengerahan host Anda, tinjaulah konfigurasi dan kebijakan yang diterapkan kepada mereka sebelum melanjutkan lebih lanjut.

source: Alternatively, you can skip the ``ssh-keygen`` command and use an existing public key.
de: Alternativ können Sie den Befehl ``ssh-keygen`` überspringen und einen bereits vorhandenen öffentlichen Schlüssel verwenden.
fr: Autrement, vous pouvez sauter la commande ``ssh-keygen`` et utiliser une clé publique existante.
id: Atau, Anda dapat melewatkan command ``ssh-keygen`` dan menggunakan public key yang ada.

source: Although Object Storage supports any file system with :term:`extended attributes (xattr)`, testing and benchmarking indicate the best performance and reliability on :term:`XFS`. For more information on horizontally scaling your environment, see the `Deployment Guide <http://docs.openstack.org/developer/swift/deployment_guide.html>`_.
fr: Bien que le Stockage Objet supporte tout système de fichier avec des :term:`attributs étendus (xattr)`, les tests et benchmarks ont montré les meilleures performances et fiabilité sur :term:`XFS`. Pour plus d'informations sur le redimensionnement horizontal de votre environnement, voir le `Guide de Déploiement <http://docs.openstack.org/developer/swift/deployment_guide.html>`_.
id: Meskipun Object Storage mendukung sistem file dengan :term:`extended attributes (xattr)`, pengujian dan benchmarking menunjukkan performa terbaik dan kehandalan pada :term: `XFS`. Untuk informasi lebih lanjut tentang lingkungan skala secara horizontal, lihat `Deployment Guide <http://docs.openstack.org/developer/swift/deployment_guide.html>`_.

source: Although most environments include Identity, Image service, Compute, at least one networking service, and the dashboard, the Object Storage service can operate independently. If your use case only involves Object Storage, you can skip to :ref:`swift` after configuring the appropriate nodes for it. However, the dashboard requires at least the Image service, Compute, and Networking.
de: Obwohl die meisten Umgebungen den Identitätsdienst, den Abbilddienst, den Computedienst, mindestens einen Netzwerkdienst und das Dashboard enthalten, kann der Objektspeicherdienst unabhängig davon betrieben werden. Wenn Ihr Anwendungsfall Objektspeicher beinhaltet, fahren Sie mit :ref:`swift` fort, nachdem Sie die entsprechenden Knoten dazu konfiguriert haben. Allerdings benötigt das Dashboard mindestens den Abbilddienst, den Computedienst sowie einen Netzwerkdienst.
fr: Bien que la plupart des environnements incluent le service d'Identité, le service d'Image, un Compute, au moins un service réseau, et le dashboard, le service de Stockage Objet peut fonctionner indépendamment. Si votre cas d'usage implique seulement le Stockage Objet, vous pouvez passer à :ref:`swift`après avoir configuré les nœuds appropriés. Néanmoins, le dashboard nécessite au moins le service d'Image, Compute et Réseau.
id: Meskipun sebagian besar lingkungan termasuk layanan Identity, layanan Image, layanan Compute, setidaknya satu layanan jaringan, dan dashboard, layanan Object Storage dapat beroperasi secara independen. Jika kasus penggunaan Anda hanya melibatkan Object Storage, Anda dapat melompat ke: ref: `swift` setelah mengkonfigurasi node yang tepat untuk itu. Namun, dashboard memerlukan setidaknya layanan Image, Compute, dan Networking.

source: Any given Networking set up has at least one external network. Unlike the other networks, the external network is not merely a virtually defined network. Instead, it represents a view into a slice of the physical, external network accessible outside the OpenStack installation. IP addresses on the external network are accessible by anybody physically on the outside network.
de: Jede Netzwerkeinrichtung hat zumindest ein externes Netzwerk. Anders als andere Netzwerke ist das externe Netzwerk nicht nur durch Software definiert. Vielmehr erlaubt es einen Blick in einen Teil des physikalischen externen Netzwerkes außerhalb der OpenStack Installation. IP-Adressen im externen Netzwerk sind von jedem erreichbar, der sich physisch im äußeren Netzwerk befindet.
fr: Toute configuration réseau comporte au moins un réseau externe. A la différence des autres réseaux, le réseau externe n'est pas simplement un réseau défini virtuellement. Il représente une vue d'une partie du réseau physique externe accessible a l'extérieur de l'installation OpenStack. Les adresses IP du réseau externe sont accessibles par n'importe qui physiquement connectés au réseau extérieur.
id: Apapun Networking diberikan menyiapkan setidaknya memiliki satu jaringan eksternal. Tidak seperti jaringan lainnya, jaringan eksternal bukan hanya jaringan didefinisikan secara virtual. Sebaliknya, itu merupakan pandangan ke sepotong jaringan fisik, eksternal diakses di luar instalasi OpenStack. Alamat IP pada jaringan eksternal dapat diakses oleh siapa saja secara fisik pada jaringan luar.

source: Any roles that you create must map to roles specified in the ``policy.json`` file in the configuration file directory of each OpenStack service. The default policy for most services grants administrative access to the ``admin`` role. For more information, see the `Operations Guide - Managing Projects and Users <http://docs.openstack.org/ops-guide/ops-projects-users.html>`__.
de: Jede Rolle, die Sie erzeugen, muss den in der ``policy.json`` Datei angegebenen Rollen des jeweiligen OpenStack Dienstes entsprechen. Die Standardrichtlinie der meisten Dienste erlaubt administrativen Zugang zur ``admin`` Rolle. Weitere Informationen finden Sie im `Operations Guide - Managing Projects and Users <http://docs.openstack.org/ops-guide/ops-projects-users.html>`__.
fr: Tous les rôles que vous créez doivent correspondre aux rôles spécifiés dans le fichier ``policy.json`` dans le répertoire des fichiers de configuration de chaque service OpenStack. La politique par défaut pour la plupart des services accorde des accès administratifs au rôle ``admin``. Pour plus d'informations, voir le `Guide des Opérations - Gérer les Projets et les Utilisateurs <http://docs.openstack.org/ops-guide/ops-projects-users.html>`__.

source: Appendix
de: Anhang
fr: Annexe

source: As the ``admin`` user, request an authentication token:
de: Fordern Sie einen Authentifizierungstoken als Benutzer ``admin`` an:
fr: En tant qu'utilisateur ``admin``, demander un jeton d'authentification:
id: Sebagai user ``admin``, minta token otentikasi:

source: As the ``demo`` user, request an authentication token:
de: Fordern Sie einen Authentifizierungstoken als Benutzer ``demo`` an:
fr: En tant qu'utilisateur ``demo``, demander un jeton d'authentification:
id: Sebagai user ``demo``, minta token otentikasi:

source: As the number of OpenStack services and virtual machines increase, so do the hardware requirements for the best performance. If performance degrades after enabling additional services or virtual machines, consider adding hardware resources to your environment.
de: So wie die Anzahl der OpenStack-Dienste und der Virtuellen Maschinen wächst, steigen auch die Hardwareanforderungen zur bestmöglichen Performance. Wenn die Performance schwächer wird nachdem Sie zusätzliche Dienste oder Virtuelle Maschinen gestartet haben, sollten Sie zusätzliche Hardware für Ihre Umgebung in Erwägung ziehen.
fr: Comme le nombre de services OpenStack et de machines virtuelles augmentent, il en va de même pour les exigences matérielles pour les meilleurs performances. Si les performances se dégradent après avoir activé des services supplémentaires ou lancé des machines virtuelles, envisager d'ajouter des ressources matérielles à votre environnement.
id: Karena jumlah layanan OpenStack dan mesin virtual meningkat, begitu juga kebutuhan hardware untuk kinerja terbaik. Jika kinerja mendegradasi setelah mengaktifkan layanan tambahan atau mesin virtual, pertimbangkanlah untuk menambahkan sumber daya perangkat keras untuk lingkungan Anda.

source: Associate the floating IP address with the instance:
de: Verbinden Sie die Floating-IP-Adresse mit Ihrer Instanz:
fr: Associer l'adresse IP flottante à l'instance:
id: Mengasosiasikan floating IP address dengan instance:

source: Attach a volume to an instance:
de: Hängen Sie einen Datenträger an eine Instanz:
fr: Attacher un volume à une instance:
id: Tempelkan volume ke sebuah instance:

source: Attach the ``volume1`` volume to the ``provider-instance`` instance:
de: Hängen sie den Datenträger ``volume1`` an die Instanz ``provider-instance``:
fr: Attacher le volume ``volume1`` à l'instance ``provider-instance``:
id: Menempelkan volume ``Volume1`` ke instance ``provider-instance``:

source: Attach the volume to an instance
de: Hängen sie den Datenträger an eine Instanz
fr: Attacher le volume à une instance:
id: Tempel volume ke sebuah instance

source: Authenticate using ``admin`` or ``demo`` user and ``default`` domain credentials.
de: Authentifizieren Sie sich mit den Anmeldeinformationen für die Benutzer``admin`` oder ``demo`` und der Domäne ``default`` .
fr: S'authentifier avec les credentials de l'utilisateur ``admin`` ou ``demo`` et le domaine ``default``.
id: Otentikasi menggunakan user ``admin`` atau user ``demo`` dan kredensial domain ``default``.

source: Back end names are arbitrary. As an example, this guide uses the name of the driver.
de: Backend-Namen sind frei wählbar. Als Beispiel verwendet diese Anleitung den Namen des Treibers als Backend-Namen.
fr: Les noms des back end sont arbitraires. Comme exemple, ce guide utilise le nom du driver.
id: Penamaan back end secara sembarangan. Sebagai contoh, buku ini menggunakan nama driver.

source: Back-end names are arbitrary. As an example, this guide uses the name of the driver as the name of the back end.
de: Backend-Namen sind frei wählbar. Als Beispiel verwendet diese Anleitung den Namen des Treibers als Backend-Namen.
fr: Les noms des backends sont arbitraires. Par exemple, ce guide utilise le nom du driver comme nom de backend.
id: Nama back-end yang sembarangan. Sebagai contoh, petunjuk ini menggunakan nama driver sebagai nama belakang.

source: Because this configuration uses an SQL database server, you can remove the SQLite database file:
de: Da die Konfiguration einen SQL-Datenbank-Server benutzt, kann die SQLite Datenbank-Datei gelöscht werden.
fr: Comme cette configuration utilise un serveur de base de données SQL, le fichier de base de données SQLite peut être supprimé:
id: Karena konfigurasi ini menggunakan server database SQL, Anda dapat menghapus file database SQLite:

source: Before being able to create a share, the generic driver with the DHSS mode enabled requires the definition of at least an image, a flavor, a network, and a share-network for being used to create a share server where the NFS/CIFS shares are served.
fr: Avant de pouvoir créer un partage, le driver générique avec le mode DHSS activé nécessite la définition d'au moins une image, un gabarit, un réseau et un réseau de partage pour pouvoir être utilisé pour créer un serveur de partage où les partages NFS/CIFS sont servis.
id: Sebelum dapat membuat share, driver generik dengan modus DHSS diaktifkan memerlukan definisi setidaknya image, flavor, network, dan share-network untuk digunakan untuk membuat server share dimana share NFS/CIFS dilayani.

source: Before launching an instance, you must create the necessary virtual network infrastructure. For networking option 1, an instance uses a provider (external) network that connects to the physical network infrastructure via layer-2 (bridging/switching). This network includes a DHCP server that provides IP addresses to instances.
de: Vor dem Starten einer Instanz muss die benötigte virtuelle Netzwerkinfrastruktur angelegt werden. Bei Verwendung der Netzwerkoption 1 verwendet eine Instanz ein (externes) Anbieternetzwerk, das mit der physikalischen Netzwerkinfrastruktur über Layer-2 (Bridging/Switching) verbunden ist. Dieses Netzwerk beinhaltet einen DHCP-Server zur Bereitstellung von IP-Adressen für Instasnzen.
fr: Avant de lancer une instance, vous devez créer l'infrastructure de réseau virtuel nécessaire. Pour le réseau option 1, une instance utilise un réseau fournisseur (externe) qui se connecte à l'infrastructure réseau physique via la couche-2 (bridging/switching). Ce réseau inclut un serveur DHCP qui fournit les adresses IP aux instances.
id: Sebelum meluncurkan sebuah instance, Anda harus membuat diperlukan infrastruktur jaringan virtual. Untuk opsi 1 jaringan, sebuah contoh menggunakan penyedia jaringan (eksternal) yang terhubung ke jaringan infrastruktur fisik melalui lapisan-2 (bridging / switching). Jaringan ini mencakup server DHCP yang menyediakan alamat IP untuk contoh.
