Repository: 25hours/openstack-manuals
Catalog: doc/install-guide/source/locale/*/LC_MESSAGES/install-guide.po
Languages: de, fr, id

source: Enable the Open Build Service repositories for MongoDB based on your openSUSE or SLES version:
de: Aktivieren Sie die Open-Build-Service-Quellen für MongoDB, abhängig von Ihrer openSUSE- oder SLES-Version.
fr: Activer les dépôts Open Build Service pour MongoDB en fonction de votre version openSUSE ou SLES:
id: Mengaktifkan repositori Open Build Service untuk MongoDB berdasarkan openSUSE Anda atau versi SLES:

source: Enable the OpenStack repository
de: Aktivieren Sie das OpenStack-Repository
fr: Activer le dépôt OpenStack
id: Mengaktifkan repositori OpenStack

source: Enable the backports repository
de: Aktivieren Sie das Backports-Repository
fr: Activer le dépôt rétroportages (backports)
id: Aktifkan repository backports

source: Enables Network-Connectivity-as-a-Service for other OpenStack services, such as OpenStack Compute. Provides an API for users to define networks and the attachments into them. Has a pluggable architecture that supports many popular networking vendors and technologies.
fr: Permet Network-Connectivity-as-a-Service pour d'autres services d'OpenStack, comme OpenStack Compute. Fournit une API pour que les utilisateurs puissent définir les réseaux et les attachements à ces réseaux. Possède une architecture connectable avec la plupart des fournisseurs connus de réseaux et de technologies.
id: Memungkinkan Network-Connectivity-as-a-Service untuk layanan OpenStack lainnya, seperti OpenStack Compute. Menyediakan API bagi pengguna untuk menentukan jaringan dan attachments ke mereka. Memiliki arsitektur pluggable yang mendukung banyak vendor jaringan populer dan teknologi.

source: Ensure proper ownership of the mount point directory structure:
de: Stellen Sie die korrekten Berechtigungen für die Verzeichnisstruktur der Einhängepunkte sicher:
fr: Veiller à ce que le répertoire du point de montage possède les bons droits:
id: Pastikan kepemilikan tepat 'mount point directory structure':

source: Ensure the kernel module ``nbd`` is loaded.
de: Stellen Sie sicher, dass das Kernel-Modul ``nbd`` geladen wurde.
fr: S'assurer que le module noyau ``nbd`` est chargé.
id: Pastikan modul kernel ``nbd`` dimuat.

source: Ensure the module loads on every boot by adding ``nbd`` to the ``/etc/modules-load.d/nbd.conf`` file.
de: Stellen Sie sicher, dass das Modul bei jedem Systemstart geladen wird, indem Sie ``nbd`` zur Datei ``/etc/modules-load.d/nbd.conf`` hinzufügen.
fr: S'assurer que le module se charge à chaque boot en ajoutant ``nbd`` dans le fichier ``/etc/modules-load.d/nbd.conf``.
id: Pastikan beban modul pada setiap boot dengan menambahkan ``nbd`` ke file ``/etc/modules-load.d/nbd.conf``.

source: Environment
de: Umgebung
fr: Environnement

source: Example architecture
fr: Architecture en exemple
id: Arsitektur contoh

source: Exit the database access client.
de: Beenden Sie den Datenbank-Client.
fr: Quitter le client d'accès à la base de données.
id: Keluarlah dari client untuk mengakses database.

source: Explanations of configuration options and sample configuration files are included.
de: Erläuterungen von Konfigurationsoptionen und Beispielkonfigurationen sind inbegriffen.
fr: Sont incluent des explications sur les options de configuration et des fichiers de configuration exemples.
id: Penjelasan dari opsi konfigurasi dan file konfigurasi sampel disertakan.

source: Finalize installation
de: Installation abschließen
fr: Finaliser l'installation
id: Finalisasi instalasi

source: Finalize the installation
de: Schließen Sie die Installation ab
fr: Finaliser l'installation
id: Finalisasi instalasi

source: Find entitlement pools containing the channels for your RHEL system:
de: Finden von Berechtigungspools, die die Kanäle für Ihr RHEL System enthalten:
fr: Trouver les pools d'habilitation contenant les canaux pour votre système RHEL:
id: Cari pool hak (entitlement pool) yang berisi saluran untuk sistem RHEL Anda:

source: First node
de: Erster Knoten
fr: Premier nœud
id: Node pertama

source: Flavor is image specific and may differ from image to image.
de: Varianten sind Abbild-spezifisch und können sich von Abbild zu Abbild unterscheiden.
fr: Le gabarit est spécifique à l'image et peut être différent d'une image à l'autre.
id: Flavor adalah image tertentu dan mungkin berbeda dari image ke image.

source: For OpenStack services, this guide uses ``SERVICE_PASS`` to reference service account passwords and ``SERVICE_DBPASS`` to reference database passwords.
de: Für die OpenStack-Dienste verwendet dieser Leitfaden ``SERVICE_PASS`` für die Accountpasswörter der Dienste und ``SERVICE_DBPASS`` für die Datenbankpasswörter.
fr: Pour les services OpenStack, ce guide utilise ``SERVICE_PASS`` pour désigner les mots de passe des comptes de service et ``SERVICE_DBPASS`` pour désigner les mots de passe des bases de données.
id: Untuk layanan OpenStack, panduan ini menggunakan ``SERVICE_PASS`` layanan referensi password account dan ``SERVICE_ DBPASS`` untuk referensi password database.

source: For best performance, we recommend that your environment meets or exceeds the hardware requirements in :ref:`figure-hwreqs`.
de: Für eine optimale Performance wird empfohlen, mindestens die Hardwareanforderungen in :ref:`figure-hwreqs`zu erfüllen.
fr: Pour les meilleures performances, il est recommandé que votre environnement respecte ou dépasse les exigences matérielles de :ref:`figure-hwreqs`.
id: Untuk performa terbaik, kami merekomendasikan bahwa lingkungan Anda memenuhi atau melebihi persyaratan hardware di :ref:`figure-hwreqs`.

source: For both networking options:
de: Für beide Netzwerkoptionen:
fr: Pour les deux options de mise en réseau:
id: Untuk kedua opsi jaringan:

source: For deployments using option 1:
de: Für Bereitstellungen, die Option 1 verwenden:
fr: Pour les déploiements utilisant l'option 1:
id: Untuk pengerahan menggunakan opsi 1:

source: For deployments using option 2:
de: Für Bereitstellungen, die Option 2 verwenden:
fr: Pour les déploiements utilisant l'option 2:
id: Untuk pengerahan menggunakan opsi 2:

source: For details about browsers that support noVNC, see `README <https://github.com/kanaka/noVNC/blob/master/README.md>`__ and `browser support <https://github.com/kanaka/noVNC/wiki/Browser-support>`__.
de: Details zu Browsern, die noVNC unterstützen, lesen Sie `README <https://github.com/kanaka/noVNC/blob/master/README.md>`__ und `browser support <https://github.com/kanaka/noVNC/wiki/Browser-support>`__.
fr: Pour connaitre les navigateurs qui supportent noVNC, voir `README <https://github.com/kanaka/noVNC/blob/master/README.md>`__ et `browser support <https://github.com/kanaka/noVNC/wiki/Browser-support>`__.
id: Untuk detail tentang browser yang mendukung noVNC, melihat `README <https://github.com/kanaka/noVNC/blob/master/README.md>` __ dan `dukungan browser <https://github.com/kanaka/noVNC / wiki / Browser-support> `__.

source: For first-time installation and testing purposes, many users elect to build each host as a :term:`virtual machine (VM)`. The primary benefits of VMs include the following:
de: Für Testzwecke oder zur Erstinstallation entscheiden Sich viele Nutzer dafür, die Hosts zunächst als :term:`virtual machine (VM)` zu installieren. Die wichtigsten Vorteile von VMs sind:
fr: Pour une première installation et pour des besoins de test, beaucoup d'utilisateurs choisissent de monter chaque nœud sur une :term:`machine virtuelle (VM)`. Les principaux avantages des VMs incluent:
id: Untuk tujuan instalasi pertama kali dan pengujiannya, banyak user memilih untuk membangun masing-masing host sebagai :term:`virtual machine (VM)`. Manfaat utama dari VM meliputi berikut ini:

source: For information about disk and container formats for images, see `Disk and container formats for images <http://docs.openstack.org/image-guide/image-formats.html>`__ in the ``OpenStack Virtual Machine Image Guide``.
de: Für Informationen zu Festplatten- und Containerformaten von Abbildern lesen Sie `Disk and container formats for images <http://docs.openstack.org/image-guide/image-formats.html>`__ im ``OpenStack Virtual Machine Image Guide``.
fr: Pour plus d'informations sur les formats de disque et de conteneur pour les images, voir `Formats de disques et de conteneur pour les images <http://docs.openstack.org/image-guide/image-formats.html>`__ dans le document ``Guides des Images de VM OpenStack``.
id: Untuk informasi tentang disk dan kontainer format untuk gambar, lihat `Disk dan wadah format untuk gambar <http://docs.openstack.org/image-guide/image-formats.html>` __ dalam `` Panduan Gambar OpenStack Virtual Machine ``.

source: For information about the :command:`openstack image create` parameters, see `Image service command-line client <http://docs.openstack.org/cli-reference/openstack.html#openstack-image-create>`__ in the ``OpenStack Command-Line Interface Reference``.
de: Für Informationen zu den Befehlsparametern :command:`openstack image create` lesen Sie `Image service command-line client <http://docs.openstack.org/cli-reference/openstack.html#openstack-image-create>`__ in der ``OpenStack Command-Line Interface Reference``.
fr: Pour plus d'informations sur les paramètres de :command:`openstack image create`, voir `Client en ligne de commande du Service Image <http://docs.openstack.org/cli-reference/openstack.html#openstack-image-create>`__ dans le document ``Référence de l'Interface en Ligne de Commande OpenStack``.
id: Untuk informasi tentang parameter :command:`openstack image create`, lihat `Image service command-line client <http://docs.openstack.org/cli-reference/openstack.html#openstack-image-create>`__ dalam ``OpenStack Command-Line interface Reference``.

source: For information on requirements for other back ends, see `Configuration Reference <http://docs.openstack.org/mitaka/config-reference/image-service.html>`__.
de: Für Informationen zu den Anforderungen anderer Backends wird auf die `Configuration Reference <http://docs.openstack.org/mitaka/config-reference/image-service.html>`__ verwiesen.
fr: Pour des informations sur les pré-requis des autres backends, voir `Référence de Configuration <http://docs.openstack.org/mitaka/config-reference/image-service.html>`__.
id: Untuk informasi mengenai persyaratan untuk 'back end' lainnya, lihat `Configuration Reference <http://docs.openstack.org/mitaka/config-reference/image-service.html>`__.

source: For more information about how to download and build images, see `OpenStack Virtual Machine Image Guide <http://docs.openstack.org/image-guide/>`__. For information about how to manage images, see the `OpenStack End User Guide <http://docs.openstack.org/user-guide/common/cli-manage-images.html>`__.
de: Für weitere Informationen zum Herunterladen und Erstellen von Abbildern wird auf den `OpenStack Virtual Machine Image Guide <http://docs.openstack.org/image-guide/>`__ verwiesen. Für Informationen zum Verwalten von Abbildern wird auf den `OpenStack End User Guide <http://docs.openstack.org/user-guide/common/cli_manage_images.html>`__ verwiesen.
fr: Pour plus d'informations sur comment télécharger et créer des images, voir le `Guide des Images de Machines Virtuelles OpenStack <http://docs.openstack.org/image-guide/>`__. Pour plus d'information sur la gestion des images, voir le `Guide de l'Utilisateur Final OpenStack <http://docs.openstack.org/user-guide/common/cli-manage-images.html>`__.

source: For more information about how to manage shares, see the `Manage shares <http://docs.openstack.org/user-guide/cli-manage-shares.html>`__ in OpenStack End User Guide.
de: Für weitere Informationen zum managen von Freigaben lesen Sie `Manage shares <http://docs.openstack.org/user-guide/cli-manage-shares.html>`__ im OpenStack End User Guide.
fr: Pour plus d'informations sur la gestion des partages, voir `Gérer les partages <http://docs.openstack.org/user-guide/cli-manage-shares.html>`__ dans le Guide de l'Utilisateur Final OpenStack.

source: For more information about how to manage volumes, see the `Manage volumes <http://docs.openstack.org/user-guide/common/cli-manage-volumes.html>`__ in OpenStack End User Guide.
de: Für weitere Informationen zur Verwaltung von Datenträgern lesen Sie den Abschnitt `Datenträger verwalten <http://docs.openstack.org/user-guide/common/cli_manage_volumes.html>`__ im OpenStack End User Guide.
fr: Pour plus d'informations sur la gestion des volumes, voir `Gérer les volumes <http://docs.openstack.org/user-guide/common/cli-manage-volumes.html>`__ dans le Guide de l'Utilisateur Final OpenStack.

source: For more information about system requirements, see the `OpenStack Operations Guide <http://docs.openstack.org/ops/>`_.
de: Für weitere Informationen zu Systemanforderungen schauen Sie in die `OpenStack Bedienungsanleitung <http://docs.openstack.org/ops/>`_.
fr: Pour plus d'informations sur les pré-requis système, voir le `Guide des Operations OpenStack <http://docs.openstack.org/ops/>`_.
id: Untuk informasi lebih lanjut tentang persyaratan sistem, lihat `OpenStack Operations Guide <http://docs.openstack.org/ops/>`_.

source: For more information about the Networking service including virtual networking components, layout, and traffic flows, see the `Networking Guide <http://docs.openstack.org/mitaka/networking-guide/>`__.
fr: Pour plus d'informations sur le service de Mise en Réseau incluant les composants de réseau virtuel, la configuration, et les flux de trafic, voir le `Guide Networking <http://docs.openstack.org/mitaka/networking-guide/>`__.
id: Untuk informasi lebih lanjut tentang layanan Networking termasuk komponen virtual jaringan, tata letak, dan arus lalu lintas, lihat `Networking Guide <http://docs.openstack.org/mitaka/networking-guide/>`__.

source: For more information on other modules that enable additional features, see the `Deployment Guide <http://docs.openstack.org/developer/swift/deployment_guide.html>`__.
fr: Pour plus d'informations sur les autres modules activant des fonctionnalités additionnelles, voir le `Guide de Déploiement <http://docs.openstack.org/developer/swift/deployment_guide.html>`__.
id: Untuk informasi lebih lanjut tentang modul lain yang memungkinkan fitur tambahan, lihat `Deployment Guide <http://docs.openstack.org/developer/swift/deployment_guide.html>`__.

source: For more information on production architectures, see the `Architecture Design Guide <http://docs.openstack.org/arch-design/>`__, `Operations Guide <http://docs.openstack.org/ops/>`__, and `Networking Guide <http://docs.openstack.org/mitaka/networking-guide/>`__.
fr: Pour plus d'information sur des architectures de production, voir les documents `Guide de Design d'Architecture <http://docs.openstack.org/arch-design/>`__, `Guide des Opérations <http://docs.openstack.org/ops/>`__, et `Guide du Réseau <http://docs.openstack.org/mitaka/networking-guide/>`__.
id: Untuk informasi lebih lanjut tentang arsitektur produksi, lihat `Architecture Design Guide <http://docs.openstack.org/arch-design/>`__, `Operations Guide <http://docs.openstack.org/ops/>`__, dan `Networking Guide <http://docs.openstack.org/mitaka/networking-guide/>`__.

source: For more information, see the `Configuration Reference <http://docs.openstack.org/mitaka/config-reference/block-storage/volume-drivers.html>`__.
de: Für nähere Informationen lesen Sie die `Configuration Reference <http://docs.openstack.org/mitaka/config-reference/block-storage/volume-drivers.html>`__.
fr: Pour plus d'informations, voir le `Référentiel de Configuration <http://docs.openstack.org/mitaka/config-reference/block-storage/volume-drivers.html>`__.
id: Untuk informasi lebih lanjut, lihat `Configuration Reference <http://docs.openstack.org/mitaka/config-reference/block-storage/volume-drivers.html>`__.

source: For more information, see the `Configuration Reference <http://docs.openstack.org/mitaka/config-reference/shared-file-systems/drivers.html>`__.
de: Für nähere Informationen lesen Sie die `Configuration Reference <http://docs.openstack.org/mitaka/config-reference/shared-file-systems/drivers.html>`__.
fr: Pour plus d'informations, voir le `Référentiel de Configuration <http://docs.openstack.org/mitaka/config-reference/shared-file-systems/drivers.html>`__.
id: Untuk informasi lebih lanjut, lihat `Configuration Reference <http://docs.openstack.org/mitaka/config-reference/shared-file-systems/drivers.html>`__.

source: For networking option 2, also enable and start the layer-3 service:
de: Für die Netzwerk Option 2 aktivieren und starten Sie auch den Layer-3 Dienst.
fr: Pour le Réseau option 2, activer également et démarrer le service layer-3.
id: Untuk opsi 2 jaringan, juga memungkinkan dan memulai layanan lapisan-3:

source: For networking option 2, also install the ``neutron-l3-agent`` package.
fr: Pour le Réseau option 2, installer aussi le package ``neutron-l3-agent``.
id: Untuk opsi 2 jaringan, juga menginstal paket ``neutron-l3-agent``.

source: For networking option 2, also restart the layer-3 service:
de: Für die Netzwerk Option 2 starten Sie auch den Layer-3 Dienst neu:
fr: Pour le Réseau option 2, redémarrer également le service layer-3.
id: Untuk opsi 2 jaringan, juga restart layanan lapisan-3:

source: For security reasons, disable the temporary authentication token mechanism:
de: Aus Sicherheitsgründen sollten Sie den Mechanismus für provisorische Authentifizierungstoken deaktivieren:
fr: Pour des raisons de sécurité, désactiver le mécanisme de jeton d'authentification temporaire:
id: Untuk alasan keamanan, nonaktifkan mekanisme token otentikasi sementara:

source: For security reasons, do not use the temporary authentication token for longer than necessary to initialize the Identity service.
de: Aus Sicherheitsgründen sollten Sie den provisorischen Authentifizierungstoken zur Initialisierung des Identitätsdienstes nicht länger als unbedingt nötig verwenden.
fr: Pour des raisons de sécurité, ne pas utiliser le jeton d'authentification temporaire après avoir initialisé le service d'Identité.
id: Untuk alasan keamanan, jangan menggunakan token otentikasi sementara untuk lebih lama dari yang diperlukan untuk menginisialisasi layanan Identity.

source: For simplicity, service traffic between compute nodes and this node uses the management network. Production environments should implement a separate storage network to increase performance and security.
fr: Pour simplifier, le trafic du service entre les nœuds compute et ce nœud utilise le réseau de management. Les environnements de production devraient implémenter un réseau de stockage séparé pour accroitre la performance et la sécurité.
id: Untuk mempermudah, trafik layanan antara node komputasi dan node ini menggunakan jaringan manajemen. Lingkungan produksi harus menerapkan jaringan penyimpanan terpisah untuk meningkatkan kinerja dan keamanan.

source: For simplicity, this configuration references the same storage node configuration for the Block Storage service.
fr: Pour simplifier, cette configuration référence le même nœud de stockage pour le service de Stockage par Bloc.
id: Untuk mempermudah, konfigurasi ini me-referensi konfigurasi storage node yang sama untuk layanan Block Storage.

source: For simplicity, this configuration references the same storage node configuration for the Block Storage service. However, the LVM driver requires a separate empty local block storage device to avoid conflict with the Block Storage service. The instructions use ``/dev/sdc``, but you can substitute a different value for your particular node.
fr: Pour simplifier, cette configuration référence le même nœud de stockage pour le service de Stockage par Bloc. Néanmoins, le driver LVM nécessite un device de stockage bloc local vide séparé pour éviter tout conflit avec le service de Stockage par Bloc. Les instructions utilisent ``/dev/sdc``, mais vous pouvez le substituer par une valeur adaptée à votre nœud particulier.
id: Untuk mempermudah, konfigurasi ini me-referensi konfigurasi storage node yang sama untuk layanan Block Storage. Namun, driver LVM membutuhkan perangkat penyimpanan blok lokal kosong terpisah untuk menghindari konflik dengan layanan Block Storage. Petunjuk menggunakan ``/dev/sdc``, tetapi Anda dapat mengganti nilai yang berbeda untuk node tertentu.

source: For simplicity, this guide describes configuring the Image service to use the ``file`` back end, which uploads and stores in a directory on the controller node hosting the Image service. By default, this directory is ``/var/lib/glance/images/``.
de: Zur Vereinfachung konfiguriert dieser Leitfaden den Abbilddienst zur Nutzung des ``file``-Backends, dabei wird das Abbild lokal in einem Verzeichnis auf dem Controller-Knoten gespeichert, wo der Abbilddienst läuft. Standardmäßig lautet das Verzeichnis ``/var/lib/glance/images/``.
fr: Pour simplifier, ce guide décrit la configuration d'un service d'image utilisant le backend ``file``, qui charge et stocke les images dans un répertoire sur le nœud contrôleur hébergeant le service d'Image. Par défaut, ce répertoire est ``/var/lib/glance/images/``.
id: Untuk mempermudah, panduan ini menjelaskan konfigurasi layanan Image untuk menggunakan back end ``file``, yang upload dan menyimpan di direktori pada controller node hosting layanan image. Secara default, direktori ini adalah ``/var/lib/glance/images/``.

source: For the outside network to access VMs, and vice versa, routers between the networks are needed. Each router has one gateway that is connected to an external network and one or more interfaces connected to internal networks. Like a physical router, subnets can access machines on other subnets that are connected to the same router, and machines can access the outside network through the gateway for the router.
de: Damit man vom fremden Netzwerk auf die VMs zugreifen kann, und umgekehrt, werden Router zwischen den Netzwerken benötigt. Jeder Router hat ein Gateway, das mit einem Netzwerk verbunden ist und ein oder mehrere Interfaces, die mit den internen Netzwerken verbunden sind. Wie bei einem physikalischen Router, können Subnetze Maschinen in anderen Subnetzen erreichen, die mit demselben Router verbunden sind und Maschinen können das äußere Netzwerk durch das Gateway des Routers erreichen.
fr: Pour que le réseau extérieur accède aux VMs, et vice versa, il est nécessaire d'avoir des routeurs entre les réseaux. Chaque routeur possède une passerelle connectée à un réseau externe et à une ou plusieurs interfaces connectées aux réseaux internes. Comme avec un routeur physique, les sous-réseau peuvent accéder aux machines sur d'autres sous-réseaux connectés au même routeur, et les machines peuvent accéder au réseau extérieur via la passerelle du routeur.
id: Untuk jaringan luar mengakses VM, dan sebaliknya, router antara jaringan diperlukan. Setiap router memiliki satu gateway yang terhubung ke jaringan eksternal dan satu atau lebih interface yang terhubung ke jaringan internal. Seperti router fisik, subnet dapat mengakses mesin pada subnet lain yang terhubung ke router yang sama, dan mesin dapat mengakses jaringan luar melalui gateway untuk router.

source: Format the ``/dev/sdb`` and ``/dev/sdc`` devices as XFS:
fr: Formater les devices ``/dev/sdb`` et ``/dev/sdc`` en XFS:
id: Format perangkat ``/dev/sdb`` dan ``/dev/sdc`` sebagai XFS:

source: From the *compute* node, test access to the Internet:
de: Testen Sie die Internetverbindung vom Knoten *compute*:
fr: Tester l'accès Internet depuis le nœud *compute*:
id: Dari *compute* node, tes akses ke Internet:
