Repository: 25hours/openstack-manuals
Catalog: doc/install-guide/source/locale/*/LC_MESSAGES/install-guide.po
Languages: de, fr, id

source: From the *compute* node, test access to the management interface on the *controller* node:
de: Testen Sie die Verbindung vom Knoten *compute* zur Management-Schnittstelle des Knotens *controller*:
fr: Tester l'accès à l'interface de management du nœud *controller* depuis le nœud *compute*:
id: Dari *compute* node, tes akses untuk management interface pada *controller* node:

source: From the *controller* node, test access to the Internet:
de: Testen Sie die Internetverbindung vom Knoten *controller*:
fr: Tester l'accès à Internet depuis le nœud *controller*:
id: Dari *controller* node, tes akses ke Internet:

source: From the *controller* node, test access to the management interface on the *compute* node:
de: Testen Sie die Verbindung vom Knoten *controller* zur Management-Schnittstelle des Knotens *compute*:
fr: Tester l'accès à l'interface de management du nœud *compute* depuis le noeud *controller*:
id: Dari *controller* node, tes akses untuk management interface pada *compute* node:

source: Generate a key pair
de: Schlüsselpaar generieren
fr: Générer une paire de clés
id: Menghasilkan key pair

source: Generate a random value to use as the administration token during initial configuration:
de: Lassen Sie einen Zufallswert zur Nutzung als Administrations-Token für die Erst-Konfiguration erzeugen:
fr: Générer une valeur aléatoire à utiliser comme jeton d'administration pendant la configuration initiale :
id: Hasilkan nilai acak untuk digunakan sebagai token administrasi dalam konfigurasi awal:

source: Generate and add a key pair:
de: Generieren Sie ein Schlüsselpaar und fügen es hinzu:
fr: Générer et ajouter une paire de clés:
id: Menghasilkan dan menambahkan key pair:

source: Glossary
de: Glossar
fr: Glossaire

source: Grant proper access to the ``aodh`` database:
de: Vergeben Sie die richtigen Zugriffsberechtigungen für die Datenbank ``aodh``:
fr: Octroyer les droits d'accès appropriés à la base de données ``aodh``:
id: Berikan akses yang tepat ke ``aodh`` database:

source: Grant proper access to the ``cinder`` database:
de: Vergeben Sie die richtigen Zugriffsberechtigungen für die Datenbank ``cinder``:
fr: Accorder les bons droits d'accès à la base de données ``cinder``:
id: Memberikan akses yang tepat untuk database ``cinder``:

source: Grant proper access to the ``glance`` database:
de: Vergeben Sie die richtigen Zugriffsberechtigungen für die Datenbank ``glance``:
fr: Octroyer les bons droits à la base de données ``glance``:
id: Memberikan akses yang tepat untuk database ``glance``:

source: Grant proper access to the ``heat`` database:
de: Vergeben Sie die richtigen Zugriffsberechtigungen für die Datenbank ``heat``:
fr: Octroyer les bons droits à la base de données ``heat``:
id: Berikan akses yang tepat untuk database ``heat``:

source: Grant proper access to the ``keystone`` database:
de: Vergeben Sie die richtigen Zugriffsberechtigungen für die Datenbank ``keystone``:
fr: Attribuer les bons droits d'accès à la base de données ``keystone``:
id: Memberikan akses yang tepat untuk database ``keystone``:

source: Grant proper access to the ``manila`` database:
de: Vergeben Sie die richtigen Zugriffsberechtigungen für die ``manila`` Datenbank:
fr: Octroyer les bons droits à la base de données ``manila`:
id: Memberikan akses yang tepat untuk database ``manila``:

source: Grant proper access to the ``neutron`` database, replacing ``NEUTRON_DBPASS`` with a suitable password:
de: Vergeben Sie die richtigen Zugriffsberechtigungen für die Datenbank ``neutron`` indem Sie ``NEUTRON_DBPASS`` durch ein geeignetes Passwort ersetzen:
fr: Attribuer les bons droits d'accès à la base de données ``neutron``, en remplaçant ``NEUTRON_DBPASS`` par un mot de passe approprié:
id: Memberikan akses yang tepat untuk database ``neutron``, menggantikan ``NEUTRON_DBPASS`` dengan password yang sesuai:

source: Grant proper access to the ``trove`` database:
fr: Octroyer les bons droits à la base de données ``trove`:
id: Berikan akses yang tepat untuk database ``trove``:

source: Grant proper access to the databases:
de: Vergeben Sie die richtigen Zugriffsberechtigungen für die Datenbanken:
fr: Octroyer les bons droits aux bases de données:
id: Memberikan akses yang tepat untuk database:

source: Host networking
de: Host-Netzwerke
fr: Réseau sur le(s) host(s)

source: However, VMs will reduce performance of your instances, particularly if your hypervisor and/or processor lacks support for hardware acceleration of nested VMs.
de: Allerdings werden VMs die Performance Ihrer Instanzen verringern, insbesondere wenn Ihr Hypervisor und/oder Prozessor keine Hardwarebeschleunigung von verschachtelten VMs unterstützen.
fr: Cependant, les VMs vont réduire la performance de vos instances, en particulier, si votre hyperviseur et/ou processeur ne supporte pas l'accélération hardware et les "nested VMs" (VMs imbriquées).
id: Namun, VMS akan mengurangi kinerja instances Anda, terutama jika hypervisor Anda dan / atau prosesor kekurangan dukungan untuk akselerasi perangkat keras 'nested VM'.

source: IP address: 10.0.0.11
de: IP Adresse: 10.0.0.11
fr: Adresse IP: 10.0.0.11

source: IP address: 10.0.0.31
de: IP Adresse: 10.0.0.31
fr: Adresse IP: 10.0.0.31

source: IP address: ``10.0.0.41``
de: IP-Adresse: ``10.0.0.41``
fr: Adresse IP: ``10.0.0.41``

source: IP address: ``10.0.0.51``
de: IP-Adresse:``10.0.0.51``
fr: Adresse IP: ``10.0.0.51``

source: IP address: ``10.0.0.52``
de: IP-Adresse:``10.0.0.52``
fr: Adresse IP : ``10.0.0.52``

source: Identity service
de: Identitätsdienst
fr: Service d'identité
id: Layanan Identity

source: If necessary, replace ``10.0.0.0/24`` with a description of your subnet.
de: Ersetzen Sie ``10.0.0.0/24`` durch ein anderes Subnetz, wenn erforderlich.
fr: Si nécessaire, remplacer ``10.0.0.0/24`` par une description de votre sous-réseau.
id: Jika perlu, ganti `` 10.0.0.0 / 24`` dengan deskripsi subnet Anda.

source: If one or more of these steps do not work, check the ``/var/log/audit/audit.log`` file for SELinux messages indicating denial of actions for the ``swift`` processes. If present, change the security context of the ``/srv/node`` directory to the lowest security level (s0) for the ``swift_data_t`` type, ``object_r`` role and the ``system_u`` user:
fr: Si une ou plusieurs de ces étapes ne fonctionne pas, vérifier si le fichier ``/var/log/audit/audit.log`` contient des messages SELinux indiquant cating un rejet des actions pour les processus ``swift``. S'il y en a, modifier le contexte de sécurité du répertoire ``/srv/node`` au plus bas niveau de sécurité (s0) pour le type ``swift_data_t``, le rôle ``object_r`` et l'utilisateur ``system_u``:
id: Jika salah satu atau lebih dari langkah-langkah ini tidak bekerja, periksa file ``/var/log/audit/audit.log`` untuk pesan SELinux yang menunjukkan penolakan tindakan untuk proses ``swift``. Jika ada, ubah konteks keamanan direktori ``/srv/node`` ke tingkat keamanan terendah (s0) untuk tipe ``swift_data_t``, peran ``object_r`` dan user ``system_u``:

source: If the command fails saying you are not authorized to insert a user, you may need to temporarily comment out the ``auth`` option in the ``/etc/mongodb.conf`` file, restart the MongoDB service using ``systemctl restart mongodb``, and try calling the command again.
de: Wenn die Ausführung des Befehls fehlschlägt mit der Meldung, Sie seien nicht authorisiert einen Benutzer hinzuzufügen, kann es erforderlich sein, die Option ``auth`` in der Datei ``/etc/mongodb.conf`` auszukommentieren, den MongoDB-Dienst mit ``systemctl restart mongodb`` neu zu starten und den Befehl erneut auszuführen.
fr: Si la commande échoue en indiquant que vous n'êtes pas autorisé à insérer un utilisateur, vous pouvez être amené à commenter temporairement l'option ``auth`` dans le fichier ``/etc/mongodb.conf``, redémarrer le service MongoDB par la commande ``systemctl restart mongodb``et réessayer d'exécuter la commande.
id: Jika command gagal mengatakan Anda tidak diizinkan untuk memasukkan user, Anda mungkin perlu komentar sementara keluar opsi ``auth`` di file ``/etc/mongodb.conf``, restart layanan MongoDB menggunakan ``systemctl restart mongodb``, dan coba memanggil command lagi.

source: If the file is not present, you can get it from this `location <http://git.openstack.org/cgit/openstack/trove/plain/etc/trove/api-paste.ini?h=stable/mitaka>`__.
fr: Si le fichier n'est pas présent, vous pouvez le récupérer à cet `emplacement <http://git.openstack.org/cgit/openstack/trove/plain/etc/trove/api-paste.ini?h=stable/mitaka>`__.
id: Jika file tidak hadir, Anda bisa mendapatkannya dari sini `location <http://git.openstack.org/cgit/openstack/trove/plain/etc/trove/api-paste.ini?h=stable/mitaka> `__.

source: If the upgrade process includes a new kernel, reboot your host to activate it.
de: Wenn das Upgrade einen neuen Kernel enthält, starten Sie den Host neu, um den Kernel zu aktivieren.
fr: Si le processus d'upgrade inclut un nouveau noyau, redémarrer votre hôte pour l'activer.
id: Jika proses upgrade termasuk kernel baru, reboot host Anda untuk mengaktifkannya.

source: If the web browser to access remote consoles resides on a host that cannot resolve the ``controller`` hostname, you must replace ``controller`` with the management interface IP address of the controller node.
de: Sofern der Webbrowser für den Zugriff auf die Remote-Konsole auf einem Host läuft, der den ``controller`` Hostnamen nicht auflösen kann, müssen Sie ``Controller`` mit der IP-Adresse des Managementinterfaces auf dem Controller-Knoten ersetzen.
fr: Si le navigateur web pour accéder aux consoles distantes tourne sur un hôte qui ne peut pas résoudre le nom de host du ``controller``, vous devez remplacer ``controller`` par l'adresse IP de l'interface de management de votre nœud contrôleur.
id: Jika web browser untuk mengakses konsol jarak jauh berada pada host yang tidak dapat menyelesaikan `` hostname controller``, Anda harus mengganti ``controller`` dengan alamat IP interface manajemen dari controller node.

source: If this command returns a value of ``one or greater``, your compute node supports hardware acceleration which typically requires no additional configuration.
de: Wenn dieser Befehl als Ergebnis ``eins oder mehr`` aufweist, unterstützt Ihr Compute-Node Harwarebeschleunigung, in diesem Fall ist keine weitere Konfiguration notwendig.
fr: Si la commande retourne une valeur de ``un ou plus``, votre nœud compute supporte l'accélération matérielle ce qui ne nécessite en général aucune configuration complémentaire.
id: Jika command ini mengembalikan nilai ``one or greater``, compute node Anda mendukung akselerasi hardware yang biasanya tidak memerlukan konfigurasi tambahan.

source: If this command returns a value of ``zero``, your compute node does not support hardware acceleration and you must configure ``libvirt`` to use QEMU instead of KVM.
de: Wenn dieser Befehl als Ergebnis ``null`` aufweist, unterstützt Ihr Compute-Node Harwarebeschleunigung nicht, in diesem Fall müssen Sie ``libvirt`` so konfigurieren, dass QEMU statt KVM verwendet wird.
fr: Si la commande retourne la valeur ``zero``, votre nœud compute ne supporte pas l'accélération matérielle et vous devez configurer ``libvirt`` pour utiliser QEMU à la place de KVM.
id: Jika command ini mengembalikan nilai `` zero``, compute node Anda tidak mendukung akselerasi hardware dan Anda harus mengkonfigurasi `` libvirt`` menggunakan QEMU bukan KVM.

source: If you change the journaling configuration, stop the MongoDB service, remove the initial journal files, and start the service:
de: Wenn Sie die Journalkonfiguration ändern, müssen Sie den MongoDB-Dienst stoppen, die ursprünglichen Journaldateien löschen und den Dienst starten:
fr: Si vous modifiez la configuration de la journalisation, arrêtez le service MongoDB, supprimez les fichiers journaux initiaux, et redémarrez le service:
id: Jika Anda mengubah konfigurasi journal, menghentikan layanan MongoDB, menghapus file jurnal awal, dan memulai layanan:

source: If you choose to install on VMs, make sure your hypervisor provides a way to disable MAC address filtering on the provider network interface.
de: Wenn Sie sich für die Installation auf VMs entscheiden, stellen Sie sicher dass Ihr Hypervisor eine Möglichkeit bietet, das Filtern von MAC-Adressen auf der Anbieternetzwerk-Schnittstelle zu deaktivieren.
fr: Si vous choisissez l'installation sur VMs, assurez-vous que votre hyperviseur permette de désactiver le filtrage de MAC adresses sur l'interface réseau fournisseur.
id: Jika Anda memilih untuk menginstal pada VM, pastikan hypervisor Anda menyediakan cara untuk menonaktifkan 'MAC address filtering' pada antarmuka jaringan operator.

source: If you chose networking option 1, disable support for layer-3 networking services:
de: Wenn Sie die Netzwerkoption 1 wählen, deaktivieren Sie die Unterstützung von Layer-3-Netzwerkdiensten:
fr: Si vous avez choisi l'option 1 pour le réseau, désactiver le support des services réseau de niveau 3:
id: Jika Anda memilih opsi 1 jaringan, nonaktifkan dukungan untuk layanan layer-3 networking:

source: If you chose networking option 1, you can only launch an instance on the provider network. If you chose networking option 2, you can launch an instance on the provider network and the self-service network.
de: Wenn Sie Netzwerk Option 1 wählen, können Sie nur Instanzen im Anbieternetzwerk starten. Wenn Sie Option 2 wählen, können Sie Instanzen im Anbieternetzwerk und im Self-service Netzwerk starten.
fr: Si vous avez choisi l'option 1 pour le réseau, vous pouvez lancer une instance seulement sur le réseau fournisseur. Si vous avez choisi l'option 2 pour le réseau, vous pouvez lancer une instance sur le réseau fournisseur ou sur le réseau self-service.
id: Jika Anda memilih opsi 1 jaringan, Anda hanya dapat memulai sebuah instance dari jaringan provider. Jika Anda memilih opsi 2 jaringan, Anda dapat memulai sebuah instance dari jaringan provider dan jaringan self-service.

source: If you chose networking option 2, you can also create a self-service (private) network that connects to the physical network infrastructure via NAT. This network includes a DHCP server that provides IP addresses to instances. An instance on this network can automatically access external networks such as the Internet. However, access to an instance on this network from external networks such as the Internet requires a :term:`floating IP address`.
de: Wenn Sie Netzwerk Option 2 wählen, können Sie auch ein privates self-service Netzwerk erstellen, dass eine Verbindung zur physikalischen Netzwerkinfrastruktur via NAT herstellt. Dieses Netzwerk enthält einen DHCP Server, der IP-Adressen an Instanzen verteilt. Eine Instanz in diesem Netzwerk kann automatisch auf externe Netzwerke, wie das Internet, zugreifen. Aber Zugriff auf eine Instanz in diesem Netzwerk, z.B. aus dem Internet, erfordert eine :term: 'Floating IP-Adresse'.
fr: Si vous choisissez le réseau option 2, vous pouvez aussi créer un réseau self-service (privé) qui se connecte à l'infrastructure réseau physique via NAT. Ce réseau inclut un serveur DHCP qui fournit des adresses IP aux instances. Une instance sur ce réseau peut accèder automatiquement aux réseaux externes comme internet. Néanmoins, l'accès à une instance de ce réseau à partir d'un réseau externe comme internet nécessite une :term:`adresse IP flottante`.
id: Jika Anda memilih opsi 2 jaringan, Anda juga dapat membuat self-service (private) jaringan yang terhubung ke jaringan infrastruktur fisik melalui NAT. Jaringan ini mencakup server DHCP yang menyediakan alamat IP untuk instances. Sebuah instances pada jaringan ini dapat secara otomatis mengakses jaringan eksternal seperti Internet. Namun, akses ke sebuah instances pada jaringan ini dari jaringan eksternal seperti Internet membutuhkan :term:`floating IP address`.

source: If you chose option 1 and your environment contains only one network, you can omit the ``--nic`` option because OpenStack automatically chooses the only network available.
de: Wenn Sie Option 1 wählen und Ihre Umgebung nur ein Netzwerk enthält, können Sie die ``--nic`` Option auslassen, da OpenStack automatisch das einzig vorhandene Netzwerk auswählt.
fr: Si vous avez choisi l'option 1 et que votre environnement contient un seul réseau, vous pouvez omettre l'option ``--nic`` parce qu'OpenStack choisit automatiquement le seul réseau disponible.
id: Jika Anda memilih opsi 1 dan lingkungan Anda hanya berisi satu jaringan, Anda dapat menghilangkan opsi ``--nic`` karena OpenStack otomatis memilih satu-satunya jaringan yang tersedia.

source: If you chose option 2, the output should also contain the ``selfservice`` self-service network.
de: Wenn Sie Option 2 wählen sollte die Ausgabe auch das ``selfservice`` self-service Netzwerk beinhalten.
fr: Si vous avez choisi l'option 2, la sortie écran doit aussi contenir le réseau self-service ``selfservice``.
id: Jika Anda memilih opsi 2, output juga harus berisi jaringan self-service ``selfservice``.

source: If you decide to not use ``dbconfig-common``, then you have to create the database and manage its access rights yourself, and run the following by hand.
de: Wenn Sie sich entscheiden, ``dbconfig-common`` nicht zu verwenden, müssen Sie die Datenbank selbst anlegen und die Zugriffsberechtigungen selbst verwalten und folgende Schritte manuell ausführen.
fr: Si vous décidez de ne pas utiliser ``dbconfig-common``, alors vous devez créer la base de données et gérer les droits d'accès vous-même, et exécuter manuellement ce qui suit.
id: Jika Anda memutuskan untuk tidak menggunakan `` dbconfig-common``, kemudian Anda harus membuat database dan mengelola hak akses nya sendiri, dan menjalankan berikut dengan tangan.

source: If you want to deploy the Block Storage service, configure one additional storage node.
de: Wenn Sie den Blockspeicherdienst installieren wollen, konfigurieren Sie einen zusätzlichen Speicherknoten.
fr: Si vous souhaitez déployer le service de Stockage par Blocs, configurez un nœud de stockage additionnel.
id: Jika Anda ingin mengerahkan layanan Block Storage, konfigurasi satu storage node tambahan.

source: If you want to deploy the Object Storage service, configure two additional storage nodes.
de: Wenn Sie den Objektspeicherdienst installieren wollen, konfigurieren Sie zwei zusätzliche Speicherknoten.
fr: Si vous souhaitez déployer le service de Stockage Objet, configurez deux nœuds de stockage additionnels.
id: Jika Anda ingin mengerahkan layanan Object Storage, konfigurasi dua storage nodes tambahan.

source: If you want to do backup and restore, you also need Object Storage.
fr: Si vous souhaitez effectuer des sauvegardes et des restauration, vous avez également besoin du Stockage Objet.
id: Jika Anda ingin melakukan backup dan restore, Anda juga perlu Object Storage.

source: If you want to provision datastores on block-storage volumes, you also need Block Storage.
fr: Si vous souhaitez provisionner des datastores sur du stockage blocs, vous devez aussi installer le Stockage par Blocs.
id: Jika Anda ingin provision datastore pada volume blok-storage, Anda juga perlu Block Storage.

source: If your environment includes the Block Storage service, you can create a volume and attach it to an instance.
de: Wenn Ihre Infrastruktur den Blockspeicher-Dienst beinhaltet können Sie einen Datenträger erstellen und ihn einer Instanz anhängen.
fr: Si votre environnement inclut le service de Stockage par Blocs, vous pouvez créer un volume et l'attacher à une instance.
id: Jika lingkungan Anda termasuk layanan Block Storage, Anda dapat membuat volume dan menempelkannya ke sebuah instance.

source: If your environment includes the Orchestration service, you can create a stack that launches an instance.
de: Wenn Ihre Infrastruktur den Orchestrierungsdienst beinhaltet können Sie einen Stack erstellen, der eine Instanz startet.
fr: Si votre environnement inclut le service d'Orchestration, vous pouvez créer une stack qui lance une instance.
id: Jika lingkungan Anda termasuk layanan Orchestration, Anda dapat membuat stack yang meluncurkan sebuah instance.

source: If your environment includes the Shared File Systems service, you can create a share and mount it in an instance:
de: Wenn Ihre Umgebung den Dienst für geteilte Dateisysteme beinhaltet, können Sie eine Freigabe erstellen und in einer Instanz mounten.
fr: Si votre environnement inclut le service de Systèmes de Fichiers Partagés, vous pouvez créer un partage et le monter dans une instance:
id: Jika lingkungan Anda termasuk layanan Shared File Systems, Anda dapat membuat share dan mount di sebuah instance:

source: If your instance does not launch or seem to work as you expect, see the `Instance Boot Failures <http://docs.openstack.org/ops-guide/ops-maintenance-compute.html#instances>`__ section in OpenStack Operations Guide for more information or use one of the :doc:`many other options <common/app_support>` to seek assistance. We want your first installation to work!
de: Sollte Ihre Instanz nicht starten oder nicht wie erwartet funktionieren, lesen Sie den Abschnitt `Instance Boot Failures <http://docs.openstack.org/ops-guide/ops-maintenance-compute.html#instances>`__ im OpenStack Operations Guide für weitere Informationen oder nutzen Sie eines der Dokumente unter :doc:`many other options <common/app_support>` für Hilfestellungen. Wir möchten, dass Ihre erste Installation funktioniert!
fr: Si votre instance ne se lance pas ou ne semble pas fonctionner comme attendu, voir la section `Démarrage d'instance en échec <http://docs.openstack.org/ops-guide/ops-maintenance-compute.html#instances>`__ du Guide des Opérations OpenStack pour plus d'informations ou utiliser un des :doc:`nombreux autres moyens <common/app_support>` de chercher du support. Nous souhaitons que votre première installation fonctionne!

source: If your storage nodes use LVM on the operating system disk, you must also add the associated device to the filter. For example, if the ``/dev/sda`` device contains the operating system:
de: Wenn Ihre Storage Nodes LVM für die Betriebssystemfestplatten verwenden, müssen Sie zusätzlich das entsprechende Gerät zum Filter hinzufügen. Zum Beispiel, wenn das Gerät ``/dev/sda`` das Betriebssystem enthält:
fr: Si vos nœuds de stockage utilisent LVM sur leur disque système, vous devez aussi ajouter le device associé au filtre. Par exemple, si le device ``/dev/sda`` contient le système d'exploitation:
id: Jika storage nodes Anda menggunakan LVM pada sistem operasi disk, Anda juga harus menambahkan perangkat yang terkait dengan filter. Misalnya, jika perangkat ``/dev/sda`` berisi sistem operasi:

source: If your web browser runs on a host that cannot resolve the ``controller`` host name, you can replace ``controller`` with the IP address of the management interface on your controller node.
de: Sofern Ihr Webbrowser auf einem Host läuft, der den ``Controller`` Hostnamen nicht auflösen kann, können Sie ``Controller`` mit der IP-Adresse des Management-Interfaces auf dem Controller-Knoten ersetzen.
fr: Si votre navigateur web tourne sur un hôte qui ne peut pas résoudre le nom de host du ``controller``, vous pouvez remplacer ``controller`` par l'adresse IP de l'interface de management de votre nœud contrôleur.
id: Jika web browser Anda berjalan pada host yang tidak dapat resolve ``controller`` host name, Anda dapat mengganti ``controller`` dengan alamat IP dari interface manajemen pada controller node Anda.

source: Ignore any deprecation messages in this output.
de: Ignorieren Sie alle veraltet-Nachrichten in dieser Ausgabe.
fr: Ignorer les éventuels messages obsolètes.
id: Abaikan pesan bantahan dalam output ini.

source: Image service
de: Abbilddienst
fr: Service Image
id: Layanan Image
