Repository: 25hours/openstack-manuals
Catalog: doc/install-guide/source/locale/*/LC_MESSAGES/install-guide.po
Languages: de, fr, id

source: Verify operation of the Shared File Systems service.
fr: Vérifier le fonctionnement du service de Systèmes de Fichiers Partagés.
id: Verifikasi pengoperasian layanan Shared File Systems service.

source: Verify operation of the Telemetry service. These steps only include the Image service meters to reduce clutter. Environments with ceilometer integration for additional services contain more meters.
de: Verifizieren Sie die Funktionsweise des Telemetriedienstes. Diese Schritte beinhalten nur die Zähler für den Abbilddienst um die Übersicht zu wahren. Üblicherweise gibt es deutlich mehr Zähler für weitere Dienste, wenn die Umgebung Ceilometer verwendet.
fr: Vérifier le fonctionnement du service de Télémétrie. Ces étapes incluent uniquement les métriques du service Image pour simplifier. Les environnements avec l'intégration de Ceilometer pour d'autres services contiennent plus de métriques.
id: Verifikasi pengoperasian layanan Telemetry. Langkah-langkah ini hanya mencakup meter layanan Image untuk mengurangi kekacauan. Lingkungan dengan integrasi ceilometer untuk layanan tambahan mengandung banyak meter.

source: Verify operation of the dashboard.
de: Überprüfen Sie den Betrieb des Dashboards.
fr: Vérifier le fonctionnement du dashboard.
id: Verifikasi operasi dashboard.

source: Verify that the ``api-paste.ini`` file is present in ``/etc/trove``.
fr: Vérifier que le fichier ``api-paste.ini`` est présent dans ``/etc/trove``.
id: Pastikan bahwa file ``api-paste.ini`` hadir dalam ``/etc/trove``.

source: Verify the ring contents:
fr: Vérifier les contenus des anneaux:
id: Memverifikasi ring content:

source: We recommend disabling EPEL when using RDO packages due to updates in EPEL breaking backwards compatibility. Or, preferably pin package versions using the ``yum-versionlock`` plugin.
de: Wir empfehlen bei der Verwendung von RDO Paketen EPEL zu deaktivieren, wegen Aktualisierungen in EPEL, die die Abwärtskompatibilität brechen. Als Alternative pinnen Sie die Paketversionen mittels des ``yum-versionlock`` Plugins.
fr: Il est recommandé de désactiver EPEL quand on utilise les packages RDO à cause de certaines mises à jour dans EPEL qui casse la rétrocompatibilité. Ou mieux, épingler les versions des packages en utilisant le plugin ``yum-versionlock``.
id: Sebaiknya menonaktifkan EPEL saat menggunakan paket RDO karena update di EPEL mencegah kompatibilitas mundur. Atau, versi paket pin yang lebih disukai menggunakan plugin ``yum-versionlock``.

source: We recommend that you verify NTP synchronization before proceeding further. Some nodes, particularly those that reference the controller node, can take several minutes to synchronize.
de: Es wird empfohlen, die NTP-Synchronisation sicherzustellen, bevor Sie fortfahren. Bei einigen Knoten kann das Synchronisieren mehrere Minuten dauern, insbesondere bei Knoten, die den Controller-Knoten referenzieren.
fr: Il est recommandé de vérifier la synchronisation NTP avant d'aller plus loin. Certains nœuds, en particulier ceux qui pointent vers le contrôleur, peuvent mettre plusieurs minutes pour se synchroniser.
id: Kami menyarankan Anda memverifikasi sinkronisasi NTP sebelum melanjutkan lebih lanjut. Beberapa node, terutama mereka yang referensi node kontroller, dapat mengambil beberapa menit untuk menyinkronkan.

source: We recommend that you verify network connectivity to the Internet and among the nodes before proceeding further.
de: Bevor Sie fortfahren, wird empfohlen, die Verbindung zum Internet und innerhalb der Knoten sicherzustellen.
fr: Il est recommandé de vérifier l'accès Internet et la connectivité entre les nœuds avant de poursuivre.
id: Kami menyarankan Anda memverifikasi konektivitas jaringan ke Internet dan di antara node sebelum melanjutkan lebih lanjut.

source: We recommend that you verify operation and fix any issues before proceeding. The following steps use the IP address ranges from the network and subnet creation examples.
de: Bevor Sie fortfahren wird empfohlen, die Funkionalität zu prüfen und alle Probleme zu beseitigen. In den folgenden Schritten werden die IP-Adressbereiche aus den Beispielen zur Erzeugung von Netzen und Subnetzen verwendet.
fr: Il est recommandé de vérifier le fonctionnement et régler les problèmes avant de poursuivre. Les étapes suivantes utilisent les plages d'adresses IP des exemples de création de réseau et sous-réseau.
id: Kami menyarankan Anda memverifikasi operasi dan memperbaiki masalah apapun sebelum melanjutkan. Langkah-langkah berikut menggunakan range alamat IP dari contoh pembuatan jaringan dan subnet.

source: You can also disable journaling. For more information, see the `MongoDB manual <http://docs.mongodb.org/manual/>`__.
de: Sie können das Journal auch deaktivieren. Lesen Sie das `MongoDB Handbuch <http://docs.mongodb.org/manual/>`__ für weitere Informationen.
fr: Vous pouvez aussi désactiver la journalisation. Pour plus d'informations, voir le `manuel MongoDB <http://docs.mongodb.org/manual/>`__.
id: Anda juga dapat menonaktifkan journal. Untuk informasi lebih lanjut, lihat `MongoDB manual <http://docs.mongodb.org/manual/>`__.

source: You can also reference a flavor by ID.
de: Sie können eine Variante auch mit der ID referenzieren.
fr: Vous pouvez aussi référencer un gabarit par son ID.
id: Anda juga dapat referensi flavor dengan ID.

source: You can also use SSH keys instead of password authentication for service instance credentials.
fr: Vous pouvez aussi utiliser des clés SSH à la place de l'authentification par mot de passe pour les credentials d'instance de service.
id: Anda juga dapat menggunakan keys SSH bukan otentikasi password untuk kredensial instance layanan.

source: You can deploy more than one block storage node. Each node requires a minimum of one network interface.
fr: Vous pouvez déployer plus d'un nœud stockage. Chaque nœud nécessite au minimum une interfaces réseau.
id: Anda dapat mengerahkan lebih dari satu node penyimpanan blok. Setiap node membutuhkan minimal satu interface jaringan.

source: You can deploy more than one compute node. Each node requires a minimum of two network interfaces.
fr: Vous pouvez déployer plus d'un nœud compute. Chaque nœud nécessite au minimum deux interfaces réseau.
id: Anda dapat mengerahkan lebih dari satu compute node. Setiap node membutuhkan minimal dua interfaces jaringan.

source: You can deploy the Networking service using one of two architectures represented by options 1 and 2.
de: Sie können den Netzwerkdienst unter Verwendung von einer von zwei Architekturen bereitstellen, die als Optionen 1 und 2 bezeichnet werden.
fr: Vous pouvez déployer le service Réseau en utilisant l'une des deux architectures représentées par les options 1 et 2.
id: Anda dapat mengerahkan Networking Jaringan menggunakan salah satu dari dua arsitektur diwakili oleh opsi 1 dan 2.

source: You can modify these ranges and gateways to work with your particular network infrastructure.
de: Sie können diese Bereiche entsprechend Ihrer jeweiligen Netzwerkinfrastruktur anpassen.
fr: Vous pouvez modifier ces plages d'adresses et ces passerelles pour les adapter à votre infrastructure réseau.
id: Anda dapat memodifikasi rentang dan gateway ini untuk bekerja dengan infrastruktur jaringan tertentu.

source: You can repeat this procedure to create additional projects and users.
de: Sie können dieses Vorgehen wiederholen um weitere Projekte und Benutzer anzulegen.
fr: Vous pouvez répéter cette procédure pour créer d'autres projets et utilisateurs.
id: Anda dapat mengulangi prosedur ini untuk membuat proyek tambahan dan pengguna.

source: You must :ref:`create the provider network <launch-instance-networks-provider>` before the self-service network.
de: Sie müssen erst das :ref:`Anbieternetzwerk erstellen <launch-instance-networks-provider>` und dann das self-service Netzwerk.
fr: Vous devez :ref:`créer le réseau fournisseur <launch-instance-networks-provider>` avant le réseau self-service.
id: Anda harus :ref:`create the provider network <launch-instance-networks-provider>` sebelum jaringan self-service.

source: You must add the ``heat_stack_owner`` role to each user that manages stacks.
de: Jeder Benutzer, der Stacks verwalten soll, muss die Rolle ``heat_stack_owner`` erhalten.
fr: Vous devez ajouter le rôle ``heat_stack_owner`` à chaque utilisateur qui gère des stacks.
id: Anda harus menambahkan peran ``heat_stack_owner`` untuk setiap user yang mengelola stack.

source: You must create a file system on the device and mount it to use the volume.
de: Um den Datenträger zu verwenden, müssen Sie ein Dateisystem darauf erstellen und ihn dann mounten.
fr: Vous devez créer un système de fichiers sur le device et le monter pour utiliser le volume.
id: Anda harus membuat sistem file pada perangkat dan me-mount file itu menggunakan volume.

source: You must pass the value of the authentication token to the :command:`openstack` command with the ``--os-token`` parameter or set the OS_TOKEN environment variable. Similarly, you must also pass the value of the Identity service URL to the :command:`openstack` command with the ``--os-url`` parameter or set the OS_URL environment variable. This guide uses environment variables to reduce command length.
de: Sie müssen den Authentifizierungstoken entweder beim Befehl :command:`openstack` als Parameter ``--os-token`` angeben oder die Umgebungsvariable OS_TOKEN belegen. Ähnlich dazu müssen Sie die URL zum Identitätsdienst entweder beim Befehl :command:`openstack` als Parameter ``--os-url`` angeben oder die Umgebungsvariable OS_URL belegen. Dieser Leitfaden verwendet Umgebungsvariablen zur Reduzierung der Befehlslänge.
fr: Vous devez passer la valeur du jeton d'authentification à la commande :command:`openstack` à l'aide du paramètre ``--os-token`` ou en définissant la variable d'environnement OS_TOKEN. De la même façon, vous devez aussi passer la valeur de l'URL du service d'Identity à la commande :command:`openstack` à l'aide du paramètre ``--os-url`` ou en définissant la variable d'environnement OS_URL. Ce guide utilise les variables d'environnement pour réduire la taille des commandes.
id: Anda harus melewatkan nilai token otentikasi ke command :command:`openstack` dengan parameter ` `--os-token`` atau mengatur variabel environment OS_TOKEN . Demikian pula, Anda juga harus melweatkan nilai URL layanan Identity ke command :command:`openstack` dengan parameter ` `--os-url`` atau mengatur variabel lingkungan OS_URL. Panduan ini menggunakan variabel lingkungan untuk mengurangi panjang perintah.

source: You must use an account with administrative privileges to configure each node. Either run the commands as the ``root`` user or configure the ``sudo`` utility.
de: Für die Konfiguration der Knoten sind unbedingt administrative Rechte notwendig. Führen sie die Befehle entweder als Benutzer ``root`` aus oder konfigurieren Sie das Dienstprogramm ``sudo`` entsprechend.
fr: Vous devez utiliser un compte avec des privilèges administrateur pour configurer chaque nœud. Exécuter les commandes en tant que ``root`` ou configurer l'utilitaire ``sudo``.
id: Anda harus menggunakan account dengan hak akses administratif untuk mengkonfigurasi setiap node. Baik untuk menjalankan command sebagai user ``root`` atau mengkonfigurasi utility ``sudo``.

source: You should install Chrony, an implementation of :term:`NTP`, to properly synchronize services among nodes. We recommend that you configure the controller node to reference more accurate (lower stratum) servers and other nodes to reference the controller node.
de: Sie sollten Chrony installieren, dabei handelt es sich um eine Implementierung von :term:`NTP` zur korrekten Synchronisierung zwischen mehreren Knoten. Es wird empfohlen den Controller-Knoten so zu konfigurieren, dass er einen genaueren Server nutzt (niedrigeres Stratum) und andere Knoten den Controller-Knoten referenzieren.
fr: Vous devez installer Chrony, une implémentation de :term:`NTP`, pour synchroniser correctement les services entre les nœuds. Il est recommandé de configurer le contrôleur pour pointer vers des serveurs plus précis (stratum moins élevé) et les autres nœuds pour pointer vers le contrôleur.
id: Anda harus menginstal Chrony, yang merupakan implementasi dari: istilah: `NTP`, untuk menyinkronkan secara benar layanan antar node. Kami merekomendasikan bahwa Anda mengkonfigurasi node kontroller ke referensi server yang lebih akurat (lower stratum) dan node lain untuk referensi node kontroller.

source: Your OpenStack environment now includes Block Storage. You can :doc:`launch an instance <launch-instance>` or add more services to your environment in the following chapters.
de: Ihre OpenStack-Umgebung nutzt jetzt Block-Storage. Sie können :doc:`Eine Instanz starten <launch-instance>` oder in den folgenden Kapiteln weitere Dienste zu Ihrer Umgebung hinzufügen.
fr: Votre environnement OpenStack inclut maintenant le Stockage par Blocs. Vous pouvez :doc:`lancer une instance <launch-instance>` ou ajouter d'autres services à votre environnement dans les chapitres suivants.
id: Lingkungan OpenStack Anda sekarang termasuk Blok Storage. Anda dapat :doc:`launch an instance <launch-instance>` atau menambahkan layanan lainnya untuk lingkungan Anda dalam bab-bab berikut.

source: Your OpenStack environment now includes Database services.
fr: Votre environnement OpenStack inclut maintenant les services de Base de Données.
id: Lingkungan OpenStack Anda sekarang termasuk layanan Database.

source: Your OpenStack environment now includes Object Storage. You can :ref:`launch-instance` or add more services to your environment.
fr: Votre environnement OpenStack inclut maintenant le Stockage Objet. Vous pouvez :ref:`launch-instance` ou ajouter d'autres services à votre environnement.
id: Lingkungan OpenStack Anda sekarang termasuk Object Storage. Anda dapat :ref:`launch-instance` atau menambahkan layanan lainnya dengan lingkungan Anda.

source: Your OpenStack environment now includes Orchestration. You can :ref:`launch-instance` or add more services to your environment in the following chapters.
de: Ihre OpenStack-Umgebung verwendet jetzt Orchestrierung. Sie können eine Instanz starten :ref:`launch-instance` oder weitere Dienste zu Ihrer Umgebung hinzufügen.
fr: Votre environnement OpenStack inclut maintenant l'Orchestration. Vous pouvez :ref:`launch-instance` ou ajouter d'autres services à votre environnement dans les chapitres suivantes.
id: Lingkungan OpenStack Anda sekarang masuk Orchestration. Anda dapat :ref:`launch-instance` atau menambahkan layanan lainnya untuk lingkungan Anda dalam bab-bab berikut.

source: Your OpenStack environment now includes Telemetry. You can :ref:`launch-instance` or add more services to your environment.
de: Ihre OpenStack-Umgebung verwendet jetzt Telemetrie. Sie können :ref:`launch-instance` oder weitere Dienste zu Ihrer Umgebung hinzufügen.
fr: Votre environnement OpenStack inclut maintenant la Télémétrie. Vous pouvez :ref:`launch-instance` ou ajouter d'autres services à votre environnement.
id: Lingkungan OpenStack Anda sekarang masuk Telemetry. Anda dapat: ref: `launch-instance` atau menambahkan layanan lainnya ke lingkungan Anda.

source: Your OpenStack environment now includes the Shared File Systems service. You can :doc:`launch an instance <launch-instance>` or add more services to your environment in the following chapters.
de: Ihre OpenStack-Umgebung verwendet jetzt den Share-File-System-Dienst. Sie können eine :doc:`Instanz starten <launch-instance>` oder weitere Dienste zu Ihrer Umgebung hinzufügen.
fr: Votre environnement OpenStack inclut maintenant le service de Systèmes de Fichiers Partagés. Vous pouvez :doc:`lancer une instance <launch-instance>` ou ajouter d'autres services à votre environnement dans les chapitres suivants.
id: Lingkungan OpenStack Anda sekarang termasuk layanan Shared File Systems. Anda dapat : doc:`launch an instance <launch-instance>` atau menambahkan layanan lainnya untuk lingkungan Anda dalam bab-bab berikut.

source: Your OpenStack environment now includes the core components necessary to launch a basic instance. You can :ref:`launch-instance` or add more OpenStack services to your environment.
de: Ihre OpenStack-Umgebung verwendet jetzt die notwendigen Kernkomponenten um eine minimale Instanz zu starten. Sie können eine Instanz starten über :ref:`launch-instance` oder weitere Dienste zu Ihrer Umgebung hinzufügen.
fr: Votre environnement OpenStack inclut maintenant les composants essentiels nécessaires au lancement d'une instance basique. Vous pouvez :ref:`launch-instance` ou ajouter d'autres services OpenStack à votre environnement.
id: Lingkungan OpenStack Anda sekarang termasuk komponen inti yang diperlukan untuk memulai sebuah basic instance. Anda dapat :ref:`launch-instance` atau menambahkan lebih layanan OpenStack untuk lingkungan Anda.

source: Your OpenStack environment now includes the dashboard. You can :ref:`launch-instance` or add more services to your environment.
de: Ihre OpenStack-Umgebung verwendet jetzt das Dashboard. Sie können eine Instanz starten über :ref:`launch-instance` oder weitere Dienste zu Ihrer Umgebung hinzufügen.
fr: Votre environnement OpenStack inclut maintenant le Tableau de bord. Vous pouvez :ref:`launch-instance` ou ajouter d'autres services à votre environnement.
id: Lingkungan OpenStack Anda sekarang termasuk dasbor. Anda dapat :ref:`launch-instance` atau menambahkan layanan lainnya dengan lingkungan Anda.

source: Your distribution does not enable a restrictive :term:`firewall` by default. For more information about securing your environment, refer to the `OpenStack Security Guide <http://docs.openstack.org/sec/>`__.
de: Ihre Distribution aktiviert standardmäßig keine restriktive :term:`firewall`. Für weitere Informationen zur Sicherung Ihrer Infrastruktur lesen Sie den `OpenStack Security Guide <http://docs.openstack.org/sec/>`__.
fr: Votre distribution n'active pas de :term:`firewall` restrictif par défaut. Pour plus d'informations concernant la sécurisation de votre environnement, se référer au `Guide de Sécurité OpenStack <http://docs.openstack.org/sec/>`__.
id: Distribusi Anda tidak memungkinkan membatasi :term:`firewall` secara default. Untuk informasi lebih lanjut tentang mengamankan lingkungan Anda, lihat `OpenStack Security Guide <http://docs.openstack.org/sec/>`__.

source: Your distribution enables a restrictive :term:`firewall` by default. During the installation process, certain steps will fail unless you alter or disable the firewall. For more information about securing your environment, refer to the `OpenStack Security Guide <http://docs.openstack.org/sec/>`__.
de: Ihre Distribution aktiviert standardmäßig eine restriktive :term:`Firewall`. Bestimmte Schritte werden während der Installation fehlschlagen, sofern Sie die Firewall nicht ändern oder abschalten. Weitere Informationen zum Absichern Ihrer Umgebung finden Sie im `OpenStack Security Guide <http://docs.openstack.org/sec/>`__.
fr: Votre distribution active par défaut un :term:`firewall` restrictif. Pendant le processus d'installation, certaines étapes vont échouer à moins de modifier ou de désactiver le firewall. Pour plus d'informations concernant la sécurisation de votre environnement, se référer au `Guide de Sécurité OpenStack <http://docs.openstack.org/sec/>`__.
id: Distribusi Anda memungkinkan membatasi :term:`firewall` secara default. Selama proses instalasi, langkah-langkah tertentu akan gagal kecuali Anda mengubah atau menonaktifkan firewall. Untuk informasi lebih lanjut tentang mengamankan lingkungan Anda, lihat `OpenStack Security Guide <http://docs.openstack.org/sec/>`__.

source: Your environment must at least include the Identity service (keystone) prior to deploying Object Storage.
fr: Votre environnement doit inclure au minimum le service d'Identité (keystone) avant de déployer le stockage d'objet.
id: Lingkungan Anda harus setidaknya mencakup layanan Identity (keystone) sebelum pengerahan Object Storage.

source: Your environment must include the Block Storage service.
de: Ihre Umgebung muss den Block-Speicherdienst enthalten.
fr: Votre environnement doit inclure le service de Stockage par Blocs.
id: Lingkungan Anda harus menyertakan layanan Block Storage.

source: Your environment must include the Object Storage service.
de: Ihre Umgebung muss den Dienst Objekt-Storage verwenden.
fr: Votre environnement doit inclure le service Stockage Objet.
id: Lingkungan Anda harus menyertakan layanan Object Storage.

source: Your hosts must contain the latest versions of base installation packages available for your distribution before proceeding further.
de: Stellen Sie sicher, dass Ihre Hosts die neuesten verfügbaren Versionen der Grundinstallationspakete für Ihre Distribution enthalten, bevor Sie fortfahren.
fr: Pour pouvoir aller plus loin, vos hôtes doivent contenir la dernière version des packages d'installation de base disponibles pour votre distribution.
id: Host Anda harus berisi versi terbaru dari paket instalasi dasar tersedia untuk distribusi Anda sebelum melanjutkan lebih lanjut.

source: `Block Storage <http://www.openstack.org/software/releases/liberty/components/cinder>`_
fr: `Stockage par Blocs <http://www.openstack.org/software/releases/liberty/components/cinder>`_

source: `Create a trove image <http://docs.openstack.org/developer/trove/dev/building_guest_images.html>`_.
fr: `Créer une image trove <http://docs.openstack.org/developer/trove/dev/building_guest_images.html>`_.

source: `Dashboard <http://www.openstack.org/software/releases/liberty/components/horizon>`_
fr: `Tableau de Bord <http://www.openstack.org/software/releases/liberty/components/horizon>`_

source: `Identity service <http://www.openstack.org/software/releases/liberty/components/keystone>`_
fr: `Service d'identité <http://www.openstack.org/software/releases/liberty/components/keystone>`_

source: `Image service <http://www.openstack.org/software/releases/liberty/components/glance>`_
fr: `Service d'Image <http://www.openstack.org/software/releases/liberty/components/glance>`_

source: `Networking <http://www.openstack.org/software/releases/liberty/components/neutron>`_
fr: `Réseaux<http://www.openstack.org/software/releases/liberty/components/neutron>`_

source: `Object Storage <http://www.openstack.org/software/releases/liberty/components/swift>`_
fr: `Stockage Objet <http://www.openstack.org/software/releases/liberty/components/swift>`_

source: `Telemetry <http://www.openstack.org/software/releases/liberty/components/ceilometer>`_
fr: `Télémétrie <http://www.openstack.org/software/releases/liberty/components/ceilometer>`_

source: ``nova-api-metadata`` is included in the ``nova-api`` package, and can be selected through debconf.
fr: ``nova-api-metadata`` est inclut dans le package ``nova-api``, et peut être sélectionner via debconf.
id: ``nova-api-metadata`` termasuk dalam paket ``nova-api``, dan dapat dipilih melalui debconf.

source: Any roles that you create must map to roles specified in the ``policy.json`` file in the configuration file directory of each OpenStack service. The default policy for most services grants administrative access to the ``admin`` role. For more information, see the `Operations Guide - Managing Projects and Users <http://docs.openstack.org/ops-guide/ops_projects_users.html>`__.
id: Apa peran yang Anda buat harus memetakan peran yang ditentukan dalam file ``policy.json`` di direktori file konfigurasi setiap layanan OpenStack. Kebijakan default untuk sebagian besar layanan memberikan akses administratif untuk peran ``admin``. Untuk informasi lebih lanjut, lihat `Operations Guide - Managing Projects and Users <http://docs.openstack.org/ops-guide/ops_projects_users.html>`__.

source: Change to the ``/etc/swift`` directory.
id: Ubah ke directory ``/etc/swift``.
