Repository: 25hours/openstack-manuals
Catalog: doc/install-guide/source/locale/*/LC_MESSAGES/install-guide.po
Languages: de, fr, id

source: Replace ``FILE`` with the name of a local file to upload to the ``container1`` container.
de: Ersetzen Sie ``DATEI`` durch den Namen einer lokalen Datei und laden diese zum Container ``container1`` hoch.
fr: Remplacer ``FILE`` par le nom d'un fichier local à charger dans le conteneur ``container1``.
id: Ganti ``FILE`` dengan nama file lokal untuk meng-upload ke container ``container1``.

source: Replace ``FILE`` with the name of the file uploaded to the ``container1`` container.
de: Ersetzen Sie ``DATEI`` durch den Namen der zum Container ``container1`` hochgeladenen Datei.
fr: Remplacer ``FILE`` par le nom du fichier chargé dans le conteneur ``container1``.
id: Ganti `` FILE`` dengan nama file upload ke container ``container1``.

source: Replace ``GLANCE_DBPASS`` with a suitable password.
de: Ersetzen Sie ``GLANCE_DBPASS`` durch ein geeignetes Passwort.
fr: Remplacer ``GLANCE_DBPASS`` par un mot de passe approprié.
id: Ganti ``GLANCE_DBPASS`` dengan password yang sesuai.

source: Replace ``GLANCE_DBPASS`` with the password you chose for the Image service database.
de: Ersetzen Sie ``GLANCE_DBPASS`` mit dem Passwort, das Sie für die Datenbank des Abbilddienstes gewählt haben.
fr: Remplacer ``GLANCE_DBPASS`` par le mot de passe choisi pour la base de données du service d'Image.
id: Ganti ``GLANCE_DBPASS`` dengan password yang Anda pilih untuk database layanan Image.

source: Replace ``GLANCE_PASS`` with the password you chose for the ``glance`` user in the Identity service.
de: Ersetzen Sie ``GLANCE_PASS`` durch das Passwort, das Sie für den Benutzer ``glance`` im Identitätsdienst vergeben haben.
fr: Remplacer ``GLANCE_PASS`` par le mot de passe choisi pour l'utilisateur ``glance`` dans le service d'Identité.
id: Ganti ``GLANCE_PASS`` dengan password yang Anda pilih untuk user ``glance`` dalam pelayanan Identity.

source: Replace ``HEAT_DBPASS`` with a suitable password.
de: Ersetzen Sie ``HEAT_DBPASS`` durch ein geeignetes Passwort.
fr: Remplacer ``HEAT_DBPASS`` par un mot de passe approprié.
id: Ganti ``HEAT_DBPASS`` dengan password yang sesuai.

source: Replace ``HEAT_DBPASS`` with the password you chose for the Orchestration database.
de: Ersetzen Sie ``HEAT_DBPASS`` durch das Passwort, das Sie für die Orchestrierungsdatenbank gewählt haben.
fr: Remplacer ``HEAT_DBPASS`` par le mot de passe choisi pour la base de données de l'Orchestration.
id: Ganti ``HEAT_DBPASS`` dengan password yang Anda pilih untuk database Orchestration.

source: Replace ``HEAT_DOMAIN_PASS`` with the password you chose for the ``heat_domain_admin`` user in the Identity service.
de: Ersetzen Sie ``HEAT_DOMAIN_PASS`` durch das Passwort, das Sie für den Benutzer ``heat_domain_admin`` im Identitätsdienst vergeben haben.
fr: Remplacer ``HEAT_DOMAIN_PASS`` par le mot de passe choisi pour l'utilisateur ``heat_domain_admin`` dans le service d'Identité.
id: Ganti ``HEAT_DOMAIN_PASS`` dengan password yang Anda pilih untuk user ``heat_domain_admin`` dalam pelayanan Identity.

source: Replace ``HEAT_PASS`` with the password you chose for the ``heat`` user in the Identity service.
de: Ersetzen Sie ``HEAT_PASS`` durch das Passwort, das Sie für den Benutzer ``heat`` im Identitätsdienst vergeben haben.
fr: Remplacer ``HEAT_PASS`` par le mot de passe choisi pour l'utilisateur ``heat`` dans le service d'Identité.
id: Ganti ``HEAT_PASS`` dengan password yang Anda pilih untuk usr ``heat`` dalam pelayanan Identity.

source: Replace ``INSTANCE_IP_ADDRESS`` with the IP address of the instance.
de: Ersetzen Sie ``INSTANCE_IP_ADDRESS`` durch die IP-Adresse der Instanz.
fr: Remplacer ``INSTANCE_IP_ADDRESS`` par l'adresse IP de l'instance.
id: Ganti ``INSTANCE_IP_ADDRESS`` dengan alamat IP dari instance.

source: Replace ``INSTANCE_NAME`` with the name of the instance and ``VOLUME_NAME`` with the name of the volume you want to attach to it.
de: Ersetzen Sie ``INSTANCE_NAME`` durch den Namen der Instanz und ``VOLUME_NAME`` durch den Namen des Datenträgers, den Sie anhängen möchten.
fr: Remplacer ``INSTANCE_NAME`` par le nom de l'instance et ``VOLUME_NAME`` par le nom du volume que vous voulez lui attacher.
id: Ganti `` INSTANCE_NAME`` dengan nama instance dan ``VOLUME_NAME`` dengan nama volume Anda ingin tempelkan untuk itu.

source: Replace ``INTERFACE_NAME`` with the actual interface name. For example, *eth1* or *ens224*.
de: Ersetzen Sie ``INTERFACE_NAME`` durch den tatsächlichen Namen der Schnittstelle. Zum Beispiel *eth1* oder *ens224*.
fr: Remplacer ``INTERFACE_NAME`` par le nom de l'interface réelle. Par exemple, *eth1* ou *ens224*.
id: Gantilah ``INTERFACE_NAME`` dengan nama interface yang sebenarnya. Misalnya, *eth1* atau *ens224*.

source: Replace ``KEYSTONE_DBPASS`` with a suitable password.
de: Ersetzen Sie ``KEYSTONE_DBPASS`` durch ein geeignetes Passwort.
fr: Remplacer ``KEYSTONE_DBPASS`` par un mot de passe approprié.
id: Ganti ``KEYSTONE_DBPASS`` dengan password yang sesuai.

source: Replace ``KEYSTONE_DBPASS`` with the password you chose for the database.
de: Ersetzen Sie ``KEYSTONE_DBPASS`` durch das Passwort, das Sie für die Datenbank gewählt haben.
fr: Remplacer ``KEYSTONE_DBPASS`` par le mot de passe choisi pour la base de données.
id: Ganti ``KEYSTONE_DBPASS``dengan password yang Anda pilih untuk database.

source: Replace ``MANAGEMENT_INTERFACE_IP_ADDRESS`` with the IP address of the management network interface on your compute node, typically 10.0.0.31 for the first node in the :ref:`example architecture <overview-example-architectures>`.
de: Ersetzen Sie ``MANAGEMENT_INTERFACE_IP_ADDRESS`` mit der IP-Adresse der Management-Netzwerkschnittstelle Ihres Compute-Nodes, üblicherweise 10.0.0.31 für den ersten Node in der :ref:`Beispiel-Architektur <overview-example-architectures>`.
fr: Remplacer ``MANAGEMENT_INTERFACE_IP_ADDRESS`` par l'adresse IP de l'interface réseau de management de votre nœud compute, généralement 10.0.0.31 pour le premier nœud dans l':ref:`exemple d'architecture <overview-example-architectures>`.
id: Ganti `` MANAGEMENT_INTERFACE_IP_ADDRESS`` dengan alamat IP dari interface jaringan manajemen pada compute node Anda, biasanya 10.0.0.31 untuk node pertama dalam :ref:`example architecture <overview-example-architectures>`.

source: Replace ``MANAGEMENT_INTERFACE_IP_ADDRESS`` with the IP address of the management network interface on your share node, typically 10.0.0.41 for the first node in the :ref:`example architecture <overview-example-architectures>`.
de: Ersetzen Sie ``MANAGEMENT_INTERFACE_IP_ADDRESS`` durch die IP-Adresse der Management-Netzwerkschnittstelle Ihres Freigabeknotens, typischerweise 10.0.0.41 für den ersten Knoten in der :ref:`Beispiel-Architektur <overview-example-architectures>`.
fr: Remplacer ``MANAGEMENT_INTERFACE_IP_ADDRESS`` par l'adresse IP de l'interface du réseau de management sur le nœud de partage, généralement 10.0.0.41 pour le premier nœud dans l' :ref:`exemple d'architecture <overview-example-architectures>`.
id: Ganti ``MANAGEMENT_INTERFACE_IP_ADDRESS`` dengan alamat IP dari interface jaringan manajemen pada share node Anda, biasanya 10.0.0.41 untuk node pertama dalam :ref:`example architecture <overview-example-architectures>`.

source: Replace ``MANAGEMENT_INTERFACE_IP_ADDRESS`` with the IP address of the management network interface on your storage node, typically 10.0.0.41 for the first node in the :ref:`example architecture <overview-example-architectures>`.
de: Ersetzen Sie ``MANAGEMENT_INTERFACE_IP_ADDRESS`` durch die IP-Adresse der Management-Netzwerkschnittstelle Ihres Storage Nodes, typischerweise 10.0.0.41 für den ersten Node in der :ref:`Beispiel-Architektur <overview-example-architectures>`.
fr: Remplacer ``MANAGEMENT_INTERFACE_IP_ADDRESS`` par l'adresse IP de l'interface du réseau de management sur le nœud de stockage, généralement 10.0.0.41 pour le premier nœud dans l' :ref:`exemple d'architecture <overview-example-architectures>`.
id: Gantilah ``MANAGEMENT_INTERFACE_IP_ADDRESS`` dengan alamat IP dari antarmuka jaringan manajemen pada storage node Anda, biasanya 10.0.0.41 untuk node pertama dalam :ref:`example architecture <overview-example-architectures>`.

source: Replace ``MANAGEMENT_INTERFACE_IP_ADDRESS`` with the IP address of the management network on the storage node.
fr: Remplacer ``MANAGEMENT_INTERFACE_IP_ADDRESS`` par l'adresse IP du réseau de management sur le nœud de stockage.
id: Ganti `` MANAGEMENT_INTERFACE_IP_ADDRESS`` dengan alamat IP dari jaringan manajemen pada node penyimpanan.

source: Replace ``MANILA_DBPASS`` with a suitable password.
de: Ersetzen Sie ``MANILA_DBPASS`` durch ein geeignetes Passwort.
fr: Remplacer ``MANILA_PASS`` par un mot de passe approprié.
id: Ganti ``MANILA_DBPASS`` dengan password yang sesuai.

source: Replace ``MANILA_DBPASS`` with the password you chose for the Share File System database.
fr: Remplacer ``MANILA_DBPASS`` par le mot de passe choisi pour la base de données du Système de Fichiers Partagés.
id: Ganti ``MANILA_DBPASS`` dengan password yang Anda pilih untuk database Share File System.

source: Replace ``MANILA_PASS`` with the password you chose for the ``manila`` user in the Identity service.
de: Ersetzen Sie ``MANILA_PASS`` durch das Passwort, das Sie für den Benutzer ``manila`` im Identitätsdienst vergeben haben.
fr: Remplacer ``MANILA_PASS`` par le mot de passe choisi pour l'utilisateur ``manila`` dans le service d'Identité.
id: Ganti ``MANILA_PASS`` dengan password yang Anda pilih untuk user ``manila`` dalam pelayanan Identity.

source: Replace ``METADATA_SECRET`` with a suitable secret for the metadata proxy.
de: Ersetzen Sie ``METADATA_SECRET`` mit einem angemessenen Geheimwort für den Metadatenproxy.
fr: Remplacer ``METADATA_SECRET`` par un secret approprié pour le proxy metadata.
id: Ganti `` METADATA_SECRET`` dengan rahasia cocok untuk proxy metadata.

source: Replace ``METADATA_SECRET`` with the secret you chose for the metadata proxy.
de: Ersetzen Sie ``METADATA_SECRET`` mit dem Geheimwort, dass Sie für den Metadatendienst gewählt haben.
fr: Remplacer ``METADATA_SECRET`` par le secret choisi pour le proxy metadata.
id: Ganti ``METADATA_SECRET`` dengan rahasia Anda memilih untuk proxy metadata.

source: Replace ``NEUTRON_DBPASS`` with the password you chose for the database.
de: Ersetzen Sie ``NEUTRON_DBPASS`` durch das Passwort, das Sie für die Datenbank gewählt haben.
fr: Remplacer ``NEUTRON_DBPASS`` par le mot de passe choisi pour la base de données.
id: Ganti ``NEUTRON_DBPASS`` dengan password yang Anda pilih untuk database.

source: Replace ``NEUTRON_PASS`` with the password you chose for the ``neutron`` user in the Identity service.
de: Ersetzen Sie ``NEUTRON_PASS`` durch das Passwort, das Sie für den Benutzer ``neutron`` im Identitätsdienst vergeben haben.
fr: Remplacer ``NEUTRON_PASS`` par le mot de passe choisi pour l'utilisateur ``neutron`` dans le service d'Identité.
id: Ganti ``NEUTRON_PASS`` dengan password yang Anda pilih untuk user ``neutron`` dalam pelayanan Identity.

source: Replace ``NOVA_DBPASS`` with a suitable password.
de: Ersetzen Sie ``NOVA_DBPASS`` durch ein geeignetes Passwort.
fr: Remplacer ``NOVA_DBPASS`` par un mot de passe approprié.
id: Ganti `` NOVA_DBPASS`` dengan password yang sesuai.

source: Replace ``NOVA_DBPASS`` with the password you chose for the Compute databases.
fr: Remplacer ``NOVA_DBPASS`` par le mot de passe choisi pour les bases de données Compute.
id: Ganti `` NOVA_DBPASS`` dengan password yang Anda pilih untuk Compute databases.

source: Replace ``NOVA_PASS`` with the password you chose for the ``nova`` user in the Identity service.
de: Ersetzen Sie ``NOVA_PASS`` durch das Passwort, das Sie für den Benutzer ``nova`` im Identitätsdienst vergeben haben.
fr: Remplacer ``NOVA_PASS`` par le mot de passe choisi pour l'utilisateur ``nova`` dans le service d'Identité.
id: Ganti ``NOVA_PASS`` dengan password yang Anda pilih untuk user ``nova`` dalam pelayanan Identity.

source: Replace ``NTP_SERVER`` with the hostname or IP address of a suitable more accurate (lower stratum) NTP server. The configuration supports multiple ``server`` keys.
de: Ersetzen Sie ``NTP_SERVER`` mit dem Hostname oder der IP-Adresse eines passenden und genaueren NTP-Servers (niedrigeres Stratum). Die Konfiguration unterstützt mehrere ``server``-Werte.
fr: Remplacer ``NTP_SERVER`` par le hostname ou l'adresse IP d'un serveur NTP approprié plus précis (plus petit stratum). La configuration supporte plusieurs clés ``server``.
id: Ganti ``NTP_SERVER`` dengan hostname atau IP address yang sesuai lebih akurat (lapisan bawah) NTP Server. Konfigurasi mendukung multiple ``server`` keys.

source: Replace ``OVERLAY_INTERFACE_IP_ADDRESS`` with the IP address of the underlying physical network interface that handles overlay networks. The example architecture uses the management interface to tunnel traffic to the other nodes. Therefore, replace ``OVERLAY_INTERFACE_IP_ADDRESS`` with the management IP address of the compute node. See :ref:`environment-networking` for more information.
de: Ersetzen Sie ``OVERLAY_INTERFACE_IP_ADDRESS`` mit der IP-Adresse der darunter liegenden physischen Netzwerkinterfaces, dass das Overlay Netzwerk bedient. Die Beispielarchitektur verwendet das Management Interface um Datenverkehr zu anderen Knoten zu tunneln. Ersetzen Sie daher ``OVERLAY_INTERFACE_IP_ADDRESS`` mit der Management IP-Adresse des Computeknotens. Lesen Sie :ref:`environment-networking` für weitere Informationen.
fr: Remplacer ``OVERLAY_INTERFACE_IP_ADDRESS`` par l'adresse IP de l'interface réseau physique sous-jacent qui gère les réseaux superposés. L'architecture en exemple utilise l'interface de management pour tuneliser le trafic vers les autres nœuds. Par conséquent, remplacer ``OVERLAY_INTERFACE_IP_ADDRESS`` par l'adresse IP de management du nœud compute. Voir :ref:`environment-networking`pour plus d'informations.
id: Ganti ``OVERLAY_INTERFACE_IP_ADDRESS`` dengan alamat IP dari interface jaringan fisik yang mendasari yang menangani jaringan overlay. Contoh arsitektur menggunakan interface manajemen lalu lintas terowongan ke node lain. Oleh karena itu, ganti ``OVERLAY_INTERFACE_IP_ADDRESS`` dengan alamat IP manajemen dari node komputasi. Lihat :ref:`environment-networking` for more information.

source: Replace ``OVERLAY_INTERFACE_IP_ADDRESS`` with the IP address of the underlying physical network interface that handles overlay networks. The example architecture uses the management interface to tunnel traffic to the other nodes. Therefore, replace ``OVERLAY_INTERFACE_IP_ADDRESS`` with the management IP address of the controller node. See :ref:`environment-networking` for more information.
de: Ersetzen Sie ``OVERLAY_INTERFACE_IP_ADDRESS`` mit der IP-Adresse der darunter liegenden physischen Netzwerkinterfaces, dass das Overlay Netzwerk bedient. Die Beispielarchitektur verwendet das Management Interface um Datenverkehr zu anderen Knoten zu tunneln. Ersetzen Sie daher ``OVERLAY_INTERFACE_IP_ADDRESS`` mit der Management IP-Adresse des Controllerknotens. Lesen Sie :ref:`environment-networking` für weitere Informationen.
fr: Remplacer ``OVERLAY_INTERFACE_IP_ADDRESS`` par l'adresse IP de l'interface réseau physique sous-jacent qui gère les réseaux superposés. L'architecture en exemple utilise l'interface de management pour tuneliser le trafic vers les autres nœuds. Par conséquent, remplacer ``OVERLAY_INTERFACE_IP_ADDRESS`` par l'adresse IP de management du nœud contrôleur. Voir :ref:`environment-networking`pour plus d'informations.
id: Ganti ``OVERLAY_INTERFACE_IP_ADDRESS`` dengan alamat IP dari interface jaringan fisik yang mendasari yang menangani jaringan overlay. Contoh arsitektur menggunakan interface manajemen lalu tunnel traffic to the other nodes. Oleh karena itu, ganti ``OVERLAY_INTERFACE_IP_ADDRESS`` dengan alamat manajemen IP dari controller node. Lihat :ref:`environment-networking` untuk informasi lebih lanjut.

source: Replace ``PROVIDER_INTERFACE_NAME`` with the name of the underlying provider physical network interface. See :ref:`environment-networking` for more information.
de: Ersetzen Sie ``PROVIDER_INTERFACE_NAME`` mit dem Namen des darunter liegenden physikalischen Anbieternetzwerk-Interfaces. Lesen Sie :ref:`environment-networking` für weitere Informationen.
fr: Remplacer ``PROVIDER_INTERFACE_NAME`` par le nom de l'interface sur le réseau physique provider sous-jacent. Voir :ref:`environment-networking`pour plus d'informations.
id: Ganti ``PROVIDER_INTERFACE_NAME`` dengan nama provider yang mendasari interface jaringan fisik. Lihat :ref:`environment-networking` untuk informasi lebih lanjut.

source: Replace ``PROVIDER_NETWORK_CIDR`` with the subnet on the provider physical network in CIDR notation.
de: Ersetzen Sie ``PROVIDER_NETWORK_CIDR`` durch das Subnetz im physischen Anbieternetzwerk in CIDR-Notation.
fr: Remplacer ``PROVIDER_NETWORK_CIDR`` par le sous-réseau sur le réseau physique fournisseur en notation CIDR.
id: Ganti ``PROVIDER_NETWORK_CIDR`` dengan subnet pada jaringan fisik provider dalam notasi CIDR.

source: Replace ``PROVIDER_NETWORK_GATEWAY`` with the gateway IP address on the provider network, typically the ".1" IP address.
de: Ersetzen Sie ``PROVIDER_NETWORK_GATEWAY`` durch die Gateway-IP-Adresse im Anbieternetzwerk, üblicherweise die IP-Adresse ".1".
fr: Remplacer ``PROVIDER_NETWORK_GATEWAY`` par l'adresse IP de la passerelle sur le réseau provider, en général l'adresse IP en ".1".
id: Ganti ``PROVIDER_NETWORK_GATEWAY`` dengan alamat IP gateway di jaringan provider, biasanya ".1" alamat IP.

source: Replace ``PROVIDER_NET_ID`` with the ID of the ``provider`` provider network.
de: Ersetzen Sie ``PROVIDER_NET_ID`` mit der ID des ``provider`` Anbieternetzwerkes.
fr: Remplacer ``PROVIDER_NET_ID`` par l'ID du réseau fournisseur ``provider``.
id: Ganti ``PROVIDER_NET_ID`` dengan ID dari jaringan provider ``provider``.

source: Replace ``RABBIT_PASS`` with a suitable password.
de: Ersetzen Sie ``RABBIT_PASS`` durch ein geeignetes Passwort.
fr: Remplacer ``RABBIT_PASS`` par un mot de passe approprié.
id: Gantilah ``RABBIT_PASS`` dengan password yang sesuai.

source: Replace ``RABBIT_PASS`` with the password you chose for the ``openstack`` account in RabbitMQ.
de: Ersetzen Sie ``RABBIT_PASS`` mit dem Passwort, welches Sie für den ``openstack`` Account in ``RabbitMQ`` gewählt haben.
fr: Remplacer ``RABBIT_PASS`` par le mot de passe choisi pour le compte ``openstack`` dans RabbitMQ.
id: Ganti ``RABBIT_PASS`` dengan password yang Anda pilih untuk account ``openstack`` di RabbitMQ.

source: Replace ``RABBIT_PASS`` with the password you chose for the ``openstack`` account in ``RabbitMQ``.
de: Ersetzen Sie ``RABBIT_PASS`` mit dem Passwort, welches Sie für den ``openstack`` Account in ``RabbitMQ`` gewählt haben.
fr: Remplacez ``RABBIT_PASS`` par le mot de passe que vous avez attribué au compte ``openstack`` dans ``RabbitMQ``.
id: Ganti `` RABBIT_PASS`` dengan password yang Anda pilih akun ``openstack`` di ``RabbitMQ``.

source: Replace ``SELFSERVICE_NETWORK_CIDR`` with the subnet you want to use on the self-service network. You can use any arbitrary value, although we recommend a network from `RFC 1918 <https://tools.ietf.org/html/rfc1918>`_.
de: Ersetzen Sie ``SELFSERVICE_NETWORK_CIDR`` mit dem Subnetz, dass Sie für das self-service Netzwerk verwenden wollen. Sie können beliebige Werte verwenden, allerdings empfehlen wir ein Netzwerk aus `RFC 1918 <https://tools.ietf.org/html/rfc1918>`_.
fr: Remplacer ``SELFSERVICE_NETWORK_CIDR`` par le sous-réseau que vous voulez utiliser sur le réseau self-service. Vous pouvez utiliser n'importe quelle valeur arbitraire, bien que nous recommandions un réseau de la `RFC 1918 <https://tools.ietf.org/html/rfc1918>`_.
id: Ganti ``SELFSERVICE_NETWORK_CIDR`` dengan subnet yang ingin Anda gunakan pada jaringan self-service. Anda dapat menggunakan nilai semaunya, meskipun kami merekomendasikan jaringan dari `RFC 1918 <https://tools.ietf.org/html/rfc1918>` _.

source: Replace ``SELFSERVICE_NETWORK_GATEWAY`` with the gateway you want to use on the self-service network, typically the ".1" IP address.
de: Ersetzen Sie ``SELFSERVICE_NETWORK_GATEWAY`` mit dem Gateway, dass Sie für das self-service Netzwerk verwenden wollen, typischerweise die ".1" IP Adresse.
fr: Remplacer ``SELFSERVICE_NETWORK_GATEWAY`` par la passerelle que vous voulez utiliser sur le réseau self-service, généralement l'adresse IP en ".1".
id: Ganti ``SELFSERVICE_NETWORK_GATEWAY`` dengan gateway yang ingin Anda gunakan pada jaringan self-service, biasanya ".1" alamat IP.

source: Replace ``SELFSERVICE_NET_ID`` with the ID of the ``selfservice`` network.
de: Ersetzen Sie ``SELFSERVICE_NET_ID`` mit der ID des ``selfservice`` Netzwerkes.
fr: Remplacer ``SELFSERVICE_NET_ID`` par l'ID du réseau ``selfservice``.
id: Ganti ``SELFSERVICE_NET_ID`` dengan ID dari jaringan ``selfservice``.

source: Replace ``START_IP_ADDRESS`` and ``END_IP_ADDRESS`` with the first and last IP address of the range within the subnet that you want to allocate for instances. This range must not include any existing active IP addresses.
de: Ersetzen Sie ``START_IP_ADDRESS`` und ``END_IP_ADDRESS`` durch die erste und letzte IP-Adresse des Bereiches innerhalb des Subnetzes, das Sie den Instanzen zuweisen möchten. Dieser Bereich darf keine existierenden aktiven IP-Adressen enthalten.
fr: Remplacer ``START_IP_ADDRESS`` et ``END_IP_ADDRESS`` par la première et la dernière adresse IP de la plage que vous voulez allouer pour les instances à l'intérieur du sous-réseau. Cette plage ne doit contenir aucune adresse IP existante.
id: Ganti ``START_IP_ADDRESS`` dan `` END_IP_ADDRESS`` dengan alamat IP pertama dan terakhir dari range dalam subnet yang ingin Anda mengalokasikan untuk instances. Range ini tidak boleh menyertakan ada alamat IP yang aktif.

source: Replace ``STORAGE_NODE_MANAGEMENT_INTERFACE_IP_ADDRESS`` with the IP address of the management network on the storage node. Replace ``DEVICE_NAME`` with a storage device name on the same storage node. For example, using the first storage node in :ref:`swift-storage` with the ``/dev/sdb`` storage device and weight of 100:
fr: Remplacer ``STORAGE_NODE_MANAGEMENT_INTERFACE_IP_ADDRESS`` par l'adresse IP du réseau de management sur le nœud de stockage. Remplacer ``DEVICE_NAME`` par le nom d'un device de stockage sur le même nœud de stockage. Par exemple, utiliser le premier nœud de stockage du :ref:`swift-storage` avec le device de stockage ``/dev/sdb``et le poids de 100:
id: Ganti ``STORAGE_NODE_MANAGEMENT_INTERFACE_IP_ADDRESS`` dengan alamat IP dari jaringan manajemen pada node penyimpanan. Ganti ``DEVICE_NAME`` dengan nama perangkat penyimpanan pada node penyimpanan yang sama. Misalnya, menggunakan node penyimpanan pertama di :ref:`swift-storage` dengan storage device ``/dev/sdb``dan weight of 100:

source: Replace ``SWIFT_PASS`` with the password you chose for the ``swift`` user in the Identity service.
fr: Remplacer ``SWIFT_PASS`` par le mot de passe choisi pour l'utilisateur ``swift`` dans le service d'Identité.
id: Ganti ``SWIFT_PASS`` dengan password yang Anda pilih untuk user ``swift`` dalam pelayanan Identity.
