Repository: 25hours/openstack-manuals
Catalog: doc/install-guide/source/locale/*/LC_MESSAGES/install-guide.po
Languages: de, fr, id

source: Create a database `instance <http://docs.openstack.org/user-guide/create_db.html>`_.
id: Membuat database `instance <http://docs.openstack.org/user-guide/create_db.html>` _.

source: Customize your dashboard. See section `Customize the dashboard <http://docs.openstack.org/admin-guide/common/dashboard_customizing.html>`__.
id: Sesuaikan dashboard Anda. Lihat bagian `Customize the dashboard <http://docs.openstack.org/admin-guide/common/dashboard_customizing.html>`__.

source: Description
de: Beschreibung
id: Deskripsi

source: For more information about how to download and build images, see `OpenStack Virtual Machine Image Guide <http://docs.openstack.org/image-guide/>`__. For information about how to manage images, see the `OpenStack End User Guide <http://docs.openstack.org/user-guide/common/cli_manage_images.html>`__.
id: Untuk informasi lebih lanjut tentang cara men-download dan membangun image, lihat `OpenStack Virtual Machine Image Guide <http://docs.openstack.org/image-guide/>`__. Untuk informasi tentang bagaimana mengelola images, lihat `OpenStack End User Guide <http://docs.openstack.org/user-guide/common/cli_manage_images.html>`__.

source: For more information about how to manage shares, see the `Manage shares <http://docs.openstack.org/user-guide/cli_manage_shares.html>`__ in OpenStack End User Guide.
id: Untuk informasi lebih lanjut tentang bagaimana manage share, lihat `Manage shares <http://docs.openstack.org/user-guide/cli_manage_shares.html>`__ di OpenStack End User Guide.

source: For more information about how to manage volumes, see the `Manage volumes <http://docs.openstack.org/user-guide/common/cli_manage_volumes.html>`__ in OpenStack End User Guide.
id: Untuk informasi lebih lanjut tentang bagaimana mengelola volume, lihat `Manage volumes <http://docs.openstack.org/user-guide/common/cli_manage_volumes.html>`__ di OpenStack End User Guide.

source: If your instance does not launch or seem to work as you expect, see the `Instance Boot Failures <http://docs.openstack.org/ops-guide/ops_maintenance_compute.html#instances>`__ section in OpenStack Operations Guide for more information or use one of the :doc:`many other options <common/app_support>` to seek assistance. We want your first installation to work!
id: Jika misalnya Anda tidak memulai atau tampaknya bekerja seperti yang Anda harapkan, melihat bagian `Instance Boot Failures <http://docs.openstack.org/ops-guide/ops_maintenance_compute.html#instances>`__ di Panduan OpenStack Operasi untuk lebih informasi atau menggunakan salah satu :doc:`many other options <common/app_support>` untuk mencari bantuan. Kami ingin instalasi pertama Anda untuk bekerja!

source: Service
de: Dienst
id: Layanan

source: Set up session storage. See `Set up session storage for the dashboard <http://docs.openstack.org/admin-guide/dashboard_sessions.html>`__.
id: Atur penyimpanan sesi. Lihat `Set up session storage for the dashboard <http://docs.openstack.org/admin-guide/dashboard_sessions.html>`__.

source: This section creates the necessary virtual networks to support launching instances. Networking option 1 includes one provider (external) network with one instance that uses it. Networking option 2 includes one provider network with one instance that uses it and one self-service (private) network with one instance that uses it. The instructions in this section use command-line interface (CLI) tools on the controller node. For more information on the CLI tools, see the `OpenStack End User Guide <http://docs.openstack.org/user-guide/cli_launch_instances.html>`__. To use the dashboard, see the `OpenStack End User Guide <http://docs.openstack.org/user-guide/dashboard.html>`__.
id: Bagian ini menciptakan jaringan virtual yang diperlukan untuk mendukung peluncuran instance. Jaringan opsi 1 mencakup satu penyedia jaringan (eksternal) dengan satu instance yang menggunakan itu. Jaringan opsi 2 mencakup satu jaringan penyedia dengan satu instance yang menggunakan itu dan satu self-layanan jaringan (swasta) dengan satu instance yang menggunakan itu. Petunjuk di bagian ini menggunakan antarmuka baris perintah (CLI) alat pada kontroler simpul. Untuk informasi lebih lanjut tentang alat CLI, lihat `OpenStack End User Guide <http://docs.openstack.org/user-guide/cli_launch_instances.html>`__. Untuk menggunakan dasbor, lihat `OpenStack End User Guide <http://docs.openstack.org/user-guide/dashboard.html>`__.

source: Network Time Protocol (NTP)
de: Network Time Protokoll (NTP)

source: Orchestration
de: Orchestrierung
