Repository: 25hours/openstack-manuals
Catalog: doc/install-guide/source/locale/*/LC_MESSAGES/install-guide.po
Languages: de, fr, id

source: In the ``[ml2]`` section, enable the Linux bridge and layer-2 population mechanisms:
de: Aktivieren Sie Linux Bridge and Layer-2 Bestückungsmechanismen in der ``[ml2]`` Sektion:
fr: Dans la section ``[ml2]``, activer Linux bridge et les mécanismes de population de niveau-2:
id: Dalam bagian ``[ml2]``, mengaktifkan Linux bridge and layer-2 population mechanisms:

source: In the ``[ml2]`` section, enable the Linux bridge mechanism:
de: Aktivieren Sie den Linux-Bridge-Mechanismus im Abschnitt ``[ml2]``:
fr: Dans la section ``[ml2]``, activer le mécanisme Linux bridge:
id: Dalam bagian `` [ML2] ``, mengaktifkan mekanisme jembatan Linux:

source: In the ``[ml2]`` section, enable the port security extension driver:
de: Aktivieren Sie den Treiber für die Port-Sicherheits-Erweiterung im Abschnitt ``[ml2]``:
fr: Dans la section ``[ml2]``, activer le driver d'extension de sécurité des ports:
id: Dalam bagian ``[ML2] ``, mengaktifkan 'port security extension driver':

source: In the ``[ml2_type_flat]`` section, configure the provider virtual network as a flat network:
de: Konfigurieren Sie das Anbieternetzwerk als flaches Netzwerk in der ``[ml2_type_flat]`` Sektion:
fr: Dans la section ``[ml2_type_flat]``, configurer le réseau virtuel fournisseur comme étant un réseau plat:
id: Dalam bagian `` [ml2_type_flat] ``, mengkonfigurasi jaringan virtual provider sebagai jaringan datar:

source: In the ``[ml2_type_vxlan]`` section, configure the VXLAN network identifier range for self-service networks:
de: Konfigurieren Sie den Bereich der VXLAN Netzwerk Identifizierer für self-service Netzwerke in der ``[ml2_type_vxlan]`` Sektion:
fr: Dans la section ``[ml2_type_vxlan]``, configurer la plage d'identifiants de réseaux VXLAN pour les réseaux self-services:
id: Dalam bagian ``[ml2_type_vxlan]``, mengkonfigurasi jaringan VXLAN identifier range untuk jaringan self-service:

source: In the ``[mysqld]`` section, set the ``bind-address`` key to the management IP address of the controller node to enable access by other nodes via the management network:
de: Ändern Sie den Wert ``bind-address`` in der Sektion ``[mysqld]`` zur Management-IP-Adresse des Controller-Knotens, um anderen Knoten den Zugriff über das Managementnetzwerk zu ermöglichen:
fr: Dans la section ``[mysqld]``, renseigner la clé ``bind-address`` avec l'adresse IP de management du nœud contrôleur pour permettre l'accès par les autres nœuds via le réseau de management:
id: Dalam bagian ``[mysqld] ``, aturlah key ``bind-address`` ke alamat IP manajemen dari controller node untuk mengaktifkan akses oleh node lain melalui jaringan manajemen:

source: In the ``[mysqld]`` section, set the following keys to enable useful options and the UTF-8 character set:
de: Setzen Sie folgende Werte in der Sektion ``[mysqld]``, um hilfreiche Optionen und den UTF-8-Zeichensatz zu aktivieren:
fr: Dans la section ``[mysqld]``, définir les clés suivantes pour activer des options utiles et le jeu de caractères UTF-8:
id: Dalam bagian ``[mysqld] ``, aturlah key berikut untuk mengaktifkan pilihan yang berguna dan atur karakter UTF-8:

source: In the ``[neutron]`` section, configure access parameters, enable the metadata proxy, and configure the secret:
de: Konfigurieren Sie die Anmeldeparameter in der Sektion ``[neutron]``, aktivieren Sie den Metadatenproxy und konfigurieren Sie das Geheimwort:
fr: Dans la section ``[neutron]``, configurer les paramètres d'accès, activer le proxy metadata, et configurer le secret:
id: Dalam bagian ``[neutron] ``, mengkonfigurasi parameter akses, mengaktifkan proxy metadata, dan mengkonfigurasi rahasia:

source: In the ``[neutron]`` section, configure access parameters:
de: Konfigurieren Sie die Anmeldeparameter in der Sektion ``[neutron]``:
fr: Dans la section ``[neutron]``, configurer les paramètres d'accès:
id: Dalam bagian ``[neutron] ``, mengkonfigurasi parameter akses:

source: In the ``[neutron]``, ``[nova]``, and ``[cinder]`` sections, enable authentication for those services:
de: Aktivieren Sie in den Abschnitten ``[neutron]``, ``[nova]``, und ``[cinder]`` die Authentifizierung für diese Dienste:
fr: Dans les sections ``[neutron]``, ``[nova]``, et ``[cinder]``, activer l'authentification pour ces services:
id: Dalam bagian ``[neutron]``, ``[nova]``, dan ``[cinder]``, aktifkan otentikasi untuk layanan tersebut:

source: In the ``[oslo_concurrency]`` section, configure the lock path:
de: Konfigurieren Sie den Sperrpfad in der Sektion ``[oslo_concurrency]``:
fr: Dans la section ``[oslo_concurrency]``, configurer le chemin du verrou:
id: Dalam bagian ``[oslo concurrency] ``, konfigurasi lock path:

source: In the ``[oslo_messaging_notifications]`` section, configure notifications:
de: Konfigurieren Sie Benachrichtigungen im Abschnitt ``[oslo_messaging_notifications]``:
fr: Dans la section ``[oslo_messaging_notifications]`` , configurer les notifications:
id: Dalam bagian '[oslo_messaging_notifications]' , konfigur pemberitahuan:

source: In the ``[pipeline:main]`` section, add ``ceilometer``:
de: Fügen Sie ``ceilometer`` in der Sektion ``[pipeline:main]`` hinzu:
fr: Dans la section ``[pipeline:main]`` , ajouter ``ceilometer``:
id: Dalam bagian ``[pipa: main] ``, tambahkan ``ceilometer``:

source: In the ``[pipeline:main]`` section, enable the appropriate modules:
fr: Dans la section ``[pipeline:main]``, activer les modules appropriés:
id: Dalam bagian ``[pipeline:main]``, mengaktifkan modul yang tepat:

source: In the ``[pipeline:main]`` section, remove the ``tempurl`` and ``tempauth`` modules and add the ``authtoken`` and ``keystoneauth`` modules:
fr: Dans la section ``[pipeline:main]``, supprimer les modules ``tempurl`` et ``tempauth`` et ajouter les modules ``authtoken`` et ``keystoneauth``:
id: Dalam bagian ``[pipeline:main]``, hapus `` tempurl`` dan `` modul tempauth`` dan tambahkan modul ``authtoken`` dan ``keystoneauth``

source: In the ``[securitygroup]`` section, enable :term:`ipset` to increase efficiency of security group rules:
de: Aktivieren Sie :term:`ipset` im Abschnitt``[securitygroup]`` zur Effizienzsteigerung der Sicherheitsgruppenregeln:
fr: Dans la section ``[securitygroup]``, activer :term:`ipset` pour augmenter l'efficacité des règles des groupes de sécurité:
id: Dalam bagian ``[securitygroup] ``, mengaktifkan :term:`ipset` to increase efficiency of security group rules:

source: In the ``[securitygroup]`` section, enable security groups and configure the Linux bridge :term:`iptables` firewall driver:
de: Aktivieren Sie Sicherheitsgruppen und konfigurieren Sie den Linuxbridge :term:`iptables` Firewall-Treiber in der ``[securitygroup]`` Sektion:
fr: Dans la section ``[securitygroup]``, activer les groupes de sécurité et configurer le driver firewall Linux bridge :term:`iptables`:
id: Dalam bagian ``[securitygroup]``, kelompok keamanan diaktifkan dan mengkonfigurasi Linux bridge :term:`iptables` firewall driver:

source: In the ``[service_credentials]`` section, configure service credentials:
de: Konfigurieren Sie die Dienstanmeldeinformationen in der Sektion ``[service_credentials]``:
fr: Dans la section ``[service_credentials]``, configurer les crédentiels du service :
id: Dalam bagian ``[service_credentials]``, konfigur kredensial layanan:

source: In the ``[storage-policy:0]`` section, configure the default storage policy:
fr: Dans la section ``[storage-policy:0]``, configurer la police de stockage par défaut:
id: Dalam bagian ``[storage-kebijakan: 0] ``, mengkonfigurasi kebijakan penyimpanan default:

source: In the ``[swift-hash]`` section, configure the hash path prefix and suffix for your environment.
fr: Dans la section ``[swift-hash]``, configurer le préfixe et le suffixe du chemin hash pour votre environment.
id: Dalam bagian ``[swift-hash] ``, mengkonfigurasi hash path prefix and suffix untuk lingkungan Anda.

source: In the ``[token]`` section, configure the Fernet token provider:
de: Konfigurieren Sie den Fernet-Token-Anbieter im Abschnitt ``[token]``:
fr: Dans la section ``[token]``, configurer le fournisseur de token Fernet:
id: Dalam bagian ``[token] ``, konfigurasi penyedia tanda Fernet:

source: In the ``[vnc]`` section, configure the VNC proxy to use the management interface IP address of the controller node:
fr: Dans la section ``[vnc]``, configurer le proxy VNC pour utiliser l'adresse IP de l'interface de management du nœud contrôleur:
id: Dalam bagian ``[vnc] ``, mengkonfigurasi proxy VNC menggunakan manajemen antarmuka alamat IP dari controller node:

source: In the ``[vnc]`` section, enable and configure remote console access:
de: Aktivieren und konfigurieren Sie den Fernzugriff auf die Konsole in der ``[vnc]`` Sektion:
fr: Dans la section ``[vnc]``, activer et configurer l'accès à la console distante:
id: Dalam bagian `` [vnc] ``, mengaktifkan dan mengkonfigurasi akses remote konsol:

source: In the ``[vxlan]`` section, disable VXLAN overlay networks:
de: Deaktivieren Sie VXLAN overlay Netzwerke in der ``[vxlan]`` Sektion:
fr: Dans la section ``[vxlan]``, désactiver la superposition de réseaux VXLAN:
id: Dalam bagian ``[vxlan] ``, disable VXLAN overlay networks:

source: In the ``[vxlan]`` section, enable VXLAN overlay networks, configure the IP address of the physical network interface that handles overlay networks, and enable layer-2 population:
de: Aktivieren Sie VXLAN Overlay Netzwerke, konfigurieren Sie die IP-Adresse des physikalischen Netzwerkinterfaces, dass das Overlay Netzwerk verwaltet und aktivieren Sie Layer-2 Population in der ``[vxlan]`` Sektion.
fr: Dans la section ``[vxlan]``, activer la superposition de réseaux VXLAN, configurer l'adresse IP de l'interface réseau physique qui gère les réseaux superposés, et activer la population de niveau-2:
id: Dalam bagian ``[vxlan] ``, aktifkan jaringan overlay VXLAN, mengkonfigurasi alamat IP dari interface jaringan fisik yang menangani jaringan overlay, dan aktifkan lapisan-2 populasi:

source: In the ``devices`` section, add a filter that accepts the ``/dev/sdb`` and ``/dev/sdc`` devices and rejects all other devices:
de: Fügen Sie in der Sektion ``devices`` einen Filter hinzu, der die Geräte ``/dev/sdb`` und ``/dev/sdc`` akzeptiert und alle anderen Geräte abweist.
fr: Dans la section ``devices``, ajouter un filtre qui accepte les devices ``/dev/sdb`` et ``/dev/sdc`` et rejette tous les autres devices:
id: Dalam bagian ``devices``, tambahkan filter yang menerima device ``/dev/sdb`` dan ``/dev/sdc`` dan menolak semua devices lain:

source: In the ``devices`` section, add a filter that accepts the ``/dev/sdb`` device and rejects all other devices:
de: Fügen Sie in der Sektion ``devices`` einen Filter hinzu, der das Gerät ``/dev/sdb`` akzeptiert und alle andere Geräte abweist.
fr: Dans la section ``devices``, ajouter un filtre qui accepte le device ``/dev/sdb`` et rejette tous les autres devices:
id: Dalam bagian ``devices``, tambahkan filter yang menerima perangkat ``/dev/sdb`` dan menolak semua perangkat lain:

source: In the provider networks architecture, all instances attach directly to the provider network. In the self-service (private) networks architecture, instances can attach to a self-service or provider network. Self-service networks can reside entirely within OpenStack or provide some level of external network access using :term:`NAT` through the provider network.
de: In der Anbieternetzwerk-Architektur liegen alle Instanzen im Anbieternetzwerk. In der (privaten) Self-Service-Netzwerkarchitektur können Instanzen einem Self-Service-Netzwerk oder einem Anbieternetzwerk hinzugefügt werden. Self-Service-Netzwerke können entweder vollständig innerhalb von OpenStack liegen oder ein bestimmtes Level an externem Netzwerkzugriff durch das Anbieternetzwerk mit Hilfe von :term:`NAT` zur Verfügung stellen.
fr: Dans une architecture réseaux fournisseur, toutes les instances sont directement attachées au réseau fournisseur. Dans une architecture réseaux self-service (privés), les instances peuvent s'attacher à un réseau self-service ou fournisseur. Les réseaux self-service peuvent résider entièrement à l'intérieur du périmètre OpenStack ou fournir un certain niveau d'accès au réseau externe en utilisant le :term:`NAT` via le réseau fournisseur.
id: Dalam arsitektur jaringan penyedia, semua instance terhubung langsung ke jaringan provider. Di arsitektur jaringan swalayan (private), instance dapat terhubung ke swalayan atau jaringan operator. Jaringan swalayan dapat berada sepenuhnya dalam OpenStack atau memberikan beberapa tingkat akses jaringan eksternal menggunakan :term:`NAT` melalui jaringan provider.

source: In typical deployments, you should create an instance from an image that supports network file systems such as NFS/CIFS to evaluate the Shared File Systems service. This guide should use the CirrOS image for instances to reduce resource requirements for evaluation. However, the CirrOS image lacks support for network file systems. For evaluation of the Shared File Systems service, this guide creates a regular instance using the ``manila-share-service`` image because it supports network file systems and using the ``manila-service-flavor`` that limits resource consumption by the instance to 256 MB memory on the compute node.
fr: Dans un déploiement typique, vous devriez créer une instance à partir d'une image qui supporte les systèmes de fichiers réseau comme NFS/CIFS pour évaluer le service de Systèmes de Fichiers Partagés. Ce guide devrait utiliser l'image CirrOS pour les instances pour réduire le besoin de ressources pour l'évaluation. Néanmoins, l'image CirrOS ne supporte pas les systèmes de fichiers réseau. Pour évaluer le service de Systèmes de Fichiers Partagés, ce guide crée une instance régulière utilisant l'image ``manila-share-service`` parce qu'elle supporte les systèmes de fichiers réseau et en utilisant le gabarit ``manila-service-flavor`` qui limite la consommation de ressources par l'instance à 256 Mo de mémoire sur le nœud compute.
id: Dalam pengerahan tipikal, Anda harus membuat sebuah instance dari sebuah image yang mendukung sistem file jaringan seperti NFS / CIFS untuk mengevaluasi layanan Shared File Systems. Panduan ini harus menggunakan image CirrOS instance untuk mengurangi kebutuhan sumber daya evaluasi. Namun, image CirrOS kekurangan dukungan untuk sistem file jaringan. Untuk evaluasi layanan Shared File Systems, panduan ini menciptakan instance yang biasa menggunakan image ``manila-share-service`` karena mendukung sistem file jaringan dan menggunakan ``manila-service-flavor`` yang membatasi konsumsi sumber daya oleh instance sampai 256 MB memori pada node komputasi.

source: Increase security using methods such as firewalls, encryption, and service policies.
fr: Accroitre la sécurité en utilisant des méthodes comme les firewalls, le chiffrement, et les politiques de service.
id: Meningkatkan keamanan menggunakan metode seperti firewall, enkripsi, dan kebijakan pelayanan.

source: Initialize Fernet keys:
de: Initialisieren Sie Fernet-Schlüssel:
fr: Initialiser les clés Fernet:
id: Inisialisasi key Fernet:

source: Install LVM and NFS server packages:
fr: Installer les packages LVM et serveur NFS:
id: Menginstal paket server yang LVM dan NFS:

source: Install ``wget`` if your distribution does not include it.
de: Installieren Sie ``wget`` wenn Ihre Distribution es nicht schon enthält.
fr: Installer ``wget`` si votre distribution ne l'inclut pas.
id: Instal ``wget`` jika distribusi Anda tidak memasukkannya.

source: Install and configure
de: installiere und konfiguriere
fr: Installer et configurer
id: Installasi dan konfigurasi

source: Install and configure a compute node
de: Compute-Node installieren und konfigurieren
fr: Installer et configurer un nœud compute
id: Menginstal dan mengkonfigurasi node komputasi

source: Install and configure a share node
fr: Installer et configurer un nœud de partage
id: Menginstal dan mengkonfigurasi share node

source: Install and configure a storage node
de: Installieren und Konfigurieren eines Speicherknotens
fr: Installer et configurer un nœud de stockage
id: Instalasi dan konfigurasi storage node

source: Install and configure components
de: Installieren und konfigurieren von Komponenten
fr: Installer et configurer les composants
id: Instal dan konfigurasi komponen

source: Install and configure compute node
de: Compute-Node installieren und konfigurieren
fr: Installer et configurer un nœud compute
id: Menginstal dan mengkonfigurasi compute node

source: Install and configure controller node
de: Controller Node installieren und konfigurieren
fr: Installer et configurer le nœud contrôleur
id: Menginstal dan mengkonfigurasi controller node

source: Install and configure the Networking components
de: Installieren und konfigurieren Sie die Netzwerkkomponenten
fr: Installer et configurer les composants Réseau
id: Menginstal dan mengkonfigurasi komponen Networking

source: Install and configure the Networking components on the *controller* node.
de: Installieren und konfigurieren der Netzwerkkomponenten auf dem *Controller* Knoten.
fr: Installer let configurer les composants réseau sur le nœud *controller*.
id: Menginstal dan mengkonfigurasi komponen Jaringan pada *controller* node.

source: Install and configure the components
de: Installieren und konfigurieren Sie die Komponenten
fr: Installer et configurer les composants
id: Instal dan konfigurasi komponen

source: Install and configure the controller node
fr: Installer et configurer le nœud contrôleur.
id: Menginstal dan mengkonfigurasi controller node

source: Install and configure the storage nodes
fr: Installer et configurer les nœuds de stockage
id: Menginstal dan mengkonfigurasi node penyimpanan

source: Install components
de: Komponenten installieren
fr: Installer les composants
id: Installah komponen

source: Install the LVM packages:
de: Installieren Sie die LVM-Pakete:
fr: Installer les packages LVM:
id: Instal paket LVM:

source: Install the MongoDB package:
de: Installieren Sie das Paket MongoDB:
fr: Installer le package MongoDB:
id: Installs paket MongoDB:

source: Install the MongoDB packages:
de: Installieren Sie die MongoDB-Pakete:
fr: Installer les packages MongoDB:
id: Instal paket MongoDB:

source: Install the Networking service components:
de: Installieren Sie die Netzwerkdienst-Komponenten:
fr: Installer les composants du service Réseau:
id: Menginstal komponen layanan Networking:

source: Install the OpenStack client:
de: Installieren Sie den OpenStack-Client:
fr: Installer le client OpenStack:
id: Menginstal klien OpenStack:

source: Install the components
de: Komponenten installieren
fr: Installer les composants
id: Menginstal komponen

source: Install the package:
de: Installieren Sie das Paket:
fr: Installer le package:
id: Install paket:

source: Install the packages:
de: Installieren Sie die Pakete:
fr: Installer les paquets :
id: Instal paket:

source: Install the supporting utility packages:
de: Installieren Sie die unterstützenden Werkzeugpakete:
fr: Installer les packages des fonctionnalités support:
id: Instal paket utilitas pendukung:

source: Keep these values secret and do not change or lose them.
fr: Garder ces valeurs secrètes et ne pas les modifier ou les perdre.
id: Jaga nilai-nilai ini rahasia dan tidak mengubah atau kehilangan mereka.

source: Later on, the package will configure the below directive with the value you entered:
de: Anschließend wird das Paket die unten stehende Anweisung mit dem eingegeben Wert konfigurieren:
fr: Plus tard, le package va configurer la directive suivante avec les valeurs saisies:
id: Kemudian, paket akan mengkonfigurasi 'below directive' dengan nilai yang Anda masukkan:

source: Later you can use the following command to install a package:
de: Anschließend können Sie folgenden Befehl verwenden, um ein Paket zu installieren:
fr: Ensuite, vous pouvez utiliser la commande suivante pour installer un package:
id: Kemudian Anda dapat menggunakan command berikut untuk menginstal paket:

source: Launch an instance
de: Starten Sie eine Instanz:
fr: Lancer une instance
id: Meluncurkan sebuah instance

source: Launch an instance of the service image
de: Starten Sie einen Instanz des Dienst-Abbildes
fr: Lancer une instance de l'image de service
id: Meluncurkan sebuah instance dari image pelayanan

source: Launch an instance on the provider network
de: Starten einer Instanz im Anbieternetzwerk
fr: Lancer une instance sur le réseau fournisseur
id: Meluncurkan sebuah instance dari jaringan operator

source: Launch an instance on the self-service network
de: Start einer Instanz im self-service Netzwerk
fr: Lancer une instance sur le réseau self-service
id: Meluncurkan sebuah instance pada jaringan self-service

source: Launch an instance using the ``manila-service-image`` and ``manila-service-flavor``.
de: Starten einer Instanz unter Verwendung von ``manila-service-image`` und ``manila-service-flavor``.
fr: Lancer une instance utilisant l'image ``manila-service-image`` et le gabarit ``manila-service-flavor``.
id: Meluncurkan sebuah instance menggunakan ``manila-service-image`` dan ``manila-service-flavor``.

source: Launch the instance
de: Starten Sie die Instanz
fr: Lancer l'instance
id: Luncurkan instance

source: Launch the instance:
de: Starten Sie die Instanz:
fr: Lancer l'instance:
id: Luncurkan instance

source: List agents to verify successful launch of the neutron agents:
de: Lassen Sie die Agenten anzeigen um sicherzustellen, dass die Neutron-Agenten erfolgreich gestartet wurden:
fr: Lister les agents pour vérifier le bon lancement des agents neutron:
id: Daftar agen untuk memverifikasi sukses peluncuran agen neutron:

source: List available flavors:
de: Verfügbare Varianten auflisten:
fr: Lister les gabarits disponibles:
id: Daftar rasa yang tersedia:

source: List available images:
de: Verfügbare Images auflisten:
fr: Lister les images disponible:
id: Daftar images yang tersedia:

source: List available meters again to validate detection of the image download:
de: Erneut verfügbare Zähler anzeigen lassen um zu prüfen, ob der Download des Abbildes festgestellt wurde:
fr: Lister à nouveau les compteurs disponibles pour vérifier la détection du téléchargement de l'image:
id: Daftarlah meter yang tersedia lagi untuk memvalidasi deteksi download image:

source: List available meters:
de: Verfügbare Zähler anzeigen:
fr: Lister les compteurs disponibles:
id: Daftarlah meter tersedia:

source: List available networks to obtain the network and subnet ID for the ``selfservice`` network:
fr: Lister les réseaux disponibles pour obtenir les ID de réseau et de sous-réseau du réseau ``selfservice``:
id: Daftar jaringan yang tersedia untuk mendapatkan jaringan dan subnet ID untuk jaringan ``selfservice``:

source: List available networks:
de: Verfügbare Netzwerke auflisten:
fr: Lister les réseaux disponibles:
id: Daftar jaringan yang tersedia:

source: List available security groups:
de: Verfügbare Sicherheitsgruppen auflisten:
fr: Lister les groupes de sécurité disponibles:
id: Daftar security groupyang tersedia:

source: List files in the ``container1`` container:
de: Lassen Sie alle Dateien im Container ``container1`` anzeigen:
fr: Lister les fichiers dans le conteneur ``container1``:
id: Dafter files dalam container ``container1``:

source: List loaded extensions to verify successful launch of the ``neutron-server`` process:
de: Lassen Sie aktive Erweiterungen anzeigen um sicherzustellen, dass der Prozess ``neutron-server`` erfolgreich gestartet wurde:
fr: Lister les extensions chargées pour vérifier le bon démarrage du processus ``neutron-server``:
id: Daftar ekstensi yang dimuat untuk memverifikasi sukses peluncuran proses ``neutron-server``:
