Repository: 25hours/openstack-manuals
Catalog: doc/install-guide/source/locale/*/LC_MESSAGES/install-guide.po
Languages: de, fr, id

source: The previous section used a combination of environment variables and command options to interact with the Identity service via the ``openstack`` client. To increase efficiency of client operations, OpenStack supports simple client environment scripts also known as OpenRC files. These scripts typically contain common options for all clients, but also support unique options. For more information, see the `OpenStack End User Guide <http://docs.openstack.org/user-guide/common/ cli_set_environment_variables_using_openstack_rc.html>`__.
de: Im vorherigen Abschnitt wurde eine Kombination aus Umgebungsvariablen und Befehlsoptionen verwendet, um über den ``openstack``-Client mit dem Identitätsdienst zu interagieren. Um die Effizienz von Client-Operationen zu erhöhen, unterstützt OpenStack Client-Umgebungsskripte, auch bekannt als OpenRC-Dateien. Diese Skripte enthalten üblicherweise allgemeine Optionen für alle Clients, unterstützen aber auch einmalige Optionen. Schauen Sie in den `OpenStack End User Guide <http://docs.openstack.org/user-guide/common/ cli_set_environment_variables_using_openstack_rc.html>`__ für weitere Informationen.
fr: La section précédente utilisait une combinaison de variables d'environnement et d'options de commande pour interagir avec le service d'Identité via le client ``openstack``. Pour faciliter les opérations client, OpenStack supporte des scripts d'environnement client simples également appelés fichiers OpenRC. Ces scripts contiennent généralement des options communes pour tous les clients, mais supportent aussi des options uniques. Pour plus d'informations, voir le `Guide de l'Utilisateur Final OpenStack <http://docs.openstack.org/user-guide/common/ cli_set_environment_variables_using_openstack_rc.html>`__.
id: Bagian sebelumnya menggunakan kombinasi variabel lingkungan dan pilihan command untuk berinteraksi dengan layanan Identity melalui klien ``openstack``. Untuk meningkatkan efisiensi operasi klien, OpenStack mendukung skrip lingkungan klien sederhana juga dikenal sebagai file OpenRC. Script ini biasanya berisi pilihan umum untuk semua klien, tetapi juga mendukung pilihan yang unik. Untuk informasi lebih lanjut, lihat `OpenStack End User Guide <http://docs.openstack.org/user-guide/common/ cli_set_environment_variables_using_openstack_rc.html>`__.

source: The provider interface uses a special configuration without an IP address assigned to it. Configure the second interface as the provider interface:
de: Die Anbieterschnittstelle nutzt eine besondere Konfiguration ohne eine zugewiesene IP-Adresse. Konfigurieren Sie die zweite Schnittstelle als Anbieterschnittstelle:
fr: L'interface fournisseur utilise une configuration spéciale sans adresse IP assignée. Configurer la seconde interface en tant qu'interface fournisseur.
id: Interface provider menggunakan konfigurasi khusus tanpa alamat IP yang ditugaskan untuk itu. Mengkonfigurasi interface kedua sebagai interface provider:

source: The provider network must include the ``router:external`` option to enable self-service routers to use it for connectivity to external networks such as the Internet. The ``admin`` or other privileged user must include this option during network creation or add it later. In this case, we can add it to the existing ``provider`` provider network.
de: Das Anbieternetzwerk muss die ``router:external`` Option beinhalten, damit self-service Router eine Verbindung zu externen Netzwerken wie z.B. dem Internet herstellen können. Der ``admin`` oder ein anderer privilegierter Benutzer muss diese Option bei der Netzwerkerstellung oder später hinzufügen. In diesem Fall können wir das vorhandene ``provider`` Anbieternetzwerk hinzufügen.
fr: Le réseau fournisseur doit inclure l'option ``router: external`` pour permettre aux routeurs self-services de les utiliser pour se connecter aux réseaux externes comme internet. L'utilisateur ``admin`` ou autre utilisateur à privilèges doit inclure cette option lors de la création du réseau ou l'ajouter plus tard. Dans ce cas, on peut l'ajouter au réseau fournisseur ``fournisseur`` existant.
id: Jaringan provider harus menyertakan opsi ``router:external`` untuk mengaktifkan router self-service menggunakannya untuk konektivitas ke jaringan eksternal seperti Internet. The `` admin`` atau user istimewa lainnya harus menyertakan opsi ini selama pembuatan jaringan atau menambahkannya nanti. Dalam hal ini, kita dapat menambahkannya ke jaringan provider ``provider`` yang ada.

source: The provider network uses 203.0.113.0/24 with a gateway on 203.0.113.1. A DHCP server assigns each instance an IP address from 203.0.113.101 to 203.0.113.250. All instances use 8.8.4.4 as a DNS resolver.
de: Das Anbieternetzwerk verwendet 203.0.113.0/24 mit einem Gateway auf 203.0.113.1. Ein DHCP-Server weist jeder Instanz eine IP-Adresse von 203.0.113.101 bis 203.0.113.250 zu. Alle Instanzen verwenden 8.8.4.4 zur DNS-Auflösung.
fr: Le réseau fournisseur utilise 203.0.113.0/24 avec une passerelle en 203.0.113.1. Un serveur DHCP attribue à chaque instance une adresse IP entre 203.0.113.101 et 203.0.113.250. Toutes les instances utilisent 8.8.4.4 pour la résolution DNS.
id: Jaringan provider menggunakan 203.0.113.0/24 dengan gateway di 203.0.113.1. Sebuah server DHCP memberikan setiap instance alamat IP dari 203.0.113.101 sampai 203.0.113.250. Semua instance menggunakan 8.8.4.4 sebagai penyelesai DNS.

source: The provider networks option deploys the OpenStack Networking service in the simplest way possible with primarily layer-2 (bridging/switching) services and VLAN segmentation of networks. Essentially, it bridges virtual networks to physical networks and relies on physical network infrastructure for layer-3 (routing) services. Additionally, a :term:`DHCP` service provides IP address information to instances.
fr: L'option de réseaux fournisseurs déploie le service Réseau d'OpenStack de la façon la plus simple possible avec essentiellement les service de couche-2 (bridging/switching) et une segmentation des réseaux en VLAN. Principalement, il fait le lien (bridge) entre les réseaux virtuels et les réseaux physiques et s'appuie sur l'infrastructure réseau physique pour les services de couche-3 (routing). De plus, un service :term:`DHCP` fournit les informations d'adresse IP aux instances.
id: Opsi jaringan provider mengerahkan layanan OpenStack Networking dengan cara paling sederhana mungkin terutama layanan lapisan-2 (bridging / switching) dan VLAN segmentasi jaringan. Pada dasarnya, hal itu menjembatani jaringan virtual untuk jaringan fisik, dan bergantung pada infrastruktur jaringan fisik untuk lapisan-3 (routing) layanan. Selain itu, layanan :term:`DHCP` memberikan informasi alamat IP untuk instances.

source: The proxy service relies on an authentication and authorization mechanism such as the Identity service. However, unlike other services, it also offers an internal mechanism that allows it to operate without any other OpenStack services. However, for simplicity, this guide references the Identity service in :doc:`keystone`. Before you configure the Object Storage service, you must create service credentials and an API endpoint.
fr: Le service proxy se base sur un mécanisme d'authentification et d'autorisation comme le service d'Identité. Néanmoins, contrairement aux autres services, il offre également un mécanisme interne qui lui permet de fonctionner sans aucun autre service OpenStack. Toutefois, pour simplifier, ce guide référence le service d'Identité par :doc:`keystone`. Avant de configurer le service de Stockage Objet, vous devez créer des credentials de service et un endpoint API.
id: Layanan proxy bergantung pada mekanisme otentikasi dan otorisasi seperti layanan Identity. Namun, tidak seperti layanan lain, itu juga menawarkan mekanisme internal yang memungkinkan untuk beroperasi tanpa layanan OpenStack lainnya. Namun, untuk kesederhanaan, panduan ini referensi layanan Identitas di :doc: `keystone`. Sebelum Anda mengkonfigurasi layanan Object Storage, Anda harus membuat kredensial layanan dan endpoint API.

source: The self-service network uses 172.16.1.0/24 with a gateway on 172.16.1.1. A DHCP server assigns each instance an IP address from 172.16.1.2 to 172.16.1.254. All instances use 8.8.4.4 as a DNS resolver.
de: Das self-service Netzwerk verwendet 172.16.1.0/24 mit einem Gateway auf 172.16.1.1. Ein DHCP-Server weist jeder Instanz eine IP-Adresse aus dem Bereich 172.16.1.2 bis 172.16.1.254 zu. Alle Instanzen verwenden 8.8.4.4 zur DNS Namensauflösung.
fr: Le réseau self-service utilise 172.16.1.0/24 avec la passerelle sur 172.16.1.1. Un serveur DHCP attribue à chaque instance une adresse IP entre 172.16.1.2 et 172.16.1.254. Toutes les instances utilisent 8.8.4.4 pour la résolution DNS.
id: Jaringan self-service menggunakan 172.16.1.0/24 dengan gateway di 172.16.1.1. Sebuah server DHCP memberikan setiap instance alamat IP dari 172.16.1.2 sampai 172.16.1.254. Semua instance menggunakan 8.8.4.4 sebagai resolver DNS.

source: The self-service networks option augments the provider networks option with layer-3 (routing) services that enable :term:`self-service` networks using overlay segmentation methods such as :term:`VXLAN`. Essentially, it routes virtual networks to physical networks using :term:`NAT`. Additionally, this option provides the foundation for advanced services such as LBaaS and FWaaS.
fr: L'option de réseaux libres-services améliore l'option de réseaux fournisseurs avec des services de couche-3 (routing) qui permettent la création de réseaux :term:`libres-services` utilisant des techniques de segmentation overlay comme :term:`VXLAN`. Essentiellement, cela permet de router les réseaux virtuels vers les réseaux physiques via le :term:`NAT`. De plus, cette option sert de base aux services avancés comme LBaaS et FWaaS.
id: Opsi jaringan self-service menambah opsi jaringan provider dengan layanan layer-3 (routing) yang memungkinkan layanan :term:`self-service` ` menggunakan metode segmentasi overlay seperti :term:` VXLAN`. Pada dasarnya, itu me-rute jaringan maya ke jaringan fisik dengan menggunakan :term: `NAT`. Selain itu, opsi ini memberikan landasan bagi layanan canggih seperti LBaaS dan FWaaS.

source: The server component listens on all IP addresses and the proxy component only listens on the management interface IP address of the compute node. The base URL indicates the location where you can use a web browser to access remote consoles of instances on this compute node.
de: Die Serverkomponente hört auf allen IP-Adressen während die Proxykomponente nur auf der Management-IP-Adresse des Compute-Knotens hört. Die Basis-URL zeigt den Ort, wo Sie mit einem Browser Zugriff auf die Remote-Konsolen der Instanzen dieses Compute-Knotens erhalten.
fr: Le composant serveur écoute sur toutes les adresses IP et le composant proxy écoute seulement sur l'adresse IP de l'interface de management du nœud compute. L'URL de base indique l'emplacement où vous pouvez utiliser un navigateur web pour accéder aux consoles distantes des instances sur ce nœud compute.
id: Komponen server mendengarkan semua alamat IP dan komponen proxy yang hanya mendengarkan alamat IP interface manajemen pada compute node. base URL menunjukkan lokasi dimana Anda dapat menggunakan web browser untuk mengakses remote consoles instances pada compute node ini.

source: The service provisions logical volumes on this device using the :term:`LVM <Logical Volume Manager (LVM)>` driver and provides them to instances via :term:`iSCSI` transport. You can follow these instructions with minor modifications to horizontally scale your environment with additional storage nodes.
de: Der Dienst sieht logische Datenträger auf diesem Gerät vor, die den Treiber :term:`LVM <Logical Volume Manager (LVM)>` verwenden. Die Datenträger werden den Instanzen mittels :term:`iSCSI` bereitgestellt. Um die Umgebung mit zusätzlichen Storage Nodes horizontal zu skalieren, können Sie mit kleineren Anpassungen diese Anleitung befolgen.
fr: Le service provisionne des volumes logiques sur ce device en utilisant le driver :term:`LVM <Logical Volume Manager (LVM)>` et les fournit aux instances via le transport :term:`iSCSI`. Vous pouvez suivre ces instructions, à peu de choses près, pour redimensionner horizontalement votre environnement en y ajoutant de nouveaux nœuds.
id: Ketentuan layanan volume logis pada perangkat ini menggunakan driver :term: `LVM <Logical Volume Manager (LVM)>` dan menyediakan mereka untuk instance melalui transport :term: `iSCSI`. Anda dapat mengikuti petunjuk ini dengan sedikit modifikasi untuk horizontally scale lingkungan Anda dengan storage nodes tambahan.

source: The share node can support two modes, with and without the handling of share servers. The mode depends on driver support.
fr: Le noeud de partage supporte deux modes, avec ou sans gestion des serveurs de partage. Le mode dépend du support du driver.
id: Node share dapat mendukung dua mode, dengan dan tanpa penanganan share servers. Modus tergantung pada dukungan driver.

source: The smallest default flavor consumes 512 MB memory per instance. For environments with compute nodes containing less than 4 GB memory, we recommend creating the ``m1.nano`` flavor that only requires 64 MB per instance. Only use this flavor with the CirrOS image for testing purposes.
de: Die kleinste Standard-Variante benötigt 512 MB Hauptspeicher pro Instanz. Für Compute-Nodes mit weniger als 4 GB Hauptspeicher wird empfohlen, die Variante ``m1.nano`` zu erstellen, diese benötigt nur 64 MB pro Instanz. Verwenden Sie diese Variante ausschließlich für das CirrOS-Abbild zu Testzwecken.
fr: Le plus petit gabarit par défaut consomme 512 Mo de mémoire par instance. Pour des environnements avec des compute nodes comprenant moins de 4 Go de mémoire, il est recommandé de créer le gabarit ``m1.nano`` qui nécessite seulement 64 Mo par instance. A utiliser seulement avec l'image CirrOS et à des fins de test.
id: Flavor default terkecil mengkonsumsi memori 512 MB per instance. Untuk lingkungan dengan compute node yang mengandung kurang dari 4 GB memori, sebaiknya menciptakan flavor ``m1.nano`` yang hanya membutuhkan 64 MB per instance. Hanya menggunakan flavor ini dengan image CirrOS untuk tujuan pengujian.

source: The status changes from ``BUILD`` to ``ACTIVE`` when the build process successfully completes.
de: Der Status ändert sich von ``BUILD`` auf ``ACTIVE`` wenn der Bauprozess erfolgreich abgeschlossen wird.
fr: Le statut passe de ``BUILD`` à ``ACTIVE`` quand le processus de construction se termine avec sucés.
id: Status perubahan dari ``BUILD`` ke ``ACTIVE`` ketika proses pembangunan berhasil selesai.

source: The storage node runs many Object Storage services and the :command:`swift-init` command makes them easier to manage. You can ignore errors from services not running on the storage node.
fr: Le nœud de stockage fait tourner de nombreux services du Stockage Objet et la commande :command:`swift-init` permet de les contrôler plus facilement. Vous pouvez ignorer les erreurs sur les services qui ne tournent pas sur le nœud de stockage.
id: Node storage jalankan banyak layanan Object Storage dan command :command:`swift-init` membuat mereka lebih mudah untuk mengelola. Anda dapat mengabaikan kesalahan dari layanan tidak berjalan pada node penyimpanan.

source: There are two modes of installation. One using ``/horizon`` as the URL, keeping your default vhost and only adding an Alias directive: this is the default. The other mode will remove the default Apache vhost and install the dashboard on the webroot. It was the only available option before the Liberty release. If you prefer to set the Apache configuration manually, install the ``openstack-dashboard`` package instead of ``openstack-dashboard-apache``.
de: Es gibt zwei Installationsarten. Eine verwendet ``/horizon`` als URL, dabei wird der Standard-vhost beibehalten und nur eine Alias-Direktive hinzugefügt: das ist der Standard. Der andere Weg entfernt den Standard-vhost des Apache und installiert das Dashboard im Webroot. Dies war die einzig verfügbare Option vor dem Liberty-Release. Wenn Sie die Apache-Konfiguration lieber manuell vornehmen möchten, installieren Sie das Paket ``openstack-dashboard`` anstelle von ``openstack-dashboard-apache``.
fr: Il y a deux modes d'installation. Le premier utilise ``/horizon`` comme URL, garde votre vhost par défaut et ajoute seulement une directive Alias: c'est le mode par défaut. L'autre mode va supprimer le vhost Apache par défaut et installe le dashboard sur le webroot. C'était la seule option disponible avant la version Liberty. Si vous préférez définir manuellement la configuration Apache, installez le package ``openstack-dashboard`` à la place du ``openstack-dashboard-apache``.
id: Ada dua mode instalasi. Satu menggunakan ``/horizon`` sebagai URL, menjaga vhost default dan hanya menambahkan direktif Alias: ini adalah default. Modus lainnya akan menghapus default Apache vhost dan menginstal dashboard pada webroot. Ini adalah satu-satunya pilihan yang tersedia sebelum rilis Liberty. Jika Anda lebih memilih untuk mengatur konfigurasi Apache secara manual, installah paket ``openstack-dashboard`` bukan ``openstack-dashboard-apache``.

source: This chapter explains how to install and configure the Networking service (neutron) using the :ref:`provider networks <network1>` or :ref:`self-service networks <network2>` option.
de: Dieses Kapitel erklärt die Installation und Konfiguration des Netzwerkdienstes (neutron) zur Verwendung der :ref:`provider networks <network1>` oder :ref:`self-service networks <network2>` Option.
fr: Ce chapitre explique comment installer et configurer le service Réseau (neutron) en utilisant l'option :ref:`réseaux fournisseur <network1>` ou :ref:`réseaux libre-service <network2>`.
id: Bab ini menjelaskan cara menginstal dan mengkonfigurasi layanan Networking (neutron) menggunakan opsi :ref:`provider networks <network1>` atau opsi :ref:`self-service networks <network2>`.

source: This chapter omits the backup manager because it depends on the Object Storage service.
de: Dieses Kapitel überspringt den Backup-Manager, da dieser vom Objekt-Storage-Dienst abhängt.
fr: Ce chapitre omet le gestionnaire de sauvegarde car il dépend du service de Stockage Objet.
id: Bab ini menghilangkan backup manager karena tergantung pada layanan Object Storage.

source: This command provides no output.
de: Das Kommando erzeugt keine Ausgabe.
fr: Cette commande ne produit aucune sortie.
id: Command ini tidak memberikan output.

source: This command uses the password for the ``admin`` user.
de: Dieser Befehl verwendet das Passwort für den Benutzer ``admin``.
fr: Cette commande utilise le mot de passe de l'utilisateur ``admin``.
id: Command ini menggunakan password untuk user ``admin``.

source: This command uses the password for the ``demo`` user and API port 5000 which only allows regular (non-admin) access to the Identity service API.
de: Dieser Befehl verwendet das Passwort für den Benutzer ``demo`` und den API-Port 5000, dieser erlaubt nur regulären (nicht-administrativen) Zugriff auf die Identitätsdienst-API.
fr: Cette commande utilise le mot de passe de l'utilisateur ``demo`` et le port API 5000 qui autorise uniquement l'accès simple (non-admin) à l'API du service d'Identité.
id: Command ini menggunakan password untuk user ``demo`` dan API port 5000 dimana hanya memungkinkan reguler (non-admin) akses ke layanan Identity API.

source: This example architecture differs from a minimal production architecture as follows:
fr: Cet exemple d'architecture diffère d'une architecture minimale de production par ce qui suit:
id: Contoh arsitektur ini berbeda dari arsitektur produksi minimal sebagai berikut:

source: This example deployment uses an Apache web server.
de: Diese Beispielimplementierung verwendet einen Apache Webserver.
fr: Cet exemple de déploiement utilise un serveur web Apache.
id: Contoh pengerahan ini menggunakan web server Apache.

source: This example shows you how to update a MySQL 5.6 datastore:
fr: Cet exemple vous montre comment upgrader un datastore MySQL 5.6.
id: Contoh ini menunjukkan Anda bagaimana untuk memperbarui MySQL 5.6 datastore:

source: This guide covers step-by-step deployment of the following major OpenStack services using a functional example architecture suitable for new users of OpenStack with sufficient Linux experience:
fr: Ce guide couvre le déploiement pas à pas des services OpenStack principaux suivants, en utilisant un exemple d'architecture fonctionnelle adaptée à des nouveaux utilisateurs d'OpenStack ayant une expérience suffisante de Linux:
id: Panduan ini mencakup langkah-demi-langkah pengerahan layanan OpenStack utama berikut menggunakan arsitektur contoh fungsional cocok untuk pengguna baru OpenStack dengan pengalaman Linux yang cukup:

source: This guide describes how to configure the Shared File Systems service to use the ``generic`` driver with the driver handles share server mode (DHSS) enabled. This mode requires Compute (nova), Networking (neutron) and Block storage (cinder) services for managing share servers. The information used for creating share servers is configured as share networks. Generic driver with DHSS enabled also requires network to be attached to a public router.
fr: Ce guide décrit comment configurer le service de Systèmes de Fichiers Partagés pour utiliser le driver ``generic`` avec le mode driver handles share server (DHSS) activé. Ce mode nécessite les services Compute (nova), Réseau (neutron) et Stockage par Bloc (cinder) pour gérer les serveurs de partage. L'information utilisée pour créer les serveurs de partage est configurée comme réseaux de partage. Le driver générique avec DHSS activé nécessite également que le réseau soit attaché à un routeur public.
id: Panduan ini menjelaskan cara mengkonfigurasi layanan Shared File Systems untuk menggunakan driver ``generic`` dengan driver menangani share server mode (DHSS) yang diaktifkan. Mode ini membutuhkan layanan Compute (nova), Networking (neutron) dan Block storage (cinder) untuk mengelola share servers. Informasi yang digunakan untuk membuat server share dikonfigurasi sebagai share networks. Driver generik dengan DHSS diaktifkan juga membutuhkan jaringan yang harus terpasang ke router publik.

source: This guide documents OpenStack Mitaka release.
de: Dieser Leitfaden dokumentiert das OpenStack Mitaka-Release.
fr: Ce guide documente la release Mitaka d'OpenStack.
id: Ini dokumen panduan OpenStack Mitaka rilis.

source: This guide uses a service project that contains a unique user for each service that you add to your environment. Create the ``service`` project:
de: Dieser Leitfaden verwendet ein Dienstprojekt, das für jeden hinzugefügten Dienst einen eigenen Benutzer anlegt. Erstellen Sie das Projekt ``service``:
fr: Ce guide utilise un projet service qui contient un utilisateur unique pour chaque service que vous ajoutez à votre environnement. Créer le projet ``service``:
id: Panduan ini menggunakan sebuah proyek layanan yang berisi user unik untuk setiap layanan yang Anda tambahkan ke lingkungan Anda. Buat provek ``service``:
