Repository: 25hours/openstack-manuals
Catalog: doc/install-guide/source/locale/*/LC_MESSAGES/install-guide.po
Languages: de, fr, id

source: Configure ``user`` as the default role for users that you create via the dashboard:
de: Konfigurieren Sie ``user`` als Standardrolle für Benutzer, die über das Dashboard angelegt werden:
fr: Configurer ``user`` comme étant le rôle par défaut pour les utilisateurs créés via le dashboard:
id: Konfigurasi ``user`` sebagai peran default untuk user yang Anda buat melalui dashboard:

source: Configure components
de: Komponenten konfigurieren
fr: Configurer les composants
id: Mengkonfigurasi komponen

source: Configure name resolution
de: Konfigurieren Sie die Namensauflösung
fr: Configurer la résolution de nom
id: Konfigurasi resolusi nama

source: Configure network interfaces
de: Konfigurieren Sie die Netzwerkschnittstellen
fr: Configurer les interfaces réseau
id: Konfigurasi interface jaringan

source: Configure networking options
de: Netzwerkoptionen konfigurieren
fr: Configurer les options réseau
id: Konfigurasikan opsi jaringan

source: Configure share server management support options
fr: Options supportées pour la gestion du serveur de partage
id: Mengkonfigurasi share server opsi dukungan manajemen

source: Configure the Apache HTTP server
de: Konfigurieren Sie den Apache HTTP-Server
fr: Configurer le serveur HTTP Apache
id: Konfigurasi server Apache HTTP

source: Configure the DHCP agent
de: Konfigurieren Sie den DHCP-Agenten
fr: Configurer l'agent DHCP
id: Mengkonfigurasi agen DHCP

source: Configure the Database service to use the ``RabbitMQ`` message broker by setting the following options in each file:
fr: Configurer le service de Base de Données pour utiliser le broker de messages ``RabbitMQ`` en définissant les options suivantes dans chaque fichier:
id: Mengkonfigurasi layanan Database untuk menggunakan broker pesan ``RabbitMQ`` dengan menetapkan opsi berikut di setiap file:

source: Configure the Identity API version:
de: Konfigurieren Sie die Identitäts-API-Version:
fr: Configurer la version d'API du service d'Identité:
id: Mengkonfigurasi versi API Identity:

source: Configure the Image service to use Telemetry
de: Konfigurieren Sie den Abbilddienst zur Verwendung des Telemetriedienstes.
fr: Configurer le service d'Image pour utiliser la Télémétrie.
id: Konfigur layanan Image untuk penggunaan Telemetry

source: Configure the Linux bridge agent
de: Konfigurieren Sie den Linux-Bridge-Agent
fr: Configurer l'agent Linux bridge
id: Mengkonfigurasi Linux bridge agent

source: Configure the Modular Layer 2 (ML2) plug-in
de: Konfigurieren des Modular Layer 2 (ML2) Plug-ins
fr: Configurer le plugin Modular Layer 2 (ML2)
id: Mengkonfigurasi Modular Layer 2 (ML2) plug-in

source: Configure the Networking components on a *compute* node.
de: Konfigurieren Sie die Netzwerkkomponenten auf einem *Compute*-Node.
fr: Configurer les composants réseau sur un nœud *compute*
id: Mengkonfigurasi komponen Networking pada *compute* node.

source: Configure the ``bind_ip`` key to use the management interface IP address of the controller node.
de: Konfigurieren Sie den Schlüssel ``bind_ip`` so, dass die IP-Adresse der Managementschnittstelle des Controller-Knotens verwendet wird.
fr: Configurer la clé ``bind_ip`` pour utiliser l'adresse IP de l'interface de management du nœud contrôleur.
id: Konfigurasi ``bind_ip`` key kunci menggunakan management interface IP address dari the controller node.

source: Configure the ``memcached`` session storage service:
de: Konfigurieren Sie die ``memcached`` Sitzungsspeicherung:
fr: Configurer le service de stockage de session ``memcached``:
id: Mengkonfigurasi layanan penyimpanan sesi ``memcached``:

source: Configure the authentication token:
de: Konfigurieren Sie den Authentifizierungstoken:
fr: Configurer le jeton d'authentification:
id: Mengkonfigurasi token otentikasi:

source: Configure the common component
de: Konfiguration der üblichen Komponenten
fr: Configurer les composants communs

source: Configure the dashboard to use OpenStack services on the ``controller`` node:
de: Konfigurieren Sie das Dashboard so, dass die OpenStack-Dienste auf dem Controller-Knoten herangezogen werden:
fr: Configurer le dashboard pour utiliser les services OpenStack sur le nœud `contrôleur``:
id: Konfigurasi dashboard untuk menggunakan layanan OpenStack pada ``controller`` node:

source: Configure the endpoint URL:
de: Konfigurieren Sie die Endpunkt-URL:
fr: Configurer l'URL de endpoint:
id: Mengkonfigurasi URL endpoint:

source: Configure the first interface as the management interface:
de: Konfigurieren Sie die erste Schnittstelle zur Managementschnittstelle:
fr: Configurer la première interface comme interface de management:
id: Konfigurasi interface pertama sebagai interface manajemen:

source: Configure the initial administration token:
de: Konfigurieren Sie den anfänglichen Administrations-Token:
fr: Configurer le jeton d'admonistration initial :
id: Konfigurasi token administration awal:

source: Configure the layer-3 agent
de: Konfigurieren Sie den Layer-3-Agenten
fr: Configurer l'agent layer-3

source: Configure the management interface:
de: Konfiguriere das Management Interface:
fr: Configurer l'interface de management:
id: Konfigurasi management interface: \

source: Configure the metadata agent
de: Konfigurieren Sie den Metadaten-Agenten
fr: Configurer l'agent metadata
id: Mengkonfigurasi agen metadata

source: Configure the server component
de: Konfigurieren der Serverkomponente
fr: Configurer le composant serveur
id: Mengkonfigurasi komponen server

source: Configure the web server:
de: Konfigurieren SIe den Webserver:
fr: Configurer le serveur web:
id: Konfigurasi web server:

source: Configure user access to the new share before attempting to mount it via the network:
de: Konfigurieren Sie den Benutzer-Zugriff zur neuen Freigabe bevor Sie versuchen sie über das Netzwerk zu mounten:
fr: Configurer l'accès utilisateur au nouveau partage avant d'essayer de le monter à travers le réseau:
id: Mengkonfigurasi akses user ke share baru sebelum mencoba untuk me-mount melalui jaringan:

source: Confirm upload of the image and validate attributes:
de: Bestätigen Sie das Hochladen des Abbildes und prüfen Sie die Attribute:
fr: Confirmer le chargement de l'image et valider les attributs:
id: Konfirmasi upload image dan validasi atribut:

source: Contents
de: Inhalte
fr: Contenu
id: Isi

source: Contents in the *Name/IP address* column should indicate the hostname of the controller node.
de: Die Werte in der Spalte *Name/IP address* sollten auf den Hostnamen des Controller-Knotens hindeuten.
fr: Le contenu de la colonne *Nom/Adresse IP* doit indiquer le hostname du contrôleur.
id: Isi dalam kolom *Name/IP address* harus menunjukkan hostname node kontroller.

source: Contents in the *Name/IP address* column should indicate the hostname or IP address of one or more NTP servers. Contents in the *S* column should indicate *\** for the server to which the NTP service is currently synchronized.
de: Die Werte in der Spalte *Name/IP address* sollten auf den Hostnamen oder die IP-Adresse von einem oder mehreren NTP-Servern hindeuten. Werte in der Spalte *S* sollten mit *\** anzeigen, mit welchem NTP-Dienst der Server zurzeit synchronisiert ist.
fr: Le contenu de la colonne *Nom/Adresse IP* doit indiquer le hostname ou l'adresse IP d'un ou plusieurs serveurs NTP. Le contenu de la colonne *S* doit indiquer *\** pour le serveur vers lequel le service NTP se synchronise actuellement.
id: Isi dalam kolom *Name/IP address* harus menunjukkan hostname atau IP address dari satu atau lebih server NTP. Isi dalam kolom *S* harus menunjukkan * \ ** untuk server dimana layanan NTP disinkronkan saat ini.

source: Controller
fr: Contrôleur

source: Controller Node: 1 processor, 4 GB memory, and 5 GB storage
de: Controller-Knoten: 1 Prozessor, 4 GB RAM und 5 GB Speicher
fr: Nœud Contrôleur: 1 processeur, 4 Go de mémoire, et 5 Go de stockage
id: Controller Node: 1 prosesor, memori 4 GB, dan 5 GB penyimpanan

source: Controller node
de: Controller Knoten
fr: Noeud contrôleur

source: Copy the ``account.ring.gz``, ``container.ring.gz``, and ``object.ring.gz`` files to the ``/etc/swift`` directory on each storage node and any additional nodes running the proxy service.
fr: Copier les fichiers ``account.ring.gz``, ``container.ring.gz``, et ``object.ring.gz`` dans le répertoire ``/etc/swift`` sur chaque nœud de stockage et tout nœud supplémentaire faisant tourner le service proxy.
id: Salin `` account.ring.gz``, `` container.ring.gz``, dan `` file object.ring.gz`` ke direktori ``/etc/swift`` pada setiap node penyimpanan dan setiap node tambahan menjalankan layanan proxy.

source: Copy the ``swift.conf`` file to the ``/etc/swift`` directory on each storage node and any additional nodes running the proxy service.
fr: Copier le fichier ``swift.conf`` vers le répertoire ``/etc/swift`` de chaque nœud de stockage et de tout nœud additionnel où tourne le service proxy.
id: Salin file ``swift.conf`` ke direktori ``/etc/swift`` pada setiap node penyimpanan dan setiap tambahan node menjalankan layanan proxy.

source: Create OpenStack client environment scripts
de: Erstellen Sie OpenStack-Client-Umgebungsskripte
fr: Créer les scripts d'environnement client OpenStack
id: Buat script lingkungan klien OpenStack

source: Create ``container1`` container:
fr: Créer le conteneur ``container1``:
id: Buat container ``container1``:

source: Create a 1 GB volume:
de: Erstellen Sie einen Datenträger der Größe 1 GB:
fr: Créer un volume de 1Go:
id: Membuat volume 1GB:

source: Create a :term:`floating IP address` on the provider virtual network:
de: Erzeugen Sie eine :term:`floating IP Addresse` im Anbieternetzwerk:
fr: Créer une :term:`adresse IP flottante` sur le réseau virtuel ``fournisseur``:
id: Buat :term:`floating IP address` pada jaringan virtual provider:

source: Create a NFS share using the share network:
de: Erstellen Sie eine NFS-Freigabe im Freigabe-Netzwerk:
fr: Créer un partage NFS utilisant le réseau de partage:
id: Buat share NFS menggunakan jaringan bersama:

source: Create a NFS share:
de: Erstellen einer NFS-Freigabe
fr: Créer un partage NFS:
id: Buat share NFS:

source: Create a ``cinder`` user:
de: Erstellen Sie einen Benutzer ``cinder``:
fr: Créer un utilisateur ``cinder``:
id: Buatlah user ``cinder``:

source: Create a ``manila`` user:
de: Erstellen Sie einen ``manila`` Benutzer:
fr: Créer un utilisateur ``manila``:
id: Buat user ``manila``:

source: Create a database `instance <http://docs.openstack.org/user-guide/create-db.html>`_.
fr: Créer une `instance de base de donnée <http://docs.openstack.org/user-guide/create-db.html>`_.

source: Create a datastore. You need to create a separate datastore for each type of database you want to use, for example, MySQL, MongoDB, Cassandra. This example shows you how to create a datastore for a MySQL database:
fr: Créer un datastore. Vous avez besoin d'un datastore séparé pour chaque type de base de données que vous souhaitez utiliser, par exemple, MySQL, MongoDB, Cassandra. Cet exemple vous montre comment créer un datastore pour une base de données MySQL:
id: Buat datastore. Anda perlu membuat datastore terpisah untuk setiap jenis database yang ingin Anda gunakan, misalnya, MySQL, MongoDB, Cassandra. Contoh ini menunjukkan Anda bagaimana untuk membuat datastore untuk database MySQL:

source: Create a default share type with DHSS disabled:
de: Erzeugen Sie ein Standard-Share mit aktiviertem DHSS:
fr: Créer un type de partage par défaut avec DHSS désactivé:
id: Buat tipe share default dengan DHSS dinonaktifkan:

source: Create a default share type with DHSS enabled:
fr: Créer un type de partage par défaut avec DHSS activé:
id: Membuat tipe share default dengan DHSS diaktifkan:

source: Create a domain, projects, users, and roles
de: Erstellen Sie eine Domäne, Projekte, Benutzer und Rollen
fr: Créer un domaine, des projets, des utilisateurs et des rôles
id: Membuat domain, proyek, user, dan role

source: Create a folder where the mount will be placed:
de: Erstellen Sie ein Verzeichnis, wohin gemounted werden soll:
fr: Créer un répertoire où le montage sera placé:
id: Buat folder dimana mount akan ditempatkan:

source: Create a new flavor to support the service image:
de: Erzeugen Sie eine neue Variante zur Unterstützung des Dienst-Abbildes:
fr: Sélectionner un nouveau gabarit d'instance qui supporte l'image de service:
id: Menciptakan flavor baru untuk mendukung image pelayanan:

source: Create a router
de: Erstellen eines Routers
fr: Créer un routeur
id: Buat router

source: Create a share
de: Freigabe erstellen
fr: Créer un partage
id: Buat share

source: Create a share for the Shared File Systems service option that you chose in :ref:`manila-storage`.
fr: Créer un partage pour l'option de service de Systèmes de Fichiers Partagés que vous avez choisi dans :ref:`manila-storage`.
id: Buat share untuk opsi layanan Shared File Systems yang Anda pilih di :ref: `manila-storage`.

source: Create a share network
de: Erstellen eines Freigabenetzwerks
fr: Créer un réseau de partage
id: Buat jaringan bersama

source: Create a share type
de: Erstelle Freigabetyp
fr: Créer un type de partage
id: Membuat tipe share

source: Create a stack
de: Einen Stack erstellen
fr: Créer une stack
id: Membuat stack

source: Create a stack of one CirrOS instance on the provider network:
de: Erstellen Sie einen Stack mit einer CirrOS-Instanz im Anbieter-Netzwerk:
fr: Créer une stack d'une instance CirrOS sur le réseau fournisseur:
id: Buat stack satu instance CirrOS pada jaringan penyedia:

source: Create a stack using the ``demo-template.yml`` template.
de: Erstellen Sie einen Stack anhand der Vorlage ``demo-template.yml``.
fr: Créer une stack utilisant le template ``demo-template.yml``.
id: Membuat stack menggunakan template ``demo-template.yml``.

source: Create a subnet on the network:
de: Erstellen Sie ein Subnetz für das Netzwerk:
fr: Créer un sous-réseau sur le réseau:
id: Buat subnet pada jaringan:

source: Create a template
de: Erstellen Sie eine Vorlage
fr: Créer un template
id: Membuat template

source: Create a volume
de: Erstellen Sie einen Datenträger
fr: Créer un volume
id: Membuat volume

source: Create account ring
fr: Créer l'anneau des comptes
id: Buat account ring

source: Create an administrative project, user, and role for administrative operations in your environment:
de: Erstellen Sie Administrator-Projekt, -Benutzer und -Rolle für administrative Aufgaben in Ihrer Umgebung:
fr: Créer un projet, utilisateur et rôle administrateur pour réaliser les opérations administrateur dans votre environnement:
id: Buat sebuah proyek administrasi, user, dan role untuk operasi administrasi di lingkungan Anda:

source: Create an image for the type of database you want to use, for example, MySQL, MongoDB, Cassandra.
fr: Créer une image pour le type de base de données que vous voulez utiliser, par exemple, MySQL, MongoDB, Cassandra.
id: Membuat image untuk jenis database yang ingin Anda gunakan, misalnya, MySQL, MongoDB, Cassandra.

source: Create and distribute initial rings
fr: Créer et distribuer des anneaux initiaux.
id: Membuat dan mendistribusikan initial ring

source: Create and edit the ``/etc/my.cnf.d/openstack.cnf`` file and complete the following actions:
de: Erstellen Sie die Datei ``/etc/my.cnf.d/openstack.cnf``und bearbeiten den Inhalt wie folgt:
fr: Créer et éditer le fichier ``/etc/my.cnf.d/openstack.cnf`` et effectuer les modifications suivantes:
id: Buat dan editlah file ``/etc/my.cnf.d/openstack.cnf`` dan selesaikan tindakan berikut:

source: Create and edit the ``/etc/mysql/conf.d/openstack.cnf`` file and complete the following actions:
de: Erstellen Sie die Datei ``/etc/mysql/conf.d/openstack.cnf``und bearbeiten den Inhalt wie folgt:
fr: Créer et éditer le fichier ``/etc/mysql/conf.d/openstack.cnf`` et effectuer les modifications suivantes:
id: Buat dan editlah file``/etc/mysql/conf.d/openstack.cnf`` dan selesaikan tindakan berikut:

source: Create client environment scripts for the ``admin`` and ``demo`` projects and users. Future portions of this guide reference these scripts to load appropriate credentials for client operations.
de: Erstellen Sie Client-Umgebungsskripte für die Projekte und Benutzer``admin`` und ``demo``. Im weiteren Verlauf dieses Leitfadens werden diese Skripte herangezogen, um passende Anmeldeinformationen für Client-Operationen zu laden.
fr: Créer les scripts d'environnement client pour les projets et utilisateurs ``admin`` et ``demo``. Les prochaines sections de ce guide font référence à ces scripts pour charger les credentials appropriées aux opérations clientes.
id: Membuat skrip lingkungan klien untuk ``admin`` dan proyek ``demo`` dan user. Bagian depan buku ini mengacu script untuk memuat mandat yang tepat untuk operasi client.

source: Create container ring
fr: Créer l'anneau containeur
id: Buat container ring

source: Create m1.nano flavor
de: Variante m1.nano erstellen
fr: Créer un gabarit m1.nano
id: Buat flavor m1.nano

source: Create object ring
fr: Créer l'anneau des objets
id: Buat object ring

source: Create or edit the ``/etc/rsyncd.conf`` file to contain the following:
de: Erstellen oder bearbeiten Sie die Datei ``/etc/rsyncd.conf``mit folgendem Inhalt:
fr: Créer ou éditer le fichier ``/etc/rsyncd.conf`` pour qu'il contienne ce qui suit:
id: Buat atau edit file ``/etc/rsyncd.conf`` mengandung berikut:

source: Create the Alarming service API endpoints:
de: Erstellen Sie die API-Endpunkte für den Benachrichtigungsdienst:
fr: Créer les endpoints API pour le service d'Alarme :
id: Buat 'Alarming service API endpoints':

source: Create the Block Storage service API endpoints:
de: Erstellen Sie die API-Endpunkte für Block-Storage:
fr: Créer les endpoints API du service de Stockage par Blocs:
id: Buatlah endpoint API layanan Block Storage:

source: Create the Compute service API endpoints:
fr: Créer les points de terminaison API pour le service de Compute:
id: Buat layanan Compute API endpoints:

source: Create the Database service API endpoints:
fr: Créer les endpoints API pour le service de Base de Données:
id: Buat layanan Database API endpoints:

source: Create the Identity service API endpoints:
de: Erstellen Sie die API-Endpunkte für den Identitätsdienst:
fr: Créer les endpoints API pour le service d'Identité:
id: Buat layanan Identity endpoint API:

source: Create the Image service API endpoints:
de: Erstellen Sie die API-Endpunkte für den Abbilddienst:
fr: Créer les endpoints API du service d'Image:
id: Buat layanan Image endpoint API:

source: Create the LVM physical volume ``/dev/sdb``:
de: Erstellen Sie den LVM physikalischen Datenträger ``/dev/sdb``:
fr: Créer le volume physique LVM ``/dev/sdb``:
id: Buat volume fisik LVM ``/dev/sdb``:

source: Create the LVM physical volume ``/dev/sdc``:
de: Erstellen Sie den physikalischen LVM-Datenträger ``/dev/sdc``:
fr: Créer le volume physique LVM ``/dev/sdc``:
id: Buat volume fisik LVM ``/dev/sdc``:

source: Create the LVM volume group ``cinder-volumes``:
de: Erstellen Sie die LVM Datenträgergruppe ``cinder-volumes``:
fr: Créer le groupe de volumes LVM ``cinder-volumes``:
id: Buat grup volume LVM ``cinder-volumes``:

source: Create the LVM volume group ``manila-volumes``:
de: Erstellen Sie die LVM Datenträgergruppe ``manila-volumes``:
fr: Créer le groupe de volume LVM ``manila-volumes``:
id: Buat grup volume LVM ``manila-volumes``:

source: Create the Networking service API endpoints:
de: Erstellen Sie die Netzwerk-API-Endpunkte:
fr: Créer les endpoints API pour le service réseau:
id: Buat layanan Networking endpoint API:

source: Create the Object Storage service API endpoints:
fr: Créer les endpoints du service de Stockage Objet:
id: Buat layanan Object Storage endpoints API:

source: Create the Orchestration service API endpoints:
de: Erstellen Sie die API-Endpunkte für den Orchestrierungsdienst:
fr: Créer les points de terminaison API du service d'Orchestration:
id: Buat endpoint API layanan Orchestration:

source: Create the Shared File Systems service API endpoints:
fr: Créer les endpoints API pour le service de Systèmes de Fichiers Partagés :
id: Menciptakan layanan Shared File Systems API endpoints:

source: Create the Telemetry service API endpoints:
de: API-Endpunkte für den Telemetriedienst erstellen:
fr: Créer les endpoints API pour le service de Télémétrie:
id: Buatlah endpoint API layanan Telemetry:

source: Create the ``/etc/apache2/conf.d/wsgi-keystone.conf`` file with the following content:
de: Erstellen Sie die Datei ``/etc/apache2/conf.d/wsgi-keystone.conf`` mit folgendem Inhalt:
fr: Créer le fichier ``/etc/apache2/conf.d/wsgi-keystone.conf`` avec le contenu suivant:
id: Buat file ``/etc/apache2/conf.d/wsgi-keystone.conf`` dengan isi sebagai berikut:

source: Create the ``/etc/apache2/sites-available/wsgi-keystone.conf`` file with the following content:
de: Erstellen Sie die Datei ``/etc/apache2/sites-available/wsgi-keystone.conf`` mit folgendem Inhalt:
fr: Créer le fichier ``/etc/apache2/sites-available/wsgi-keystone.conf`` avec le contenu suivant:
id: Buat file ``/etc/apache2/sites-available/wsgi-keystone.conf`` dengan isi sebagai berikut:

source: Create the ``/etc/httpd/conf.d/wsgi-keystone.conf`` file with the following content:
de: Erstellen Sie die Datei ``/etc/httpd/conf.d/wsgi-keystone.conf``mit folgendem Inhalt:
fr: Créer le fichier ``/etc/httpd/conf.d/wsgi-keystone.conf`` avec le contenu suivant:
id: Buat file ``/etc/httpd/conf.d/wsgi-keystone.conf`` dengan isi sebagai berikut:

source: Create the ``/etc/swift`` directory.
fr: Créer le répertoire ``/etc/swift``.
id: Buat direktore ```/etc/swift``.

source: Create the ``ResellerAdmin`` role:
de: Erstellen Sie die Rolle ``ResellerAdmin``:
fr: Créer le rôle ``ResellerAdmin`` :
id: Buatlah peran ``ResellerAdmin``:

source: Create the ``admin`` project and user:
de: Erstellen Sie das Projekt und den Benutzer ``admin``:
fr: Créer le projet et l'utilisateur ``admin``:
id: Buat project ``admin`` dan user:

source: Create the ``admin`` project:
de: Erstellen Sie das Projekt ``admin``:
fr: Créer le projet ``admin``:
id: Buat proyek ``admin``:

source: Create the ``admin`` role:
de: Erstellen Sie die Rolle ``admin``:
fr: Créer le rôle ``admin``:
id: Buat role ``admin``:

source: Create the ``admin`` user:
de: Erstellen Sie den Benutzer ``admin``:
fr: Créer l'utilisateur ``admin``:
id: Buat user ``admin``:

source: Create the ``aodh`` database:
de: Erstellen Sie die Datenbank ``aodh``:
fr: Créer la base de données ``aodh``:
id: Buat ``aodh`` database:

source: Create the ``aodh`` service entity:
de: Erstellen des ``aodh`` Dienstobjekts:
fr: Créer l'entité de service ``aodh``:
id: Buat entitas layanan ``aodh``:

source: Create the ``aodh`` user:
de: Erstellen des ``aodh`` Benutzers:
fr: Créer l'utilisateur ``aodh``:
id: Buat ``aodh`` user:

source: Create the ``ceilometer`` database:
de: Erstellen Sie die Datenbank ``ceilometer``:
fr: Créer la base de données ``ceilometer``:
id: Buat database ``ceilometer``:

source: Create the ``ceilometer`` service entity:
de: Dienstobjekt ``ceilometer`` erstellen:
fr: Créer l'entité de service ``ceilometer` :
id: Buatlah entitas layanan ``ceilometer``:

source: Create the ``ceilometer`` user:
de: Benutzer ``ceilometer`` erstellen:
fr: Créer l'utilisateur ``ceilometer``:
id: Buatlah user ``ceilometer``:

source: Create the ``cinder`` and ``cinderv2`` service entities:
de: Erstellen Sie die Dienstinstanzen ``cinder`` und ``cinderv2``:
fr: Créer les entités de service ``cinder`` et ``cinderv2``:
id: Buatlah entitas layanan ``cinder`` dan ``cinderv2``:

source: Create the ``cinder`` database:
de: Erstellen Sie die Datenbank ``cinder``:
fr: Créer la base de données ``cinder`` :
id: Buatlah database ``cinder``:
