Repository: 25hours/openstack-manuals
Catalog: doc/install-guide/source/locale/*/LC_MESSAGES/install-guide.po
Languages: de, fr, id

source: (Note that, although they have the same names, these files are in a different location and have different content than the similarly named files you edited earlier in this procedure.)
fr: (A noter que, bien qu'ils aient les mêmes noms, ces fichiers se trouvent à un emplacement différent et ont un contenu différent que ceux du même nom modifiés plus tôt dans cette procédure.)
id: (Perhatikan bahwa, meskipun mereka memiliki nama yang sama, file-file ini berada di lokasi yang berbeda dan memiliki konten yang berbeda dari file bernama sama Anda diedit sebelumnya dalam prosedur ini.)

source: (Optional) If you intend to use non-raw image types such as QCOW2 and VMDK, install the QEMU package:
de: (Optional) Wenn Sie beabsichtigen, keine rohen Abbildtypen wie QCOW2 und VMDK zu verwenden, installieren Sie das QEMU-Paket:
fr: (Optionnel) Si vous comptez utiliser d'autres types d'image que raw telles que QCOW2 ou VMDK, alors installez le package QEMU:
id: (Opsional) Jika Anda berniat untuk menggunakan tipe image non-raw seperti QCOW2 dan VMDK, instal paket QEMU:

source: **Example**
de: **Beispiel**
fr: **Exemple**

source: **Hardware requirements**
fr: **Prérequis Matériels**

source: **Higher-level services**
fr: **Services de plus haut niveau**

source: **Networking Option 1: Provider networks - Connectivity**
de: **Netzwerkoption 1: Anbieternetzwerke - Konnektivität**
fr: **Réseau Option 1: Réseaux fournisseurs d'accès - Connectivité**

source: **Networking Option 1: Provider networks - Overview**
de: **Netzwerkoption 1: Anbieternetzwerke - Überblick**
fr: **Réseau Option 1: Réseaux fournisseurs d'accès - Vue d'ensemble**

source: **Networking Option 2: Self-service networks - Connectivity**
de: **Network Option 2: Self-service Netzwerke - Konnektivität**
fr: **Réseau Option 2: Réseaux libre-service - Connectivité**

source: **Networking Option 2: Self-service networks - Overview**
de: **Netzwerk Option 2: Self-service Netzwerke - Übersicht**
fr: **Réseau Option 2: Réseaux libre-service - Vue d'ensemble**

source: **On SLES:**
de: **Unter SLES:**
fr: **Sur SLES:**

source: **On openSUSE:**
de: **Unter openSUSE:**
fr: **Sur openSUSE:**

source: **OpenStack services**
fr: **Services OpenStack**

source: **Passwords**
de: **Passwörter**
fr: **Mots de passe**

source: **Shared services**
fr: **Services partagés**

source: **Storage**
fr: **Stockage**

source: A bug prevents using both driver options on the same share node. For more information, see LVM Driver section at the `Configuration Reference <http://docs.openstack.org/mitaka/config-reference/content/section_share-drivers.html>`__.
fr: Un bug empêche d'utiliser les deux options de driver sur le même nœud de partage. Pour plus d'informations, voir la section Driver LVM dans le document `Référence de Configuration <http://docs.openstack.org/mitaka/config-reference/content/section_share-drivers.html>`__.
id: Sebuah bug mencegah menggunakan kedua pilihan driver pada share node yang sama. Untuk informasi lebih lanjut, lihat bagian LVM Driver di `Configuration Reference <http://docs.openstack.org/mitaka/config-reference/content/section_share-drivers.html>`__.

source: A flavor specifies a virtual resource allocation profile which includes processor, memory, and storage.
de: Eine Variante spezifiziert, welche virtuellen Ressourcen reserviert werden (Prozessor, Hauptspeicher und Festplatte).
fr: Un gabarit définit un profil d'allocation de ressources virtuelles qui inclut processeur, mémoire, et stockage.
id: Rasa menentukan profil alokasi sumber daya virtual yang meliputi prosesor, memori, dan penyimpanan.

source: A single disk partition on each node works for most basic installations. However, you should consider :term:`Logical Volume Manager (LVM)` for installations with optional services such as Block Storage.
de: Die meisten Grundinstallationen funktionieren mit nur einer Festplattenpartition auf jedem Knoten. Für Installationen mit optionalen Diensten wie z.B. Blockspeicher sollten Sie jedoch in Erwägung ziehen, :term:`Logical Volume Manager (LVM)`zu nutzen.
fr: Une unique partition disque sur chaque nœud fonctionnera pour la plupart des installations basiques. Cependant, vous devriez envisager :term:`Logical Volume Manager (LVM)` pour les installations avec des services optionnels comme le Stockage par Blocs.
id: Sebuah partisi disk tunggal pada setiap node bekerja untuk kebanyakan instalasi dasar. Namun, Anda harus mempertimbangkan :term:`Logical Volume Manager (LVM)` untuk instalasi dengan layanan opsional seperti Block Storage.

source: A unique ``nova-consoleproxy`` package provides the ``nova-novncproxy``, ``nova-spicehtml5proxy``, and ``nova-xvpvncproxy`` packages. To select packages, edit the ``/etc/default/nova-consoleproxy`` file or use the debconf interface. You can also manually edit the ``/etc/default/nova-consoleproxy`` file, and stop and start the console daemons.
fr: Un unique package ``nova-consoleproxy`` fournit les packages ``nova-novncproxy``, ``nova-spicehtml5proxy``, et ``nova-xvpvncproxy``. Pour sélectionner les packages, éditer le fichier ``/etc/default/nova-consoleproxy`` ou utiliser l'interface debconf. Vous pouvez aussi éditer manuellement le fichier ``/etc/default/nova-consoleproxy``, et redémarrer les daemons console.
id: Sebuah paket ``nova-consoleproxy`` unik menyediakan paket ``nova-novncproxy``, ``nova-spicehtml5proxy``, dan ``nova-xvpvncproxy``. Untuk memilih paket, mengedit file ``/etc/default/nova-consoleproxy`` atau menggunakan interface debconf. Anda juga dapat secara manual mengedit file ``/etc/default/nova-consoleproxy``, dan berhenti dan mulai console daemons.

source: Ability to take periodic "snap shots" throughout the installation process and "roll back" to a working configuration in the event of a problem.
de: Die Möglichkeit, regelmäßige "Schattenkopien" während des Installationsprozesses zu erstellen und einen "roll back" zu einem funktionierenden Zeitpunkt durchzuführen, wenn Probleme auftreten sollten.
fr: Possibilité de prendre des "snapshots" périodiques tout au long de l'installation et de faire des retours-arrière ("rollback") vers une configuration fonctionnelle en cas de problème.
id: Kemampuan untuk mengambil periodik "snap shot" selama proses instalasi dan "roll back" ke 'working configuration' bila ada masalah.

source: Abstract
de: Kurzbeschreibung
fr: Sommaire
id: Abstrak

source: Access the dashboard using a web browser at ``http://controller/``.
de: Rufen Sie das Dashboard mit einem Webbrowser unter ``http://controller/``auf.
fr: Accéder au dashboard via un navigateur web à l'adresse ``http://controller/``.
id: Akses dashboard menggunakan web browser di ``http://controller/``.

source: Access the dashboard using a web browser at ``http://controller/dashboard``.
de: Rufen Sie das Dashboard mit einem Webbrowser unter ``http://controller/dashboard``auf.
fr: Accéder au dashboard via un navigateur web à l'adresse ``http://controller/dashboard``.
id: Akses dashboard menggunakan web browser di ``http://controller/dashboard``.

source: Access the dashboard using a web browser at ``http://controller/horizon``.
de: Rufen Sie das Dashboard mit einem Webbrowser unter ``http://controller/horizon``auf.
fr: Accéder au dashboard via un navigateur web à l'adresse ``http://controller/horizon``.
id: Akses dashboard menggunakan web browser di ``http://controller/horizon``.

source: Access the instance remotely
de: Fernzugriff auf die Instanz
fr: Accéder à l'instance à distance
id: Mengakses instance jarak jauh

source: Access the instance using a virtual console
de: Zugriff auf die Instanz mittels einer Virtuellen Konsole
fr: Accéder à l'instance à l'aide d'une console virtuelle
id: Mengakses instance menggunakan konsol virtual

source: Access the instance using the virtual console
de: Zugriff auf die Instanz mittels der Virtuellen Konsole
fr: Accéder à l'instance via la console virtuelle
id: Mengakses instance menggunakan konsol virtual

source: Access your instance using SSH and use the ``fdisk`` command to verify presence of the volume as the ``/dev/vdb`` block storage device:
de: Melden Sie sich mit SSH an Ihrer Instanz an und führen den Befehl ``fdisk`` aus, um zu überprüfen ob der Datenträger als ``/dev/vdb`` vorhanden ist:
fr: Accéder à votre instance par SSH et utiliser la commande ``fdisk`` pour vérifier la présence du volume en tant que device de stockage par blocs ``/dev/vdb``:
id: Mengakses instance Anda menggunakan SSH dan menggunakan command ``fdisk`` untuk memverifikasi keberadaan volume sebagai perangkat penyimpanan blok ``/dev/vdb``.

source: Access your instance using SSH from the controller node or any host on the provider physical network:
de: Greifen Sie per SSH vom Controller auf Ihre Instanz oder beliebige Hosts im physischen Anbieternetzwerk zu:
fr: Accéder à votre instance en SSH à partir du nœud contrôleur ou tout autre host sur le réseau physique fournisseur:
id: Mengakses instance Anda menggunakan SSH dari controller node atau semua host pada jaringan fisik penyedia:

source: Actual output may differ slightly from this example.
de: Diese tatsächliche Ausgabe kann von diesem Beispiel abweichen.
fr: La sortie réelle peut être légèrement différente de cet exemple.
id: Output aktual mungkin sedikit berbeda dari contoh ini.

source: Add a datastore to trove:
fr: Ajouter un datastore à trove:
id: Tambahkan datastore untuk trove:

source: Add each storage node to the ring:
fr: Ajouter chaque nœud de stockage à l'anneau:
id: Tambahkan setiap node penyimpanan untuk ring:

source: Add rules to the ``default`` security group:
de: Fügen sie weitere Regeln zur Sicherheitsgruppe``default`` hinzu:
fr: Ajouter des règles au groupe de sécurité ``default``:
id: Menambahkan aturan ke grup keamanan ``default``:

source: Add security group rules
de: Sicherheitsgruppenregeln hinzufügen
fr: Ajouter des règles au groupe de sécurité
id: Tambahkan aturan grup keamanan

source: Add the ``ResellerAdmin`` role to the ``ceilometer`` user:
de: Fügen Sie dem Benutzer ``ceilometer`` die Rolle ``ResellerAdmin`` hinzu:
fr: Ajouter le rôle ``ResellerAdmin`` à l'utilisateur ``ceilometer`` :
id: Tambahkan peran ``ResellerAdmin`` ke user ``ceilometer``:

source: Add the ``admin`` role to the ``admin`` project and user:
de: Fügen Sie die Rolle ``admin`` zum Projekt und Benutzer ``admin`` hinzu:
fr: Ajouter le rôle ``admin`` au projet et à l'utilisateur ``admin``:
id: Tambahkan peran ``admin`` ke proyek ``admin`` dan user:

source: Add the ``admin`` role to the ``aodh`` user:
de: Fügen Sie die Rolle ``admin`` zum Benutzer ``cinder`` hinzu:
fr: Ajouter le rôle ``admin`` à l'utilisateur ``aodh``:
id: Tambahkan pecan ``admin`` ke user ``aodh``:

source: Add the ``admin`` role to the ``ceilometer`` user.
de: Die Rolle ``admin`` zum Benutzer ``ceilometer`` hinzufügen.
fr: Ajouter le rôle``admin`` à l'utilisateur ``ceilometer``.
id: Tambahkan peran ``admin`` ke user ``ceilometer``.

source: Add the ``admin`` role to the ``cinder`` user:
de: Fügen Sie die Rolle ``admin`` zum Benutzer ``cinder`` hinzu:
fr: Ajouter le rôle ``admin`` à l'utilisateur ``cinder``:
id: Tambahkan peran ``admin`` ke user ``cinder``:

source: Add the ``admin`` role to the ``glance`` user and ``service`` project:
de: Fügen Sie die Rolle ``admin`` zum Benutzer ``glance`` hinzu:
fr: Ajouter le rôle ``admin`` à l'utilisateur ``glance`` et au projet ``service``:
id: Tambahkan peran ``admin`` ke user ``glance`` dan proyek ``service``:

source: Add the ``admin`` role to the ``heat_domain_admin`` user in the ``heat`` domain to enable administrative stack management privileges by the ``heat_domain_admin`` user:
de: Fügen Sie die Rolle ``admin`` zum Benutzer ``heat_domain_admin`` in der Domäne ``heat`` hinzu, um dem Benutzer ``heat_domain_admin`` administrative Rechte zur Stackverwaltung zuzuweisen:
fr: Ajouter le rôle ``admin`` à l'utilisateur ``heat_domain_admin`` dans le domaine ``heat`` pour attribuer les privilèges de gestion de stacks en tant qu'admin à l'utilisateur ``heat_domain_admin``:
id: Tambahkan peran ``admin`` ke user ``heat_domain_admin`` dalam domain ``heat`` mengaktifkan hak manajemen stack administrasi oleh user ``heat_domain_admin``:

source: Add the ``admin`` role to the ``heat`` user:
de: Fügen Sie die Rolle ``admin`` zum Benutzer ``heat`` hinzu:
fr: Ajouter le rôle ``admin`` à l'utilisateur ``heat``:
id: Tambahkan peran ``admin`` ke user ``heat``:

source: Add the ``admin`` role to the ``manila`` user:
de: Fügen Sie die Rolle ``admin`` zum ``manila`` Benutzer hinzu:
fr: Ajouter le rôle ``admin`` à l'utilisateur ``manila``:
id: Tambahkan peran ``admin`` ke user ``manila``:

source: Add the ``admin`` role to the ``neutron`` user:
de: Fügen Sie die Rolle ``admin`` zum Benutzer ``neutron`` hinzu:
fr: Ajouter le rôle ``admin`` à l'utilisateur ``neutron``:
id: Tambahkan peran ``admin`` ke user ``neutron``:

source: Add the ``admin`` role to the ``nova`` user:
de: Fügen Sie die Rolle ``admin`` zum Benutzer ``nova`` hinzu:
fr: Ajouter le rôle ``admin`` à l'utilisateur ``nova``:
id: Tambahkan peran ``admin`` ke user ``nova``:

source: Add the ``admin`` role to the ``swift`` user:
fr: Ajouter le rôle ``admin`` à l'utilisateur ``swift``:
id: Tambahkan peran ``admin`` ke user ``swift``:

source: Add the ``admin`` role to the ``trove`` user:
fr: Ajouter le rôle ``admin`` à l'utilisateur ``trove``:
id: Tambahkan peran ``admin`` ke user ``trove``:

source: Add the ``heat_stack_owner`` role to the ``demo`` project and user to enable stack management by the ``demo`` user:
de: Fügen Sie die Rolle ``heat_stack_owner`` dem Projekt und Benutzer ``demo`` hinzu, um dem Benutzer ``demo``die Stackverwaltung zu ermöglichen:
fr: Ajouter le rôle ``heat_stack_owner`` au projet et à l'utilisateur ``demo`` pour permettre la gestion de stack par l'utilisateur ``demo``:
id: Tambahkan peran ``heat_stack_owner`` ke proyek ``demo`` dan user untuk memungkinkan manajemen stack oleh user ``demo``:

source: Add the ``openstack`` user:
de: Fügen Sie den Benutzer ``openstack`` hinzu:
fr: Ajouter l'utilisateur ``openstack``:
id: Tambahkan user ``openstack``:

source: Add the ``router: external`` option to the ``provider`` network:
de: Fügen Sie die ``router: external`` Option zum ``provider`` Netzwerk hinzu:
fr: Ajouter l'option ``router: external`` au réseau ``fournisseur``:
id: Tambahkan opsi ``router:external`` ke jaringan ``provider``:

source: Add the ``user`` role to the ``demo`` project and user:
de: Fügen Sie die Rolle ``user`` zum Projekt und Benutzer ``demo`` hinzu:
fr: Ajouter le rôle ``user`` au projet et à l'utilisateur ``demo``:
id: Tambahkan peran ``user`` ke proyek ``demo`` dan user:

source: Add the image to the Image service:
de: Fügen Sie das Abbild zum Abbilddienst hinzu:
fr: Ajouter l'image au service d'Image:
id: Tambahkan image ke layanan Image:

source: Add the self-service network subnet as an interface on the router:
de: Fügen Sie das self-service Netzwerk Subnetz als Interface auf dem Router hinzu:
fr: Ajouter le sous-réseau du réseau self-service comme interface du routeur:
id: Tambahkan subnet jaringan self-service sebagai interface pada router:

source: Additional compute nodes should use 10.0.0.32, 10.0.0.33, and so on.
de: Zusätzliche Compute Knoten sollten 10.0.0.32, 10.0.0.33 und so weiter verwenden.
fr: Les nœuds Compute additionnels doivent utiliser 10.0.0.32, 10.0.0.33, et ainsi de suite.
id: Node komputasi tambahan harus menggunakan 10.0.0.32, 10.0.0.33, dan sebagainya.

source: Additionally, you can allocate IP addresses on external networks to ports on the internal network. Whenever something is connected to a subnet, that connection is called a port. You can associate external network IP addresses with ports to VMs. This way, entities on the outside network can access VMs.
de: Außerdem können Sie IP-Adresses von externen Netzwerkports zu Ports im internen Netzwerk zuweisen. Immer wenn etwas mit einem Subnetz verbunden ist, wird es als Port bezeichnet. Sie können externe Netzwerk-IP-Adressen mit Ports zu VMs zuweisen. Auf diesem Weg können Einheiten im äußeren Netzwerk auf VMs zugreifen.
fr: De plus, vous pouvez allouez des adresses IP sur les réseaux extérieurs à des ports sur le réseau interne. Chaque fois que quelque chose est connecté à un sous-réseau, cette connexion est appelée un port. Vous pouvez associer des adresses IP de réseau externe avec des ports de VMs. De cette façon, des entités sur le réseau extérieur peuvent joindre les VMs.
id: Selain itu, Anda dapat mengalokasikan alamat IP pada jaringan eksternal untuk port pada jaringan internal. Setiap kali sesuatu terhubung ke subnet, koneksi yang disebut port. Anda dapat mengaitkan alamat jaringan IP eksternal dengan port untuk VM. Dengan cara ini, entitas di jaringan luar dapat mengakses VM.

source: After a short time, the volume status should change from ``creating`` to ``available``:
de: Nach kurzer Zeit sollte sich der Datenträgerstatus von ``Erzeuge`` in ``Verfügbar`` ändern:
fr: Après un court moment, le statut du volume devrait passer de ``en création`` à ``disponible``:
id: Setelah waktu yang singkat, status volume harus berubah dari ``creating`` ke ``available``:

source: After a short time, verify successful creation of the stack:
de: Überprüfen Sie die erfolgreiche Erstellung des Stacks nach kurzer Wartezeit:
fr: Après quelque temps, vérifier la création effective de la stack:
id: Setelah waktu yang singkat, memverifikasi ciptaan stack yang sukses:

source: After becoming familiar with basic installation, configuration, operation, and troubleshooting of these OpenStack services, you should consider the following steps toward deployment using a production architecture:
fr: Après s'être familiarisé avec l'installation de base, la configuration, le fonctionnement, et le dépannage de ces services OpenStack, vous devriez envisager les étapes suivantes en vue du déploiement d'une architecture de production:
id: Setelah menjadi akrab dengan instalasi dasar, konfigurasi, operasi, dan pemecahan masalah dari layanan ini OpenStack, Anda harus mempertimbangkan langkah-langkah berikut menuju pengerahan menggunakan arsitektur produksi:

source: After creating the appropriate networks for your environment, you can continue preparing the environment to launch an instance.
de: Nach dem Erstellen der passenden Netzwerke für Ihre Umgebung können Sie die Umgebungseinrichtung zum Start einer Instanz fortsetzen.
fr: Après avoir créé les réseaux nécessaires pour votre environnement, vous pouvez continuer la préparation de votre environnement pour lancer une instance.
id: Setelah menciptakan jaringan yang sesuai untuk lingkungan Anda, Anda dapat terus mempersiapkan lingkungan untuk meluncurkan sebuah instance.

source: After installing the operating system on each node for the architecture that you choose to deploy, you must configure the network interfaces. We recommend that you disable any automated network management tools and manually edit the appropriate configuration files for your distribution. For more information on how to configure networking on your distribution, see the `SLES 12 <https://www.suse.com/documentation/sles-12/book_sle_admin/data/sec_basicnet_manconf.html>`__ or `openSUSE <http://activedoc.opensuse.org/book/opensuse-reference/chapter-13-basic-networking>`__ documentation.
de: Nachdem das Betriebssystem auf jedem Knoten mit der gewünschten Architektur installiert wurde, müssen die Netzwerkschnittstellen konfiguriert werden. Es wird empfohlen, alle automatisierten Netzwerkverwaltungshilfsmittel zu deaktivieren und die entsprechenden Konfigurationsdateien für Ihre Distribution manuell anzupassen. Für weitere Informationen zum Konfigurieren der Netzwerke auf Ihrer Distribution lesen Sie die Dokumentation für `SLES 12 <https://www.suse.com/documentation/sles-12/book_sle_admin/data/sec_basicnet_manconf.html>`__ oder für `openSUSE <http://activedoc.opensuse.org/book/opensuse-reference/chapter-13-basic-networking>`__.
fr: Après avoir installé le système d'exploitation sur chaque nœud de l'architecture que vous avez choisie de déployer, vous devez configurer les interfaces réseau. Nous recommandons de désactiver tout outil de gestion automatisée du réseau et d'éditer manuellement les fichiers de configuration appropriés à votre distribution. Pour plus d'informations sur la configuration réseau de votre distribution, voir la documentation `SLES 12 <https://www.suse.com/documentation/sles-12/book_sle_admin/data/sec_basicnet_manconf.html>`__ ou `openSUSE <http://activedoc.opensuse.org/book/opensuse-reference/chapter-13-basic-networking>`__.
id: Setelah menginstal sistem operasi pada setiap node untuk arsitektur yang Anda pilih untukpengerahan, Anda harus mengkonfigurasi interface jaringan. Kami menyarankan Anda menonaktifkan perangkat manajemen jaringan otomatis dan manual mengedit file konfigurasi yang sesuai untuk distribusi Anda. Untuk informasi lebih lanjut tentang cara mengkonfigurasi jaringan distribusi Anda, lihat `SLES 12 <https://www.suse.com/documentation/sles-12/book_sle_admin/data/sec_basicnet_manconf.html>`__ or `openSUSE <http://activedoc.opensuse.org/book/opensuse-reference/chapter-13-basic-networking>`__ documentation.

source: After installing the operating system on each node for the architecture that you choose to deploy, you must configure the network interfaces. We recommend that you disable any automated network management tools and manually edit the appropriate configuration files for your distribution. For more information on how to configure networking on your distribution, see the `documentation <https://access.redhat.com/documentation/en-US/Red_Hat_Enterprise_Linux/7/html/Networking_Guide/sec-Using_the_Command_Line_Interface.html>`__ .
de: Nachdem das Betriebssystem auf jedem Knoten mit der gewünschten Architektur installiert wurde, müssen die Netzwerkschnittstellen konfiguriert werden. Es wird empfohlen, alle automatisierten Netzwerkverwaltungshilfsmittel zu deaktivieren und die entsprechenden Konfigurationsdateien für Ihre Distribution manuell anzupassen. Für weitere Informationen zum Konfigurieren der Netzwerke auf Ihrer Distribution lesen Sie die `Dokumentation <https://access.redhat.com/documentation/en-US/Red_Hat_Enterprise_Linux/7/html/Networking_Guide/sec-Using_the_Command_Line_Interface.html>`__ .
fr: Après avoir installé le système d'exploitation sur chaque nœud de l'architecture que vous avez choisie de déployer, vous devez configurer les interfaces réseau. Nous recommandons de désactiver tout outil de gestion automatisée du réseau et d'éditer manuellement les fichiers de configuration appropriés à votre distribution. Pour plus d'informations sur la configuration réseau de votre distribution, voir la `documentation <https://access.redhat.com/documentation/en-US/Red_Hat_Enterprise_Linux/7/html/Networking_Guide/sec-Using_the_Command_Line_Interface.html>`__ .
id: Setelah menginstal sistem operasi pada setiap node untuk arsitektur yang Anda pilih untuk pengerahan, Anda harus mengkonfigurasi interface jaringan. Kami menyarankan Anda menonaktifkan perangkat manajemen jaringan otomatis dan manual mengedit file konfigurasi yang sesuai untuk distribusi Anda. Untuk informasi lebih lanjut tentang cara mengkonfigurasi jaringan distribusi Anda, lihat `documentation <https://access.redhat.com/documentation/en-US/Red_Hat_Enterprise_Linux/7/html/Networking_Guide/sec-Using_the_Command_Line_Interface.html>`__ .
