Repository: 25hours/openstack-manuals
Catalog: doc/install-guide/source/locale/*/LC_MESSAGES/install-guide.po
Languages: de, fr, id

source: Implement a deployment tool such as Ansible, Chef, Puppet, or Salt to automate deployment and management of the production environment.
fr: Implémenter un outils de déploiement comme Ansible, Chef, Puppet, ou Salt pour automatiser les déploiements et la gestion de l'environnement de production.
id: Menerapkan alat pengerahan seperti Ansible, Chef, Puppet, atau Salt untuk mengotomatisasi pengerahan dan pengelolaan lingkungan produksi.

source: In Debian, the Keystone package offers automatic registration of Keystone in the service catalogue. This is equivalent of running the below commands:
de: In Debian bietet das Keystone-Paket die Möglichkeit, Keystone im Dienstkatalog automatisch zu registrieren. Dies entspricht den unten stehenden Befehlen:
fr: Sur Debian, le package Keystone permet un enregistrement automatique de Keystone dans le catalogue de service. Cela revient à exécuter les commandes suivantes:
id: Pada Debian, paket Keystone menawarkan pendaftaran otomatis Keystone di katalog layanan. Ini adalah setara dengan menjalankan command di bawah ini:

source: In ``trove-conductor.conf``, edit ``config-file`` to point to ``/etc/trove/trove-conductor.conf``.
fr: Dans ``trove-conductor.conf``, éditer ``config-file`` pour pointer vers ``/etc/trove/trove-conductor.conf``.
id: Dalam ``trove-conductor.conf``, edit ``config-file`` untuk menunjuk ke ``/etc/trove/trove-conductor.conf``.

source: In ``trove-taskmanager.conf``, edit ``config-file`` to point to ``/etc/trove/trove-taskmanager.conf``.
fr: Dans le fichier ``trove-taskmanager.conf``, éditer ``config-file`` pour pointer vers ``/etc/trove/trove-taskmanager.conf``.
id: Dalam ``trove-taskmanager.conf``, edit `` config-file`` untuk menunjuk ke ``/etc/trove/trove-taskmanager.conf``.

source: In addition to external networks, any Networking set up has one or more internal networks. These software-defined networks connect directly to the VMs. Only the VMs on any given internal network, or those on subnets connected through interfaces to a similar router, can access VMs connected to that network directly.
de: Jedes Netzwerk hat zusätzlich zum externen Netzwerk ein oder mehrere interne Netzwerke. Diese durch Software definierten Netzwerke verbinden direkt zu VMs. Nur VMs in den angegebenen internen Netzwerken, oder durch Subnetze mit einem ähnlichen Router verbundene Interfaces, können auf mit dem Netzwerk verbundene VMs direkt zugreifen.
fr: En plus des réseaux externes, toute mise en place réseau possède un ou plusieurs réseaux internes. Ces réseaux définis par logiciel se connectent directement aux VMs. Seules les VMs sur un réseau interne donné, ou celles sur des sous-réseaux connectés par des interfaces sur un même routeur, peuvent accéder aux VMs connectées à ce réseau directement.
id: Selain jaringan eksternal, setiap Networking mengatur memiliki satu atau lebih jaringan internal. Jaringan software-defined tersebut terhubung langsung ke VM. Hanya VM pada jaringan internal yang diberikan, atau mereka pada subnet terhubung melalui interface ke router yang sama, dapat mengakses VM terhubung ke jaringan itu secara langsung.

source: In each file, find this line:
fr: Dans chaque fichier, trouver cette ligne:
id: Dalam setiap file, cari baris ini:

source: In the ``/etc/trove`` directory, edit the ``trove.conf``, ``trove-taskmanager.conf`` and ``trove-conductor.conf`` files and complete the following steps:
fr: Dans le répertoire ``/etc/trove``, éditer les fichiers ``trove.conf``, ``trove-taskmanager.conf`` et``trove-conductor.conf`` et effectuer les modifications suivantes:
id: Dalam direktori ``/etc/trove`, edit file ``trove.conf``, ``trove-taskmanager.conf`` dan ``trove-conductor.conf`` dan lakukan langkah-langkah berikut:

source: In the ``[DEFAULT]`` and [oslo_messaging_rabbit] sections, configure ``RabbitMQ`` message queue access:
de: Konfigurieren Sie den ``RabbitMQ`` Nachrichtenwarteschlangen-Zugriff in den Sektionen ``[DEFAULT]`` und ``[oslo_messaging_rabbit]``:
fr: Dans les sections ``[DEFAULT]`` et ``[oslo_messaging_rabbit]``, configurer l'accès à la file de messages ``RabbitMQ``:
id: Dalam bagian `` [DEFAULT] `` dan [oslo_messaging_rabbit], configure akses antrian pesan `` RabbitMQ``:

source: In the ``[DEFAULT]`` and ``[keystone_authtoken]`` sections, configure Identity service access:
de: Konfigurieren Sie den Identitätsdienst-Zugriff in den Sektionen ``[DEFAULT]`` und ``[keystone_authtoken]``:
fr: Dans les sections ``[DEFAULT]`` et ``[keystone_authtoken]``, configurer l'accès au service d'Identité :
id: Dalam bagian ``[DEFAULT] `` dan ``[keystone_authtoken] ``, konfigur akses layanan Identity:

source: In the ``[DEFAULT]`` and ``[nova]`` sections, configure Networking to notify Compute of network topology changes:
de: Konfigurieren Sie das Netzwerk um Compute über Netzwerk-Topologieänderungen zu benachrichtigen in den ``[DEFAULT]`` und ``[nova]`` Sektionen:
fr: Dans les sections ``[DEFAULT]`` et ``[nova]``, configurer le composant Réseau pour notifier le Compute des changements de topologie réseau:
id: Dalam bagian ``[DEFAULT] `` dan ``[nova] ``, mengkonfigurasi Networking untuk memberitahukan Compute perubahan topologi jaringan:

source: In the ``[DEFAULT]`` and ``[oslo_messaging_rabbit]`` sections, configure RabbitMQ message queue access:
de: Konfigurieren Sie den ``RabbitMQ`` Nachrichtenwarteschlangen-Zugriff in den Sektionen ``[DEFAULT]`` und ``[oslo_messaging_rabbit]`` :
fr: Dans les sections ``[DEFAULT]`` et ``[oslo_messaging_rabbit]``, configurer l'accès à la file de message RabbitMQ:
id: Dalam bagian ``[DEFAULT] `` dan ``[oslo_messaging_rabbit]``, mengkonfigurasi akses antrian pesan RabbitMQ:

source: In the ``[DEFAULT]`` and ``[oslo_messaging_rabbit]`` sections, configure ``RabbitMQ`` message queue access:
de: Konfigurieren Sie den ``RabbitMQ`` Nachrichtenwarteschlangen-Zugriff in den Sektionen ``[DEFAULT]`` und ``[oslo_messaging_rabbit]`` :
fr: Dans les sections ``[DEFAULT]`` et ``[oslo_messaging_rabbit]``, configurer l'accès au service de files de messages ``RabbitMQ``:
id: Dalam bagian `` [DEFAULT] `` dan `` [oslo_messaging_rabbit] ``, konfigur akses antrian pesan (message queue) "RabbitMQ":

source: In the ``[DEFAULT]`` section, check that the ``my_ip`` option is correctly set (this value is handled by the config and postinst scripts of the ``nova-common`` package using debconf):
de: Prüfen Sie in der ``[DEFAULT]`` Sektion, ob die ``my_ip`` Option korrekt gesetzt ist. Dieser Wert wird von den Konfig und Postinst-Skripten des ``nova-common`` Paketes mittels debconf gehandhabt:
fr: Dans la section ``[DEFAULT]``, vérifier que l'option ``my_ip`` est correctement définie (cette valeur est positionnée par les scripts config et postinst du package ``nova-common`` à l'aide de debconf):
id: Dalam bagian ` [DEFAULT] ``, periksa bahwa opsi ``my_ip`` diatur dengan benar (nilai ini ditangani oleh config dan postinst scripts dari paket ``nova-common`` menggunakan debconf):

source: In the ``[DEFAULT]`` section, configure the Linux bridge interface driver and external network bridge:
de: Konfigurieren Sie das Linuxbridge Interface und die externe Netzwerkbridge in der ``[DEFAULT]`` Sektion:
fr: Dans la section ``[DEFAULT]``, configurer le driver d'interface Linux bridge et le bridge du réseaux externe:
id: Dalam bagian ``[DEFAULT] ``, mengkonfigurasi Linux bridge interface driver dan external network bridge:

source: In the ``[DEFAULT]`` section, configure the Linux bridge interface driver, Dnsmasq DHCP driver, and enable isolated metadata so instances on provider networks can access metadata over the network:
de: Konfigurieren Sie Linux Bridge Interface Treiber, Dnsmasq DHCP Treiber und aktivieren Sie isolierte Metadaten, so dass Instanzen in Anbieternetzwerken auf Metadaten über das Netzwerk zugreifen können, in der ``[DEFAULT]`` Sektion:
fr: Dans la section ``[DEFAULT]``, configurer le driver d'interface Linux bridge, le driver DHCP Dnsmasq, et activer les metadata isolées pour que les instances sur les réseaux fournisseurs puissent accéder aux metadata à travers le réseau:
id: Dalam bagian ``[DEFAULT] ``, mengkonfigurasi Linux bridge interface driver, Dnsmasq DHCP driver, dan memungkinkan metadata terisolasi sehingga instances pada jaringan provider dapat mengakses metadata melalui jaringan:

source: In the ``[DEFAULT]`` section, configure the ``my_ip`` option to use the management interface IP address of the controller node:
de: Konfigurieren Sie in der Sektion ``[DEFAULT]`` die Option ``my_ip`` so, dass die IP-Adresse der Management-Schnittstelle des Controller Nodes genutzt wird.
fr: Dans la section ``[DEFAULT]``, configurer l'option ``my_ip`` pour utiliser l'adresse IP de l'interface d'administration du nœud contrôleur:
id: Dalam bagian `` [DEFAULT] ``, konfigurasi opsi ``my_ip`` menggunakan manajemen antarmuka alamat IP dari controller node:

source: In the ``[DEFAULT]`` section, configure the ``my_ip`` option:
de: Konfigurieren Sie in der Sektion``[DEFAULT]`` die Option ``my_ip``:
fr: Dans la section ``[DEFAULT]``, configurer l'option ``my_ip``:
id: Dalam bagian ``[DEFAULT] ``, konfigurasi opsi ``my_ip``:

source: In the ``[DEFAULT]`` section, configure the bind IP address, bind port, user, configuration directory, and mount point directory:
fr: Dans la section ``[DEFAULT]``, configurer l'adresse IP de bind, le port de port, l'utilisateur, le répertoire de configuration, et les point de montage:
id: Dalam bagian `` DEFAULT] ``, mengkonfigurasi alamat bind IP address, bind port, user, configuration directory, dan mount point directory:

source: In the ``[DEFAULT]`` section, configure the bind port, user, and configuration directory:
fr: Dans la section ``[DEFAULT]``, configurer le port d'écoute, l'utilisateur, et le répertoire de configuration:
id: Dalam bagian ``[DEFAULT] ``, mengkonfigurasi bind port, user, dan configuration directory:

source: In the ``[DEFAULT]`` section, configure the location of the Image service API:
de: Konfigurieren Sie den Ort des Abbilddienstes in der Sektion ``[DEFAULT]``:
fr: Dans la section ``[DEFAULT]``, configurer l'emplacement de l'API du service d'Image:
id: Dalam bagian ``[DEFAULT] ``, konfigurasi lokasi layanan Image API:

source: In the ``[DEFAULT]`` section, configure the metadata and wait condition URLs:
de: Konfigurieren Sie in der Sektion ``[DEFAULT]`` die URLs für Metadaten und wait condition:
fr: Dans la section ``[DEFAULT]``, configurer les metadata et les URLs de condition d'attente:
id: Dalam bagian ``[DEFAULT] ``, konfigurasi metadata dan menunggu URL kondisi:

source: In the ``[DEFAULT]`` section, configure the metadata host and shared secret:
de: Konfigurieren Sie den Metadatendienst und die geteilten Geheimwörter in der ``[DEFAULT]`` Sektion:
fr: Dans la section ``[DEFAULT]``, configurer le host de metadata et le secret partagé:
id: Dalam bagian ``[DEFAULT] ``, mengkonfigurasi metadata host and shared secret:

source: In the ``[DEFAULT]`` section, configure the stack domain and administrative credentials:
de: Konfigurieren Sie in der Sektion ``[DEFAULT]`` die Stack-Domäne und die administrativen Anmeldeinformationen:
fr: Dans la section ``[DEFAULT]``, configurer le domaine stack et les credentials admin.
id: Dalam bagian ``[DEFAULT] ``, konfigurasi domain stack dan kredensial administratif:

source: In the ``[DEFAULT]`` section, define the value of the initial administration token:
de: Belegen Sie den Anfangswert des Administrations-Tokens im Abschnitt ``[DEFAULT]``:
fr: Dans la section ``[DEFAULT]``, définir la valeur de jeton d'administration initial:
id: Dalam bagian ``[DEFAULT] ``, tentukan nilai token administration awal:

source: In the ``[DEFAULT]`` section, disable additional plug-ins:
fr: Dans la section ``[DEFAULT]``, désactiver les plugins additionnels:
id: Dalam bagian `` [DEFAULT] ``, menonaktifkan plug-ins tambahan:

source: In the ``[DEFAULT]`` section, enable only the compute and metadata APIs:
fr: Dans la section ``[DEFAULT]``, activer uniquement les APIs compute et metadata:
id: Dalam bagian ``[DEFAULT] ``, memungkinkan hanya menghitung dan metadata API:

source: In the ``[DEFAULT]`` section, enable support for the Networking service:
de: Aktivieren Sie die Unterstützung für den Netzwerkdienst in der ``[DEFAULT]`` Sektion:
fr: Dans la section ``[DEFAULT]``, activer le support du service de Réseau:
id: Dalam bagian `` [DEFAULT] ``, mengaktifkan dukungan untuk layanan Networking:

source: In the ``[DEFAULT]`` section, enable the LVM back end:
de: Aktivieren Sie das LVM-Backend in der Sektion ``[DEFAULT]``:
fr: Dans la section ``[DEFAULT]``, activer le backend LVM:
id: Dalam bagian ``[DEFAULT] `` , memungkinkan backend LVM:

source: In the ``[DEFAULT]`` section, enable the LVM driver and the NFS/CIFS protocols:
fr: Dans la section ``[DEFAULT]``, activer le driver LVM et les protocoles NFS/CIFS:
id: Dalam bagian ``[DEFAULT] ``, aktifkan driver LVM dan protokol NFS/CIFS:

source: In the ``[DEFAULT]`` section, enable the Modular Layer 2 (ML2) plug-in and disable additional plug-ins:
de: Aktivieren Sie das Modular Layer 2 (ML2) Plugin in der ``[DEFAULT]`` Sektion und deaktivieren Sie zusätzliche Plugins:
fr: Dans la section ``[DEFAULT]``, activer le plugin Modular Layer 2 (ML2) et désactiver les plugins additionnels:
id: Dalam bagian ``[DEFAULT] ``, mengaktifkan Modular Layer 2 (ML2) plug-in dan menonaktifkan plug-ins tambahan:

source: In the ``[DEFAULT]`` section, enable the Modular Layer 2 (ML2) plug-in, router service, and overlapping IP addresses:
de: Aktivieren Sie das Modular Layer 2 (ML2) Plugin, den Router-Dienst und überlappende IP-Adressen in der ``[DEFAULT]`` Sektion:
fr: Dans la section ``[DEFAULT]``, activer le plugin Modular Layer 2 (ML2), le service routeur, et la superposition d'adresses IP:
id: Dalam bagian ``[DEFAULT] ``, mengaktifkan Modular Layer 2 (ML2) plug-in, layanan router, dan alamat IP yang tumpang tindih:

source: In the ``[DEFAULT]`` section, enable the generic driver and the NFS/CIFS protocols:
fr: Dans la section ``[DEFAULT]``, activer le driver générique et les protocoles NFS/CIFS:
id: Dalam bagian ``[DEFAULT] ``, aktifkan driver generik dan protokol NFS/CIFS:

source: In the ``[DEFAULT]`` section, set the following config values:
de: Setzen Sie im Abschnitt ``[DEFAULT]`` folgende Konfigurationswerte:
fr: Dans la section ``[DEFAULT]``, définir les valeurs de configuration suivantes:
id: Dalam bagian ``[DEFAULT] ``, mengatur nilai-nilai konfigurasi berikut:

source: In the ``[DEFAULT]``, ``[oslo_messaging_notifications]``, and ``[oslo_messaging_rabbit]`` sections, configure notifications and RabbitMQ message broker access:
de: Konfigurieren Sie Benachrichtigungen und Zugriff zum RabbitMQ-Nachrichten-Broker in den Sektionen ``[DEFAULT]``, ``[oslo_messaging_notifications]`` und ``[oslo_messaging_rabbit]``:
fr: Dans les sections ``[DEFAULT]``, ``[oslo_messaging_notifications]``, et ``[oslo_messaging_rabbit]`, configurez les notifications et l'accès au broker de messages RabbitMQ :
id: Dalam bagian ``[DEFAULT] ``, ``[oslo_messaging_notifications]``, dan ``[oslo_messaging_rabbit]`` konfigur pemberitahuan dan akses broker pesan RabbitMQ:

source: In the ``[api_database]`` and ``[database]`` sections, configure database access:
fr: Dans les sections ``[api_database]`` et ``[database]``, configurez l'accès à la base de données:
id: Dalam bagian ``[api_database] `` dan `` [database] `` , mengkonfigurasi akses database:

source: In the ``[app:proxy-server]`` section, enable automatic account creation:
fr: Dans la section ``[app:proxy-server]``, activer la création automatique des comptes :
id: Dalam bagian ``[app: proxy server] ``, memungkinkan pembuatan account otomatis:

source: In the ``[collector]`` section, configure the dispatcher:
de: Konfigurieren Sie den Dispatcher in der Sektion ``[collector]``:
fr: Dans la section ``[collector]``, configurer le dispatcher:
id: Dalam bagian ``[collektor] ``, konfigurasikan dispatcher:

source: In the ``[database]`` section, comment out any ``connection`` options because compute nodes do not directly access the database.
de: Kommentieren Sie im Abschnitt ``[database]`` jede ``connection``-Option aus, weil Compute-Nodes nicht direkt auf die Datenbank zugreifen.
fr: Dans la section ``[database]``, commenter toutes les options ``connection`` parce que les nœuds compute n'accèdent pas directement à la base de données.
id: Dalam bagian ``[Database] ``, komentar apapun pilihan ``connection`` karena compute node tidak secara langsung mengakses database.

source: In the ``[database]`` section, configure database access:
de: Konfigurieren Sie den Datenbankzugriff in der Sektion ``[database]`` :
fr: Dans la section ``[database]``, configurer l'accès à la base de données :
id: Dalam bagian `` [Database] ``, konfigur akses database:

source: In the ``[ec2authtoken]`` section, configure Identity service access:
de: Konfigurieren Sie den Zugriff auf den Identitätsdienst in der Sektion ``[ec2authtoken]``:
fr: Dans la section ``[ec2authtoken]``, configurer l'accès au service d'Identité:
id: Dalam bagian ``[ec2authtoken]``, konfigurasi akses layanan Identity:

source: In the ``[filter:authtoken]`` section, configure Identity service access:
fr: Dans la section ``[filter:authtoken]``, configurer l'accès au service d'Identité:
id: Dalam bagian ``[filter: authtoken] ``, mengkonfigurasi akses layanan Identity:

source: In the ``[filter:cache]`` section, configure the ``memcached`` location:
fr: Dans la section ``[filter:cache]``, configurer l'emplacement de ``memcached``:
id: Dalam bagian ``[filter: cache] ``, mengkonfigurasi lokasi ``memcached``:

source: In the ``[filter:ceilometer]`` section, configure notifications:
de: Konfigurieren Sie Benachrichtigungen in der Sektion ``[filter:ceilometer]``:
fr: Dans la section ``[filter:ceilometer]`` , configurer les notifications:
id: Dalam bagian ``[filter: ceilometer] ``, konfigurasikan notifications:

source: In the ``[filter:keystoneauth]`` section, add the ``ResellerAdmin`` role:
de: Fügen Sie die Rolle ``ResellerAdmin`` in der Sektion ``[filter:keystoneauth]`` hinzu:
fr: Dans la section ``[filter:keystoneauth]`` , ajouter le rôle ``ResellerAdmin`` :
id: Dalam bagian ``[filter:keystoneauth]``, tambahkan peran ``ResellerAdmin``:

source: In the ``[filter:keystoneauth]`` section, configure the operator roles:
fr: Dans la section ``[filter:keystoneauth]``, configurer les rôles opérateur:
id: Dalam bagian ``[filter: authkeystone] ``, mengkonfigurasi peran operator:

source: In the ``[filter:recon]`` section, configure the recon (meters) cache and lock directories:
fr: Dans la section ``[filter:recon]``, configurer les répertoires cache et verrou recon (compteurs):
id: Dalam bagian ``[filter:recon]``, mengkonfigurasi recon (meters) cache dan lock directories:

source: In the ``[filter:recon]`` section, configure the recon (meters) cache directory:
fr: Dans la section ``[filter:recon]``, configurer le répertoire du cache recon (compteurs):
id: Dalam bagian ``[filter:recon]``, mengkonfigurasi recon (meters) cache directory:

source: In the ``[generic]`` section, configure the generic driver:
de: Konfigurieren Sie den generischen Treiber im Abschnitt ``[generic]``:
fr: Dans la section ``[generic]``, configurer le driver générique:
id: Dalam bagian ``[generik] ``, mengkonfigurasi driver generik:

source: In the ``[glance]`` section, configure the location of the Image service API:
de: Konfigurieren Sie den Ort der Abbilddienst API in der Sektion ``[glance]``:
fr: Dans la section ``[glance]``, configurer l'emplacement de l'API du service d'Image:
id: Dalam bagian ``[glance] ``, mengkonfigurasi lokasi API layanan Image:

source: In the ``[glance_store]`` section, configure the local file system store and location of image files:
de: Konfigurieren Sie im Abschnitt ``[glance_store]`` den lokalen Speicher sowie den Speicherort von Abbilddateien:
fr: Dans la section ``[glance_store]``, configurer l'entrepôt sur filesystem local et l'emplacement des fichiers d'image:
id: Dalam bagian ``[glance_store] ``, konfigurasi penyimpanan sistem file lokal dan lokasi file image:

source: In the ``[keystone_authtoken]`` and ``[paste_deploy]`` sections, configure Identity service access:
de: Konfigurieren Sie den Identitätsdienst-Zugriff in den Sektionen ``[keystone_authtoken]`` und ``[paste_deploy]``:
fr: Dans les sections ``[keystone_authtoken]`` et ``[paste_deploy]``, configurer les accès au service d'Identité:
id: Dalam ``[keystone_authtoken] `` dan bagian ``[paste_deploy]`, konfigurasi akses layanan Identity:

source: In the ``[keystone_authtoken]``, ``[trustee]``, ``[clients_keystone]``, and ``[ec2authtoken]`` sections, configure Identity service access:
de: Konfigurieren Sie den Zugriff zum Identitätsdienst in den Sektionen ``[keystone_authtoken]``, ``[trustee]``, ``[clients_keystone]`` und ``[ec2authtoken]``:
fr: Dans les sections ``[keystone_authtoken]``, ``[trustee]``, ``[clients_keystone]``, et ``[ec2authtoken]``, configurer l'accès au service d'Identité:
id: Dalam bagian ``[keystone_authtoken]``, ``[trustee]``, ``[clients_keystone]``, and ``[ec2authtoken]``, konfigurasi akses layanan Identity:

source: In the ``[linux_bridge]`` section, map the provider virtual network to the provider physical network interface:
de: Bilden Sie das virtuelle Anbieternetzwerk und das physikalische Anbieternetzwerk-Interface in der ``[linux_bridge]`` Sektion ab.:
fr: Dans la section ``[linux_bridge]``, faire correspondre le réseau virtuel provider à l'interface réseau physique provider:
id: Dalam bagian ``[linux_bridge]``, memetakan jaringan virtual provider untuk interface provider jaringan fisik:

source: In the ``[lvm]`` section, configure the LVM back end with the LVM driver, ``cinder-volumes`` volume group, iSCSI protocol, and appropriate iSCSI service:
de: Konfigurieren Sie das LVM-Backend in der Sektion ``[lvm]`` mit dem LVM-Treiber, die Datenträgergruppe ``cinder-volumes``, das iSCSI-Protokol und entsprechenden iSCSI-Dienst:
fr: Dans la section ``[lvm]``, configurer le backend LVM avec le driver LVM, le groupe de volumes ``cinder-volumes``, le protocole iSCSI, et le service iSCSI approprié:
id: Dalam bagian ``[LVM] ``, konfigurasi back end LVM dengan driver LVM, kelompok volume ``cinder-volumes``, protokol iSCSI, dan layanan iSCSI yang tepat:

source: In the ``[lvm]`` section, configure the LVM driver:
de: Konfigurieren Sie den LVM-Treiber im Abschnitt ``[lvm]``:
fr: Dans la section ``[lvm]``, configurer le driver LVM:
id: Dalam bagian ``[LVM] ``, mengkonfigurasi driver LVM:

source: In the ``[ml2]`` section, disable self-service networks:
de: Deaktivieren Sie self-service Netzwerke in der ``[ml2]`` Sektion:
fr: Dans la section ``[ml2]``, désactiver les réseaux self-service:
id: Dalam bagian `` [ML2] ``, menonaktifkan self-service swalayan:

source: In the ``[ml2]`` section, enable VXLAN self-service networks:
de: Aktivieren Sie VXLAN self-service Netzwerke in der ``[ml2]`` Sektion:
fr: Dans la section ``[ml2]``, activer les réseaux self-service VXLAN:
id: Dalam bagian ``[ml2]``, memungkinkan jaringan self-service VXLAN:

source: In the ``[ml2]`` section, enable flat and VLAN networks:
de: Aktivieren Sie flache und VLAN Netzwerke in der ``[ml2]`` section:
fr: Dans la section ``[ml2]``, activer les réseaux flat et VLAN:
id: Dalam bagian ``[ML2] ``, mengaktifkan jaringan datar dan VLAN:

source: In the ``[ml2]`` section, enable flat, VLAN, and VXLAN networks:
de: Aktivieren Sie flache, VLAN, and VXLAN Netzwerke in der ``[ml2]`` Section:
fr: Dans la section ``[ml2]``, activer les réseaux flat, VLAN, et VXLAN:
id: Pada bagian ``[ml2] ``, memungkinkan jaringan datar, VLAN, dan VXLAN:
