Repository: 25hours/openstack-manuals
Catalog: doc/install-guide/source/locale/*/LC_MESSAGES/install-guide.po
Languages: de, fr, id

source: Orchestrates multiple composite cloud applications by using either the native :term:`HOT <Heat Orchestration Template (HOT)>` template format or the AWS CloudFormation template format, through both an OpenStack-native REST API and a CloudFormation-compatible Query API.
fr: Orchestre de nombreuses applications de cloud composées en utilisant soit le format de template natif :term:`HOT <Heat Orchestration Template (HOT)>` ou le format CloudFormation d'AWS, à travers soit une API REST native OpenStack ou soit par une API de Requête compatible avec CloudFormation.
id: Orchestrates beberapa aplikasi cloud komposit dengan menggunakan salah satu asli native template format :term :`HOT <Heat Orchestration Template (HOT)>` ataupun template format AWS CloudFormation, baik melalui OpenStack-native REST API ataupun a CloudFormation-compatible Query API.

source: Orchestration requires additional information in the Identity service to manage stacks. To add this information, complete these steps:
de: Zur Verwaltung von Stacks werden zusätzliche Informationen zur Orchestrierung im Identitätsdienst benötigt. Führen Sie folgende Schritte aus, um die Informationen hinzuzufügen:
fr: L'Orchestration nécessite des informations supplémentaires dans le service d'Identité pour gérer les stacks. Pour ajouter ces informations, effectuer les opérations suivantes:
id: Orkestrasi memerlukan informasi tambahan dalam layanan Identity untuk mengelola stacks. Untuk menambahkan informasi ini, selesaikan langkah berikut:

source: Orchestration service
de: Orchestrierungsdienst
fr: Service d'Orchestration
id: Layanan Orchestration

source: Other nodes
de: Andere Knoten
fr: Autres nœuds
id: Node lain

source: Other nodes reference the controller node for clock synchronization. Perform these steps on all other nodes.
de: Andere Knoten ziehen den Controller-Knoten zur Uhrzeitsynchronisierung heran. Führen Sie diese Schritte auf allen anderen Knoten aus.
fr: Les autres nœuds pointent vers le contrôleur pour la synchronisation de l'horloge. Effectuer ces opérations sur tous les autres nœuds.
id: Node lain mereferensi node kontroller untuk sinkronisasi jam. Lakukan langkah ini pada semua node lainnya.

source: Overlay (tunnel) traffic for self-service networks traverses the management network instead of a dedicated network.
fr: Le trafic overlay (tunnel) des réseaux privés traverse le réseau de management au lieu d'un réseau dédié.
id: Lalu lintas overlay (tunnel) untuk jaringan self-service melintasi jaringan manajemen bukan jaringan khusus.

source: Overview
de: Übersicht
fr: Vue d'ensemble
id: Iktisar

source: Password name
de: Passwortbezeichnung
fr: Nom du mot de passe

source: Password of Block Storage service user ``cinder``
de: Passwort für den Block-Speicherdienst-Benutzer ``cinder``
fr: Mot de passe de l'utilisateur de service de Stockage par Blocs ``cinder``
id: Password user layanan Block Storage ``cinder``

source: Password of Compute service user ``nova``
de: Passwort des Compute-Dienst-Benutzers ``nova``
fr: Mot de passe de l'utilisateur de service Compute ``nova``
id: Password user layanan Compute ``nova``

source: Password of Image service user ``glance``
de: Passwort des Abbilddienst-Benutzers ``glance``
fr: Mot de passe de l'utilisateur du service d'Image ``glance``
id: Password user layanan Image ``glance``

source: Password of Networking service user ``neutron``
de: Passwort des Netzwerkdienst-Benutzers ``neutron``
fr: Mot de passe de l'utilisateur de service réseau ``neutron``
id: Password user layanan Networking `` neutron``

source: Password of Object Storage service user ``swift``
de: Passwort des Objekt-Speicherdienst-Benutzers ``swift``
fr: Mot de passe de l'utilisateur de service de Stockage Objet ``swift``
id: Password user layanan Object Storage ``swift``

source: Password of Orchestration domain
de: Passwort der Orchestrierungs-Domäne
fr: Mot de passe du domaine d'Orchestration
id: Password domain Orchestration

source: Password of Orchestration service user ``heat``
de: Passwort des Orchestrierungsdienst-Benutzers ``heat``
fr: Mot de passe de l'utilisateur du service d'Orchestration ``heat``
id: Password user layanan Orchestration `` heat``

source: Password of Telemetry service user ``ceilometer``
de: Passwort des Telemetriedienst-Benutzers ``ceilometer``
fr: Mot de passe de l'utilisateur de service de Télémétrie ``ceilometer``
id: Password user layanan Telemetry ``ceilometer``

source: Password of user ``admin``
de: Passwort des Benutzers ``admin``
fr: Mot de passe de l'utilisateur ``admin``
id: Password user ``admin``

source: Password of user ``demo``
de: Passwort des Benutzers ``demo``
fr: Mot de passe de l'utilisateur ``demo``
id: Password user `` demo``

source: Password of user guest of RabbitMQ
de: Passwort für den Gastbenutzer von RabbitMQ
fr: Mot de passe de l'utilisateur guest de RabbitMQ
id: Password user guest RabbitMQ

source: Perform these commands on the controller node.
de: Führen Sie diese Befehle auf dem Controller Node aus.
fr: Exécuter ces commandes sur le nœud contrôleur.
id: Lakukan commands pada controller node.

source: Perform these commands on the node where you installed trove.
fr: Exécuter ces commandes sur le nœud où est installé trove.
id: Lakukan command ini pada node di mana Anda menginstal trove.

source: Perform these steps on each storage node.
fr: Effectuer ces opérations sur chaque nœud de stockage.
id: Lakukan langkah ini pada setiap node penyimpanan.

source: Perform these steps on the controller and any other nodes that run the Object Storage proxy service.
de: Führen Sie diese Schritte auf dem Controller und allen anderen Nodes aus, auf denen der Proxydienst für Objekt-Storage läuft.
fr: Effectuer ces opérations sur le contrôleur et sur tout autre nœud où tourne le service proxy du Stockage Objet.
id: Lakukan langkah ini pada controller dan setiap node lain yang menjalankan layanan proxy Object Storage.

source: Perform these steps on the controller node.
de: Führen Sie diese Schritte auf dem Controller Node durch.
fr: Effectuer ces opérations sur le nœud contrôleur.
id: Lakukan langkah ini pada controller node.

source: Perform these steps on the storage node.
de: Führen Sie diese Schritte auf dem Storage Node aus.
fr: Effectuer ces opérations sur le nœud de stockage.
id: Lakukan langkah ini pada storage node.

source: Permit :term:`ICMP` (ping):
de: :term:`ICMP` (ping) erlauben:
fr: Autoriser :term:`ICMP` (ping):
id: Izin : term: `ICMP` (ping):

source: Permit configuration, write, and read access for the ``openstack`` user:
de: Erlauben Sie dem Benutzer ``openstack`` Zugriff zum Konfigurieren, Lesen und Schreiben.
fr: Permet la configuration, les accès en lecture et écriture pour l'utilisateur ``openstack``.
id: Izinkanlah konfigurasi, menulis, dan membaca akses untuk user ``openstack``:

source: Permit secure shell (SSH) access:
de: Erlauben Sie Secure Shell (SSH) Zugriff:
fr: Autoriser l'accès secure shell (SSH):
id: Mengizinkan akses secure shell (SSH):

source: Ping this IP address from the controller node or any host on the physical provider network:
de: Pingen Sie die IP-Adresse vom Controller-Knoten oder einem anderen Host im physikalischen Anbieternetzwerk.
fr: Pinguer cette adresse IP à partir du nœud contrôleur ou de tout autre host sur le réseau fournisseur physique.
id: Lakukan ping alamat IP ini dari controller node atau host di jaringan provider fisik:

source: Populate the Alarming database:
de: Befüllen der Alarm-Datenbank:
fr: Peupler la base de données du service d'Alarme :

source: Populate the Block Storage database:
de: Befüllen der Block-Storage-Datenbank:
fr: Peupler la base de données de Stockage par Blocs:
id: Isilah database Block Storage:

source: Populate the Compute databases:
fr: Peupler les bases de données du service Compute.
id: Mengisi Compute databases:

source: Populate the Identity service database:
de: Befüllen Sie die Identitätsdienst-Datenbank:
fr: Peupler la base de données du service d'identité.
id: Isi database layanan Identity:

source: Populate the Image service database:
de: Befüllen Sie die Abbilddienst-Datenbank:
fr: Peupler la base de données du service d'Image:
id: Mengisi database layanan Image:

source: Populate the Orchestration database:
de: Befüllen Sie die Orchestrierungsdatenbank:
fr: Peupler la base de données du service d'Orchestration:
id: Isilah database Orchestration:

source: Populate the Share File System database:
de: Befüllen Sie die Share-Dateisystem-Datenbank:
fr: Peupler la base de données du Système de Fichiers Partagés:
id: Mengisi database Share File System:

source: Populate the database:
de: Befüllen Sie die Datenbank:
fr: Peupler la base de données:
id: Mengisi database:

source: Populate the trove database you created earlier in this procedure:
fr: Peupler la base de données trove créée plus tôt dans cette procédure:
id: Mengisi trove database yang Anda buat sebelumnya dalam prosedur ini:

source: Prerequisites
de: Voraussetzungen
fr: Pré-requis
id: Prerequisite

source: Project name
fr: Nom du projet
id: Nama Proyek

source: Provide appropriate values for the following settings:
fr: Fournir les valeurs appropriées pour les paramètres suivants:
id: Memberikan nilai yang sesuai untuk pengaturan berikut:

source: Provide users with a public IP address, a username, and a password so they can access the dashboard through a web browser. In case of any SSL certificate connection problems, point the server IP address to a domain name, and give users access.
de: Benutzern eine öffentliche IP-Adresse, einen Benutzernamen und ein Passwort zuweisen, sodass sie mit einem Webbrowser auf das Dashboard zugreifen können. Bei Verbindungsproblemen aufgrund von SSL-Zertifikaten weisen Sie der IP-Adresse des Servers einen Domänennamen zu und erlauben dann Benutzern den Zugriff.
fr: Fournir aux utilisateurs une adresse IP publique, un nom d'utilisateur, et un mot de passe pour qu'ils puissent accéder au dashboard via un navigateur web. En cas de problème de connexion dû au certificat SSL, faire pointer l'adresse IP du serveur vers un nom de domaine, et donner l'accès aux utilisateurs.
id: Sediakan user dengan alamat IP publik, username, dan password sehingga mereka dapat mengakses dashboard melalui web browser. Dalam hal terjadi masalah koneksi sertifikat SSL, tunjukkan alamat IP server untuk nama domain, dan memberikan akses user.

source: Provider network
de: Anbieternetzwerk
fr: Réseau fournisseur

source: Provider on 203.0.113.0/24 with gateway 203.0.113.1
de: Provider auf 203.0.113.0/24 mit Gateway 203.0.113.1
fr: Fournisseur sur 203.0.113.0/24 avec la passerelle 203.0.113.1
id: Provider pada 203.0.113.0/24 dengan gateway 203.0.113.1

source: Provides a web-based self-service portal to interact with underlying OpenStack services, such as launching an instance, assigning IP addresses and configuring access controls.
fr: Fournit un portal de self-service basé web qui sert aux interactions avec les services sous-jacents d'OpenStack, comme le lancement d'une instance, le distribution d'adresses IP ou la configuration des contrôles d'accès.
id: Menyediakan portal layanan mandiri berbasis web untuk berinteraksi dengan layanan OpenStack yang mendasari, seperti meluncurkan sebuah instance, menetapkan alamat IP dan konfigurasi kontrol akses.

source: Provides an authentication and authorization service for other OpenStack services. Provides a catalog of endpoints for all OpenStack services.
fr: Fournit un service d'authentification et d'autorisation pour les autres services d'OpenStack. Fournit un catalogue de points de terminaison pour tous les services d'OpenStack.
id: Menyediakan otentikasi dan otorisasi layanan untuk layanan OpenStack lainnya. Menyediakan katalog endpoint untuk semua layanan OpenStack.

source: Provides persistent block storage to running instances. Its pluggable driver architecture facilitates the creation and management of block storage devices.
fr: Fournit un stockage de blocs persistants aux instances en cours d'exécution. Son architecture de pilote enfichable facilite la création et la gestion des périphériques de stockage en blocs.
id: Menyediakan penyimpanan blok persisten untuk menjalankan instances. Arsitekturnya driver pluggable driver memfasilitasi penciptaan dan pengelolaan perangkat penyimpanan blok.

source: RHEL and CentOS enable :term:`SELinux` by default. Install the ``openstack-selinux`` package to automatically manage security policies for OpenStack services:
de: RHEL und CentOS aktivieren standardmäßig :term:`SELinux`. Installieren Sie das Paket ``openstack-selinux``, um Sicherheitsrichtlinien für OpenStack-Dienste automatisch verwalten zu lassen:
fr: RHEL et CentOS active :term:`SELinux` par défaut. Installer le package ``openstack-selinux`` pour gérer automatiquement les polices de sécurité pour les services OpenStack:
id: RHEL dan CentOS mengaktifkan: istilah: `SELinux` secara default. Instal paket ``OpenStack-selinux`` secara otomatis mengatur kebijakan keamanan untuk layanan OpenStack:

source: Rebalance the ring:
fr: Rééquiliber l'anneaux de stockage:
id: Rebalance ring:

source: Reboot the system to activate the changes.
de: Starten Sie das System neu, um die Änderungen wirksam zu machen.
fr: Redémarrer le système pour prendre en compte les modifications.
id: Reboot sistem untuk mengaktifkan perubahan.

source: Reconfiguring network interfaces will interrupt network connectivity. We recommend using a local terminal session for these procedures.
de: Die Neukonfiguration der Netzwerkschnittstellen wird die Netzwerkverbindung unterbrechen. Für diesen Vorgang empfehlen wir eine lokale Terminal-Sitzung.
fr: La reconfiguration des interfaces réseau va interrompre la connectivité réseau. Il est recommandé d'utiliser une session sur un terminal local pour ces procédures.
id: Konfigurasi ulang interface jaringan akan mengganggu konektivitas jaringan. Kami merekomendasikan penggunaan sesi terminal lokal untuk prosedur ini.

source: Recursively change the ownership of the ``/etc/keystone`` directory:
de: Ändern Sie die Eigentumsrechte des Verzeichnisses ``/etc/keystone`` rekursiv:
fr: Modifier le propriétaire du répertoire ``/etc/keystone`` de façon récursive:
id: Ubah secara rekursif kepemilikan direktori ``/etc/keystone``:

source: Regular (non-admin) tasks should use an unprivileged project and user. As an example, this guide creates the ``demo`` project and user.
de: Übliche (nicht-administrative) Aufgaben sollten von Benutzern/Projekten ohne Privilegien ausgeführt werden. Als Beispiel wird im Leitfaden das Projekt und der Benutzer ``demo`` angelegt.
fr: Les tâches régulières (non-admin) devraient utiliser des projet et utilisateur sans privilèges. Par exemple, ce guide créé le projet et utilisateur ``demo``.
id: Reguler (non-admin) tugas harus menggunakan sebuah proyek unprivileged dan user. Sebagai contoh, buku ini menciptakan proyek ``demo`` dan user.

source: Reload the web server configuration:
de: Laden Sie die Webserver-Konfiguration neu:
fr: Recharger la configuration du serveur web:
id: Reload konfigurasi web server:

source: Remove the previously downloaded image file ``/tmp/cirros.img``:
de: Löschen Sie die zuvor heruntergeladene Abbilddatei ``/tmp/cirros.img``:
fr: Supprimer l'image téléchargée précédemment ``/tmp/cirros.img``:
id: Hapuslah file image download sebelumnya ``/tmp/cirros.img`:

source: Repeat this command for each storage device on each storage node. In the example architecture, use the command in four variations:
fr: Répéter cette commande pour chaque device de stockage sur chaque nœud de stockage. Dans l'exemple d'architecture, utiliser la commande quatre fois:
id: Ulangi command ini untuk setiap perangkat penyimpanan pada setiap node penyimpanan. Pada contoh arsitektur, gunakan command dalam empat variasi:

source: Replace HASH_PATH_PREFIX and HASH_PATH_SUFFIX with unique values.
fr: Remplacer HASH_PATH_PREFIX et HASH_PATH_SUFFIX par des valeurs uniques.
id: Ganti HASH_PATH_PREFIX dan HASH_PATH_SUFFIX dengan nilai-nilai yang unik.

source: Replace ``ADMIN_PASS`` with the password you chose for the ``admin`` user in the Identity service.
de: Ersetzen Sie ``ADMIN_PASS`` durch das Passwort, das Sie für den Benutzer ``admin`` im Identitätsdienst vergeben haben.
fr: Remplacer ``ADMIN_PASS`` par le mot de passe choisi pour l'utilisateur ``admin`` dans le service d'Identité.
id: Ganti ``ADMIN_PASS`` dengan password yang Anda pilih untuk user ``admin`` dalam pelayanan Identity.

source: Replace ``ADMIN_TOKEN`` with the authentication token that you generated in the section called :doc:`keystone-install`. For example:
de: Ersetzen Sie ``ADMIN_TOKEN`` durch den Authentifizierungstoken, den Sie im Abschnitt :doc:`keystone-install` erzeugt haben. Zum Beispiel:
fr: Remplacer ``ADMIN_TOKEN`` par le jeton authentification généré dans la section intitulée :doc:`keystone-install`. Par exemple:
id: Ganti `` ADMIN_TOKEN`` dengan token otentikasi yang dihasilkan di bagian yang disebut :doc: `keystone-install`. Sebagai contoh:

source: Replace ``ADMIN_TOKEN`` with the random value that you generated in a previous step.
de: Ersetzen Sie ``ADMIN_TOKEN`` durch den zufällig generierten Wert aus dem vorherigen Schritt.
fr: Remplacer ``ADMIN_TOKEN`` par la valeur aléatoire générée dans l'étape précédente.
id: Ganti ``ADMIN_TOKEN`` dengan nilai acak yang Anda buat di langkah sebelumnya.

source: Replace ``AODH_DBPASS`` with a suitable password.
de: Ersetzen Sie ``AODH_DBPASS`` durch ein geeignetes Passwort.
fr: Remplacer ``AODH_DBPASS`` par un mot de passe adequat.
id: Gantilah `` AODH_DBPASS`` dengan password yang sesuai.

source: Replace ``AODH_DBPASS`` with the password you chose for the Telemetry Alarming module database. You must escape special characters such as ':', '/', '+', and '@' in the connection string in accordance with `RFC2396 <https://www.ietf.org/rfc/rfc2396.txt>`_.
de: Ersetzen Sie ``AODH_DBPASS`` mit dem Passwort, welches Sie für die Datenbank der Telemetrie-Benachrichtigungsmodule gewählt haben. Sonderzeichen im String für die Datenbankverbindung wie ':', '/', '+', und '@' müssen nach `RFC2396<https://www.ietf.org/rfc/rfc2396.txt>` maskiert werden.
fr: Remplacer ``AODH_DBPASS`` par le mot de passe que vous avez attribué à la base de données du module d'Alarme de Télémétrie. Vous devez protéger les caractères spéciaux comme ':', '/', '+', et '@' dans la chaîne de connexion conformément à la `RFC2396 <https://www.ietf.org/rfc/rfc2396.txt>`_.
id: Ganti `` AODH_DBPASS`` dengan password yang Anda pilih untuk database modul 'Telemetry Alarming'. Anda harus escape karakter khusus seperti ':', '/', '+', dan '@' dalam string koneksi sesuai dengan `RFC2396 <https://www.ietf.org/rfc/rfc2396.txt>` _.

source: Replace ``AODH_PASS`` with the password you chose for the ``aodh`` user in the Identity service.
de: Ersetzen Sie ``AODH_PASS`` mit dem Passwort, welches Sie für den Benutzer ``cinder`` im Identitätsdienst benutzt haben.
fr: Remplacer ``AODH_PASS`` par le mot de passe que vous avez attribué à l'utilisateur ``aodh`` dans le service d'Identité.
id: Ganti ``AODH_PASS`` dengan password yang Anda pilih untuk user `aodh`` di layanan Identity.

source: Replace ``CEILOMETER_DBPASS`` with a suitable password.
de: Ersetzen Sie ``CEILOMETER_DBPASS`` mit einem geeigneten Passwort.
fr: Remplacer ``CEILOMETER_DBPASS`` par un mot de passe approprié.
id: Gantilah ``CEILOMETER_DBPASS`` dengan password yang sesuai.

source: Replace ``CEILOMETER_DBPASS`` with the password you chose for the Telemetry service database. You must escape special characters such as ':', '/', '+', and '@' in the connection string in accordance with `RFC2396 <https://www.ietf.org/rfc/rfc2396.txt>`_.
de: Ersetzen Sie ``CEILOMETER_DBPASS`` mit dem Passwort, welches Sie für die Telemetriedienst-Datenbank gewählt haben. Sonderzeichen im String für die Datenbankverbindung wie ':', '/', '+', und '@' müssen nach `RFC2396<https://www.ietf.org/rfc/rfc2396.txt>` maskiert werden.
fr: Remplacer ``CEILOMETER_DBPASS`` par le mot de passe choisi pour la base de données du service de Télémétrie. Vous devez protéger les caractères spéciaux comme ':', '/', '+', et '@' dans la chaîne de connexion conformément à la `RFC2396 <https://www.ietf.org/rfc/rfc2396.txt>`_..
id: Gantilah ``CEILOMETER_DBPASS`` dengan password yang Anda pilih untuk database layanan Telemetry. Anda harus escape karakter khusus seperti ':', '/', '+', dan '@' dalam string koneksi sesuai dengan `RFC2396 <https://www.ietf.org/rfc/rfc2396.txt>` _.

source: Replace ``CEILOMETER_PASS`` with the password you chose for the Telemetry service database.
de: Ersetzen Sie ``CEILOMETER_PASS`` mit dem Passwort, welches Sie für den Telemetrie Datenbankdienst gewählt haben.
fr: Remplacer ``CEILOMETER_PASS`` par le mot de passe choisi pour la base de données du service de Télémétrie.
id: Gantilah ``CEILOMETER_PASS`` dengan password yang Anda pilih untuk database layanan Telemetry.

source: Replace ``CEILOMETER_PASS`` with the password you chose for the ``ceilometer`` user in the Identity service.
de: Ersetzen Sie``CEILOMETER_PASS`` mit dem Passwort, welches Sie für den Benutzer ``ceilometer`` im Identitätsdienst gewählt haben.
fr: Remplacer ``CEILOMETER_PASS`` par le mot de passe choisi pour l'utilisateur ``ceilometer`` dans le service d'Identité.
id: Gantilah ``CEILOMETER_PASS`` dengan password yang Anda pilih untuk user ``ceilometer`` dalam pelayanan Identity.

source: Replace ``CINDER_DBPASS`` with a suitable password.
de: Ersetzen Sie ``CINDER_DBPASS`` durch ein geeignetes Passwort.
fr: Remplacer ``CINDER_DBPASS`` par un mot de passe approprié.
id: Ganti ``CINDER_DBPASS`` dengan password yang sesuai.

source: Replace ``CINDER_DBPASS`` with the password you chose for the Block Storage database.
de: Ersetzen Sie ``CINDER_DBPASS`` durch das Passwort, das Sie für die Block-Storage-Datenbank gewählt haben.
fr: Remplacer ``CINDER_DBPASS`` par le mot de passe choisi pour la base de données du Stockage par Blocs.
id: Gantilah ``CINDER_DBPASS`` dengan password yang Anda pilih untuk database Block Storage.

source: Replace ``CINDER_PASS`` with the password you chose for the ``cinder`` user in the Identity service.
de: Ersetzen Sie ``CINDER_PASS`` durch das Passwort, das Sie für den Benutzer ``cinder`` im Identitätsdienst vergeben haben.
fr: Remplacer ``CINDER_PASS`` par le mot de passe choisi pour l'utilisateur ``cinder`` dans le service d'Identité.
id: Gantilah ``CINDER_PASS`` dengan password yang Anda pilih untuk user ``cinder`` dalam pelayanan Identity.

source: Replace ``DEMO_PASS`` with the password you chose for the ``demo`` user in the Identity service.
de: Ersetzen Sie ``DEMO_PASS`` durch das Passwort, das Sie für den Benutzer ``demo`` im Identitätsdienst vergeben haben.
fr: Remplacer ``DEMO_PASS`` par le mot de passe choisi pour l'utilisateur ``demo`` dans le service d'Identité.
id: Ganti ``DEMO_PASS`` dengan password yang Anda pilih untuk user ``demo`` dalam pelayanan Identity.

source: Replace ``DNS_RESOLVER`` with the IP address of a DNS resolver. In most cases, you can use one from the ``/etc/resolv.conf`` file on the host.
de: Ersetzen Sie ``DNS_RESOLVER`` durch die IP-Adresse eines DNS-Auflösungsdienstes. In den meisten Fällen können Sie einen aus der Datei ``/etc/resolv.conf`` verwenden.
fr: Remplacer ``DNS_RESOLVER`` par l'adresse IP d'un DNS. Dans la plupart des cas, vous pouvez utiliser un des serveurs DNS du fichier ``/etc/resolv.conf`` du host.
id: Ganti ``DNS_RESOLVER`` dengan alamat IP dari DNS resolver. Dalam kebanyakan kasus, Anda dapat menggunakan salah satu dari file ``/etc/resolv.conf`` pada host.
