Repository: 25hours/openstack-manuals
Catalog: doc/install-guide/source/locale/*/LC_MESSAGES/install-guide.po
Languages: de, fr, id

source: The Telemetry service requires access to the Object Storage service using the ``ResellerAdmin`` role. Perform these steps on the controller node.
de: Der Telemetriedienst benötigt Zugriff zum Dienst Objekt-Storage unter Benutzung der Rolle ``ResellerAdmin``. Führen Sie diese Schritte auf dem Controller Node durch.
fr: Le service de Télémétrie doit accéder au service de Stockage Objet avec le rôle ``ResellerAdmin``. Pour cela, effectuez les opérations suivantes sur le nœud contrôleur.
id: Layanan Telemetry membutuhkan akses ke layanan Object Storage menggunakan peran ``ResellerAdmin``. Lakukan langkah ini pada kontroler simpul.

source: The Telemetry service uses a NoSQL database to store information. The database typically runs on the controller node. The procedures in this guide use MongoDB.
de: Der Telemetriedienst nutzt eine NoSQL-Datenbank zum Speichern von Informationen. Die Datenbank läuft normalerweise auf dem Controller-Knoten. In diesem Leitfaden wird MongoDB verwendet.
fr: Le service de Télémétrie utilise une base de données NoSQL pour stocker les informations. La base de données tourne généralement sur le nœud contrôleur. Les procédures dans ce guide utilise MongoDB.
id: Layanan Telemetry menggunakan database NoSQL untuk menyimpan informasi. Database biasanya berjalan pada controller node. Prosedur dalam panduan ini menggunakan MongoDB.

source: The ``--provider:physical_network provider`` and ``--provider:network_type flat`` options connect the flat virtual network to the flat (native/untagged) physical network on the ``eth1`` interface on the host using information from the following files:
de: Die ``--provider:physical_network provider`` und ``--provider:network_type flat`` Optionen verbinden das flache virtuelle Netzwerk mit dem flachen (native/untagged) physikalischen Netzwerk auf dem ``eth1`` Interface des Hosts unter Verwendung von Informationen aus den folgenden Dateien:
fr: Les options ``--provider:physical_network provider`` et ``--provider:network_type flat`` connectent le réseau virtual plat au réseau physique plat (natif/non tagué) sur l'interface ``eth1`` du host en utilisant les informations des fichiers suivants:
id: Opsi ``--provider: physical_network provider`` dan ``--provider:network_type flat`` menghubungkan jaringan virtual datar ke jaringan fisik flat (native/untagged) pada interface ``eth1`` pada host menggunakan informasi dari file-file berikut:

source: The ``--shared`` option allows all projects to use the virtual network.
de: Die Option ``--shared`` ermöglicht allen Projekten die Nutzung dieses virtuellen Netzwerkes.
fr: L'option ``--shared`` permet à tous les projets d'utiliser le réseau virtuel.
id: The opsi ``--shared`` memungkinkan semua proyek untuk menggunakan jaringan virtual.

source: The ``.config`` and ``.postinst`` maintainer scripts of the ``nova-common`` package detect automatically the IP address which goes in the ``my_ip`` directive of the ``[DEFAULT]`` section. This value will normally still be prompted, and you can check that it is correct in the nova.conf after ``nova-common`` is installed:
fr: Les scripts de maintenance ``.config`` et ``.postinst`` du package ``nova-common`` détectent automatiquement l'adresse IP qui va dans la directive ``my_ip`` de la section ``[DEFAULT]``. Cette valeur sera normalement encore demandée , et vous pouvez vérifier qu'elle est correcte dans le fichier nova.conf après l'installation du package ``nova-common``:
id: Paket ``.config`` dan ``.postinst`` maintainer scripts of the ``nova-common`` mendeteksi secara otomatis alamat IP yang berjalan di direktif ``my_ip`` dari bagian ``[DEFAULT] ``. Nilai ini biasanya akan tetap diminta, dan Anda dapat memeriksa bahwa itu adalah benar dalam nova.conf setelah ``nova-common`` diinstal:

source: The ``admin`` or other privileged user must create this network because it connects directly to the physical network infrastructure.
de: Der ``admin`` oder ein anderer privilegierter Benutzer muss dieses Netzwerk erstellen, da es eine direkte Verbindung zur physikalischen Netzwerkinfrastruktur herstellt.
fr: L'utilisateur ``admin`` ou tout autre utilisateur avec privilèges doit créer ce réseau parce qu'il se connecte directement à l'infrastructure de réseau physique.
id: ``Admin`` atau user istimewa lainnya harus membuat jaringan ini karena terhubung langsung ke infrastruktur jaringan fisik.

source: The ``demo`` or other unprivileged user can create this network because it provides connectivity to instances within the ``demo`` project only.
de: Der ``demo`` Benutzer oder andere unprivilegierte Benutzer können dieses Netzwerk erstellen, denn es erlaubt nur Verbindung zu Instanzen im ``demo`` Projekt.
fr: L'utilisateur ``demo`` ou tout autre utilisateur sans privilèges peut créer ce réseau parce qu'il fournit la connectivité uniquement aux instances du projet ``demo``.
id: ``Demo`` atau 'unprivileged user' lainnya dapat membuat jaringan ini karena memberikan konektivitas ke instances dalam proyek ``demo`` saja.

source: The ``external_network_bridge`` option intentionally lacks a value to enable multiple external networks on a single agent.
fr: L'option ``external_network_bridge`` manque volontairement d'une valeur pour permettre plusieurs réseaux externes sur un seul agent.
id: Opsi ``external_network_bridge`` sengaja tidak memiliki nilai untuk mengaktifkan multiple external networks pada a single agent.

source: The ``rsync`` service requires no authentication, so consider running it on a private network in production environments.
de: Der Dienst ``rsync`` benötigt keine Authentifizierung, deshalb kann er in Produktivumgebungen in einem privaten Netzwerk laufen.
fr: Le service ``rsync`` ne nécessite aucune authentification, donc dans un environnement de production, envisager de le faire tourner sur un réseau privé.
id: Layanan ``rsync`` tidak memerlukan otentikasi, jadi pertimbangkan menjalankannya pada jaringan private dalam lingkungan produksi.

source: The ``systemctl restart`` command starts each service if not currently running.
de: Der Befehl ``systemctl restart`` startet jeden Dienst wenn er noch nicht läuft.
fr: La commande ``systemctl restart`` démarre tous les services, s'ils ne sont pas déjà démarrés.
id: Command ``systemctl restart`` mulai setiap layanan jika tidak sedang berjalan.

source: The account server uses the account ring to maintain lists of containers.
fr: Le serveur de compte utilise l'anneau de compte pour maintenir les listes de conteneurs.
id: Server account menggunakan account ring untuk mempertahankan daftar kontainer.

source: The automatic configuration process generates a self-signed SSL certificate. Consider obtaining an official certificate for production environments.
de: Die automatische Konfiguration erzeugt ein selbstsigniertes SSL-Zertifikat. Ziehen Sie in Erwägung, ein offizielles Zertifikat für Produktivumgebungen zu erwerben.
fr: Le processus de configuration automatique génère un certificat SSL auto-signé. Envisager d'obtenir un certificat officiel pour les environnements de production.
id: Proses konfigurasi otomatis menghasilkan self-signed SSL certificate. Pertimbangkan mendapatkan sertifikat resmi untuk lingkungan produksi.

source: The compute node handles connectivity and :term:`security groups <security group>` for instances.
de: Der Compute-Node verwaltet die Konnektivität und :term:`Sicherheitsgruppen <security group>` für Instanzen.
fr: Le nœud compute gère la connectivité et les :term:`groupes de sécurité <security group>`des instances.
id: Compute node menangani dan :term:`security groups <security group>` for instances.

source: The compute node runs the :term:`hypervisor` portion of Compute that operates instances. By default, Compute uses the :term:`KVM <kernel-based VM (KVM)>` hypervisor. The compute node also runs a Networking service agent that connects instances to virtual networks and provides firewalling services to instances via :term:`security groups <security group>`.
fr: Le nœud compute exécute la partie :term:`hyperviseur` de Compute qui fait fonctionner les instances. par défaut, Compute utilise l'hyperviseur :term:`KVM <kernel-based VM (KVM)>`. Le nœud compute héberge également un agent du service Réseau qui connecte les instances aux réseaux virtuels et fournit des services de firewall aux instances via les :term:`groupes de sécurité <security group>`.
id: Compute node menjalankan :term: `hypervisor` porsi Compute yang mengoperasikan instances. Secara default, Compute menggunakan :term:`KVM <kernel-based VM (KVM)>` hypervisor. Compute node juga menjalankan agen layanan Networking yang menghubungkan instances ke jaringan virtual dan menyediakan layanan firewall untuk instances melalui :term:`security groups <security group>`.

source: The container server uses the container ring to maintain lists of objects. However, it does not track object locations.
fr: Le serveur conteneur utilise l'anneau des conteneurs pour maintenir les listes d'objets. Néanmoins, il ne trace pas l'emplacement des objets.
id: Server kontainer menggunakan container ring untuk mempertahankan daftar objek. Namun, itu tidak melacak lokasi objek.

source: The controller node requires a minimum of two network interfaces.
fr: Le nœud contrôleur nécessite au minimum deux interfaces réseau.
id: Controller node membutuhkan minimal dua interfaces jaringan.

source: The controller node runs the Identity service, Image service, management portions of Compute, management portion of Networking, various Networking agents, and the dashboard. It also includes supporting services such as an SQL database, :term:`message queue`, and :term:`NTP`.
fr: Le nœud contrôleur héberge le service d'Identité, le service d'Image, la partie management du Compute et du Réseau, plusieurs agents Réseau, et le dashboard. Il inclut également les services support comme une base de données SQL, la :term:`file de message`, et :term:`NTP`.
id: Controller node menjalankan layanan Identity, layanan Image, bagian pengelolaan Compute, porsi pengelolaan Jaringan, berbagai agen Networking, dan dashboard. Ini juga mencakup layanan pendukung seperti database SQL, :term:`message queue`, dan :term:`NTP`.

source: The dashboard relies on functional core services including Identity, Image service, Compute, and either Networking (neutron) or legacy networking (nova-network). Environments with stand-alone services such as Object Storage cannot use the dashboard. For more information, see the `developer documentation <http://docs.openstack.org/developer/ horizon/topics/deployment.html>`__.
de: Das Dashboard hängt von funktionierenden zentralen Diensten ab, etwa dem Identitätsdienst, Abbilddienst, Computedienst und entweder neutron oder nova-network als Netzwerkdienst. Umgebungen mit eigenständigen Diensten wie dem Objektspeicherdienst können das Dashboard nicht verwenden. Für weitere Informationen schauen Sie in die`Entwickler-Dokumentation <http://docs.openstack.org/developer/ horizon/topics/deployment.html>`__.
fr: Le dashboard repose sur des services de base fonctionnels comme le service d'Identité, le service d'Image, le Compute, et soit le Réseau (neutron) ou le réseau legacy (nova-network). Les environnements avec des services autonomes comme le Stockage d'Objet ne peuvent pas utiliser le dashboard. Pour plus d'informations, voir la `documentation développeur <http://docs.openstack.org/developer/ horizon/topics/deployment.html>`__.
id: Dashboard bergantung pada layanan inti fungsional termasuk Identity, layanan Gambar, Compute, dan baik Networking (neutron) ataupun jaringan legacy (nova-network). Lingkungan dengan layanan yang berdiri sendiri seperti Object Storage tidak dapat menggunakan dashboard. Untuk informasi lebih lanjut, lihat `developer documentation <http://docs.openstack.org/developer/ horizon/topics/deployment.html>`__.

source: The example architecture requires at least two nodes (hosts) to launch a basic :term:`virtual machine <virtual machine (VM)>` or instance. Optional services such as Block Storage and Object Storage require additional nodes.
fr: L'architecture en exemple nécessite au moins deux nœuds (hôtes) pour lancer une simple :term:`machine virtuelle <virtual machine (VM)>` ou instance. Les services optionnels comme le Stockage par Blocs et le Stockage Objet nécessite des nœuds additionnels.
id: Contoh arsitektur membutuhkan setidaknya dua node (host) untuk meluncurkan dasar :term:`virtual machine <virtual machine (VM)>` atau instance. Layanan opsional seperti Block Storage dan Object Storage membutuhkan node tambahan.

source: The example architectures assume use of the following networks:
de: Im Beispiel wird angenommen, dass folgende Netzwerke genutzt werden:
fr: Les architectures en exemple supposent l'utilisation des réseaux suivants:
id: Arsitektur contoh menganggap penggunaan jaringan berikut:

source: The following instructions and diagrams use example IP address ranges. You must adjust them for your particular environment.
de: Die folgenden Instruktionen und Diagramme verwenden beispielhafte IP-Adressbereiche. Sie müssen sie entsprechend Ihrer Umgebung anpassen.
fr: Les instructions et diagrammes suivants utilisent des exemples de plages d'adresses IP. Vous devez ajuster ces plages à votre environnement.
id: Petunjuk dan diagram berikut menggunakan rentang alamat IP contoh. Anda harus menyesuaikan mereka untuk lingkungan tertentu Anda.

source: The following minimum requirements should support a proof-of-concept environment with core services and several :term:`CirrOS` instances:
de: Die folgenden Mindestanforderungen sollten eine Proof-of-concept-Umgebung mit den Kerndiensten und einigen :term:`CirrOS`-Instanzen unterstützen können:
fr: Les exigences minimum suivantes devraient supporter un environnement de proof-of-concept avec les services principaux et plusieurs instances :term:`CirrOS`:
id: Persyaratan minimum berikut harus mendukung lingkungan proof-of-concept dengan layanan inti dan beberapa :term:`CirrOS` instances:

source: The following table provides a list of services that require passwords and their associated references in the guide:
de: Die nachstehende Tabelle enthält eine Liste der Dienste, die Passwörter benötigen und ihre zugehörigen Verweise zum Leitfaden:
fr: Le tableau suivant montre la liste des services qui nécessitent des mots de passe et leur références associées dans ce guide:
id: Tabel berikut menyediakan daftar layanan yang membutuhkan password dan referensi terkait dalam panduan:

source: The installation of the NoSQL database server is only necessary when installing the Telemetry service as documented in :ref:`install_ceilometer`.
de: Die Installation des NoSQL-Datenbankservers ist nur notwendig, wenn der Telemetriedienst installiert wird, beschrieben im Abschnitt :ref:`install_ceilometer`.
fr: L'installation d'une base de données NoSQL est seulement nécessaire si on installe le service de Télémétrie comme documenté dans :ref:`install_ceilometer`.
id: Instalasi server database NoSQL hanya diperlukan ketika menginstal layanan Telemetry yang didokumentasikan dalam :ref:`install_ceilometer`.

source: The instance must have connectivity to the management IP address on the storage node.
de: Die Instanz muss eine Verbindung zur Management-IP-Adresse des Speicherknotens haben.
fr: L'instance doit pouvoir joindre l'adresse IP de management sur le nœud de stockage.
id: Instance harus memiliki konektivitas ke alamat IP manajemen pada storage node.

source: The instance must use the ``selfservice`` network.
de: Die Instanz muss das ``selfservice`` Netzwerk verwenden.
fr: L'instance doit utiliser le réseau ``selfservice``.
id: Instance harus menggunakan jaringan ``selfservice``.

source: The object server uses the object ring to maintain lists of object locations on local devices.
fr: Le serveur d'objets utilise l'anneau des objets pour maintenir les listes des emplacements des objets sur les devices locaux.
id: Objek server menggunakan object ring untuk mempertahankan daftar lokasi objek pada perangkat lokal.

source: The openSUSE distribution uses the concept of patterns to represent collections of packages. If you selected 'Minimal Server Selection (Text Mode)' during the initial installation, you may be presented with a dependency conflict when you attempt to install the OpenStack packages. To avoid this, remove the minimal\_base-conflicts package:
de: Die openSUSE-Distribution verwendet das Pattern-Konzept, um Paketsammlungen zu verwalten. Wenn Sie bei der Erstinstallation 'Minimal Server Selection (Text Mode)' verwendet haben, könnten Sie beim Versuch, die OpenStack-Pakete zu installieren auf Abhängigkeitskonflikte treffen. Um dies zu verhindern, entfernen Sie das Paket minimal\_base-conflicts:
fr: La distribution openSUSE utilise le concept de patterns pour représenter une collection de packages. Si vous sélectionner 'Minimal Server Selection (Text Mode)' pendant l'installation initiale, vous serez peut-être amené à rencontrer un conflit de dépendance quand vous essaierez d'installer les packages OpenStack. Pour éviter cela, supprimer le package minimal\_base-conflicts:
id: Distribusi openSUSE menggunakan konsep pola untuk mewakili koleksi paket. Jika Anda memilih 'Minimal Server Selection (Text Mode)' selama instalasi awal, Anda mungkin dihadapkan dengan konflik ketergantungan ketika Anda mencoba untuk menginstal paket OpenStack. Untuk menghindari hal ini, hapuslah paket minimal\_base-conflicts:

source: The optional Block Storage node contains the disks that the Block Storage and Shared File System services provision for instances.
fr: Le nœud optionnel de Stockage par Blocs contient les disques que les services de Stockage par Blocs et de Systèmes de Fichiers Partagés provisionne pour les instances.
id: Opsional Block Storage node berisi disk yang Block Storage dan penyediaan layanan Shared File System instance.

source: The optional Object Storage node contain the disks that the Object Storage service uses for storing accounts, containers, and objects.
fr: Le nœud optionnel de Stockage Objet contient les disques que le service de Stockage Objet utilise pour stocker les comptes, les conteneurs et les objets.
id: Opsional Object Storage node berisi disk yang layanan Object Storage menggunakan storing accounts, containers, dan object.

source: The output should indicate four agents on the controller node and one agent on each compute node.
de: Die Ausgabe sollte vier Agenten auf dem Controller-Node und jeweils einen auf jedem Compute-Node aufweisen.
fr: La sortie d'écran devrait indiquer quatre agents sur le nœud contrôleur et un agent sur chaque nœud compute.
id: Output harus menunjukkan empat agen pada kontroler node dan satu agen pada setiap node komputasi.

source: The output should indicate three agents on the controller node and one agent on each compute node.
de: Die Ausgabe sollte drei Agenten auf dem Controller-Node und jeweils einen auf jedem Compute-Node aufweisen.
fr: La sortie d'écran devrait indiquer trois agents sur le nœud contrôleur et un agent sur chaque nœud compute.
id: Output harus menunjukkan tiga agen pada kontroler node dan satu agen pada setiap node komputasi.

source: The packages are signed by GPG key ``05905EA8``. You should verify the fingerprint of the imported GPG key before using it.
de: Die Pakete sind mit dem GPG-Schlüssel ``05905EA8`` signiert. Sie sollten den Fingerabdruck des importierten GPG-Schlüssels verifizieren, bevor Sie ihn verwenden.
fr: Les packages sont signés avec la clé GPG ``05905EA8``. Vous devez vérifier l'empreinte de la clé GPG importée avant de l'utiliser.
id: Paket-paket yang ditandatangani oleh GPG key ``05905EA8``. Anda harus memverifikasi sidik jari GPG key sebelum menggunakannya.

source: The packages are signed by GPG key ``17280DDF``. You should verify the fingerprint of the imported GPG key before using it.
de: Die Pakete sind mit dem GPG-Schlüssel ``17280DDF`` signiert. Sie sollten den Fingerabdruck des importierten GPG-Schlüssels verifizieren, bevor Sie ihn verwenden.
fr: Les packages sont signés avec la clé GPG ``17280DDF``. Vous devez vérifier l'empreinte de la clé GPG importée avant de l'utiliser.
id: Paket-paket yang ditandatangani oleh GPG key ``17280DDF``. Anda harus memverifikasi sidik jari key GPG impor sebelum menggunakannya.

source: The packages are signed by GPG key ``D85F9316``. You should verify the fingerprint of the imported GPG key before using it.
de: Die Pakete sind mit dem GPG-Schlüssel ``D85F9316`` signiert. Sie sollten den Fingerabdruck des importierten GPG-Schlüssels verifizieren, bevor Sie ihn verwenden.
fr: Les packages sont signés par la clé GPG ``D85F9316``. Vous devriez vérifier l'empreinte de la clé GPG importée avant de l'utiliser.
id: Paket-paket yang ditandatangani oleh key GPG `` D85F9316``. Anda harus memverifikasi sidik jari key GPG impor sebelum menggunakannya.

source: The packages can automatically create the service entity and API endpoint.
de: Die Pakete können die Dienstentität und den API-Endpunkt automatisch erstellen.
fr: Les packages peuvent créer automatiquement l'entité de service et le endpoint API.
id: Paket dapat secara otomatis membuat entitas layanan dan API endpoint.

source: The packages can automatically create the service entity and API endpoints.
de: Die Pakete können die Dienstentität und API-Endpunkte automatisch erstellen.
fr: Les packages peuvent automatiquement créer l'entité de service et les endpoints API.
id: Paket dapat secara otomatis membuat entitas layanan dan endpoint API.
