Repository: 25hours/openstack-manuals
Catalog: doc/install-guide/source/locale/*/LC_MESSAGES/install-guide.po
Languages: de, fr, id

source: Create the ``default`` domain:
de: Erstellen Sie die Domäne ``default``:
fr: Créer le domaine ``default``:
id: Buat domain ``default``:

source: Create the ``demo-template.yml`` file with the following content:
de: Erstellen Sie die Datei ``demo-template.yml``mit folgendem Inhalt:
fr: Créer le fichier ``demo-template.yml`` avec le contenu suivant:
id: Buat file ``demo-template.yml`` dengan konten berikut:

source: Create the ``demo`` project:
de: Erstellen Sie das Projekt ``demo``:
fr: Créer le projet ``demo``:
id: Buat proyek ``demo``:

source: Create the ``demo`` user:
de: Erstellen Sie den Benutzer ``demo``:
fr: Créer l'utilisateur ``demo``:
id: Buat user ``demo``:

source: Create the ``glance`` database:
de: Erstellen Sie die Datenbank ``glance``:
fr: Créer la base de données ``glance``:
id: Buat database ``glance``:

source: Create the ``glance`` service entity:
de: Erstellen Sie die Dienstentität ``glance``:
fr: Créer l'entité de service ``glance``:
id: Buat entitas layanan ``glance``:

source: Create the ``glance`` user:
de: Erstellen Sie den Benutzer ``glance``:
fr: Créer l'utilisateur ``glance``:
id: Buat user ``glance``:

source: Create the ``heat_domain_admin`` user to manage projects and users in the ``heat`` domain:
de: Erstellen Sie den Benutzer ``heat_domain_admin`` zur Verwaltung von Projekten und Benutzern in der Domäne ``heat``:
fr: Créer l'utilisateur ``heat_domain_admin`` pour gérer les projets et les utilisateurs du domaine ``heat``:
id: Buat user ``heat_domain_admin`` untuk mengelola proyek dan user dalam domain ``heat``:

source: Create the ``heat_stack_owner`` role:
de: Erstellen Sie die Rolle ``heat_stack_owner``:
fr: Créer le rôle ``heat_stack_owner``:
id: Buat peran ``heat_stack_owner``:

source: Create the ``heat_stack_user`` role:
de: Erstellen Sie die Rolle ``heat_stack_user``:
fr: Créer le rôle ``heat_stack_user``:
id: Buat peran ``heat_stack_user``:

source: Create the ``heat`` and ``heat-cfn`` service entities:
de: Erstellen Sie die Dienstentitäten ``heat`` und ``heat-cfn``:
fr: Créer les entités de service ``heat`` et ``heat-cfn``:
id: Buat entitas layanan ``heat`` dan ``heat-cfn``:

source: Create the ``heat`` database:
de: Erstellen Sie die Datenbank ``heat``:
fr: Créer la base de données ``heat``:
id: Buat database ``heat``:

source: Create the ``heat`` domain that contains projects and users for stacks:
de: Erstellen Sie die Domäne ``heat``, diese enthält Projekte und Benutzer für Stacks:
fr: Créer le domaine ``heat`` qui contient les projets et les utilisateurs pour les stacks:
id: Buat domain ``heat`` yang berisi proyek dan user untuk stack:

source: Create the ``heat`` user:
de: Erstellen Sie den Benutzer ``heat``:
fr: Créer l'utilisateur ``heat``:
id: Buat user ``heat``:

source: Create the ``keystone`` database:
de: Erstellen Sie die Datenbank ``keystone``:
fr: Créer la base de donnée ``keystone``:
id: Buat database ``keystone``:

source: Create the ``manila`` and ``manilav2`` service entities:
de: Erstellen Sie die Dienstinstanzen ``manila`` und ``manilav2``:
fr: Créer les entités de service ``manila`` et ``manilav2``:
id: Buat entitas layanan ``manila`` dan ``manila v2``:

source: Create the ``manila`` database:
de: Erstellen Sie die ``manila`` Datenbank:
fr: Créer la base de données ``manila``:
id: Buat database ``manila``:

source: Create the ``neutron`` database:
de: Erstellen Sie die ``neutron`` Datenbank:
fr: Créer la base de données ``neutron``:
id: Buat database ``neutron``:

source: Create the ``neutron`` service entity:
de: Erstellen Sie die Dienstentität ``neutron``:
fr: Créer l'entité de service ``neutron``:
id: Buat entitas layanan ``neutron``:

source: Create the ``neutron`` user:
de: Erstellen Sie den Benutzer ``neutron``:
fr: Créer l'utilisateur ``neutron``:
id: Buat user ``neutron``:

source: Create the ``nova_api`` and ``nova`` databases:
de: Erstellen Sie die Datenbanken ``nova_api`` und ``nova``:
fr: Créer les bases de données ``nova_api`` et ``nova``:
id: Buat `` nova_api`` dan `` database nova``:

source: Create the ``nova`` service entity:
fr: Créer l'entité de service ``nova``:
id: Buat entitas layanan ``nova``:

source: Create the ``nova`` user:
de: Erstellen Sie den Benutzer ``nova``:
fr: Créer l'utilisateur ``nova``:
id: Buat user ``nova``:

source: Create the ``recon`` directory and ensure proper ownership of it:
de: Erstellen Sie das Verzeichnis ``recon`` und richten Sie die korrekten Berechtigungen ein:
fr: Créer le répertoire ``recon`` et s'assurer qu'il possède les bons droits:
id: Buat direktori ``recon`` dan pastikan kepemilikan tepat itu:

source: Create the ``swift`` service entity:
fr: Créer l'entité de service ``swift``:
id: Buat entitas layanan ``swift``:

source: Create the ``swift`` user:
fr: Créer l'utilisateur ``swift``:
id: Buat user ``swift``:

source: Create the ``trove`` database:
fr: Créer la base de données ``trove``:
id: Buat database ``trove``:

source: Create the ``trove`` service entity:
fr: Créer l'entité de service ``trove``:
id: Buat entitas layanan ``trove``:

source: Create the ``trove`` user:
fr: Créer l'utilisateur ``trove``:
id: Buat user ``trove``:

source: Create the ``user`` role:
de: Erstellen Sie die Rolle ``user``:
fr: Créer le rôle ``user``:
id: Buat peran ``user``:

source: Create the base ``account.builder`` file:
fr: Créer le fichier de base ``account.builder``:
id: Buat basis file ``account.builder``:

source: Create the base ``container.builder`` file:
fr: Créer le fichier de base ``container.builder``:
id: Buat file ``container.builder`` dasar:

source: Create the base ``object.builder`` file:
fr: Créer le fichier de base ``object.builder``:
id: Buat file ``object.builder`` dasar:

source: Create the mount point directory structure:
de: Erstellen Sie die Verzeichnisstruktur für die Einhängepunkte:
fr: Créer la structure de répertoire du point de montage:
id: Buat 'mount point directory structure':

source: Create the network:
de: Erzeuge das Netzwerk:
fr: Créer le réseau:
id: Buat jaringan:

source: Create the provider network
de: Anbieternetzwerk erstellen
fr: Créer le réseau fournisseur
id: Buat jaringan provider

source: Create the router:
de: Den Router erstellen:
fr: Créer le routeur:
id: Buat router:

source: Create the self-service network
de: Erstellen des self-service Netzwerks
fr: Créer le réseau self-service
id: Buat jaringan self-service

source: Create the service entity and API endpoints
de: Erstellen Sie die Dienstentität und die API-Endpunkte
fr: Créer l'entité de service et les endpoints API
id: Buat entitas layanan dan endpoint API

source: Create the service entity for the Identity service:
de: Erstellen Sie die Dienstentität für den Identitätsdienst:
fr: Créer l'entité de service pour le service d'Identité:
id: Buat entitas layanan untuk layanan Identity:

source: Create the service image
de: Erzeugen Sie das Dienst-Abbild
fr: Créer l'image de service
id: Menciptakan image layanan

source: Create the share network using the ``selfservice`` network and subnet IDs:
fr: Créer le réseau de partage en utilisant le réseau ``selfservice`` et les IDs de sous-réseau:
id: Buat jaringan bersama dengan menggunakan jaringan ``selfservice`` dan subnet ID:

source: Create virtual networks
de: Erzeugen virtueller Netzwerke
fr: Créer des réseaux virtuels
id: Buat jaringan virtual

source: Create virtual networks for the networking option that you chose in :ref:`networking`. If you chose option 1, create only the provider network. If you chose option 2, create the provider and self-service networks.
de: Erstellen Sie virtuelle Netzwerke für die Netzwerkoption, die Sie in :ref:`networking` gewählt haben. Für Option 1 erstellen Sie nur ein Anbieternetzwerk. Für Option 2 erstellen Sie ein Anbieter- und ein self-service Netzwerk.
fr: Créer des réseaux virtuels pour l'option réseau que vous avez choisie dans :ref:`networking`. Si vous avez choisi l'option 1, créer seulement le réseau fournisseur. Si vous avez choisi l'option 2, créer les réseaux fournisseur et self-service.
id: Membuat jaringan virtual untuk opsi jaringan yang Anda pilih di :ref: `networking`. Jika Anda memilih opsi 1, membuat hanya jaringan provider. Jika Anda memilih opsi 2, membuat jaringan provider dan self-service .

source: Creating the scripts
de: Erstellen der Skripte
fr: Création des scripts
id: Membuat script

source: Customize your dashboard. See section `Customize the dashboard <http://docs.openstack.org/admin-guide/common/dashboard-customizing.html>`__.
de: Passen Sie Ihr Dashboard an. Weitere Informationen: `Customize the dashboard <http://docs.openstack.org/admin-guide/common/dashboard-customizing.html>`__.
fr: Personnalisez votre dashboard. Voir la section `Personnaliser le dashboard <http://docs.openstack.org/admin-guide/common/dashboard-customizing.html>`__.

source: Dashboard
fr: Tableau de bord

source: Database password (no variable used)
de: Datenbankpasswort (kein Wert gesetzt)
fr: Mot de passe de base de données (pas de variable)

source: Database password for Compute service
de: Datenbankpasswort für den Compute-Dienst
fr: Mot de passe base de données pour le service Compute
id: Password database untuk layanan Compute

source: Database password for Image service
de: Datenbankpasswort für den Abbilddienst
fr: Mot de passe de base de données pour le service d'Image
id: Password database untuk layanan Image

source: Database password for the Block Storage service
de: Datenbankpasswort für den Block-Speicherdienst
fr: Mot de passe de la base de données du service de Stockage par Blocs
id: Password database untuk layanan Block Storage

source: Database password for the Networking service
de: Datenbankpasswort des Netzwerkdienstes
fr: Mot de passe base de données pour le service Neutron
id: Password database untuk layanan Networking

source: Database password for the Orchestration service
de: Datenbankpasswort für den Orchestrierungsdienst
fr: Mot de passe base de données pour le service d'Orchestration
id: Password database untuk layanan Orchestration

source: Database password for the Telemetry service
de: Datenbankpasswort für den Telemetriedienst
fr: Mot de passe de la base de donnée du service de Télémétrie
id: Password database untuk layanan Telemetry

source: Database password for the dashboard
de: Datenbankpasswort für das Dashboard
fr: Mot de passe base de données du dashboard
id: Password database untuk dashboard

source: Database password of Identity service
de: Datenbankpasswort des Identitätsdienstes
fr: Mot de passe base de données du service d'Identité
id: Password database layanan Identity

source: Database population occurs later for Networking because the script requires complete server and plug-in configuration files.
de: Die Bestückung der Datenbank passiert später für das Netzwerk, denn das Skript benötigt vollständige Server und Plug-in Konfigurationsdateien.
fr: Le remplissage de la base de données a lieu plus tard pour le service Réseau parce que le script a besoin des fichiers de configuration complets pour le serveur et les plugin.
id: Populasi database terjadi kemudian untuk Networking karena script memerlukan server yang lengkap dan file konfigurasi plug-in.

source: Database service
fr: Service de base de données
id: Layanan Database

source: Default configuration files vary by distribution. You might need to add these sections and options rather than modifying existing sections and options. Also, an ellipsis (...) in the configuration snippets indicates potential default configuration options that you should retain.
de: Die voreingestellten Konfigurationsdateien können je nach Distribution unterschiedlich aussehen. Es kann notwendig sein, diese Abschnitte und Optionen selbst hinzuzufügen anstatt bestehende zu anzupassen. Außerdem deuten Auslassungszeichen (...) in den Konfigurationsabschnitten Standardeinstellungen an, die beibehalten werden sollten.
fr: Les fichiers de configuration par défaut diffèrent d'une distribution à l'autre. Vous pouvez être amené à ajouter ces sections et options plutôt que de modifier des sections et options existantes. Par ailleurs, une ellipse (...) dans l'extrait de configuration indique d'éventuelles options de configuration par défaut que vous devez conserver.
id: File konfigurasi default bervariasi tergantung distribusi. Anda mungkin perlu menambahkan bagian ini dan pilihan daripada memodifikasi bagian dan pilihan yang ada. Juga, elipsis (...) dalam cuplikan konfigurasi menunjukkan opsi konfigurasi default potensial yang harus Anda mempertahankan.

source: Default configuration files vary by distribution. You might need to add these sections and options rather than modifying existing sections and options. Also, an ellipsis (``...``) in the configuration snippets indicates potential default configuration options that you should retain.
fr: Les fichiers de configuration par défaut diffèrent par distribution. Vous pouvez être amenés à ajouter ces sections et options plutôt que de modifier des sections et options existantes. De plus, une ellipse (``...``) dans l'extrait de configuration indique d'éventuelles options de configuration par défaut que vous devriez conserver.
id: File konfigurasi default bervariasi oleh distribusi. Anda mungkin perlu menambahkan section ini dan opsi daripada memodifikasi section dan opsi yang ada. Juga, elipsis (`` ... ``) dalam cuplikan konfigurasi menunjukkan opsi konfigurasi default potensial yang harus Anda mempertahankan.

source: Default gateway: 10.0.0.1
fr: Passerelle par défaut: 10.0.0.1

source: Default gateway: ``10.0.0.1``
de: Standardgateway: ``10.0.0.1``
fr: Passerelle par défaut: ``10.0.0.1``

source: Delete the stack.
de: Löschen Sie den Stack.
fr: Supprimer la stack.
id: Hapus stack.

source: Determine and implement the necessary core and optional services to meet performance and redundancy requirements.
fr: Définir et mettre en œuvre les services de base et les services optionnels pour satisfaire aux besoins de performance et de redondance.
id: Menetapkan dan menerapkan inti yang diperlukan dan layanan opsional untuk memenuhi persyaratan kinerja dan redundansi.

source: Determine available networks.
de: Ermitteln Sie verfügbare Netzwerke.
fr: Déterminer les réseaux disponibles.
id: Tentukan jaringan yang tersedia.

source: Determine export IP address of the share:
de: Bestimmen der Export-IP-Adresse der Freigabe:
fr: Déterminer l'adresse IP d'export du partage:
id: Tentukan ekspor alamat IP dari share:

source: Determine instance options
de: Bestimmen der Instanzoptionen
fr: Définir les options de l'instance
id: Tentukan opsi instance

source: Determine whether your compute node supports hardware acceleration for virtual machines:
de: Überprüfen Sie ob Ihr Compute-Node Hardwarebeschleunigung für virtuelle Maschinen unterstützt:
fr: Déterminer si les nœuds compute supportent l'accélération hardware pour les machines virtuelles:
id: Pastikan apakah compute node Anda mendukung akselerasi hardware untuk mesin virtual:

source: Disable DHSS before creating a share using the LVM driver.
de: Deaktivieren von DHSS vor dem Erstellen einer Freigabe mittels LVM-Treiber
fr: Désactiver DHSS avant de créer un partage à l'aide du driver LVM.
id: Menonaktifkan DHSS sebelum membuat share menggunakan driver LVM.

source: Disable or remove any automatic update services because they can impact your OpenStack environment.
de: Deaktivieren Sie sämtliche automatischen Updatedienste, es können sonst unerwartete Probleme in Ihrer OpenStack-Umgebung auftreten.
fr: Désactiver ou supprimer tout service de mise à jour automatique car il peut impacter votre environnement OpenStack.
id: Menonaktifkan atau menghapus layanan update otomatis karena mereka dapat mempengaruhi lingkungan OpenStack Anda.

source: Disable the keystone service from starting automatically after installation:
de: Verhindern Sie das automatische Starten des Keystone-Dienstes nach der Installation:
fr: Désactiver le service keystone pour qu'il ne démarre pas automatiquement après l'installation:
id: Menonaktifkan layanan keystone dimulai secara otomatis setelah instalasi:

source: Distribute ring configuration files
fr: Distribuer les fichiers de configuration des anneaux de stockage:
id: Mendistribusikan file konfigurasi ring

source: Distributions release OpenStack packages as part of the distribution or using other methods because of differing release schedules. Perform these procedures on all nodes.
de: Distributionen veröffentlichen OpenStack-Pakete als Teil der Distribution oder nutzen andere Methoden aufgrund abweichender Releasezyklen. Führen Sie diese Schritte auf allen anderen Knoten aus.
fr: Les distributions livrent OpenStack soit avec la distribution elle-même, soit par d'autres moyens en fonction du calendrier de sortie des différentes versions. Effectuer ces procédures sur tous les nœuds.
id: Distribusi merilis paket OpenStack sebagai bagian dari distribusi atau menggunakan metode lain karena perbedaan jadwal rilis. Lakukan prosedur ini pada semua node.

source: Do not change the ``HWADDR`` and ``UUID`` keys.
de: Ändern Sie nicht die Schlüssel für ``HWADDR`` und ``UUID``.
fr: Ne pas modifier les clés ``HWADDR`` et ``UUID``.
id: Jangan mengubah key ``HWADDR`` dan ``UUID``.

source: Do not change the order of the modules.
fr: Ne pas modifier l'ordre des modules.
id: Jangan mengubah urutan modul.

source: Do not repeat this step when creating additional users for this project.
de: Wiederholen Sie diesen Schritt nicht wenn Sie diesem Projekt weitere Benutzer hinzufügen möchten.
fr: Ne pas répéter cette étape quand vous créez d'autres utilisateurs pour ce projet.
id: Jangan ulangi langkah ini ketika membuat user tambahan untuk proyek ini.

source: Download a test file from the ``container1`` container:
de: Laden Sie eine Testdatei vom Container ``container1`` herunter:
fr: Télécharger un fichier de test à partir du conteneur ``container1``:
id: Men-download file test dari container ``container1``:

source: Download the CirrOS image from the Image service:
de: Herunterladen des CirrOS Abbildes vom Abbilddienst:
fr: Télécharger l'image CirrOS à partir du service d'Image:
id: Downloadlah image CirrOS dari layanan Image:

source: Download the source image of the share server:
de: Laden Sie das Quellabbild des Freigabeservers herunter:
fr: Télécharger l'image source du serveur de partage:
id: Download image sumber di server share:

source: Download the source image:
de: Laden Sie das Quellabbild herunter:
fr: Télécharger l'image source:
id: Download image sumber:

source: Due to a bug in the Ubuntu packages, edit the service definition files to use the correct configuration settings.
fr: Suite à un bug dans les packages Ubuntu, éditer les fichiers de définition du service pour utiliser les bons paramètres de configuration.
id: Karena ada bug dalam paket Ubuntu, edit file definisi layanan untuk menggunakan pengaturan konfigurasi yang benar.

source: Due to a packaging bug, remove the ``logdir`` option from the ``[DEFAULT]`` section.
de: Entfernen Sie die wegen eines Paketierungsfehlers vorhandene ``log-dir`` Option aus der ``[DEFAULT]`` Sektion.
fr: A cause d'un bug de packaging, supprimer l'option ``logdir`` de la section ``[DEFAULT]``.
id: Karena packaging bug, hapus opsi ``log_dir`` dari bagian ``[DEFAULT] ``.

source: During the final stage of the package installation, it is possible to automatically create an ``admin`` and ``service`` project, and an ``admin`` user. This can later be used for other OpenStack services to contact the Identity service. This is the equivalent of running the below commands:
de: Während des letzten Abschnitts der Paketinstallation ist es möglich, die Projekte ``admin`` und ``service`` sowie den Benutzer ``admin`` automatisch zu erstellen. Andere OpenStack-Dienste können dies anschließend zum Kontaktieren des Identitätsdienstes verwenden. Es ist das Äquivalent zu den unten stehenden Befehlen:
fr: Lors de l'étape finale d'installation du package, il est possible de créer automatiquement des projets ``admin`` et ``service``, et un utilisateur ``admin``. Ils pourront ensuite être utilisés par d'autres services OpenStack pour contacter le service d'Identité. Cela revient à exécuter les commandes suivantes:
id: Pada tahap akhir dari paket instalasi, adalah mungkin untuk secara otomatis membuat `` admin`` dan proyek `` service``, dan user ``admin``. Ini nantinya dapat digunakan untuk layanan OpenStack lain untuk menghubungi layanan Identity. Ini adalah setara dengan menjalankan command di bawah ini:

source: Each item in the filter array begins with ``a`` for **accept** or ``r`` for **reject** and includes a regular expression for the device name. The array must end with ``r/.*/`` to reject any remaining devices. You can use the :command:`vgs -vvvv` command to test filters.
de: Jeder Eintrag im Filter beginnt mit einem ``a`` für **accept** oder ``r`` für **reject** und beinhaltet einen regulären Ausdruck für den Gerätenamen. Der Filtereintrag muss zum Abweisen aller übrigen Geräte mit ``r/.*/`` enden. Sie können den Befehl `vgs -vvvv`zum Testen der Filter verwenden.
fr: Chaque élément du tableau de filtre commence par ``a`` pour **accepter** ou ``r`` pour **rejeter** et comporte une expression régulière pour le nom de device. Le tableau doit se terminer par ``r/.*/`` pour rejeter tous les devices restants. Vous pouvez utiliser la commande :command:`vgs -vvvv` pour tester les filtres.
id: Setiap item dalam array filter yang dimulai dengan ``a`` untuk **accept ** atau ``r`` untuk **reject** dan termasuk ekspresi reguler untuk nama perangkat. Array harus diakhiri dengan `` r /.*/ `` untuk menolak setiap perangkat yang tersisa. Anda dapat menggunakan perintah :command:`vgs -vvvv` untuk menguji filter

source: Each plug-in that Networking uses has its own concepts. While not vital to operating the VNI and OpenStack environment, understanding these concepts can help you set up Networking. All Networking installations use a core plug-in and a security group plug-in (or just the No-Op security group plug-in). Additionally, Firewall-as-a-Service (FWaaS) and Load-Balancer-as-a-Service (LBaaS) plug-ins are available.
de: Jedes vom Netzwerk verwendete Plug-in hat sein eigenes Konzept. Auch wenn es nicht lebensnotwendig zum Betrieb von VNI und der OpenStack Umgebung ist, so hilft das Verstehen der Konzepte beim Einrichten des Netzwerkes. Alle Netzwerkinstallationen verwenden ein Kern-Plug-in und ein Sicherheitsgruppen-Plug-in (oder einfach das No-Op Sicherheitsgruppen-Plug-in). Zusätzlich sind Firewall-as-a-Service (FWaaS) und Load-Balancer-as-a-Service (LBaaS) Plug-ins verfübar.
fr: Chaque plugin utilisé par le composant Réseau a ses propres concepts. Bien que ce ne soit pas vital pour faire fonctionner l'infrastructure réseau virtuelle (VNI) et l'environnement OpenStack, comprendre ces concepts peut vous aider à mettre en place le composant Réseau. Toutes les installation réseau utilisent un plugin principal et un plugin Groupe de Sécurité (ou simplement le plugin Groupe de Sécurité No-Op). En complément, des plugins de Firewall-as-a-Service (FWaaS) et de Load-Balancer-as-a-Service (LBaaS) sont disponibles.
id: Setiap plug-in dimana Networking menggunakan memiliki konsep sendiri. Meskipun tidak penting untuk operasi lingkungan VNI dan OpenStack, memahami konsep-konsep ini dapat membantu Anda mengatur Networking. Semua instalasi Jaringan menggunakan core plug-in dan security group plug-in (atau just the No-Op security group plug-in). Selain itu, plug-in Firewall-as-a-Service (FWaaS) dan Load-Balancer-as-a-Service (LBaaS) tersedia.
