Repository: 25hours/openstack-manuals
Catalog: doc/install-guide/source/locale/*/LC_MESSAGES/install-guide.po
Languages: de, fr, id

source: Before starting the Object Storage services, you must create the initial account, container, and object rings. The ring builder creates configuration files that each node uses to determine and deploy the storage architecture. For simplicity, this guide uses one region and two zones with 2^10 (1024) maximum partitions, 3 replicas of each object, and 1 hour minimum time between moving a partition more than once. For Object Storage, a partition indicates a directory on a storage device rather than a conventional partition table. For more information, see the `Deployment Guide <http://docs.openstack.org/developer/swift/deployment_guide.html>`__.
fr: Avant de démarrer les services de Stockage Objet, vous devez créer le compte initial, le conteneur, et les anneaux d'objet. Le constructeur d'anneau créé des fichiers de configuration que chaque nœud utilise pour déterminer et déployer l'architecture de stockage. Pour simplifier, ce guide utilise une région et deux zones avec au maximum 2^10 (1024) partitions, 3 replicas de chaque objet, et au minimum 1 heure entre les déplacements multiples de partition. Pour le Stockage Objet, une partition désigne un répertoire sur un device de stockage plutôt qu'une table de partition conventionnelle. Pour plus d'informations, voir le `Guide de Déploiement <http://docs.openstack.org/developer/swift/deployment_guide.html>`__.
id: Sebelum memulai layanan Object Storage, Anda harus membuat initial account, container, dan object ring. Pembangun ring menciptakan file konfigurasi yang menggunakan setiap node untuk menentukan dan mengerahkan arsitektur penyimpanan. Untuk mempermudah, panduan ini menggunakan satu wilayah dan dua zona dengan 2 ^ 10 (1024) partisi maksimum, 3 replika setiap objek, dan 1 jam waktu minimum antara pergerakan partisi lebih dari sekali. Untuk Object Storage, partisi menunjukkan direktori pada perangkat penyimpanan bukan tabel partisi konvensional. Untuk informasi lebih lanjut, lihat ``Deployment Guide <http://docs.openstack.org/developer/swift/deployment_guide.html>`__.

source: Before you configure the OpenStack Identity service, you must create a database and an administration token.
de: Bevor Sie den OpenStack Identiäts Dienst installieren können, müssen Sie zunächst eine Datenbank und ein Administrations Token erstellen.
fr: Avant de configurer le service d'identité d'OpenStack, vous devez créer une base de donnée et un jeton d'administration.
id: Sebelum kamu melakukan konfigurasi layanan OpenStack Identity, kamu harus membuat sebuah database dan sebuah token administrasi

source: Before you configure the OpenStack Networking (neutron) service, you must create a database, service credentials, and API endpoints.
de: Bevor Sie den OpenStack Netzwerkdienst (Neutron) konfigurieren, müssen Sie eine Datenbank, Anmeldeinformationen und API-Endpunkte erstellen.
fr: Avant de configurer le service Réseau d'OpenStack (neutron), vous devez créer une base de données, des credentials de service, et des endpoints API.
id: Sebelum Anda mengkonfigurasi layanan OpenStack Networking (neutron), Anda harus membuat database, kredensial layanan, dan API endpoints.

source: Before you install and configure Orchestration, you must create a database, service credentials, and API endpoints. Orchestration also requires additional information in the Identity service.
de: Bevor Sie Orchestrierung installieren und konfigurieren, müssen Sie eine Datenbank anlegen und Diensteanmeldeinformationen und API-Endpunkte erstellen. Für die Orchestrierung werden zusätzliche Informationen im Identitätsdienst benötigt.
fr: Avant d'installer et configurer l'Orchestration, vous devez créer une base de données, des credentials de service, et des endpoints API. L'Orchestration requiert aussi des informations supplémentaires dans le service d'Identité.
id: Sebelum Anda menginstal dan mengkonfigurasi Orchestration, Anda harus membuat database, service credentials, dan API endpoints. Orchestration juga memerlukan informasi tambahan dalam pelayanan Identity.

source: Before you install and configure the Alarming service, you must create a database, service credentials, and API endpoints.
de: Bevor Sie den Benachrichtigungsdienst installieren und konfigurieren, müssen Sie eine Datenbank anlegen und Diensteanmeldeinformationen und API-Endpunkte erstellen.
fr: Avant d'installer et configurer le service d'Alarme, vous devez créer une base de données, des crédentiels de service et des endpoints API.
id: Sebelum Anda menginstal dan mengkonfigurasi layanan Alarming, Anda harus membuat database, kredensial layanan, dan API endpoints.

source: Before you install and configure the Block Storage service on the storage node, you must prepare the storage device.
de: Bevor Sie den Block-Speicherdienst auf dem Speicher-Knoten installieren und konfigurieren, müssen SIe das Speichergerät vorbereiten.
fr: Avant d'installer et configurer le service de Stockage par Blocs sur le nœud de stockage, vous devez préparer le device de stockage.
id: Sebelum Anda menginstal dan mengkonfigurasi layanan Block Storage pada storage node, Anda harus mempersiapkan perangkat penyimpanan.

source: Before you install and configure the Block Storage service, you must create a database, service credentials, and API endpoints.
de: Bevor Sie den Dienst Block-Storage installieren und konfigurieren, müssen Sie eine Datenbank anlegen und Dienstanmeldeinformationen und API Endpunkte erstellen.
fr: Avant d'installer et configurer le service de Stockage par Blocs, vous devez créer une base de données, des credentiels de service, et les endpoints API.
id: Sebelum Anda menginstal dan mengkonfigurasi layanan Block Storage, Anda harus membuat database, layanan credentials, dan endpoints API.

source: Before you install and configure the Compute service, you must create databases, service credentials, and API endpoints.
de: Bevor Sie den Compute-Dienst installieren und konfigurieren, müssen Sie Datenbanken, Diensteanmeldeinformationen und API-Endpunkte erstellen.
fr: Avant d'installer et configurer le service Compute, vous devez créer des bases de données, des credentials de service, et des endpoints API.
id: Sebelum Anda menginstal dan mengkonfigurasi layanan Compute, Anda harus membuat database, kredensial layanan, dan API endpoints.

source: Before you install and configure the Database service, you must create a database, service credentials, and API endpoints.
fr: Avant d'installer et configurer le service de Base de Données, vous devez créer une base de données, des credentials de service, et des endpoints API.
id: Sebelum Anda menginstal dan mengkonfigurasi layanan Database, Anda harus membuat database, kredensial layanan, dan API endpoints.

source: Before you install and configure the Image service, you must create a database, service credentials, and API endpoints.
de: Bevor Sie den Abbilddienst installieren und konfigurieren, müssen Sie eine Datenbank anlegen und Dienstanmeldeinformationen und API-Endpunkte erstellen.
fr: Avant d'installer et configurer le service d'Image, vous devez créer une base de données, des credentials de service, et des endpoints API.
id: Sebelum Anda menginstal dan mengkonfigurasi layanan Image, Anda harus membuat database, 'service credentials', dan 'API endpoints'.

source: Before you install and configure the Object Storage service on the storage nodes, you must prepare the storage devices.
fr: Avant d'installer et configurer le service de Stockage Objet sur les nœuds de stockage, vous devez préparer les devices de stockage.
id: Sebelum Anda menginstal dan mengkonfigurasi layanan Object Storage pada node penyimpanan, Anda harus mempersiapkan perangkat penyimpanan.

source: Before you install and configure the Share File System service, you must create a database, service credentials, and API endpoints.
fr: Avant d'installer et configurer le service de Systèmes de Fichiers Partagés, vous devez créer une base de données, des credentials, et des endpoints API.
id: Sebelum Anda menginstal dan mengkonfigurasi layanan Share File System, Anda harus membuat database, kredensial layanan, dan API endpoints.

source: Before you install and configure the Telemetry service, you must create a database, service credentials, and API endpoints. However, unlike other services, the Telemetry service uses a NoSQL database. See :ref:`environment-nosql-database` to install and configure MongoDB before proceeding further.
de: Bevor Sie den Telemetriedienst installieren und konfigurieren, müssen Sie eine Datenbank anlegen und Dienstanmeldeinformationen und API Endpunkte erstellen. Im Gegensatz zu anderen Diensten nutzt der Telemetriedienst eine NoSQL Datenbank. Befolgen Sie zunächst die Schritte in :ref:`environment-nosql-database`zur Installation und Konfiguration von MongoDB bevor Sie fortfahren.
fr: Avant d'installer et configurer le service de Télémétrie, vous devez créer une base de données, des credentiels, et des endpoints API. Néanmoins, contrairement aux autres services, le service de Télémétrie utilise une base de données NoSQL. Voir :ref:`environment-nosql-database` pour installer et configurer MongoDB avant de continuer.
id: Sebelum Anda menginstal dan mengkonfigurasi layanan Telemetry, Anda harus membuat database, kredensial layanan, dan API endpoint. Namun, tidak seperti layanan lainnya, layanan Telemetry menggunakan database NoSQL. Lihat: ref:`environment-nosql-database` untuk menginstal dan mengkonfigurasi MongoDB sebelum melanjutkan lebih lanjut.

source: Before you proceed, ensure that the controller node has at least several gigabytes of space available in this directory.
de: Bevor Sie fortfahren stellen Sie sicher, dass der Controller Knoten noch mindestens einige Gigagyte Speicherplatz in diesem Verzeichnis verfügbar hat.
fr: Avant de poursuivre, assurez-vous que le nœud contrôleur possède au moins plusieurs gigabits d'espace libre dans ce répertoire.
id: Sebelum Anda melanjutkan, pastikan bahwa kontroler node memiliki setidaknya beberapa gigabyte ruang yang tersedia dalam direktori ini.

source: Before you proceed, verify operation of the Compute, Networking, and Block Storage services. This options requires implementation of Networking option 2 and requires installation of some Networking service components on the storage node.
fr: Avant de continuer, vérifier le fonctionnement des services de Compute, Réseau, et Stockage par Bloc. Cette option nécessite l'implémentation du Réseau option 2 et nécessite l'installation de certains composants du service Réseau sur le nœud de stockage.
id: Sebelum Anda melanjutkan, memverifikasi operasi layanan Compute, Networking, dan Block Storage. Pilihan ini membutuhkan pelaksanaan Jaringan opsi 2 dan memerlukan instalasi beberapa komponen layanan Networking pada node penyimpanan.

source: Block Storage
de: Blockspeicher
fr: Stockage par Bloc

source: Block Storage service
de: Block-Storage-Dienst
fr: Service de Stockage par Blocs
id: Layanan Block Storage

source: Block storage node (Optional)
de: Blockstorage-Knoten (optional)
fr: Nœud de stockage par blocs (Optionnel)

source: By default, Compute uses an internal firewall driver. Since the Networking service includes a firewall driver, you must disable the Compute firewall driver by using the ``nova.virt.firewall.NoopFirewallDriver`` firewall driver.
fr: Par défaut, Compute utilise un driver de firewall interne. Comme le service de Réseau inclut un driver de firewall, vous devez désactiver le driver firewall Compute en indiquant le driver firewall ``nova.virt.firewall.NoopFirewallDriver``.
id: Secara default, Compute menggunakan driver firewall internal. Karena layanan Networking termasuk firewall driver, Anda harus menonaktifkan Compute firewall driver dengan menggunakan firewall driver ``nova.virt.firewall.NoopFirewallDriver``.

source: By default, Compute uses an internal firewall service. Since Networking includes a firewall service, you must disable the Compute firewall service by using the ``nova.virt.firewall.NoopFirewallDriver`` firewall driver.
de: Standardmäßig verwendet der Compute-Dienst einen internen Firewalldienst. Da der Netzwerkdienst schon einen Firewalldienst beinhaltet, deaktivieren Sie diesen durch Verwendung des Firewall-Treibers ``nova.virt.firewall.NoopFirewallDriver``.
fr: Par défaut, Compute utilise un service de firewall interne. Comme le service Réseau inclut un service de firewall, vous devez désactiver le service de firewall Compute en indiquant le driver firewall ``nova.virt.firewall.NoopFirewallDriver``.
id: Secara default, Compute menggunakan layanan firewall internal. Sejak Networking meliputi layanan firewall, Anda harus menonaktifkan layanan firewall Compute dengan menggunakan firewall driver ``nova.virt.firewall.NoopFirewallDriver`` .

source: By default, MongoDB creates several 1 GB journal files in the ``/var/lib/mongodb/journal`` directory. If you want to reduce the size of each journal file to 128 MB and limit total journal space consumption to 512 MB, assert the ``smallfiles`` key:
de: Standardmäßig legt MongoDB mehrere 1 GB große Journaldateien im Verzeichnis ``/var/lib/mongodb/journal`` an. Wenn Sie die Größe der einzelnen Journaldateien auf 128 MB reduzieren und den gesamten Speicherverbrauch des Journals auf 512 MB begrenzen möchten, tragen Sie den Schlüssel ``smallfiles`` ein:
fr: Par défaut, MongoDB crée plusieurs fichiers journaux de 1 Go dans le répertoire ``/var/lib/mongodb/journal``. Si vous souhaitez réduire la taille de chaque fichier journal à 128 Mo et limiter la consommation d'espace totale des journaux à 512 Mo, définissez la clé ``smallfiles``:
id: Secara default, MongoDB menciptakan beberapa file jurnal 1 GB di direktori``/var/lib/mongodb/journal``. Jika Anda ingin mengurangi ukuran setiap file jurnal untuk 128 MB dan membatasi total konsumsi ruang jurnal untuk 512 MB, tegaskan ``smallfiles`` key:

source: By default, the Identity service database contains no information to support conventional authentication and catalog services. You must use a temporary authentication token that you created in the section called :doc:`keystone-install` to initialize the service entity and API endpoint for the Identity service.
de: Standardmäßig enthält die Datenbank des Identitätsdienstes keine Informationen zur Unterstützung konventioneller Authentifizierungs- und Katalogdienste. Sie müssen einen provisorischen Authentifikationstoken verwenden, der im Abschnitt :doc:`keystone-install` erzeugt wurde, um die Dienstentität und den API-Endpunkt des Identitätsdienstes zu initialisieren.
fr: Par défaut, la base de données du service d'Identité ne contient aucune information pour supporter les services d'authentification et de catalogue. Vous devez utiliser un jeton d'authentification temporaire que vous avez créé dans la section intitulée :doc:`keystone-install` pour initialiser l'entité de service et les endpoints API pour le service d'Identité.
id: Secara default, database layanan Identity tidak mengandung informasi untuk mendukung layanan otentikasi dan katalog konvensional. Anda harus menggunakan token otentikasi sementara yang Anda buat di bagian yang disebut :doc:`keystone-install` untuk menginisialisasi entitas layanan dan endpoint API untuk layanan Identity.

source: By default, the Ubuntu packages create an SQLite database.
de: Standardmäßig erstellen die Ubuntu-Pakete eine SQLite Datenbank.
fr: Par défaut, les packages Ubuntu créent une base de données SQLite.
id: Secara default, paket Ubuntu membuat database SQLite.

source: By default, the ``default`` security group applies to all instances and includes firewall rules that deny remote access to instances. For Linux images such as CirrOS, we recommend allowing at least ICMP (ping) and secure shell (SSH).
de: Standardmäßig wird die Sicherheitsgruppe ``default`` auf alle Instanzen angewendet und beinhaltet Firewallregeln, die Remotezugriff auf Instanzen verhindern. Für Linux-Abbilder wie CirrOS wird empfohlen, zumindest ICMP (ping) und SSH zuzulassen.
fr: Par défaut, le groupe de sécurité ``default`` s'applique à toute les instances et inclut des règles firewall qui empêche tout accès distant aux instances. Pour les images Linux comme CirrOS, nous recommandons d'autoriser au minimum ICMP (ping) et secure shell (SSH).
id: Secara default, grup keamanan ``default`` berlaku untuk semua instances dan termasuk aturan firewall yang menolak akses remote untuk instances. Untuk images Linux seperti CirrOS, sebaiknya mengijinkan setidaknya ICMP (ping) dan secure shell (SSH).

source: By default, the controller node synchronizes the time via a pool of public servers. However, you can optionally configure alternative servers such as those provided by your organization.
de: Standardmäßig synchronisiert der Controller-Knoten die Zeit über einen Pool von öffentlichen Servern. Alternativ können Sie auch andere Server konfigurieren, z.B. wenn Ihr Unternehmen solche zur Verfügung stellt.
fr: Par défaut, le contrôleur synchronise le temps via un pool de serveurs publics. Cependant, vous pouvez éventuellement configurer d'autres serveurs, comme ceux proposés par votre organisation.
id: Secara default, controller node mensinkronisasi waktu melalui pool server publik. Namun, anda dapat mengkonfigurasi server alternatif seperti yang disediakan oleh organisasi Anda.

source: CentOS does not require the following steps.
de: CentOS benötigt die folgenden Schritte nicht.
fr: Les étapes suivantes sont inutiles sur CentOS.
id: CentOS tidak memerlukan langkah-langkah berikut.

source: Change the existing line with ``-l 127.0.0.1``.
de: Ändern Sie die bestehende Zeile in ``-l 127.0.0.1``.
fr: Modifier la ligne existante avec ``-l 127.0.0.1``.
id: Mengubah baris yang ada dengan ``-l 127.0.0.1``.

source: Check the status of your floating IP address:
de: Prüfen Sie den Status Ihrer Floating IP Adresse:
fr: Vérifier le statut de votre adresse IP flottante:
id: Periksa status floating IP address Anda:

source: Check the status of your instance:
de: Den Status Ihrer Instanz prüfen:
fr: Vérifier le statut de votre instance:
id: Periksa status contoh instance:

source: Choose a suitable password for the database ``root`` account.
de: Wählen Sie ein geeignetes Passwort für den ``root``-Account der Datenbank.
fr: Choisir un mot de passe approprié pour le compte ``root`` de la base de données.
id: Memilih password yang sesuai untuk account ``root`` database.

source: Choose one of the following networking options to configure services specific to it. Afterwards, return here and proceed to :ref:`neutron-controller-metadata-agent`.
de: Wählen Sie eine der folgenden Netzwerkoptionen um dafür spezifische Dienste zu konfigurieren. Kommen Sie anschließen hierher zurück um bei :ref:`neutron-controller-metadata-agent` fortzusetzen.
fr: Choisir une des options réseau suivantes pour configurer les services qui lui sont spécifiques. Ensuite, revenir ici et poursuivre à :ref:`neutron-controller-metadata-agent`.
id: Pilih salah satu opsi jaringan berikut untuk mengkonfigurasi layanan khusus untuk itu. Setelah itu, kembali ke sini dan melanjutkan ke :ref:`neutron-controller-metadata-agent`.

source: Choose one of the following options to configure the share driver. Afterwards, return here and proceed to :ref:`manila-share-finalize-install`.
fr: Choisir une des options suivantes pour configurer le driver de partage. Après quoi, revenir ici et poursuivre vers :ref:`manila-share-finalize-install`.
id: Pilih salah satu opsi berikut untuk mengkonfigurasi share driver. Setelah itu, kembali ke sini dan melanjutkan ke :ref: `manila-share-finalize-install`.

source: Choose one of the following virtual networking options.
fr: Choisir une des options suivantes de réseau virtuel :
id: Pilih salah satu opsi jaringan virtual berikut.

source: Choose the same networking option that you chose for the controller node to configure services specific to it. Afterwards, return here and proceed to :ref:`neutron-compute-compute`.
de: Wählen Sie die gleiche Netzwerkoption, die Sie für den Controller-Knoten gewählt haben, um dafür spezifische Dienste zu konfigurieren. Kommen Sie anschließen hierher zurück, um bei :ref:`neutron-compute-compute` fortzusetzen.
fr: Choisir la même option réseau que pour le nœud contrôleur pour configurer les services spécifiques à cette option. Ensuite, revenir ici et procéder à :ref:`neutron-compute-compute`.
id: Pilih opsi jaringan yang sama yang Anda memilih untuk controller node untuk mengkonfigurasi layanan khusus untuk itu. Setelah itu, kembali ke sini dan melanjutkan ke :ref:`neutron-compute-compute`.

source: Comment out any other session storage configuration.
de: Kommentieren Sie alle anderen Konfigurationen zur Sitzungsspeicherung aus.
fr: Commenter tout autre configuration de stockage de session.
id: Komentar apapun konfigurasi penyimpanan sesi lainnya.

source: Comment out or remove any other options in the ``[filter:authtoken]`` section.
fr: Commenter ou supprimer tout autre option dans la section ``[filter:authtoken]``.
id: Hapus komentar atau bahkan menghapus opsi lain dalam bagian ``[filter:authtoken]``.

source: Comment out or remove any other options in the ``[keystone_authtoken]`` section.
de: Alle anderen Optionen in der Sektion ``[keystone_authtoken]`` müssen auskommentiert oder gelöscht werden.
fr: Commenter ou supprimer toute autre option dans la section ``[keystone_authtoken]``.
id: Hilangkan komentar atau bahkan hapus opsi lain dalam bagian ``[keystone_authtoken] `` .

source: Complete OpenStack environments already include some of these packages.
fr: Les environnements OpenStack complets incluent déjà certains de ces paquets.
id: Lingkungan OpenStack lengkap sudah termasuk beberapa paket ini.

source: Compute Node: 1 processor, 2 GB memory, and 10 GB storage
de: Compute Knoten: 1 Prozessor, 2 GB RAM und 10 GB Plattenplatz
fr: Nœud Compute: 1 processeur, 2 Go de mémoire, et 10 Go de stockage
id: Compute Node: 1 prosesor, memori 2 GB, dan penyimpanan 10 GB

source: Compute node
de: Compute Knoten
fr: Noeud de calcul

source: Compute service
fr: service de Compute
id: Layanan Compute

source: Configure API versions:
de: Konfigurieren Sie die API-Versionen:
fr: Configurer les versions d'API:
id: Konfigurasi versi API:

source: Configure Cinder to use Telemetry
de: Konfigurieren Sie Cinder zur Benutzung des Telemetriedienstes
fr: Configurer Cinder pour utiliser la Télémétrie.
id: Konfigurasi Cinder menggunakan Telemetry

source: Configure Compute to use Block Storage
de: Konfigurieren Sie Compute zur Benutzung des von Block-Storage
fr: Configurer le service Compute pour utiliser le Stockage par Blocs
id: Konfigurasi Compute menggunakan Block Storage

source: Configure Compute to use Networking
fr: Configurer Compute pour utiliser le réseau

source: Configure Compute to use Telemetry
de: Konfigurieren Sie Compute zur Benutzung des Telemetriedienstes
fr: Configurer Compute pour utiliser la Télémétrie
id: Konfigurasikan Compute menggunakan Telemetry

source: Configure Object Storage to use Telemetry
de: Konfigurieren Sie den Dienst Objekt-Storage zur Verwendung des Telemetriedienstes
fr: Configurer le Stockage Objet pour utiliser la Télémétrie
id: Konfigurasi Object Storage untuk menggunakan Telemetry

source: Configure ``default`` as the default domain for users that you create via the dashboard:
de: Konfigurieren Sie ``default`` als Standarddomäne für Benutzer, die über das Dashboard angelegt werden:
fr: Configurer ``default`` comme étant le domaine par défaut pour les utilisateurs créés via le dashboard:
id: Konfigurasi ``default`` sebagai domain default untuk user yang Anda buat melalui dashboard:
