Repository: 25hours/openstack-manuals
Catalog: doc/install-guide/source/locale/*/LC_MESSAGES/install-guide.po
Languages: de, fr, id

source: Each service that you add to your OpenStack environment requires one or more service entities and three API endpoint variants in the Identity service.
de: Jeder Dienst, den Sie Ihrer OpenStack-Umgebung hinzufügen, benötigt mindestens eine Dienstentität und drei API-Endpunkt-Varianten im Identitätsdienst.
fr: Chaque service ajouté à votre environnement OpenStack nécessite une ou plusieurs entités de service et trois variantes du endpoint API dans le Service d'Identité.
id: Setiap layanan yang Anda tambahkan ke lingkungan OpenStack Anda membutuhkan satu atau lebih entitas layanan dan tiga API endpoint varian dalam pelayanan Identity.

source: Edit the ``/etc/aodh/aodh.conf`` file and complete the following actions:
de: Bearbeiten Sie die Datei ``/etc/aodh/aodh.conf`` und vervollständigen Sie folgende Aktionen:
fr: Editer le fichier ``/etc/aodh/aodh.conf`` et effectuer les modifications suivantes :
id: Edit file ``/etc/aodh/aodh.conf``` dan selesaikan tindakan berikut:

source: Edit the ``/etc/aodh/api_paste.ini`` file and modify the ``[filter:authtoken]`` section as follows:
de: Bearbeiten Sie in der Datei ``/etc/aodh/api_paste.ini``die Sektion ``[filter:authtoken]``wie folgt:
fr: Éditer le fichier ``/etc/aodh/api_paste.ini`` et modifier la section ``[filter:authtoken]`` comme suit :
id: Edit file ``/etc/aodh/api_paste.ini`` dan modifikasi bagian ``[Filter: authtoken] `` sebagai berikut:

source: Edit the ``/etc/apache2/apache2.conf`` file and configure the ``ServerName`` option to reference the controller node:
de: Bearbeiten Sie die Datei ``/etc/apache2/apache2.conf`` und tragen als ``ServerName`` den Controller-Knoten ein:
fr: Éditer le fichier ``/etc/apache2/apache2.conf`` et configurer l'option ``ServerName`` pour pointer vers le nœud contrôleur:
id: Edit file ``/etc/apache2/apache2.conf`` dan konfigurasi opsi ``ServerName`` ke referensi controller node:

source: Edit the ``/etc/ceilometer/ceilometer.conf`` file and complete the following actions:
de: Bearbeiten Sie die Datei ``/etc/ceilometer/ceilometer.conf`` und vervollständigen Sie folgende Aktionen:
fr: Éditer le fichier ``/etc/ceilometer/ceilometer.conf`` et faire les modifications suivantes:
id: Editlah file ``/etc/ceilometer/ceilometer.conf`` dan selesaikanlah tindakan berikut:

source: Edit the ``/etc/chrony.conf`` file and add, change, or remove the following keys as necessary for your environment:
de: Bearbeiten Sie die Datei ``/etc/chrony.conf`` und ergänzen, ändern oder entfernen Sie die folgenden Schlüssel aus Ihrer Umgebung, wenn erforderlich:
fr: Éditer le fichier ``/etc/chrony.conf`` et ajouter, modifier, ou supprimer les clés suivantes en fonction de votre environnement:
id: Edit file ``/etc/chrony.conf`` dan tambahkan, ubahlah, atau hapuslah tombol berikut yang diperlukan untuk lingkungan Anda:

source: Edit the ``/etc/chrony.conf`` file and comment out or remove all but one ``server`` key. Change it to reference the controller node:
de: Bearbeiten Sie die Datei ``/etc/chrony.conf`` und kommentieren Sie alle Werte bis auf ``server`` aus oder entfernen Sie sie. Ändern Sie den Wert so, dass der Controller-Knoten referenziert wird:
fr: Éditer le fichier ``/etc/chrony.conf`` et commenter ou supprimer toutes les clés ``server`` sauf une. La modifier pour pointer vers le nœud contrôleur:
id: Edit file ``/etc/chrony.conf`` dan komentar atau hapuslah semua kecuali satu ``server`` key. Mengubahnya ke referensi node kontroller:

source: Edit the ``/etc/chrony/chrony.conf`` file and add, change, or remove the following keys as necessary for your environment:
de: Bearbeiten Sie die Datei ``/etc/chrony/chrony.conf`` und ergänzen, ändern oder entfernen die folgenden Schlüssel aus Ihrer Umgebung wenn erforderlich:
fr: Éditer le fichier ``/etc/chrony/chrony.conf`` et ajouter, modifier, ou supprimer les clés suivantes en fonction de votre environnement:
id: Edit file ``/etc/chrony/chrony.conf`` dan tambahkan, ubah, atau hapus tombol berikut yang diperlukan untuk lingkungan Anda:

source: Edit the ``/etc/chrony/chrony.conf`` file and comment out or remove all but one ``server`` key. Change it to reference the controller node:
de: Bearbeiten Sie die Datei ``/etc/chrony/chrony.conf`` und kommentieren Sie alle Werte bis auf ``server`` aus oder entfernen Sie sie. Ändern Sie den Wert so, dass der Controller-Knoten referenziert wird:
fr: Éditer le fichier ``/etc/chrony/chrony.conf`` et commenter ou supprimer toutes les clés ``server`` sauf une. La modifier pour pointer vers le nœud contrôleur:
id: Edit file ``/etc/chrony/chrony.conf`` dan komentar atau hapuslah semua kecuali satu `` server`` key. Mengubahnya ke referensi node kontroller:

source: Edit the ``/etc/cinder/cinder.conf`` file and complete the following actions:
de: Bearbeiten Sie die Datei ``/etc/cinder/cinder.conf`` und vervollständigen Sie folgende Aktionen:
fr: Éditer le fichier ``/etc/cinder/cinder.conf`` et faire les modifications suivantes :
id: Edit file ``/etc/cinder/cinder.conf`` dan menyelesaikan tindakan berikut:

source: Edit the ``/etc/default/rsync`` file and enable the ``rsync`` service:
de: Bearbeiten Sie die Datei ``/etc/default/rsync`` und aktivieren Sie den Dienst ``rsync``:
fr: Editer le fichier ``/etc/default/rsync`` et activer le service ``rsync``:
id: Edit file ``/etc/default/rsync`` dan mengaktifkan layanan ``rsync``:

source: Edit the ``/etc/fstab`` file and add the following to it:
de: Bearbeiten Sie die Datei ``/etc/fstab`` und fügen Sie Folgendes hinzu:
fr: Éditer le fichier ``/etc/fstab`` et y ajouter ce qui suit:
id: Edit file ``/etc/fstab`` dan tambahkan berikut untuk itu:

source: Edit the ``/etc/glance/glance-api.conf`` and ``/etc/glance/glance-registry.conf`` files and complete the following actions:
de: Bearbeiten Sie die Dateien ``/etc/glance/glance-api.conf``und ``/etc/glance/glance-registry.conf``und vervollständigen Sie folgende Aktionen:
fr: Éditer les fichiers ``/etc/glance/glance-api.conf`` et ``/etc/glance/glance-registry.conf`` et réaliser les modifications suivantes:
id: Edit file ``/etc/glance/glance-api.conf`` dan ``/etc/glance/glance-registry.conf`` dan selesaikan tindakan berikut:

source: Edit the ``/etc/glance/glance-api.conf`` file and complete the following actions:
de: Bearbeiten Sie die Datei ``/etc/glance/glance-api.conf`` und führen Sie folgende Schritte durch:
fr: Éditer le fichier ``/etc/glance/glance-api.conf`` et effectuer les modifications suivantes:
id: Edit file ``/etc/glance/glance-api.conf`` dan selesaikan tindakan berikut:

source: Edit the ``/etc/glance/glance-registry.conf`` file and complete the following actions:
de: Bearbeiten Sie die Datei ``/etc/glance/glance-registry.conf`` und führen Sie folgende Schritte durch:
fr: Éditer le fichier ``/etc/glance/glance-registry.conf`` et effectuer les modifications suivantes:
id: Edit file ``/etc/glance/glance-registry.conf`` dan selesaikan tindakan berikut:

source: Edit the ``/etc/heat/heat.conf`` file and complete the following actions:
de: Bearbeiten Sie die Datei ``/etc/heat/heat.conf`` und führen Sie folgende Schritte aus:
fr: Éditer le fichier ``/etc/heat/heat.conf`` et effectuer les modifications suivantes:
id: Editlah file ``/etc/heat/heat.conf`` dan selesaikan tindakan berikut:

source: Edit the ``/etc/hosts`` file to contain the following:
fr: Editer le fichier ``/etc/hosts`` pour qu'il contienne ce qui suit:
id: Mengedit file ``/etc/hosts`` mengandung berikut:

source: Edit the ``/etc/httpd/conf/httpd.conf`` file and configure the ``ServerName`` option to reference the controller node:
de: Bearbeiten Sie die Datei ``/etc/httpd/conf/httpd.conf`` und tragen als ``ServerName`` den Controller-Knoten ein:
fr: Editer le fichier ``/etc/httpd/conf/httpd.conf`` et configurer l'option ``ServerName`` pour pointer vers le nœud contrôleur:
id: Edit file ``/etc/httpd/conf/httpd.conf`` dan konfigurasi opsi ``ServerName`` ke referensi controller node:

source: Edit the ``/etc/keystone/keystone-paste.ini`` file and remove ``admin_token_auth`` from the ``[pipeline:public_api]``, ``[pipeline:admin_api]``, and ``[pipeline:api_v3]`` sections.
de: Bearbeiten Sie die Datei ``/etc/keystone/keystone-paste.ini`` und entfernen Sie ``admin_token_auth`` aus den Sektionen ``[pipeline:public_api]``, ``[pipeline:admin_api]`` und ``[pipeline:api_v3]``.
fr: Éditer le fichier ``/etc/keystone/keystone-paste.ini`` et supprimer ``admin_token_auth`` des sections ``[pipeline:public_api]``, ``[pipeline:admin_api]``, et ``[pipeline:api_v3]``.
id: Edit file ``/etc/keystone/keystone-paste.ini`` dan hapus ``admin_token_auth`` dari bagian ``[pipeline:public_api]``, ``[pipeline:admin_api]``, dan ``[pipeline:api_v3]``

source: Edit the ``/etc/keystone/keystone.conf`` file and complete the following actions:
de: Bearbeiten Sie die Datei ``/etc/keystone/keystone.conf`` und führen folgende Schritte durch:
fr: Editer le fichier ``/etc/keystone/keystone.conf`` et effectuer les modifications suivantes:
id: Edit file ``/etc/keystone/keystone.conf`` dan selesaikan tindakan berikut:

source: Edit the ``/etc/manila/manila.conf`` file and complete the following actions:
de: Bearbeiten Sie die Datei ``/etc/manila/manila.conf`` und führen folgende Schritte durch:
fr: Editer le fichier ``/etc/manila/manila.conf`` et effectuer les modifications suivantes:
id: Edit file ``/etc/manila/manila.conf`` dan menyelesaikan tindakan berikut:

source: Edit the ``/etc/memcached.conf`` file and configure the service to use the management IP address of the controller node to enable access by other nodes via the management network:
de: Bearbeiten Sie die Datei ``/etc/memcached.conf`` und konfigurieren den Dienst so, dass die IP-Adresse des Managementnetzwerks des Controller-Knotens genutzt wird, wenn andere Knoten aus dem Managementnetzwerk Zugriff benötigen.
fr: Editer le fichier ``/etc/memcached.conf`` et configurer le service pour utiliser l'adresse IP de management du nœud contrôleur pour permettre l'accès par les autres nœuds via le réseau de management:
id: Editlah ``/etc/memcached.conf`` dan konfigurasi layanan untuk menggunakan alamat IP manajemen di controller node untuk mendapatkan akses node lain melalui jaringan manajemen:

source: Edit the ``/etc/mongod.conf`` file and complete the following actions:
de: Bearbeiten Sie die Datei ``/etc/mongod.conf`` und vervollständigen Sie folgende Aktionen:
fr: Éditer le fichier ``/etc/mongod.conf`` et effectuer les actions suivantes:
id: Edit file``/etc/mongod.conf`` dan selesaikan tindakan berikut:

source: Edit the ``/etc/mongodb.conf`` file and complete the following actions:
de: Bearbeiten Sie die Datei ``/etc/mongodb.conf`` und vervollständigen Sie folgende Aktionen:
fr: Éditer le fichier ``/etc/mongodb.conf`` et effectuer les actions suivantes:
id: Edit file ``/etc/mongodb.conf`` dan selesaikan tindakan berikut:

source: Edit the ``/etc/network/interfaces`` file to contain the following:
de: Bearbeiten Sie die Datei ``/etc/network/interfaces`` mit folgendem Inhalt:
fr: Éditer le fichier ``/etc/network/interfaces`` afin qu'il contienne ce qui suit:
id: Editlah file ``/etc/network/interfaces`` berisi sebagai berikut:

source: Edit the ``/etc/neutron/dhcp_agent.ini`` file and complete the following actions:
de: Bearbeiten Sie die Datei ``/etc/neutron/dhcp_agent.ini`` und führen folgende Schritte durch:
fr: Editer le fichier ``/etc/neutron/dhcp_agent.ini`` et effectuer les modifications suivantes:
id: Edit file ``/etc/neutron/dhcp_agent.ini`` dan menyelesaikan tindakan berikut:

source: Edit the ``/etc/neutron/l3_agent.ini`` file and complete the following actions:
de: Bearbeiten Sie die Datei ``/etc/neutron/l3_agent.ini`` und führen folgende Schritte durch:
fr: Editer le fichier ``/etc/neutron/l3_agent.ini`` et effectuer les modifications suivantes:
id: Edit file ``/etc/neutron/ l3_agent.ini`` and complete the following actions:

source: Edit the ``/etc/neutron/metadata_agent.ini`` file and complete the following actions:
de: Bearbeiten Sie die Datei ``/etc/neutron/metadata_agent.ini`` und führen folgende Schritte durch:
fr: Editer le fichier ``/etc/neutron/metadata_agent.ini`` et effectuer les modifications suivantes:
id: Edit file ``/etc/neutron/metadata_agent.ini``` dan menyelesaikan tindakan berikut:

source: Edit the ``/etc/neutron/neutron.conf`` file and complete the following actions:
de: Bearbeiten Sie die Datei ``/etc/neutron/neutron.conf`` und führen folgende Schritte durch:
fr: Editer le fichier ``/etc/neutron/neutron.conf`` et effectuer les modifications suivantes:
id: Edit file ``/etc /neutron/neutron.conf`` dan menyelesaikan tindakan berikut:

source: Edit the ``/etc/neutron/plugins/ml2/linuxbridge_agent.ini`` file and complete the following actions:
de: Bearbeiten Sie die Datei ``/etc/neutron/plugins/ml2/linuxbridge_agent.ini`` und führen folgende Schritte durch:
fr: Editer le fichier ``/etc/neutron/plugins/ml2/linuxbridge_agent.ini`` et effectuer les modifications suivantes:
id: Edit file ``/etc/neutron/plugins/ml2/linuxbridge_agent.ini`` dan menyelesaikan tindakan berikut:

source: Edit the ``/etc/neutron/plugins/ml2/ml2_conf.ini`` file and complete the following actions:
de: Bearbeiten Sie die Datei ``/etc/neutron/plugins/ml2/ml2_conf.ini`` und führen Sie folgende Schritte durch:
fr: Editer le fichier ``/etc/neutron/plugins/ml2/ml2_conf.ini`` et effectuer les modifications suivantes:
id: Edit file ``/etc/neutron/plugins/ml2/ml2_conf.ini`` dan menyelesaikan tindakan berikut:

source: Edit the ``/etc/nova/nova.conf`` file and add the following to it:
de: Bearbeiten Sie die Datei ``/etc/nova/nova.conf`` und fügen Sie Folgendes hinzu:
fr: Éditer le fichier ``/etc/nova/nova.conf`` et ajouter ce qui suit:
id: Editlah file ``/etc/nova/nova.conf``dan tambahkan berikut untuk itu:

source: Edit the ``/etc/nova/nova.conf`` file and complete the following actions:
de: Bearbeiten Sie die Datei ``/etc/nova/nova.conf`` und führen folgende Schritte durch:
fr: Editer le fichier ``/etc/nova/nova.conf`` et effectuer les modifications suivantes:
id: Edit file ``/etc/nova/nova.conf`` dan menyelesaikan tindakan berikut:

source: Edit the ``/etc/nova/nova.conf`` file and configure notifications in the ``[DEFAULT]`` section:
de: Konfigurieren Sie die Benachrichtigungen in der Datei ``/etc/nova/nova.conf`` in der Sektion ``[DEFAULT]``:
fr: Editer le fichier ``/etc/nova/nova.conf`` et configurer les notifications dans la section ``[DEFAULT]`` :
id: Editlah file ``/etc/nova/nova.conf`` dan konfigurasikan pemberitahuan di bagian ``[DEFAULT] ``:

source: Edit the ``/etc/nova/nova.conf`` file and perform the following actions:
de: Bearbeiten Sie die Datei ``/etc/nova/nova.conf`` und führen folgende Schritte durch:
fr: Éditer le fichier ``/etc/nova/nova.conf`` et effectuer les modifications suivantes:
id: Edit file ``/etc/nova/nova.conf`` dan melakukan tindakan berikut:

source: Edit the ``/etc/openstack-dashboard/local_settings.py`` file and complete the following actions:
de: Bearbeiten Sie die Datei ``/etc/openstack-dashboard/local_settings.py`` und führen folgende Schritte durch:
fr: Editer le fichier ``/etc/openstack-dashboard/local_settings.py`` et effectuer les modifications suivantes:
id: Edit file ``/etc/openstack-dashboard/local_settings.py`` dan selesaikan tindakan berikut:

source: Edit the ``/etc/openstack-dashboard/local_settings`` file and complete the following actions:
de: Bearbeiten Sie die Datei ``/etc/openstack-dashboard/local_settings`` und führen folgende Schritte durch:
fr: Editer le fichier ``/etc/openstack-dashboard/local_settings`` et effectuer les modifications suivantes:
id: Edit file ``/etc/openstack-dashboard/local_settings`` dan selesaikan tindakan berikut:

source: Edit the ``/etc/swift/account-server.conf`` file and complete the following actions:
fr: Editer le fichier ``/etc/swift/account-server.conf`` et effectuer les actions suivantes:
id: Edit file ``/etc/swift/account-server.conf`` dan menyelesaikan tindakan berikut:

source: Edit the ``/etc/swift/container-server.conf`` file and complete the following actions:
fr: Editer le fichier ``/etc/swift/container-server.conf`` et effectuer les modifications suivantes:
id: Edit file ``/etc/swift/container-server.conf`` dan menyelesaikan tindakan berikut:

source: Edit the ``/etc/swift/object-server.conf`` file and complete the following actions:
fr: Editer le fichier ``/etc/swift/object-server.conf`` et effectuer les modifications suivantes:
id: Edit file ``/etc/swift/object-server.conf`` dan menyelesaikan tindakan berikut:

source: Edit the ``/etc/swift/proxy-server.conf`` file and complete the following actions:
de: Bearbeiten Sie die Datei ``/etc/swift/proxy-server.conf`` und vervollständigen Sie folgende Aktionen:
fr: Éditer le fichier ``/etc/swift/proxy-server.conf`` et effectuer les modifications suivantes:
id: Editlah file ``/etc/swift/proxy-server.conf`` dan menyelesaikan tindakan berikut:

source: Edit the ``/etc/swift/swift.conf`` file and complete the following actions:
fr: Editer le fichier ``/etc/swift/swift.conf`` et effectuer les modifications suivantes:
id: Edit file ``/etc/swift/swift.conf`` dan menyelesaikan tindakan berikut:

source: Edit the ``/etc/sysconfig/apache2`` file and configure the ``APACHE_SERVERNAME`` option to reference the controller node:
de: Bearbeiten Sie die Datei ``/etc/sysconfig/apache2`` und tragen als ``APACHE_SERVERNAME`` den Controller-Knoten ein:
fr: Éditer le fichier ``/etc/sysconfig/apache2`` et configurer l'option ``APACHE_SERVERNAME`` pour pointer vers le nœud contrôleur:
id: Edit file ``/etc/sysconfig/apache2`` dan konfigurasi opsi ``APACHE_SERVERNAME`` referensi controller node:

source: Edit the ``/etc/sysconfig/network-scripts/ifcfg-INTERFACE_NAME`` file to contain the following:
de: Bearbeiten Sie die Datei ``/etc/sysconfig/network-scripts/ifcfg-INTERFACE_NAME`` mit folgendem Inhalt:
fr: Éditer le fichier ``/etc/sysconfig/network-scripts/ifcfg-INTERFACE_NAME`` afin qu'il contienne ce qui suit:
id: Editlah file ``/etc/sysconfig/network-scripts/ifcfg-INTERFACE_NAME`` mengandung berikut:

source: Edit the ``/etc/sysconfig/network/ifcfg-INTERFACE_NAME`` file to contain the following:
de: Bearbeiten Sie die Datei ``/etc/sysconfig/network/ifcfg-SCHNITTSTELLEN_NAME`` und fügen Sie Folgendes hinzu:
fr: Editer le fichier ``/etc/sysconfig/network/ifcfg-INTERFACE_NAME`` afin qu'il contienne ce qui suit:
id: Mengedit file ``/etc/sysconfig/network/ifcfg-INTERFACE_NAME`` mengandung berikut:

source: Edit the ``/etc/trove/trove-guestagent.conf`` file so that future trove guests can connect to your OpenStack environment:
fr: Éditer le fichier ``/etc/trove/trove-guestagent.conf`` pour que les futurs invités trove puissent se connecter à votre environnement OpenStack:
id: Edit file ``/etc/trove/trove-guestagent.conf`` sehingga future trove guests dapat terhubung ke lingkungan OpenStack Anda:

source: Edit the ``/srv/www/openstack-dashboard/openstack_dashboard/local/local_settings.py`` file and complete the following actions:
de: Bearbeiten Sie die Datei ``/srv/www/openstack-dashboard/openstack_dashboard/local/local_settings.py`` und führen folgende Schritte durch:
fr: Editer le fichier ``/srv/www/openstack-dashboard/openstack_dashboard/local/local_settings.py`` et effectuer les modifications suivantes:
id: Edit file ``/srv/www/openstack-dashboard/openstack_dashboard/local/local_settings.py`` dan selesaikan tindakan berikut:

source: Edit the ``[libvirt]`` section in the ``/etc/nova/nova-compute.conf`` file as follows:
de: Bearbeiten Sie den Abschnitt ``[libvirt]`` in der Datei ``/etc/nova/nova-compute.conf`` wie folgt:
fr: Éditer la section ``[libvirt]` du fichier ``/etc/nova/nova-compute.conf`` comme suit :
id: Mengedit bagian ``[libvirt] `` dalam file ``/etc/nova/nova-compute.conf`` sebagai berikut:

source: Edit the ``[libvirt]`` section in the ``/etc/nova/nova.conf`` file as follows:
de: Bearbeiten Sie den Abschnitt ``[libvirt]`` in der Datei ``/etc/nova/nova.conf`` wie folgt:
fr: Éditer la section ``[libvirt]` du fichier ``/etc/nova/nova.conf`` comme suit :
id: Mengedit bagian ``[libvirt] `` dalam file ``/etc/nova/nova.conf`` sebagai berikut:

source: Edit the ``admin-openrc`` file and add the following content:
de: Bearbeiten Sie die Datei ``admin-openrc`` und fügen Sie folgenden Inhalt hinzu:
fr: Éditer le fichier ``admin-openrc`` et ajouter le contenu suivant:
id: Edit file ``admin-openrc`` dan tambahkan konten berikut:

source: Edit the ``demo-openrc`` file and add the following content:
de: Bearbeiten Sie die Datei ``demo-openrc`` und fügen Sie folgenden Inhalt hinzu:
fr: Éditer le fichier ``demo-openrc`` et ajouter le contenu suivant:
id: Edit file ``demo-openrc`` dan tambahkan konten berikut:

source: Edit the ``trove-taskmanager.conf`` file so it includes the required settings to connect to the OpenStack Compute service as shown below:
fr: Éditer le fichier ``trove-taskmanager.conf`` pour qu'il inclut les paramètres requis pour se connecter au service OpenStack Compute comme ci-dessous:
id: Edit file ``trove-taskmanager.conf`` sehingga mencakup pengaturan yang diperlukan untuk terhubung ke layanan OpenStack Compute seperti yang ditunjukkan di bawah ini:

source: Edit the ``trove.conf`` file so it includes appropriate values for the settings shown below:
fr: Éditer le fichier ``trove.conf`` pour qu'il inclut les valeurs appropriées pour les paramètres suivants:
id: Edit file ``trove.conf`` sehingga mencakup nilai-nilai yang sesuai untuk pengaturan di bawah ini:

source: Enable Block Storage meters
de: Zähler für Block-Storage aktivieren
fr: Activer les compteurs du Stockage Blocs
id: Aktifkan Block Storage meter

source: Enable Compute service meters
de: Zähler für Compute Dienste aktivieren
fr: Activer les compteurs du service Compute
id: Aktifkan meter layanan Compute

source: Enable DHSS before creating a share using the generic driver.
de: Aktivieren von DHSS vor dem Erstellen einer Freigabe mittels des generischen Treibers.
fr: Activer DHSS avant de créer un partage à l'aide du driver générique.
id: Aktifkan DHSS sebelum membuat share menggunakan driver generik.

source: Enable Image service meters
de: Zähler für den Abbilddienst aktivieren
fr: Activer les compteurs du service d'Image
id: Aktifkan layanan Image meter

source: Enable Object Storage meters
de: Zähler für Objekt-Storage aktivieren
fr: Activer les compteurs sur le Stockage Objet
id: Aktifkan meter Object Storage

source: Enable required repositories:
de: Aktivieren Sie die erforderlichen Repositories:
fr: Activer les dépôts nécessaires:
id: Aktifkan repositori diperlukan:

source: Enable support for domains:
de: Aktivieren Sie die Unterstützung von Domänen:
fr: Activer le support des domaines:
id: Aktifkan dukungan untuk domain:

source: Enable the Identity API version 3:
de: Akrivieren Sie die Identitäts-API-Version 3:
fr: Activer la version 3 des API du service d'Identité:
id: Aktifkan Identity API versi 3:

source: Enable the Identity service virtual hosts:
de: Aktivieren Sie die virtuellen Hosts des Identitätsdienstes:
fr: Activer les hosts virtuels du service d'Identité:
id: Aktifkan layanan Identity virtual host:

source: Enable the Open Build Service repositories based on your openSUSE or SLES version:
de: Aktivieren Sie die Open-Build-Service-Repositories passend zu Ihrer openSUSE- oder SLES-Version:
fr: Activer les répertoires Open Build Service en fonction de votre version de openSUSE ou de SLES:
id: Aktifkan repositori Open Build Service dasarnya openSUSE atau versi SLES:
