Repository: 25hours/openstack-manuals
Catalog: doc/install-guide/source/locale/*/LC_MESSAGES/install-guide.po
Languages: de, fr, id

source: Some distributions add an extraneous entry in the ``/etc/hosts`` file that resolves the actual hostname to another loopback IP address such as ``127.0.1.1``. You must comment out or remove this entry to prevent name resolution problems. **Do not remove the 127.0.0.1 entry.**
fr: Certaines distributions ajoutent une entrée superflue dans le fichier ``/etc/hosts`` qui résout le hostname actuel en une autre adresse IP de loopback comme ``127.0.1.1``. Vous devez commenter ou supprimer cette entrée pour éviter des problèmes de résolution de nom. **Attention à ne pas supprimer l'entrée 127.0.0.1.**
id: Beberapa distribusi menambahkan sebuah entri asing di file ``/etc/hosts`` yang resolves hostname yang sebenarnya ke alamat IP loopback lain seperti `` 127.0.1.1``. Anda harus komentar atau bahkan menghapus entri ini untuk mencegah name resolution problems. **Jangan menghapus entri 127.0.0.1. **

source: Some distributions include LVM by default.
de: Einige Distributionen beinhalten LVM standardmäßig.
fr: Certaines distributions incluent LVM par défaut.
id: Beberapa distribusi termasuk LVM secara default.

source: Source the ``admin`` credentials to gain access to admin-only CLI commands.
de: Sourcen Sie die ``admin`` Anmeldeinformationen, um Zugriff auf CLI-Befehle zu bekommen, die dem Admin vorbehalten sind.
fr: Sourcer les informations d'identification ``admin`` pour obtenir l'accès aux commandes en ligne réservées à l'admin.
id: Jalankan ``admin`` credential untuk mendapatkan akses ke command admin-only CLI.

source: Source the ``admin`` credentials to gain access to admin-only CLI commands:
de: Sourcen Sie die ``admin`` Anmeldeinformationen, um Zugriff auf die Admin-Kommandos zu bekommen:
fr: Sourcer les crédentiels ``admin`` pour accéder aux commandes en ligne réservées à l'administrateur :
id: Dapatkan sumber mandat ``admin`` untuk mendapatkan akses ke command CLI 'admin-only':

source: Source the ``admin`` tenant credentials:
de: Sourcen Sie die Anmeldeinformationen des Mandanten ``admin``:
fr: Sourcer les credentials du tenant ``admin``.
id: Sumber ``admin`` tenant credentials:

source: Source the ``demo`` credentials to gain access to user-only CLI commands:
de: Sourcen Sie die ``demo`` Anmeldeinformationen um Zugriff auf Benutzer-CLI Kommandos zu bekommen:
fr: Sourcer les credentials ``demo`` pour obtenir l'accès aux commandes en ligne simple-utilisateur:
id: Dapatkan sumber kredensial ``demo`` untuk mendapatkan akses ke command CLI user-only:

source: Source the ``demo`` credentials to perform the following steps as a non-administrative project:
de: Sourcen Sie die ``demo``-Anmeldeinformationen, um die folgenden Schritte mit nicht-administrativen Rechten auszuführen:
fr: Sourcer les credentials ``demo`` pour exécuter les étapes suivantes en tant que projet non-admin:
id: Sumber kredensial ``demo`` untuk melakukan langkah-langkah berikut sebagai proyek non-administrasi:

source: Source the ``demo`` credentials:
de: Sourcen Sie die ``demo`` Anmeldeinformationen:
fr: Sourcer les credentials ``demo``:

source: Source the ``demo`` tenant credentials:
de: Sourcen der ``demo`` Mandanten-Anmeldeinformationen:
fr: Sourcer les credentials du tenant ``demo``:
id: Source yang kredensial tenant ``demo``:

source: Source the admin credentials to gain access to admin-only CLI commands:
de: Sourcen Sie die admin-Anmeldeinformationen, um Zugriff auf die Admin-Befehle zu erhalten:
fr: Sourcer les accréditations admin pour obtenir l'accès aux commandes en ligne spécial-admin:
id: Dapatkan kredensial admin untuk mendapatkan akses ke command CLI admin-only:

source: Start the Alarming services and configure them to start when the system boots:
de: Starten Sie die Benachrichtigungsdienste und konfigurieren Sie diese so, dass sie beim Systemstart gestartet werden:
fr: Démarrer les services d'Alarme et les configurer pour être lancés au démarrage du système :
id: Mulailah layanan Alarming dan konfigur mereka untuk memulai saat booting:

source: Start the Apache HTTP service and configure it to start when the system boots:
de: Starten Sie den Apache HTTP-Dienst und konfigurieren ihn so, dass er beim Booten des Systems startet:
fr: Démarrer le service HTTP Apache et le configurer pour qu'il s'exécute au démarrage du système:
id: Mulai server Apache HTTP dan mengkonfigurasinya untuk memulai saat booting:

source: Start the Block Storage services and configure them to start when the system boots:
de: Starten Sie die Block-Storage Dienste und konfigurieren Sie sie so, dass sie starten wenn das System bootet:
fr: Démarrer les services de Stockage par Blocs et les configurer pour être lancés au démarrage du système:
id: Mulailah layanan Block Storage dan konfigurasi mereka untuk mulai saat booting:

source: Start the Block Storage volume service including its dependencies and configure them to start when the system boots:
de: Starten Sie den Block-Storage-Dienst mit seinen Abhängigkeiten und konfigurieren ihn so, dass er startet wenn das System bootet:
fr: Démarrer le service de volume du Stockage par Blocs, avec ses dépendances, et les configurer pour se lancer au démarrage du système:
id: Mulailah layanan volume Block Storage termasuk dependensinya dan mengkonfigurasi mereka untuk mulai saat booting:

source: Start the Compute service including its dependencies and configure them to start automatically when the system boots:
de: Starten Sie den Compute-Dienst inkl. aller Abhängigkeiten und konfigurieren Sie ihn so, dass er beim Systemstart automatisch gestartet wird:
fr: Démarrer le service Compute, en incluant ses dépendances et le configurer pour se lancer au démarrage du système:
id: Mulai layanan Compute termasuk dependensinya dan mengkonfigurasi mereka untuk memulai secara otomatis ketika sistem booting:

source: Start the Compute services and configure them to start when the system boots:
fr: Démarrer les services Compute et les configurer pour se lancer au démarrage du système:
id: Mulai layanan Compute dan mengkonfigurasi mereka untuk mulai saat booting:

source: Start the Database services and configure them to start when the system boots:
fr: Démarrer les services de Base de Données et les configurer pour s'exécuter au démarrage du système:
id: Mulai layanan Database dan mengkonfigurasi mereka untuk mulai saat booting:

source: Start the Image services and configure them to start when the system boots:
de: Starten Sie den Abbilddienst und konfigurieren Sie ihn so, dass er beim Booten des Systems startet:
fr: Démarrer les services d'Image et les configurer pour s'exécuter au démarrage du système:
id: Mulai layanan Image dan konfigurasi mereka untuk mulai saat booting:

source: Start the LVM metadata service and configure it to start when the system boots:
de: Starten Sie den LVM Metadaten-Dienst und konfigurieren ihn so, dass er startet wenn das System bootet:
fr: Démarrer le service de metadata LVM et le configurer pour se lancer au démarrage du système:
id: Mulailah layanan LVM metadata dan mengkonfigurasinya untuk memulai saat booting:

source: Start the Linux Bridge agent and configure it to start when the system boots:
de: Starten Sie den Linux-Bridge-Agenten und konfigurieren Sie ihn zum Starten, wenn das System bootet:
fr: Démarrer l'agent Linux bridge et le configurer pour qu'il s'exécute au démarrage du système:
id: Mulai agen Linux Bridge agent dan mengkonfigurasinya untuk memulai saat booting:

source: Start the Linux bridge agent and configure it to start when the system boots:
de: Starten Sie den Linux-Bridge-Agenten und konfigurieren Sie ihn zum Starten, wenn das System bootet:
fr: Démarrer l'agent Linux bridge et le configurer pour qu'il s'exécute au démarrage du système:
id: Mulai agen Linux bridge dan mengkonfigurasinya untuk memulai saat booting:

source: Start the Memcached service and configure it to start when the system boots:
de: Starten Sie den Dienst Memcached und konfigurieren ihn zum Starten, wenn das System bootet:
fr: Démarrer le service Memcached et le configurer pour se lancer au démarrage du système.
id: Mulailah layanan Memcached dan mengkonfigurasinya untuk memulai saat booting:

source: Start the MongoDB service and configure it to start when the system boots:
de: Starten Sie den MongoDB-Dienst und konfigurieren ihn so, dass er beim Booten des Systems startet:
fr: Démarrer le service MongoDB et le configurer pour se lancer au démarrage du système:
id: Mulailah layanan MongoDB dan mengkonfigurasinya untuk memulai saat booting:

source: Start the NTP service and configure it to start when the system boots:
de: Starten Sie den NTP Dienst und konfigurieren Sie ihn so, dass er beim Booten des Systems startet:
fr: Démarrer le service NTP et le configurer pour se lancer au démarrage du système.
id: Mulailah layanan NTP dan mengkonfigurasinya untuk memulai saat booting:

source: Start the Networking services and configure them to start when the system boots.
de: Starten Sie die Netzwerkdienste und konfigurieren Sie diese so, dass sie beim Booten des Systems starten.
fr: Démarrer les services Réseau et les configurer pour s'exécuter au démarrage du système:
id: Mulai layanan Networking dan mengkonfigurasi mereka untuk memulai ketika sistem boot.

source: Start the Orchestration services and configure them to start when the system boots:
de: Starten Sie die Orchestrierungsdienste und konfigurieren Sie diese so, dass sie beim Booten des Systems starten:
fr: Démarrer les services d'Orchestration et les configurer pour s'exécuter au démarrage du système:
id: Mulai layanan Orchestration dan konfigurasi mereka untuk mulai saat booting:

source: Start the Share File System services and configure them to start when the system boots:
de: Starten Sie die Share-Dateisystem-Dienste und konfigurieren Sie sie so, dass sie beim Systemstart gestartet werden:
fr: Démarrer les services de Systèmes de Fichiers Partagés et les configurer pour s'exécuter au démarrage du système:
id: Mulai layanan Share File System dan mengkonfigurasi mereka untuk mulai saat booting:

source: Start the Share File Systems service including its dependencies and configure them to start when the system boots:
de: Starten Sie den Dateisystemfreigabedienst mit seinen Abhängigkeiten und konfigurieren ihn so, dass er startet, wenn das System bootet:
fr: Démarrer le service de Système de Fichiers Partagés, en incluant ses dépendances et les configurer pour se lancer au démarrage du système:
id: Mulai layanan Share File Sistem termasuk dependensinya dan mengkonfigurasi mereka untuk mulai saat booting:

source: Start the Share File Systems service including its dependencies:
fr: Démarrer le service de Système de Fichiers Partagés en incluant ses dépendances:
id: Mulai layanan Share File Sistem termasuk dependensinya:

source: Start the Telemetry Alarming services and configure them to start when the system boots:
de: Starten Sie die Telemetrie-Benachrichtigungsdienste und konfigurieren Sie diese so, dass sie beim Systemstart gestartet werden:
fr: Démarrer les services d'Alarme de Télémétrie et les configurer pour être lancés au démarrage du système :
id: Mulailah layanan Telemetry Alarming dan konfigur mereka untuk memulai saat booting:

source: Start the Telemetry services and configure them to start when the system boots:
de: Starten Sie die Telemetriedienste und konfigurieren Sie sie so, dass sie beim Systemstart gestartet werden:
fr: Démarrer les services de Télémétrie et les configurer pour être lancés au démarrage du système:
id: Mulailah layanan Telemetry dan konfigurasikan mereka untuk mulai saat booting:

source: Start the ``rsync`` service:
de: Starten Sie den Dienst ``rsync``:
fr: Démarrer le service ``rsync``:
id: Mulai layanan ``rsync``:

source: Start the ``rsyncd`` service and configure it to start when the system boots:
de: Starten Sie den Dienst ``rsyncd`` und konfigurieren ihn so, dass er beim Booten des Systems startet:
fr: Démarrer le service ``rsyncd`` et le configurer pour se lancer au démarrage du système.
id: Mulai layanan ``rsyncd`` dan mengkonfigurasinya untuk memulai saat booting:

source: Start the agent and configure it to start when the system boots:
de: Starten Sie den Agenten und konfigurieren Sie ihn so, dass er beim Booten des Systems startet :
fr: Démarrez l'agent et configurez-le pour qu'il se lance au démarrage du système:
id: Mulailah agen dan mengkonfigurasinya untuk memulai saat booting:

source: Start the database service and configure it to start when the system boots:
de: Starten Sie den Datenbank-Dienst und konfigurieren ihn so, dass er beim Booten des Systems startet:
fr: Démarrer le service de base de données et le configurer pour l'exécuter au démarrage du système:
id: Memulai layanan database dan mengkonfigurasinya untuk memulai saat booting:

source: Start the message queue service and configure it to start when the system boots:
de: Starten Sie den Nachrichtenwarteschlangendienst und konfigurieren ihn so, dass er beim Booten des Systems startet:
fr: Démarrer le service de file de messages et le configurer pour se lancer au démarrage du système:
id: Mulailah layanan message queue dan mengkonfigurasinya untuk memulai saat booting:

source: Stores and retrieves arbitrary unstructured data objects via a :term:`RESTful`, HTTP based API. It is highly fault tolerant with its data replication and scale-out architecture. Its implementation is not like a file server with mountable directories. In this case, it writes objects and files to multiple drives, ensuring the data is replicated across a server cluster.
fr: Stocke et récupère arbitrairement des objets data non structurés via une API :term:`RESTful` basée sur HTTP. Le service est hautement tolérant aux pannes avec sa réplication de données et son architecture de type scale-out. Son implémentation diffère des serveurs de fichiers avec répertoires montables. Dans ce cas, le service écrit les objets et les fichiers vers plusieurs disques, en s'assurant que les données soient répliquées à travers le cluster de serveurs.
id: Menyimpan dan mengambil semaunya objek data yang tidak terstruktur melalui :term: `RESTful`, HTTP API berbasis. Hal ini toleransi kesalahan tinggi sangat dengan data replication and scale-out architecture. Pelaksanaannya tidak seperti file server dengan direktori mountable. Dalam hal ini, itu menulis objek dan file ke beberapa drive, memastikan data direplikasi di berbagai server cluster.

source: Stores and retrieves virtual machine disk images. OpenStack Compute makes use of this during instance provisioning.
fr: Stocke et récupère des images de disques de machines virtuelles. OpenStack Compute les utilise lors de la mise en service d'instances.
id: Simpan dan ambil images disk VM. OpenStack Compute memanfaatkan ini selama penyediaan instance.

source: Telemetry service
de: Telemetriedienst
fr: Service de Télémétrie
id: Layanan Telemetry

source: Telemetry uses a combination of notifications and an agent to collect Compute meters. Perform these steps on each compute node.
de: Der Telemetriedienst nutzt eine Kombination aus Benachrichtigungen und einen Agenten, um Zählerdaten zu Compute zu sammeln. Führen Sie diese Schritte auf jedem Compute Node aus.
fr: Le service de Télémétrie utilise une combinaison de notifications et un agent pour collecter les compteurs Compute. Effectuer ces opérations sur chaque nœud Compute.
id: Telemetri menggunakan kombinasi pemberitahuan dan agen untuk mengumpulkan meter Compute. Lakukan langkah ini pada setiap node komputasi.

source: Telemetry uses a combination of polling and notifications to collect Object Storage meters.
de: Der Telemetriedienst nutzt eine Kombination aus Abfragen und Benachrichtigungen, um Zählerdaten zu Objekt-Storage zu sammeln.
fr: La Télémétrie utilise une combinaison de relevés et de notifications pour collecter les compteurs du Stockage Objet.
id: Telemetry menggunakan kombinasi polling dan pemberitahuan untuk mengumpulkan meter Object Storage.

source: Telemetry uses notifications to collect Block Storage service meters. Perform these steps on the controller and Block Storage nodes.
de: Der Telemetriedienst nutzt Benachrichtigungen, um Zählerdaten zu Block-Storage zu sammeln. Führen Sie diese Schritte auf dem Controller und den Block-Storage Nodes aus.
fr: La télémétrie utilise les notifications pour collecter les compteurs du service de Stockage Blocs. Réaliser les étapes suivantes sur les nœuds contrôleur et de Stockage Blocs.
id: Telemetri menggunakan pemberitahuan untuk mengumpulkan layanan Block Storage meter. Lakukan langkah ini pada controller dan node Block Storage.

source: Telemetry uses notifications to collect Image service meters. Perform these steps on the controller node.
de: Der Telemetriedienst nutzt Benachrichtigungen, um Zählerdaten zum Abbilddienst zu sammeln. Führen Sie diese Schritte auf dem Controller Node aus.
fr: La télémétrie utilise les notifications pour collecter les compteurs du service d'Image. Réaliser les étapes suivantes sur le nœud contrôleur.
id: Telemetri menggunakan pemberitahuan untuk mengumpulkan layanan Image meter. Lakukan langkah ini pada controller node.

source: The :command:`systemctl enable` call on openSUSE outputs a warning message when the service uses SysV Init scripts instead of native systemd files. This warning can be ignored.
de: Unter openSUSE weist der Befehl :command:`systemctl enable` mit einer Warnung darauf hin, wenn der Dienst SysV Init-Skripte statt nativer Systemd-Dateien verwendet. Diese Warnung kann ignoriert werden.
fr: L'appel :command:`systemctl enable` sur openSUSE affiche un message d'avestissement quand le service utilise les scripts d'init SysV à la place des fichiers systemd natifs. Cet avertissement peut être ignoré.
id: Command: `systemctl enable` memanggil 'openSUSE output' pesan peringatan ketika layanan menggunakan 'SysV Init scripts' bukan file systemd asli. Peringatan ini bisa diabaikan.

source: The :term:`DHCP agent` provides DHCP services for virtual networks.
de: Der :term:`DHCP agent` stellt DHCP-Dienste für virtuelle Netzwerke zur Verfügung.
fr: L':term:`agent DHCP` fournit les services DHCP aux réseaux virtuels.
id: :term:`DHCP agent` menyediakan layanan DHCP untuk jaringan virtual.

source: The :term:`Layer-3 (L3) agent` provides routing and NAT services for self-service virtual networks.
de: Der :term:`Layer-3 (L3) Agent` bietet Routing und NAT Dienste für virtuelle self-service Netzwerke.
fr: L':term:`agent Layer-3 (L3)` fournit le routage et les services NAT aux réseaux virtuels self-services.
id: :term:`Layer-3 (L3) agent` menyediakan layanan routing dan NAT untuk jaringan virtual self-service.

source: The :term:`OpenStack` project is an open source cloud computing platform that supports all types of cloud environments. The project aims for simple implementation, massive scalability, and a rich set of features. Cloud computing experts from around the world contribute to the project.
fr: Le projet :term:`OpenStack` est une plateforme de cloud computing open source qui supporte tout types d'environnements cloud. Le projet vise une implémentation simple, une scalabilité massive, et un ensemble varié de fonctionnalités. Des experts Cloud computing du monde entier contribuent au projet.
id: Project :term:`OpenStack` merupakan open source cloud computing platform yang mendukung semua jenis lingkungan cloud. Proyek ini bertujuan untuk implementasi sederhana, skalabilitas besar, dan satu set kaya fitur. Ahli komputasi awan dari seluruh dunia berkontribusi pada proyek.

source: The :term:`metadata agent <Metadata agent>` provides configuration information such as credentials to instances.
de: Der :term:`Metadatenagent <Metadata agent>` stellt Konfigurationsinformation (z.B. Anmeldeinformationen für Instanzen) zur Verfügung.
fr: L':term:`agent metadata <Metadata agent>` fournit les informations de configuration comme les credentials aux instances.
id: :term:`metadata agent <Metadata agent>` memberikan informasi konfigurasi seperti mandat untuk instance.

source: The Block Storage API and scheduler services typically run on the controller nodes. Depending upon the drivers used, the volume service can run on controllers, compute nodes, or standalone storage nodes.
de: Die Blockspeicher-API und Planungsdienste laufen typischerweise auf den Controller-Knoten. Abhängig von den verwendeten Treibern kann der Datenträgerdienst auf Controller-, Compute-Knoten oder auf eigenständigen Speicher-Knoten laufen.
fr: Les services API et scheduler du Stockage par Blocs tournent généralement sur les nœuds contrôleurs. En fonction du driver utilisé, le service de volume peut tourner sur les nœuds contrôleurs, sur les nœuds compute, ou sur des nœuds de stockage autonomes.
id: The Block Storage API dan layanan scheduler biasanya dijalankan pada controller nodes. Tergantung pada driver yang digunakan, layanan volume yang dapat berjalan pada controllers, compute nodes, atau standalone storage nodes.

source: The Block Storage service (cinder) provides block storage devices to guest instances. The method in which the storage is provisioned and consumed is determined by the Block Storage driver, or drivers in the case of a multi-backend configuration. There are a variety of drivers that are available: NAS/SAN, NFS, iSCSI, Ceph, and more.
de: Der OpenStack Blockspeicherdienst (Cinder) stellt Gast-Instanzen Blockspeichergeräte zur Verfügung. Die Methode zur Bereitstellung und Nutzung des Speichers wird durch den bzw. die Blockspeicher-Treiber (im Fall einer Multi-Backend-Konfiguration) festgelegt. Es sind verschiedene Treiber verfügbar: NAS/SAN, NFS, iSCSI, Ceph, und mehr.
fr: Le service de Stockage par Blocs (cinder) fournit des devices de stockage blocs aux instances invitées. La méthode avec laquelle le stockage est provisionné et consommé est déterminée par le driver de Stockage par Blocs, ou les drivers dans le cas d'une configuration multi-backend. Différents drivers sont disponibles: NAS/SAN, NFS, iSCSI, Ceph, entre autres.
id: Layanan Block Storage (cinder) menyediakan perangkat penyimpanan blok untuk guest instances. Metode di mana penyimpanan yang provisioned and consumed ditentukan oleh driver Block Storage, atau driver dalam kasus konfigurasi multi-backend. Ada berbagai driver yang tersedia: NAS/SAN, NFS, iSCSI, Ceph, dan banyak lagi.

source: The Block Storage service creates logical volumes in this volume group.
de: Der Block-Storage-Dienst erstellt logische Datenträger in dieser Datenträger-Gruppe.
fr: Le service de Stockage par Blocs crée des volumes logiques dans ce groupe de volumes.
id: Layanan Block Storage menciptakan volume logis dalam kelompok volume ini.

source: The Block Storage services require endpoints for each service entity.
de: Der Dienst Block-Storage erfordert Endpunkte für jede Dienstinstanz.
fr: Les services de Stockage par Blocs nécessitent un endpoint pour chaque entité de service.
id: Layanan Block Storage memerlukan endpoint untuk setiap entitas layanan.

source: The Block Storage services require two service entities.
de: Der Dienst Block-Storage erfordert zwei Dienstinstanzen.
fr: Les services de Stockage par Blocs nécessitent deux entités de service.
id: Layanan Block Storage memerlukan dua entitas layanan.
