Repository: 25hours/openstack-manuals
Catalog: doc/install-guide/source/locale/*/LC_MESSAGES/install-guide.po
Languages: de, fr, id

source: Replace ``TIME_ZONE`` with an appropriate time zone identifier. For more information, see the `list of time zones <http://en.wikipedia.org/wiki/List_of_tz_database_time_zones>`__.
de: Ersetzen Sie ``TIME_ZONE`` durch einen geeigneten Bezeichner der Zeitzone. Schauen Sie in die `Liste der Zeitzonen <http://en.wikipedia.org/wiki/List_of_tz_database_time_zones>`__ für weitere Informationen.
fr: Remplacer ``TIME_ZONE`` par un identifiant de fuseau horaire approprié. Pour plus d'informations, voir la `liste des timezones <http://en.wikipedia.org/wiki/List_of_tz_database_time_zones>`__.
id: Ganti ``TIME_ZONE`` dengan zona waktu identifier yang tepat. Untuk informasi lebih lanjut, lihat `list of time zones <http://en.wikipedia.org/wiki/List_of_tz_database_time_zones>`__.

source: Replace ``TROVE_DBPASS`` with a suitable password.
fr: Remplacer ``TROVE_DBPASS`` par un mot de passe approprié.
id: Ganti `` TROVE_DBPASS`` dengan password yang sesuai.

source: Replace the ``nova-compute-kvm`` package with ``nova-compute-qemu`` which automatically changes the ``/etc/nova/nova-compute.conf`` file and installs the necessary dependencies:
de: Ersetzen Sie das Paket ``nova-compute-kvm`` durch ``nova-compute-qemu``, dadurch wird die Datei ``/etc/nova/nova-compute.conf`` automatisch geändert und benötigte Abhängigkeiten werden automatisch installiert:
fr: Remplacer le package ``nova-compute-kvm`` par ``nova-compute-qemu`` qui modifie automatiquement le fichier ``/etc/nova/nova-compute.conf`` et installe les dépendances nécessaires:
id: Menggantikan paket ``nova-compute-kvm`` dengan ``nova-compute-qemu`` yang secara otomatis mengubah file ``/etc/nova/nova-compute.conf`` dan menginstal dependensi yang diperlukan:

source: Request an authentication token:
de: Fordern Sie einen Authentifizierungstoken:
fr: Demander un jeton d'authentification:
id: Minta token otentikasi:

source: Respond to prompts for ``database management``, ``Identity service credentials``, ``service endpoint``, and ``message queue credentials``.
de: Schnelleinstieg für ``database management``, ``Identity service credentials``, ``service endpoint`` und ``message queue credentials``.
fr: Répondre aux prompts pour ``gestion de base de données``, ``credentials du service d'Identité``, ``endpoint du service``, et ``credentials de la file de message``.
id: Respond to prompts untuk ``database management``, ``Identity service credentials``, ``service endpoint``, dan ``message queue credentials``.

source: Respond to prompts for `database management <#debconf-dbconfig-common>`__, `Identity service credentials <#debconf-keystone_authtoken>`__, `service endpoint registration <#debconf-api-endpoints>`__, and `message queue credentials <#debconf-rabbitmq>`__.
de: Schnelleinstieg für `database management <#debconf-dbconfig-common>`__, `Identity service credentials <#debconf-keystone_authtoken>`__, `service endpoint registration <#debconf-api-endpoints>`__, und `message queue credentials <#debconf-rabbitmq>`__.
fr: Répondre aux prompts pour `gestion de la base de données <#debconf-dbconfig-common>`__, `credentials du service d'Identité <#debconf-keystone_authtoken>`__, `inscription des endpoints de service <#debconf-api-endpoints>`__, et `credentials de la file de message <#debconf-rabbitmq>`__.
id: Respond prompts untuk `database management <#debconf-dbconfig-common>`__, `Identity service credentials <#debconf-keystone_authtoken>`__, `service endpoint registration <#debconf-api-endpoints>`__, dan `message queue credentials <#debconf-rabbitmq>`__.

source: Respond to prompts for debconf, which will fill the below database access directive.
de: Antworten auf Aufforderungen von debconf, welche zu den unten stehenden Datenbankzugriffsdirektiven hinzugefügt werden.
fr: Répondre aux prompts pour debconf, ce qui va remplir la directive d'accès à la base de données ci-dessous.
id: Menanggapi prompts untuk debconf, yang akan mengisi 'below database access directive'.

source: Respond to prompts for debconf.
de: Aufforderungen von debconf beantworten.
fr: Répondre aux prompts pour debconf.
id: Tanggapilah prompt debconf.

source: Respond to prompts for web server configuration.
de: Reagieren Sie auf die Eingabeaufforderung für die Webserver-Konfiguration.
fr: Répondre aux prompts pour la configuration du serveur web.

source: Restart the Alarming services:
de: Starten Sie die Benachrichtigungsdienste neu:
fr: Redémarrer les services d'Alarme :
id: Restart layanan Alarming:

source: Restart the Apache HTTP server:
de: Starten Sie den Apache HTTP-Server neu:
fr: Redémarrer le serveur HTTP Apache
id: Restart server Apache HTTP:

source: Restart the Block Storage services on the controller node:
de: Starten Sie die Dienste für Block-Storage auf dem Controller neu:
fr: Redémarrer les services des Stockage par Blocs sur le nœud contrôleur:
id: Restart layanan Block Storage pada 'controller node':

source: Restart the Block Storage services on the storage nodes:
de: Starten Sie die Dienste für Block-Storage auf den Storage Nodes neu:
fr: Redémarrer les services de Stockage par Blocs sur les nœuds de stockage:
id: Restart layanan Block Storage pada node storage:

source: Restart the Block Storage services:
de: Starten Sie die Block-Speicher Dienste neu:
fr: Redémarrer les services de Stockage par Blocs:
id: Restart layanan Block Storage:

source: Restart the Block Storage volume service including its dependencies:
de: Starten Sie den Block-Storage-Datenträgerdienst mit seinen Abhängigkeiten neu:
fr: Redémarrer le service de volume du Stockage par Blocs, ainsi que ses dépendances:
id: Restart layanan volume Block Storage termasuk dependensinya:

source: Restart the Compute API service:
de: Starten Sie den Compute API-Dienst neu:
fr: Redémarrer le service d'API Compute
id: Restart layanan Compute API:

source: Restart the Compute service:
de: Restart des Compute Servcies:
fr: Redémarrer le service Compute:
id: Restart layanan Compute:

source: Restart the Compute services:
de: Restart des Compute Servcies:
fr: Redémarrer les services Compute:
id: Restart layanan Compute:

source: Restart the Database services:
fr: Redémarrer les services de base de données:
id: Restart layanan Database:

source: Restart the Image service:
de: Starten Sie den Abbilddienst neu:
fr: Redémarrer le service d'Image:
id: Restart layanan Image:

source: Restart the Image services:
de: Starten Sie die Abbilddienste neu:
fr: Redémarrer les services d'Image:
id: Restart layanan Imange:

source: Restart the Linux bridge agent:
de: Starten Sie den Linux-Bridge-Agenten neu:
fr: Redémarrer l'agent Linux bridge:
id: Restart Linux bridge agent:

source: Restart the Memcached service:
de: Starten Sie den Dienst Memcached neu:
fr: Redémarrer le service Memcached:
id: Restart layanan Memcached:

source: Restart the NTP service:
de: Neustarten des NTP Dienstes:
fr: Redémarrer le service NTP:
id: Restart layanan NTP:

source: Restart the Networking services.
de: Starten Sie die Netzwerkdienste neu.
fr: Redémarrer les services réseau:
id: Restart layanan Networking.

source: Restart the Object Storage proxy service:
de: Neustart des Proxydienstes für Objekt-Storage:
fr: Redémarrer le service proxy du Stockage Objet:
id: Restart layanan proxy Object Storage:

source: Restart the Orchestration services:
de: Starten sie die Orchestrierungsdienste neu:
fr: Redémarrer les services d'Orchestration:
id: Restart layanan Orchestration:

source: Restart the Share File Systems services:
fr: Redémarrer les services de Systèmes de Fichiers Partagés:
id: Restart layanan Share File Systems:

source: Restart the Telemetry services:
de: Starten Sie die Telemetriedienste neu:
fr: Redémarrer les services de Télémétrie:
id: Restart layanan Telemetry:

source: Restart the agent:
de: Starten Sie den Agenten neu:
fr: Redémarrer l'agent:
id: Restart agen:

source: Restart the database service:
de: Starten Sie den Datenbank-Dienst neu:
fr: Redémarrer le service de base de données:
id: Restart layanan database:

source: Restart the web server and session storage service:
de: Starten Sie den Webserver- und Sitzungsspeicherungsdienst neu:
fr: Redémarrer le serveur web et le service de stockage de session:
id: Restart web server dan sesi layanan penyimpanan:

source: Retrieve usage statistics from the ``image.download`` meter:
de: Abruf der Nutzungsstatistiken des Zählers ``image.download``:
fr: Récupérer les statistiques d'utilisation depuis le compteur ``image.download`` :
id: Ambillah 'usage statistics' dari meter ``image.download``:

source: Return to :ref:`Finalize installation <manila-share-finalize-install>`.
de: Zurück zu :ref:`Finalize installation <manila-share-finalize-install>`.
fr: Retourner à :ref:`Finaliser l'installation <manila-share-finalize-install>`.
id: Return ke :ref: `Finalize installation <manila-share-finalize-install>`.

source: Return to :ref:`Launch an instance - Create virtual networks <launch-instance-networks>`.
de: Zurück zu :ref:`Launch an instance - Create virtual networks <launch-instance-networks>`.
fr: Retourner à :ref:`Lancer une instance - Créer des réseaux virtuels <launch-instance-networks>`.
id: Return ke :ref:`Launch an instance - Create virtual networks <launch-instance-networks>`.

source: Return to :ref:`Launch an instance <launch-instance-complete>`.
de: Zurück zu :ref:`Launch an instance <launch-instance-complete>`.
fr: Retourner à :ref:`Lancer une instance <launch-instance-complete>`.

source: Return to :ref:`Networking compute node configuration <neutron-compute-compute>`.
fr: Retourner à la :ref:`Configuration du service réseau sur le compute node <neutron-compute-compute>`.
id: Return ke :ref:`Networking compute node configuration <neutron-compute-compute>`.

source: Return to :ref:`Networking controller node configuration <neutron-controller-metadata-agent>`.
de: Zurück zu :ref:`Netzwerkkonfiguration des Controller-Node <neutron-controller-metadata-agent>`.
fr: Retourner à :ref:`Configuration du Réseau sur le nœud contrôleur <neutron-controller-metadata-agent>`.

source: Return to :ref:`launch-instance`.
de: Kehren Sie zurück zu :ref:`launch-instance`.
fr: Retourner à :ref:`launch-instance`.
id: Balik ke :ref:`launch-instance`.

source: Root password for the database
de: Root-Passwort für die Datenbank
fr: Mot de passe root pour la base de données

source: Run the ``trove list`` command. You should see output similar to this:
fr: Lancez la commande ``trove list``. Vous devriez voir une sortie écran comme ceci:
id: Jalankan command ``trove list``. Anda akan melihat output seperti ini:

source: Run the following command to install the packages:
de: Führen Sie folgenden Befehl zur Installation der Pakete aus:
fr: Lancer la commande suivante pour installer les paquets :
id: Jalankan perintah berikut untuk menginstal paket:

source: Run the following commands to install the packages:
de: Führen Sie folgende Befehle zur Installation der Pakete aus:
fr: Lancer les commandes suivantes pour installer les packages:
id: Jalankan command berikut untuk menginstal paket:

source: Run the same command on *all other* nodes:
de: Führen Sie denselben Befehl auf *allen anderen* Knoten aus:
fr: Exécuter la même commande sur *tous les autres* nœuds:
id: Menjalankan command yang sama pada *all other* nodes:

source: Run this command on the *controller* node:
de: Führen Sie diesen Befehl auf dem *Controller*-Knoten aus:
fr: Exécuter cette commande sur le nœud *controller*:
id: Jalankan command ini pada *controller* node:

source: SQL database
de: SQL-Datenbank
fr: Base de données SQL

source: Search in this guide
de: Durchsuchen Sie den Leitfaden
fr: Rechercher dans ce guide
id: Cari di panduan ini

source: Second node
de: Zweiter Knoten
fr: Second nœud

source: Secure the database service by running the ``mysql_secure_installation`` script.
de: Sichern Sie den Datenbank-Dienst, indem Sie das Skript ``mysql_secure_installation`` ausführen.
fr: Sécuriser le service de base de données en exécutant le script ``mysql_secure_installation``.
id: Mengamankan layanan database dengan menjalankan script ``mysql_secure_installation``.

source: Secure the database service by running the ``mysql_secure_installation`` script. In particular, choose a suitable password for the database ``root`` account.
de: Sichern Sie den Datenbank-Dienst, indem Sie das Skript ``mysql_secure_installation`` ausführen. Wählen Sie insbesondere für den ``root``-Account der Datenbank ein geeignetes Passwort.
fr: Sécuriser le service de base de données en exécutant le script ``mysql_secure_installation``. En particulier, choisir un mot de passe approprié pour le compte ``root`` de la base de données.
id: Amankan layanan database dengan menjalankan script ``mysql_secure_installation``. Secara khusus, pilihlah password yang cocok untuk account ``root`` database.

source: Security
de: Sicherheit
fr: Sécurité

source: Select the ML2 plug-in:
de: Auswahl des ML2 Plug-ins:
fr: Sélectionner le plugin ML2:
id: Pilih plugin ML2:

source: Select the ``keystone`` pipeline to configure the Image service to use the Identity service:
de: Wählen Sie die ``keystone``-Pipeline, damit der Abbilddienst den Identitätsdienst verwendet:
fr: Sélectionner le pipeline ``keystone`` pour configurer le service Image pour utiliser le service d'Identité:
id: Pilih jalur pipa ``keystone`` untuk mengkonfigurasi layanan Image untuk menggunakan layanan Identity:

source: Selecting the ML2 plug-in also populates the ``core_plugin`` option in the ``/etc/neutron/neutron.conf`` file with the appropriate values (in this case, it is set to the value ``ml2``).
fr: Sélectionner le plugin ML2 renseigne également l'option ``core_plugin`` dans le fichier ``/etc/neutron/neutron.conf`` avec les valeurs appropriées (dans ce cas, il définit la valeur à ``ml2``).
id: Memilih ML2 plug-in juga akan mengisi opsi ``core_plugin`` di file ``/etc/neutron/neutron.conf`` dengan nilai-nilai yang sesuai (dalam hal ini, sudah diatur untuk nilai ``ml2``).

source: Selecting the ML2 plug-in also populates the ``service_plugins`` and ``allow_overlapping_ips`` options in the ``/etc/neutron/neutron.conf`` file with the appropriate values.
fr: Sélectionner le plugin ML2 renseigne également les options ``service_plugins`` et ``allow_overlapping_ips`` dans le fichier ``/etc/neutron/neutron.conf`` avec les valeurs appropriées.
id: Memilih ML2 plug-in juga akan mengisi ``service_plugins`` dan opsi ``allow_overlapping_ips`` dalam file ``/etc/neutron/neutron.conf`` dengan nilai-nilai yang sesuai.

source: Self-service network
de: Self-service Netzwerk
fr: Réseau self-service

source: Self-service networks connect to provider networks using a virtual router that typically performs bidirectional NAT. Each router contains an interface on at least one self-service network and a gateway on a provider network.
de: Self-service Netzwerke verbinden mittels virtuellen Routern, die typischerweise ein bidirektionales NAT darstellen, zu Anbieternetzwerken. Jeder Router enthält ein Interface in mindestens einem self-service Netzwerk sowie ein Gateway zum Anbieternetzwerk.
fr: Les réseaux self-service se connecte aux réseaux fournisseur via un routeur virtuel qui en général effectue du NAT bidirectionnel. Chaque routeur possède une interface dans au moins un réseau self-service et une passerelle sur un réseau fournisseur.
id: Jaringan self-service terhubung ke jaringan provider menggunakan router virtual yang biasanya melakukan NAT dua arah. Setiap router berisi sebuah interface setidaknya satu jaringan self-service dan gateway pada jaringan provider.

source: Self-service networks typically use overlay networks. Overlay network protocols such as VXLAN include additional headers that increase overhead and decrease space available for the payload or user data. Without knowledge of the virtual network infrastructure, instances attempt to send packets using the default Ethernet :term:`maximum transmission unit (MTU)` of 1500 bytes. The Networking service automatically provides the correct MTU value to instances via DHCP. However, some cloud images do not use DHCP or ignore the DHCP MTU option and require configuration using metadata or a script.
de: Self-service Netzwerke verwenden typischerweise Overlay Netzwerke. Overlay Netzwerkprotokolle wie VXLAN beinhalten zusätzliche Header, die den Overhead erhöhen und den Platz für die Nutzlast oder Benutzerdaten verringern. Ohne Kenntnis der virtuellen Netzwerkinfrastruktur versuchen Instanzen Pakete mittels der Standard Ethernet :term:`maximum transmission unit (MTU)` von 1500 bytes zu schicken. Der Netzwerkdienst liefert automatisch den korrekten MTU-Wert per DHCP an die Instanzen. Manche Cloud-Abbilder verwenden allerdings kein DHCP oder ignorieren die DHCP MTU Option und benötigen daher die Konfiguration über Metadaten oder ein Skript.
fr: Les réseaux self-services utilisent en général les réseaux superposés. Les protocoles de réseaux superposés, comme VXLAN inclut une entête supplémentaire qui augmente le coût et diminue l'espace disponible pour la charge utile ou les données utilisateur. Sans connaissance de l'infrastructure de réseau virtuel, les instances tentent d'envoyer les paquets en utilisant le :term:`maximum transmission unit (MTU)` Ethernet par défaut de 1500 octets. Le service de Réseau fournit automatiquement la valeur de MTU correcte aux instances via le DHCP. Cependant, certaines images cloud n'utilisent pas le DHCP ou ignorent l'option MTU du DHCP et nécessitent donc une configuration en utilisant les metadata ou un script.
id: Jaringan self-service biasanya menggunakan jaringan overlay. Protokol jaringan overlay seperti VXLAN termasuk header tambahan yang meningkatkan overhead dan menurunkan ruang yang tersedia untuk payload atau pengguna data. Tanpa pengetahuan tentang infrastruktur jaringan virtual, instance mencoba untuk mengirim paket menggunakan Ethernet default :term:`maximum transmission unit (MTU)` 1500 bytes. Layanan Jaringan secara otomatis memberikan nilai MTU yang benar untuk instance melalui DHCP. Namun, beberapa cloud images tidak menggunakan DHCP atau mengabaikan opsi DHCP MTU dan memerlukan konfigurasi menggunakan metadata atau script.

source: Set a gateway on the provider network on the router:
de: Setzen Sie ein Gateway für das Anbieternetzwerk auf dem Router:
fr: Définir une passerelle sur le réseau fournisseur sur le routeur:
id: Mengatur gateway pada jaringan provider pada router:

source: Set the ``NET_ID`` environment variable to reflect the ID of a network. For example, using the provider network:
de: Belegen Sie die Umgebungsvariable ``NET_ID`` mit der Netzwerk-ID. Als Beispiel wird das Anbieter-Netzwerk verwendet:
fr: Définir la variable d'environnement ``NET_ID`` pour pointer vers l'ID d'un réseau. Par exemple, en utilisant le réseau fournisseur:
id: Mengatur variabel lingkungan ``NET_ID`` untuk mencerminkan ID jaringan. Misalnya, menggunakan jaringan operator:

source: Set the hostname of the node to ``block1``.
de: Setzen Sie den Hostnamen des Knotens auf ``block1``.
fr: Définir le hostname du nœud à ``block1``.
id: Atur hostname node ke ``block 1``.

source: Set the hostname of the node to ``compute1``.
de: Setzen Sie den Hostnamen des Nodes auf ``compute1``.
fr: Définir le hostname du nœud à ``compute1``.
id: Mengatur hostname dari node untuk ``compute1``.

source: Set the hostname of the node to ``controller``.
de: Setzen Sie den Hostnamen des Nodes auf ``controller``.
fr: Définir le hostname du nœud à ``controller``.
id: Mengatur hostname node untuk `` controller``.

source: Set the hostname of the node to ``object1``.
de: Setzen Sie den Hostnamen des Knotens auf ``object1``.
fr: Définir le hostname du nœud à ``object1``.
id: Atur hostname node ke ``objek1``.

source: Set the hostname of the node to ``object2``.
de: Setzen Sie den Hostnamen des Knotens auf ``object2``.
fr: Définir le hostname du nœud à ``object2``.
id: Atur hostname node ke ``objek 2``.

source: Set up session storage. See `Set up session storage for the dashboard <http://docs.openstack.org/admin-guide/dashboard-sessions.html>`__.
de: Speicher für die Sitzung einrichten. Weitere Informationen unter `Set up session storage for the dashboard <http://docs.openstack.org/admin-guide/dashboard-sessions.html>`__.
fr: Paramétrer le stockage de session. Voir `Paramétrer le stockage de session pour le dashboard <http://docs.openstack.org/admin-guide/dashboard-sessions.html>`__.

source: Shared File Systems
de: Freigegebene Dateisysteme
fr: Systèmes de fichiers partagés

source: Shared File Systems Option 1: No driver support for share servers management
fr: Systèmes de Fichiers Partagés Option 1: Pas de support de driver pour la gestion des serveurs de partage
id: Shared File Systems Opsi 1: Tidak ada dukungan driver untuk manajemen server bersama

source: Shared File Systems Option 2: Driver support for share servers management
fr: Systèmes de Fichiers Partagés Option 2: Support du driver pour la gestion des serveurs de partage
id: Shared File Systems Opsi 2: dukungan driver untuk manajemen server bersama

source: Shared File Systems service
de: Freigegebene Dateisysteme Dienst
fr: Service de Systèmes de Fichiers Partagés
id: Layanan Shared File Systems

source: Show the name and IP address of the instance and compare with the output of the OpenStack client:
de: Lassen Sie den Namen und die IP-Adresse der Instanz anzeigen und vergleichen sie mit der Ausgabe des OpenStack-Clients:
fr: Afficher le nom et l'adresse IP de l'instance et comparer avec la sortie du client OpenStack:
id: Tampilkan nama dan alamat IP dari instane dan membandingkan dengan output dari klien OpenStack:

source: Show the service status:
de: Dienststatus anzeigen lassen:
fr: Montrer l'état du service:
id: Tampilkan status layanan:

source: Similarly, if your compute nodes use LVM on the operating system disk, you must also modify the filter in the ``/etc/lvm/lvm.conf`` file on those nodes to include only the operating system disk. For example, if the ``/dev/sda`` device contains the operating system:
de: Gleichermaßen müssen Sie den Filter in der Datei ``/etc/lvm/lvm.conf`` auf allen betroffenen Nodes anpassen , um nur die Betriebssystemfestplatten einzuschliessen, wenn Ihre Compute Nodes LVM für die Betriebssystemfestplatten verwenden. Zum Beispiel, wenn das Gerät ``/dev/sda`` Ihr Betriebssystem enthält:
fr: De la même façon, si vos nœuds compute utilisent LVM sur leur disque système, vous devez aussi modifier le filtre dans le fichier ``/etc/lvm/lvm.conf`` sur ces nœuds pour inclure seulement le disque système. Par exemple, si le device ``/dev/sda`` contient le système d'exploitation:
id: Demikian pula, jika node komputasi Anda menggunakan LVM pada sistem operasi disk, Anda juga harus mengubah filter dalam file ``/etc/lvm/lvm.conf`` pada node untuk menyertakan hanya sistem operasi disk. Misalnya, jika perangkat ``/dev/sda`` berisi sistem operasi:
