Repository: 25hours/openstack-manuals
Catalog: doc/image-guide/locale/*.po
Languages: fr, ja

source: Because raw images don't support snapshots, OpenStack Compute will automatically convert raw image files to qcow2 as needed.
fr: Puisque les images raw ne supportent pas les copies instantanées, OpenStack Calcul va automatiquement convertir les fichiers d'image raw en qcow2 au besoin.
ja: raw イメージはスナップショットをサポートしないため、OpenStack Compute は、raw イメージファイルを必要に応じて自動的に qcow2 に変換します。

source: This is a virtual machine image in raw format, as described above.
fr: C'est une image de machine virtuelle au format raw, comme décrit au-dessus.
ja: これは、上に記載したような、raw 形式の仮想マシンイメージです。

source: A kernel file that the hypervisor will load initially to boot the image. For a Linux machine, this would be a <emphasis>vmlinuz</emphasis> file.
fr: Un fichier kernel que l'hyperviseur va initialement charger pour booter l'image. Pour une machine Linux, cela serait un fichier <emphasis>vmlinuz</emphasis>.
ja: ハイパーバイザーがイメージを起動するために最初に読み込むカーネルファイル。Linux の場合、これは <emphasis>vmlinuz</emphasis> でしょう。

source: An optional ramdisk file mounted at boot time. For a Linux machine, this would be an <emphasis>initrd</emphasis> file.
fr: Un fichier ram-disque optionnel monté lors du boot. Pour une machine Linux, cela serait un fichier <emphasis>initrd</emphasis>.
ja: 起動時にマウントされる、オプションのラムディスクファイル。Linux の場合、これは <emphasis>initrd</emphasis> ファイルでしょう。

source: The <link href="http://docs.aws.amazon.com/AWSEC2/latest/UserGuide/AMIs.html">AMI/AKI/ARI </link>format was the initial image format supported by Amazon EC2. The image consists of three files:<placeholder-1/>
fr: Le format <link href="http://docs.aws.amazon.com/AWSEC2/latest/UserGuide/AMIs.html">AMI/AKI/ARI </link> était le format d'image initial supporté par Amazon EC2. L'image consiste en trois fichiers:<placeholder-1/>
ja: <link href="http://docs.aws.amazon.com/AWSEC2/latest/UserGuide/AMIs.html">AMI/AKI/ARI</link> 形式は、Amazon EC2 によりサポートされる初期のイメージ形式でした。このイメージは 3 種類のファイルから構成されます。<placeholder-1/>

source: UEC tarball
fr: tarball UEC
ja: UEC tar ファイル

source: Ubuntu Enterprise Cloud refers to a discontinued Eucalyptus-based Ubuntu cloud solution that has been replaced by the OpenStack-based Ubuntu Cloud Infrastructure.
fr: Le Cloud Entreprise Ubuntu renvoi à une solution de cloud Ubuntu obsolète basée sur Eucalyptus qui a été remplacée par l'Infrastructure de Cloud Ubuntu basée sur OpenStack.
ja: Ubuntu Enterprise Cloud は、廃止された Eucalyptus ベースの Ubuntu クラウドソリューションを参照しています。これは、OpenStack ベースの Ubuntu Cloud Infrastructure により置き換えられました。

source: A UEC (Ubuntu Enterprise Cloud) tarball is a gzipped tarfile that contains an AMI file, AKI file, and ARI file.<placeholder-1/>
fr: Un tarball UEC (Cloud Entreprise ubuntu) est un fichier tarball gzippé contenant un fichier AMI, un fichier AKI, et un fichier ARI.<placeholder-1/>
ja: UEC (Ubuntu Enterprise Cloud) ファイルは、AMI ファイル、AKI ファイル、ARI ファイルを含む、gzip された tar ファイルです。<placeholder-1/>

source: VMware's ESXi hypervisor uses the <link href="http://www.vmware.com/technical-resources/interfaces/vmdk.html">VMDK</link> (Virtual Machine Disk) format for images.
fr: L'hyperviseur VMware's ESXi utilise le format <link href="http://www.vmware.com/technical-resources/interfaces/vmdk.html">VMDK</link> (Disque de Machine Virtuelle) pour les images.
ja: VMware の ESXi ハイパーバイザーは、イメージに <link href="http://www.vmware.com/technical-resources/interfaces/vmdk.html">VMDK</link> (Virtual Machine Disk) 形式を使用します。

source: VirtualBox uses the <link href="https://forums.virtualbox.org/viewtopic.php?t=8046">VDI</link> (Virtual Disk Image) format for image files. None of the OpenStack Compute hypervisors support VDI directly, so you will need to convert these files to a different format to use them with OpenStack.
fr: VirtualBox utilise le format <link href="https://forums.virtualbox.org/viewtopic.php?t=8046">VDI</link> (Image de Disque Virtuel) pour les fichiers d'image. Aucun des hyperviseurs de calcul OpenStack ne supporte VDI directement, donc vous devrez convertir ces fichiers à un format différent pour les utiliser avec OpenStack.
ja: VirtualBox は、イメージファイルに <link href="https://forums.virtualbox.org/viewtopic.php?t=8046">VDI</link> (Virtual Disk Image) 形式を使用します。OpenStack Compute のハイパーバイザーは、VDI をサポートしないため、これらのファイルを OpenStack で使用するために、別の形式に変換する必要があります。

source: Microsoft Hyper-V uses the VHD (Virtual Hard Disk) format for images.
fr: Microsoft Hyper-V Utilise le format VHD (Disque Dur Virtuel) pour les images.
ja: Microsoft Hyper-V は、イメージに VHD (Virtual Hard Disk) 形式を使用します。

source: The version of Hyper-V that ships with Microsoft Server 2012 uses the newer <link href="http://technet.microsoft.com/en-us/library/hh831446.aspx">VHDX</link> format, which has some additional features over VHD such as support for larger disk sizes and protection against data corruption during power failures.
fr: la version d'Hyper-V qui est livrée avec Microsoft Server 2012 utilise le nouveau format <link href="http://technet.microsoft.com/en-us/library/hh831446.aspx">VHDX</link>, qui possède quelques fonctionnalités supplémentaires par rapport au format VHD comme le support de tailles de disque plus larges et la protection contre la corruption des données lors de pannes d'électricité.
ja: Microsoft Server 2012 に同梱されている Hyper-V は、より新しい <link href="http://technet.microsoft.com/en-us/library/hh831446.aspx">VHDX</link> 形式を使用します。これは、より大きなディスク容量のサポート、電源障害時のデータ破損からの保護など、いくつか VHD を超える機能があります。

source: <link href="http://www.dmtf.org/standards/ovf">OVF</link> (Open Virtualization Format) is a packaging format for virtual machines, defined by the Distributed Management Task Force (DMTF) standards group. An OVF package contains one or more image files, a .ovf XML metadata file that contains information about the virtual machine, and possibly other files as well.
fr: <link href="http://www.dmtf.org/standards/ovf">OVF</link> (Format de Virtualisation Ouvert) est un format d'empaquetage pour les machines virtuelles, défini par les standards édictés par le groupe Distributed Management Task Force (DMTF). Un package OVF contient un ou plusieurs fichiers d'image, un fichier de métadonnées XML .ovf contenant des informations sur la machine virtuelle, et possiblement d'autres fichiers aussi.
ja: <link href="http://www.dmtf.org/standards/ovf">OVF</link> (Open Virtualization Format) は、Distributed Management Task Force (DMTF) 標準化グループにより定義された、仮想マシンのパッケージ形式です。OVF パッケージは、1 つ以上のイメージファイル、仮想マシンに関する情報を含む .ovf XML メタデータファイル、場合によりその他ファイルを含みます。

source: An OVF package can be distributed in different ways. For example, it could be distributed as a set of discrete files, or as a tar archive file with an .ova (open virtual appliance/application) extension.
fr: Un package OVF peut être distribué de différentes manières. Par exemple, il pourrait être distribué sous la forme d'un jeu de fichiers discrets, ou en tant que fichier d'archive tar avec une extension .ova ( appliance/application virtuelle ouverte).
ja: OVF パッケージは、別の方法でも配布できます。例えば、個々のファイル群として配布できます。または .ova (open virtual appliance/application) 拡張子を持つ tar ファイルとしても配布できます。

source: OpenStack Compute does not currently have support for OVF packages, so you will need to extract the image file(s) from an OVF package if you wish to use it with OpenStack.
fr: OpenStack Calcul n’inclut actuellement pas le support des packages OVF, donc il vous sera nécessaire d'extraire le(s) fichier(s) d'image à partir d'un package OVF si vous souhaitez l'utiliser avec OpenStack.
ja: OpenStack Compute は、現在 OVF パッケージをサポートしないため、OpenStack で使用したい場合、OVF パッケージからイメージファイルを抽出する必要があります。

source: The <link href="http://www.ecma-international.org/publications/standards/Ecma-119.htm">ISO</link> format is a disk image formatted with the read-only ISO 9660 (also known as ECMA-119) filesystem commonly used for CDs and DVDs. While we don't normally think of ISO as a virtual machine image format, since ISOs contain bootable filesystems with an installed operating system, you can treat them the same as you treat other virtual machine image files.
fr: Le format <link href="http://www.ecma-international.org/publications/standards/Ecma-119.htm">ISO</link> est une image disque formatée avec le système de fichiers en lecture seule ISO 9660 (aussi connu sous le nom ECMA-119) couramment utilisé pour les CDs et DVDs. Bien que nous ne voyons pas l'ISO comme un format d'image de machine virtuelle, puisque les ISOs contiennent des systèmes de fichiers bootables avec un système d'exploitation installé, vous pouvez les manipuler de la même manière que vous manipulez d'autres fichiers d'image de machine virtuelle.
ja: <link href="http://www.ecma-international.org/publications/standards/Ecma-119.htm">ISO</link> 形式は、CD や DVD に一般的に使用されている、読み込み専用の ISO 9660 (ECMA-119 としても知られている) ファイルシステムでフォーマットしたディスクイメージです。通常は、仮想マシンイメージ形式として ISO を考慮しませんが、ISO がインストール済みオペレーティングシステムを持つブート可能なファイルシステムを含むため、他の仮想マシンイメージファイルと同じように取り扱えます。

source: Example: CentOS image
fr: Exemple: image CentOS
ja: 例: CentOS イメージ

source: This example shows you how to install a CentOS image and focuses mainly on CentOS 6.4. Because the CentOS installation process might differ across versions, the installation steps might differ if you use a different version of CentOS.
fr: Cet exemple vous montre comment installer une image CentOS et se concentre principalement sur CentOS 6.4. Puisque le processus d'installation pourrait différer entre les versions, les étapes d'installation pourraient différer si vous utilisez une version différente de CentOS.
ja: この例は、CentOS イメージのインストール方法を説明します。おもに CentOS 6.4 を対象にしています。CentOS のインストールプロセスがバージョンにより異なる可能性があるため、違うバージョンの CentOS を使用している場合、インストール手順が異なる可能性があります。

source: Download a CentOS install ISO
fr: Téléchargez une ISO d'installation de CentOS
ja: CentOS インストール ISO のダウンロード

source: Navigate to the <link href="http://www.centos.org/download/mirrors/">CentOS mirrors</link> page.
fr: Rendez-vous sur la page web <link href="http://www.centos.org/download/mirrors/">CentOS mirrors</link>.
ja: <link href="http://www.centos.org/download/mirrors/">CentOS ミラー</link>ページに移動します。

source: Click one of the <literal>HTTP</literal> links in the right-hand column next to one of the mirrors.
fr: Cliquez sur un des liens <literal>HTTP</literal> dans la colonne de droite à côté d'un des miroirs.
ja: ミラーの右側にある <literal>HTTP</literal> リンクをクリックします。

source: Click the folder link of the CentOS version that you want to use. For example, <literal>6.4/</literal>.
fr: Cliquez sur le lien de dossier de la version CentOS que vous souhaitez utiliser. Par exemple, <literal>6.4/</literal>.
ja: 使用したい CentOS のバージョンのリンクをクリックします。例えば、<literal>6.4/</literal> です。

source: Click the <literal>isos/</literal> folder link.
fr: Cliquez sur le lien de dossier <literal>isos/</literal>.
ja: <literal>isos/</literal> フォルダーへのリンクをクリックします。

source: Click the <literal>x86_64/</literal> folder link for 64-bit images.
fr: Cliquez sur le lien de dossier <literal>x86_64/</literal> pour les images 64-bits.
ja: 64 ビットイメージ用の <literal>x86_64/</literal> フォルダーへのリンクをクリックします。

source: Click the netinstall ISO image that you want to download. For example, <filename>CentOS-6.4-x86_64-netinstall.iso</filename> is a good choice because it is a smaller image that downloads missing packages from the Internet during installation.
fr: Cliquez sur l'image ISO netinstall que vous souhaitez télécharger. Par exemple, <filename>CentOS-6.4-x86_64-netinstall.iso</filename> est un bon choix car c'est une image plus petite qui télécharge les packages manquant à partir d'Internet durant l'installation.
ja: ダウンロードしたい netinstall ISO イメージをクリックします。例えば、<filename>CentOS-6.4-x86_64-netinstall.iso</filename> は小さいイメージなので良いでしょう。不足しているパッケージは、インストール中にインターネットからダウンロードされます。

source: Start the installation process
fr: Lancez le processus d'installation
ja: インストールプロセスの開始

source: Start the installation process using either <placeholder-1/> or <placeholder-2/> as described in the previous section. If you use <placeholder-3/>, do not forget to connect your VNC client to the virtual machine.
fr: Commencez le processus d'installation en utilisant soit <placeholder-1/> ou <placeholder-2/> comme décrit dans la section précédente. Si vous utilisez <placeholder-3/>, n'oubliez pas de connecter votre client VNC à la machine virtuelle.
ja: 前のセクションに記載されている <placeholder-1/> や <placeholder-2/> を使用して、インストールプロセスを開始します。<placeholder-3/> を使用する場合、VNC クライアントを仮想マシンに接続し忘れないでください。

source: Assume that:
fr: Considérons que:
ja: 以下の前提とします。

source: The name of your virtual machine image is <literal>centos-6.4</literal>; you need this name when you use <placeholder-1/> commands to manipulate the state of the image.
fr: Le nom de l'image de votre machine virtuelle est <literal>centos-6.4</literal>; vous avez besoin de ce nom lorsque vous utilisez les commandes <placeholder-1/> pour manipuler l'état de l'image.
ja: 仮想マシンイメージの名前は <literal>centos-6.4</literal> です。イメージの状態を操作するために、<placeholder-1/> コマンドを使用するとき、この名前が必要になります。

source: You saved the netinstall ISO image to the <filename>/data/isos</filename> directory.
fr: Vous avez sauvegardé l'image ISO netinstall dans le dossier <filename>/data/isos</filename>.
ja: ネットワークインストール ISO イメージが <filename>/data/isos</filename> に保存されています。

source: If you use <placeholder-1/>, the commands should look something like this:
fr: Si vous utilisez <placeholder-1/>, les commandes devraient ressembler à quelque chose comme ça:
ja: <placeholder-1/> を使用する場合、このコマンドは以下のようになるでしょう。

source: Step through the installation
fr: Suivez les étapes d'installation
ja: インストールのステップ実行

source: At the initial Installer boot menu, choose the <guilabel>Install or upgrade an existing system</guilabel> option. Step through the installation prompts. Accept the defaults.
fr: Dans le menu d'installation au boot, choisissez l'option <guilabel>Installer ou mettre à jour un système existant</guilabel>. Suivez et répondez aux différentes étapes d'installation. Acceptez les choix par défaut.
ja: インストーラーの初期ブートメニューで、<guilabel>Install or upgrade an existing system</guilabel> を選択します。インストールのプロンプトを一つずつ実行します。

source: Configure TCP/IP
fr: Configurez TCP/IP
ja: TCP/IP の設定

source: The default TCP/IP settings are fine. In particular, ensure that Enable IPv4 support is enabled with DHCP, which is the default.
fr: Les réglages TCP/IP par défaut conviennent. En particulier, assurez vous que le support d'IPv4 soit actif avec DHCP, qui est le choix par défaut.
ja: デフォルトの TCP/IP の設定が良いです。とくに、IPv4 サポートが DHCP 付きで有効化されていることを確認します。

source: Point the installer to a CentOS web server
fr: Pointez l'installeur sur un serveur web CentOS
ja: CentOS Web サーバーの指定

source: Choose URL as the installation method.
fr: Choisissez URL en tant que méthode d'installation.
ja: インストール方法として URL を選択します。

source: Depending on the version of CentOS, the net installer requires that the user specify either a URL or the web site and a CentOS directory that corresponds to one of the CentOS mirrors. If the installer asks for a single URL, a valid URL might be <literal>http://mirror.umd.edu/centos/6/os/x86_64</literal>.
fr: En fonction de la version de CentOS, l'installeur suivant demande que l'utilisateur indique soit une URL soit le site web ainsi qu'un dossier CentOS qui correspond à l'un des miroirs CentOS. Si l'installeur demande une URL unique, une URL valide pourrait être <literal>http://mirror.umd.edu/centos/6/os/x86_64</literal>.
ja: CentOS のバージョンによっては、ユーザーが CentOS のミラーに応じた、URL や Web サイト、および CentOS のディレクトリをネットワークインストーラーに指定する必要があります。インストーラーが URL だけを要求する場合、有効な URL の 1 つは <literal>http://mirror.umd.edu/centos/6/os/x86_64</literal> です。

source: Consider using other mirrors as an alternative to <literal>mirror.umd.edu</literal>.
fr: Vous pouvez utiliser d'autres miroirs que <literal>mirror.umd.edu</literal>.
ja: <literal>mirror.umd.edu</literal> の代替として、他のミラーを使用することを検討してください。

source: If the installer asks for web site name and CentOS directory separately, you might enter:
fr: Si l'installeur demande un nom de site web et un dossier CentOS séparément, vous pourriez entrer:
ja: インストーラーが Web サイト名と CentOS ディレクトリをそれぞれ確認する場合、次のとおり入力します。

source: Web site name: <literal>mirror.umd.edu</literal>
fr: Nom de site web: <literal>mirror.umd.edu</literal>
ja: Web サイト名: <literal>mirror.umd.edu</literal>

source: CentOS directory: <literal>centos/6/os/x86_64</literal>
fr: Dossier CentOS: <literal>centos/6/os/x86_64</literal>
ja: CentOS ディレクトリー: <literal>centos/6/os/x86_64</literal>

source: See <link href="http://www.centos.org/download/mirrors/">CentOS mirror page</link> to get a full list of mirrors, click on the "HTTP" link of a mirror to retrieve the web site name of a mirror.
fr: Voyez la <link href="http://www.centos.org/download/mirrors/">page des miroirs CentOS</link> pour obtenir la liste complète des miroirs, cliquez sur le lien "HTTP" d'un miroir pour retrouver le nom du site web d'un miroir.
ja: ミラーの一覧は <link href="http://www.centos.org/download/mirrors/">CentOS ミラーページ</link>を参照してください。取得したいミラー Web サイト名の "HTTP" リンクをクリックしてください。

source: Storage devices
fr: Périphériques de stockage
ja: ストレージデバイス

source: If prompted about which type of devices your installation uses, choose <guilabel>Basic Storage Devices</guilabel>.
fr: Si le type de périphériques que votre installation utilise vous est demandé, choisissez <guilabel>Périphériques de Stockage de Base</guilabel>.
ja: インストールに使用するデバイスの種類を確認された場合、<guilabel>基本ストレージデバイス (Basic Storage Devices)</guilabel> を選択します。

source: Hostname
fr: Nom d'Hôte
ja: ホスト名

source: The installer may ask you to choose a host name. The default (<literal>localhost.localdomain</literal>) is fine. You install the <systemitem class="service">cloud-init</systemitem> package later, which sets the host name on boot when a new instance is provisioned using this image.
fr: L'installeur pourrait vous demander de choisir un nom d'hôte. Le nom par défaut (<literal>localhost.localdomain</literal>) est bon. Vous installez le package <systemitem class="service">cloud-init</systemitem> plus tard, qui configure le nom d'hôte au boot lorsqu'une nouvelle instance est provisionnée en utilisant cette image.
ja: インストーラーが、ホスト名の入力を求めるかもしれません。デフォルトの <literal>localhost.localdomain</literal> が良いでしょう。後ほど <systemitem class="service">cloud-init</systemitem> パッケージをインストールします。これにより、このイメージを使用して新規展開されたインスタンスの起動時に、ホスト名が設定されます。

source: Partition the disks
fr: Partitionner les disques
ja: ディスクのパーティション作成

source: There are different options for partitioning the disks. The default installation uses LVM partitions, and creates three partitions (<filename>/boot</filename>, <filename>/</filename>, swap), which works fine. Alternatively, you might want to create a single ext4 partition that is mounted to "<literal>/</literal>", which also works fine.
fr: Il y a différentes options possibles pour partitionner les disques. L'installation par défaut utilise des partitions LVM, et crée trois partitions (<filename>/boot</filename>, <filename>/</filename>, swap), ce qui convient bien. Alternativement, vous pourriez vouloir créer une partition ext4 unique montée sur "<literal>/</literal>", ce qui conviendrait aussi.
ja: ディスクのパーティションは、さまざまな選択肢があります。デフォルトは、うまく動作する LVM パーティションを使用し、3 つのパーティション (<filename>/boot</filename>、<filename>/</filename>、swap) を作成します。この代わりに、単一の ext4 パーティション を作成し、<literal>/</literal> にマウントすることもうまく動作するでしょう。

source: If unsure, use the default partition scheme for the installer because no scheme is better than another.
fr: Si vous n'êtes pas sûr, utilisez le schéma de partitionnement par défaut pour l'installeur car aucun schéma n'est mieux qu'un autre.
ja: よくわからない場合、インストーラーのデフォルトの設定が最良であるため、そのまま使用します。

source: Step through the installation, using the default options. The simplest thing to do is to choose the "Basic Server" install (may be called "Server" install on older versions of CentOS), which installs an SSH server.
fr: Suivez les étapes d'installation, en utilisant les options par défaut. La chose la plus simple à faire est de choisir l'installation "Serveur de base" (qui peut aussi être appelée installation "Serveur" sur les versions de CentOS plus anciennes), ce qui installe un serveur SSH.
ja: デフォルトのオプションを使用して、インストールをステップ実行します。最も簡単な方法は、「基本サーバー」インストールを選択することです (CentOS の古いバージョンでは、「サーバー」と呼んでいるかもしれません)。これは、SSH サーバーをインストールします。

source: Detach the CD-ROM and reboot
fr: Détachez le CD-ROM et rebootez
ja: CD-ROM の取り出しと再起動

source: After the install completes, the <guilabel>Congratulations, your CentOS installation is complete</guilabel> screen appears.
fr: Une fois que l'installation est terminée, l'écran <guilabel>Félicitations, votre installation CentOS est terminée</guilabel> apparaît.
ja: インストール完了後、<guilabel>Congratulations, your CentOS installation is complete</guilabel> 画面が表示されます。

source: To eject a disk by using the <placeholder-1/> command, libvirt requires that you attach an empty disk at the same target that the CDROM was previously attached, which should be <literal>hdc</literal>. You can confirm the appropriate target using the <placeholder-2/> command.
fr: Pour éjecter un disque en utilisant la commande <placeholder-1/>, libvirt a besoin que vous attachiez un disque vide à la même cible à laquelle le CD-ROM était précédemment attaché, qui devrait être <literal>hdc</literal>. Vous pouvez confirmer la cible appropriée en utilisant la commande <placeholder-2/>.
ja: <placeholder-1/> コマンドを使用して、ディスクを取り出すために、CD-ROM が前に接続されていた場所と同じ場所に、libvirt が空のディスクを接続する必要があります。この場所は、<literal>hdc</literal> でしょう。<placeholder-2/> コマンドを使用して、適切な接続先を確認できます。

source: Run the following commands from the host to eject the disk and reboot using virsh, as root. If you are using virt-manager, the commands below will work, but you can also use the GUI to detach and reboot it by manually stopping and starting.
fr: Lancez les commandes suivantes à partir de l'hôte pour éjecter le disque et rebootez en utilisant virsh, en tant que root. Si vous utilisez virt-manager, les commandes ci-dessous fonctionneront, mais vous pouvez aussi utiliser l'interface utilisateur graphique pour le détacher et le rebooter en le stoppant et en le redémarrant manuellement.
ja: virsh を使用して、ディスクを取り出し、再起動するために、ホストから root として以下のコマンドを実行します。仮想マシンマネージャーを使用している場合、以下のコマンドを使用できますが、ディスクを切断し、手動で停止および起動を実行するために、GUI を使用することもできます。

source: Log in to newly created image
fr: Loguez-vous dans l'image nouvellement créée
ja: 新規作成イメージへのログイン

source: When you boot for the first time after installation, you might be prompted about authentication tools. Select <guilabel>Exit</guilabel>. Then, log in as root.
fr: Lorsque vous bootez pour la première fois après l'installation, il pourrait vous être demandé d'effectuer des réglages à propos des outils d'authentification. Sélectionnez <guilabel>Exit</guilabel>. Puis, loguez-vous en tant que root.
ja: インストール後、初めて起動する場合、認証ツールに関するプロンプトが表示されます。<guilabel>Exit</guilabel> を選択します。そして、root としてログインします。

source: Install the ACPI service
fr: Installer le service ACPI
ja: ACPI サービスのインストール

source: To enable the hypervisor to reboot or shutdown an instance, you must install and run the <systemitem class="service">acpid</systemitem> service on the guest system.
fr: Afin de permettre à l'hyperviseur de rebooter ou éteindre une instance, vous devez installer et lancer le service <systemitem class="service">acpid</systemitem> sur le système invité.
ja: ハイパーバイザーがインスタンスを再起動やシャットダウンできるようにするために、ゲストシステムに <systemitem class="service">acpid</systemitem> サービスをインストールし、実行する必要があります。

source: Run the following commands inside the CentOS guest to install the ACPI service and configure it to start when the system boots:
fr: Lancez les commandes suivantes à l'intérieur de l'invité CentOS pour installer le service ACPI et configurez-le pour démarrer lorsque le système boot:
ja: ACPI サービスをインストールし、システム起動時にサービス起動するよう設定するために、以下のコマンドを CentOS ゲスト内で実行します。

source: Configure to fetch metadata
fr: Configuration pour prendre les métadonnées
ja: メタデータ取得の設定
