Repository: 25hours/openstack-manuals
Catalog: doc/image-guide/locale/*.po
Languages: fr, ja

source: To fetch the ssh public key and add it to the root account, edit the <filename>/etc/rc.local</filename> file and add the following lines before the line “touch /var/lock/subsys/local”. This code fragment is taken from the <link href="https://github.com/rackerjoe/oz-image-build/blob/master/templates/centos60_x86_64.tdl">rackerjoe oz-image-build CentOS 6 template</link>.
fr: Pour prendre la clé publique ssh et l'ajouter au compte root, éditez le fichier <filename>/etc/rc.local</filename> et ajoutez les lignes suivantes avant la ligne “touch /var/lock/subsys/local”. Ce fragment de code est prélevé depuis le <link href="https://github.com/rackerjoe/oz-image-build/blob/master/templates/centos60_x86_64.tdl">modèle CentOS 6 oz-image-build de rackerjoe</link>.
