Repository: 25hours/openstack-manuals
Catalog: doc/image-guide/locale/*.po
Languages: fr, ja

source: With these packages installed, the image performs the root partition resize on boot. For example, in the <filename>/etc/rc.local</filename> file. These packages are in the Ubuntu and Debian package repository, as well as the EPEL repository (for Fedora/RHEL/CentOS/Scientific Linux guests).
ja: これらのパッケージをインストールすると、このイメージは、起動時にルートパーティションの容量変更を実行できるようになります。例えば、<filename>/etc/rc.local</filename> にあります。これらのパッケージは、Ubuntu や Debian のパッケージリポジトリーにあります。また、Fedora、RHEL、CentOS、Scientific Linux のゲストの場合、EPEL リポジトリーにあります。

source: If you cannot install <literal>cloud-initramfs-tools</literal>, Robert Plestenjak has a GitHub project called <link href="https://github.com/flegmatik/linux-rootfs-resize">linux-rootfs-resize</link> that contains scripts that update a ramdisk by using <placeholder-1/> so that the image resizes properly on boot.
fr: Si vous ne pouvez pas installer <literal>cloud-initramfs-tools</literal>, Robert Plestenjak a un projet GitHub nommé <link href="https://github.com/flegmatik/linux-rootfs-resize">linux-rootfs-resize</link> contenant des scripts mettant à jour la ramdisk en utilisant <placeholder-1/> ce qui permet redimensionner proprement l'image au démarrage.
ja: <literal>cloud-initramfs-tools</literal> をインストールできない場合、Robert Plestenjak 氏が <link href="https://github.com/flegmatik/linux-rootfs-resize">linux-rootfs-resize</link> という GitHub プロジェクトを行っています。これには、イメージを起動時にリサイズできるよう、<placeholder-1/> を使用することにより、ラムディスクを更新するスクリプトが含まれます。

source: If you can install the cloud-utils and <package>cloud-init</package> packages, we recommend that when you create your images, you create a single ext3 or ext4 partition (not managed by LVM).
fr: Si vous pouvez installer les packages cloud-utils et <package>cloud-init</package>, nous recommandons que lorsque vous créez vos images, vous créez une partition unique ext3 ou ext4 (non gérée par LVM).
ja: cloud-utils と <package>cloud-init</package> をインストールできる場合、イメージを作成するとき、(LVM により管理されない) 単一の ext3 / ext4 パーティションを作成することを推奨します。

source: Non-Xen without <package>cloud-init</package>/<package>cloud-tools</package>: LVM
fr: Non Xen sans <package>cloud-init</package>/<package>cloud-tools</package>: LVM
ja: <package>cloud-init</package>/<package>cloud-tools</package> なしの非 Xen: LVM

source: If you cannot install <package>cloud-init</package> and <package>cloud-tools</package> inside of your guest, and you want to support resize, you must write a script that your image runs on boot to modify the partition table. In this case, we recommend using LVM to manage your partitions. Due to a limitation in the Linux kernel (as of this writing), you cannot modify a partition table of a raw disk that has partitions currently mounted, but you can do this for LVM.
fr: Si vous ne pouvez pas installer <package>cloud-init</package> et <package>cloud-tools</package> à l'intérieur de votre invité, et que vous souhaitez supporter le redimensionnement, vous devez écrire un script que votre image lancera au démarrage pour modifier la table de partitions. Dans ce cas, nous recommandons l'utilisation de LVM pour gérer vos partitions. En raison d'une limitation du kernel Linux (au moment où ces lignes sont écrites), vous ne pouvez pas modifier une table de partitions d'un disque raw dont les partitions sont actuellement montées, mais vous pouvez le faire pour LVM.
ja: ゲスト内に <package>cloud-init</package> と <package>cloud-tools</package> をインストールできず、リサイズをサポートしたい場合、パーティションテーブルを変更するために、イメージが起動時に実行するスクリプトを書く必要があります。この場合、パーティションを管理するために、LVM を使用することを推奨します。Linux カーネルの制限 (執筆時点) により、現在マウントされているローディスクのパーティションテーブルを変更できませんが、LVM の場合は実行できます。

source: Detect if any additional space is available on the disk. For example, parse the output of <placeholder-1/>.
fr: Détecter si un espace supplémentaire est disponible sur le disque. Par exemple, interprétez la sortie de <placeholder-1/>.
ja: ディスクの追加領域を利用可能かどうかを検知します。例えば、<placeholder-1/> の出力を解析します。

source: Create a new LVM partition with the additional space. For example, <placeholder-1/>.
fr: Créer une nouvelle partition LVM avec l'espace supplémentaire. Par exemple, <placeholder-1/>.
ja: この追加領域を用いて新規 LVM パーティションを作成します。例えば、<placeholder-1/>。

source: Create a new physical volume. For example, <placeholder-1/>.
fr: Créer un nouveau volume physique. Par exemple, <placeholder-1/>.
ja: 新規物理ボリュームを作成します。例えば、<placeholder-1/>。

source: Extend the volume group with this physical partition. For example, <placeholder-1/>.
fr: 2tendre le groupe de volumes avec cette partition physique. Par exemple, <placeholder-1/>.
ja: この物理パーティションを用いてボリュームグループを拡張します。例えば、<placeholder-1/>。

source: Extend the logical volume contained the root partition by the amount of space. For example, <placeholder-1/>.
fr: Etendre le volume logique contenu dans la partition racine par la quantité d'espace. Par exemple, <placeholder-1/>.
ja: ルートパーティションを含む論理ボリュームを合計容量に拡張します。例えば、<placeholder-1/>。

source: Resize the root file system. For example, <placeholder-1/>.
fr: Redimensionner le système de fichiers racine. Par exemple, <placeholder-1/>.
ja: ルートファイルシステムをリサイズします。例えば、<placeholder-1/>。

source: Your script must do something like the following:<placeholder-1/>
fr: Votre script doit faire quelque chose comme ce qui suit:<placeholder-1/>
ja: スクリプトは以下のようなことを実行する必要があります。<placeholder-1/>

source: You do not need a <filename>/boot</filename> partition unless your image is an older Linux distribution that requires that <filename>/boot</filename> is not managed by LVM.
fr: Vous n'avez pas besoin d'une partition <filename>/boot</filename> à moins que votre image est une vieille distribution Linux qui nécessite que <filename>/boot</filename> ne soit pas géré par LVM.
ja: お使いのイメージが、<filename>/boot</filename> が LVM により管理されていないという要件がある古い Linux ディストリビューションでなければ、<filename>/boot</filename> パーティションは必要ありません。

source: You must remove the network persistence rules in the image because they cause the network interface in the instance to come up as an interface other than eth0. This is because your image has a record of the MAC address of the network interface card when it was first installed, and this MAC address is different each time that the instance boots. You should alter the following files:
fr: Vous devez supprimer les règles de persistence du réseau dans l'image car elles imposent à l'interface réseau dans l'instance de s'initialiser en tant qu'interface autre que eth0. Ceci est dû au fait que votre image possède un enregistrement de l'adresse MAC de la carte d'interface réseau générée lors de sa première installation, et cette adresse MAC est différente chaque fois que cette instance démarre. Vous devez altérer les lignes suivantes:
ja: ネットワーク永続化ルールにより、インスタンスのネットワークインターフェースが eth0 以外のインターフェースとして起動するため、イメージでそのルールを削除する必要があります。これは、最初にインストールしたときに、ネットワークインターフェースカードの MAC が記録されるため、インスタンスの起動ごとに別の MAC アドレスになるためです。以下のファイルを変更します。

source: Replace <filename>/etc/udev/rules.d/70-persistent-net.rules</filename> with an empty file (contains network persistence rules, including MAC address)
fr: Remplacez <filename>/etc/udev/rules.d/70-persistent-net.rules</filename> par un fichier vide (contient les règles de persistence du réseau, y compris l'adresse MAC)
ja: <filename>/etc/udev/rules.d/70-persistent-net.rules</filename> (MAC アドレスなど、ネットワークの永続化設定) を空ファイルで置き換えます。

source: Replace <filename>/lib/udev/rules.d/75-persistent-net-generator.rules</filename> with an empty file (this generates the file above)
fr: Remplacez <filename>/lib/udev/rules.d/75-persistent-net-generator.rules</filename> par un fichier vide (cela génère le fichier au-dessus)
ja: <filename>/lib/udev/rules.d/75-persistent-net-generator.rules</filename> (上のファイルを生成) を空ファイルで置き換えます。

source: Remove the HWADDR line from <filename>/etc/sysconfig/network-scripts/ifcfg-eth0</filename> on Fedora-based images
fr: Enlevez la ligne HWADDR du fichier <filename>/etc/sysconfig/network-scripts/ifcfg-eth0</filename> sur les images basées sur Fedora
ja: Fedora ベースのイメージの <filename>/etc/sysconfig/network-scripts/ifcfg-eth0</filename> から HWADDR 行を削除します。

source: If you delete the network persistent rules files, you may get a udev kernel warning at boot time, which is why we recommend replacing them with empty files instead.
fr: Si vous supprimez les fichiers de règles de persistence du réseau, il est possible que vous obteniez un message d'avertissement du kernel à propos d'udev au démarrage, c'est la raison pour laquelle nous recommandons de les remplacer par des fichiers vides.
ja: ネットワーク永続化ルールのファイルを削除すると、起動時に udev カーネルの警告が出るかもしれません。そのため、これらを空ファイルで置き換えることを推奨します。

source: Ensure ssh server runs
fr: Assurez-vous que le serveur ssh fonctionne.
ja: SSH サーバーの動作確認

source: You must install an ssh server into the image and ensure that it starts up on boot, or you cannot connect to your instance by using ssh when it boots inside of OpenStack. This package is typically called <literal>openssh-server</literal>.
fr: Vous devez installer un serveur ssh à l'intérieur de l'image pour être certain qu'il soit lancé au démarrage, ou vous ne pourrez pas vous connecter à votre instance en utilisant ssh lorsqu'elle démarrera à l'intérieur d'OpenStack. Ce package est typiquement appelé <literal>openssh-server</literal>.
ja: イメージの中に SSH サーバーをインストールし、起動時に開始するよう設定する必要があります。そうでなければ、OpenStack 内に起動したインスタンスに SSH 接続できません。このパッケージは、一般的に <literal>openssh-server</literal> という名前です。

source: In general, we recommend that you disable any firewalls inside of your image and use OpenStack security groups to restrict access to instances. The reason is that having a firewall installed on your instance can make it more difficult to troubleshoot networking issues if you cannot connect to your instance.
fr: En général, nous recommandons la désactivation de tout firewall à l'intérieur de votre image et d'utiliser les groupes de sécurité OpenStack pour restreindre l'accès aux instances. Ceci est en raison du fait qu'avoir un firewall installé sur votre instance peut rendre plus difficile l'investigation de problèmes réseau si vous ne pouvez pas vous connecter à votre instance.
ja: 一般的に、イメージ内のファイアウォールを無効化し、インスタンスへのアクセスを制限するために OpenStack のセキュリティグループを使用することを推奨します。その理由は、インスタンスにインストールされたファイアウォールは、インスタンスに接続できない場合に、ネットワークの問題のトラブルシューティングが難しくなるからです。

source: Access instance by using ssh public key (cloud-init)
fr: Accéder à l'instance en utilisant une clé publique ssh (cloud-init)
ja: SSH 公開鍵を使用したインスタンスへのアクセス (cloud-init)

source: The typical way that users access virtual machines running on OpenStack is to ssh using public key authentication. For this to work, your virtual machine image must be configured to download the ssh public key from the OpenStack metadata service or config drive, at boot time.
fr: La méthode typique utilisée par les utilisateurs pour accéder les machines virtuelles fonctionnant sous OpenStack est d'utiliser ssh avec l'authentification par clé publique. Pour que ceci fonctionne, votre image de machine virtuelle doit être configurée pour télécharger la clé publique ssh à partir du service de métadonnées d'OpenStack ou du lecteur de configuration, lors du démarrage.
ja: ユーザーが OpenStack で動作する仮想マシンにアクセスする一般的な方法は、公開鍵認証を使用した SSH です。このために、仮想マシンイメージは、OpenStack メタデータサービスやコンフィグドライブから SSH 公開鍵を起動時にダウンロードするよう設定する必要があります。

source: Use <package>cloud-init</package> to fetch the public key
fr: Utilisez <package>cloud-init</package> pour prendre la clé publique
ja: 公開鍵の取得のための <package>cloud-init</package> の使用

source: The <package>cloud-init</package> package automatically fetches the public key from the metadata server and places the key in an account. The account varies by distribution. On Ubuntu-based virtual machines, the account is called <literal>ubuntu</literal>. On Fedora-based virtual machines, the account is called <literal>ec2-user</literal>.
fr: Le package <package>cloud-init</package> prend automatiquement la clé publique depuis le serveur de métadonnées et place la clé dans un compte. Le compte varie par distribution. Sur des machines virtuelles basées sur Ubuntu, le compte est dénommé <literal>ubuntu</literal>. Sur des machines virtuelles basées sur fedora, le compte est dénommé <literal>ec2-user</literal>.
ja: <package>cloud-init</package> は、自動的にメタデータサーバーから公開鍵を取得し、その鍵をアカウントに保存します。アカウントはディストリビューションにより異なります。Ubuntu 系仮想マシンの場合、アカウントは <literal>ubuntu</literal> という名前です。Fedora 系仮想マシンの場合、アカウントは <literal>ec2-user</literal> という名前です。

source: You can change the name of the account used by <package>cloud-init</package> by editing the <filename>/etc/cloud/cloud.cfg</filename> file and adding a line with a different user. For example, to configure <package>cloud-init</package> to put the key in an account named <literal>admin</literal>, edit the configuration file so it has the line:
fr: Vous pouvez modifier le nom du compte utilisé par <package>cloud-init</package> en éditant le fichier <filename>/etc/cloud/cloud.cfg</filename> pour y ajouter une ligne avec un utilisateur différent. Par exemple, pour configurer <package>cloud-init</package> pour mettre la clé dans un compte dénommé <literal>admin</literal>, éditez le fichier de configuration afin qu'il comprenne la ligne:
ja: <filename>/etc/cloud/cloud.cfg</filename> ファイルを編集し、別のユーザーの行を追加することにより、<package>cloud-init</package> により使用されるアカウント名を変更できます。例えば、<package>cloud-init</package> を編集して、<literal>admin</literal> という名前のアカウントに鍵を置くために、以下の行を含むように設定ファイルを編集します。

source: Write a custom script to fetch the public key
fr: Ecrire un script personnalisé pour prendre la clé publique
ja: 公開鍵の取得のためのカスタムスクリプトの書き込み

source: If you are unable or unwilling to install <package>cloud-init</package> inside the guest, you can write a custom script to fetch the public key and add it to a user account.
fr: Si vous n'êtes pas en mesure ou si vous ne souhaitez pas installer <package>cloud-init</package> à l'intérieur de l'invité, vous pouvez écrire un script personnalisé pour prendre la clé publique et l'ajouter à un compte utilisateur.
ja: ゲスト内に <package>cloud-init</package> をインストールできない場合、したくない場合は、公開鍵を取得し、ユーザーアカウントに追加するために、カスタムスクリプトを作成できます。

source: Some VNC clients replace : (colon) with ; (semicolon) and _ (underscore) with - (hyphen). If editing a file over a VNC session, make sure it's http: not http; and authorized_keys not authorized-keys.
fr: Quelques clients VNC remplacent : (deux points) par ; (point-virgule) et _ (underscore) par - (tiret). Si vous éditez un fichier par l'intermédiaire d'une session VNC, soyez sûr que c'est http: et pas http; puis authorized_keys et pas authorized-keys.
ja: いくつかの VNC クライアントは、 : (コロン) を ; (セミコロン) に、 _ (アンダースコア) を - (ハイフン) に置き換えます。VNC セッション経由でファイルを編集する場合、http: が http; ではないこと、authorized_keys が authorized-keys ではないことを確認してください。

source: Process user data and other metadata (cloud-init)
fr: Traitement des données utilisateur et autres métadonnées (cloud-init)
ja: ユーザーデータと他のメタデータの処理 (cloud-init)

source: In addition to the ssh public key, an image might need additional information from OpenStack, such as <link href="http://docs.openstack.org/user-guide/content/inserting_userdata.html">Provide user data to instances</link>, that the user submitted when requesting the image. For example, you might want to set the host name of the instance when it is booted. Or, you might wish to configure your image so that it executes user data content as a script on boot.
ja: イメージは、SSH 公開鍵に加えて、<link href="http://docs.openstack.org/user-guide/content/inserting_userdata.html">インスタンスに提供されるユーザーデータ</link>など、OpenStack からの追加情報を必要とするかもしれません。これは、イメージの起動時に、ユーザーが指定するものです。例えば、インスタンスの起動時に、ホスト名を設定したいかもしれません。または、スクリプトのようなユーザーデータの内容を起動時に実行できるよう、イメージを設定したいかもしれません。

source: You can access this information through the metadata service or referring to <link href="http://docs.openstack.org/user-guide/content/config-drive.html">Store metadata on the configuration drive</link>. As the OpenStack metadata service is compatible with version 2009-04-04 of the Amazon EC2 metadata service, consult the Amazon EC2 documentation on <link href="http://docs.amazonwebservices.com/AWSEC2/2009-04-04/UserGuide/AESDG-chapter-instancedata.html">Using Instance Metadata</link> for details on how to retrieve user data.
ja: メタデータサービス、または、<link href="http://docs.openstack.org/user-guide/content/config-drive.html">コンフィグドライブへのメタデータの保存</link>により、この情報にアクセスできます。OpenStack メタデータサービスは、Amazon EC2 メタデータサービスの 2009-04-04 版と互換性があるので、ユーザーデータの取得に関する詳細は、<link href="http://docs.amazonwebservices.com/AWSEC2/2009-04-04/UserGuide/AESDG-chapter-instancedata.html">Using Instance Metadata</link> にある Amazon EC2 ドキュメントを参照してください。

source: The easiest way to support this type of functionality is to install the <package>cloud-init</package> package into your image, which is configured by default to treat user data as an executable script, and sets the host name.
fr: La manière la plus simple de supporter ce type de fonctionnalité est d'installer le package <package>cloud-init</package> à l'intérieur de votre image, qui est configuré par défaut pour traiter les données utilisateur en tant que script exécutable, et configurer le nom d'hôte.
ja: この類の機能をサポートする最も簡単な方法は、イメージ内に <package>cloud-init</package> パッケージをインストールすることです。これは、デフォルトでユーザーデータを実行可能スクリプトとして取り扱い、ホスト名を設定します。

source: Ensure image writes boot log to console
fr: S'assurer que l'image écrive le journal de démarrage sur la console
ja: イメージがブートログをコンソールに書き込むことの確認

source: You must configure the image so that the kernel writes the boot log to the <literal>ttyS0</literal> device. In particular, the <literal>console=ttyS0</literal> argument must be passed to the kernel on boot.
fr: Vous devez configurer l'image de telle façon que le kernel écrive le journal de démarrage sur le périphérique <literal>ttyS0</literal>. En particulier, l'argument <literal>console=ttyS0</literal> doit être passé au kernel lors du démarrage.
ja: カーネルがブートログを <literal>ttyS0</literal> デバイスに書き込めるよう、イメージを設定する必要があります。とくに、ブート時に <literal>console=ttyS0</literal> 引数をカーネルに渡す必要があります。

source: If your image uses grub2 as the boot loader, there should be a line in the grub configuration file. For example, <filename>/boot/grub/grub.cfg</filename>, which looks something like this:
fr: Si votre image utilise grub2 en tant que chargeur de démarrage, il devrait y avoir une ligne dans le fichier de configuration de grub. Par exemple, <filename>/boot/grub/grub.cfg</filename>, qui devrait ressembler à quelque chose comme ça:
ja: お使いのイメージがブートローダーとして grub2 を使用している場合、grub 設定ファイルに設定行があります。例えば、<filename>/boot/grub/grub.cfg</filename> が以下のようになっているでしょう。

source: If <literal>console=ttyS0</literal> does not appear, you must modify your grub configuration. In general, you should not update the <filename>grub.cfg</filename> directly, since it is automatically generated. Instead, you should edit <filename>/etc/default/grub</filename> and modify the value of the <literal>GRUB_CMDLINE_LINUX_DEFAULT</literal> variable: <placeholder-1/>
fr: Si <literal>console=ttyS0</literal> n'apparaît pas, vous devez modifier votre configuration grub. En général, vous ne devriez pas mettre à jour le fichier <filename>grub.cfg</filename> directement, puisqu'il est généré de façon automatique. A la place, vous devriez éditer <filename>/etc/default/grub</filename> et modifier la valeur de la variable <literal>GRUB_CMDLINE_LINUX_DEFAULT</literal>:<placeholder-1/>
ja: <literal>console=ttyS0</literal> がない場合、GRUB 設定を変更する必要があります。一般的に、<filename>grub.cfg</filename> は自動的に生成されるため、直接編集すべきではありません。代わりに、<filename>/etc/default/grub</filename> を編集し、<literal>GRUB_CMDLINE_LINUX_DEFAULT</literal> 変数の値を変更します。<placeholder-1/>

source: Next, update the grub configuration. On Debian-based operating-systems such as Ubuntu, run this command:
fr: Ensuite, mettez à jour la configuration grub. Sur les systèmes d'exploitation basés sur Debian comme ubuntu, lancez cette commande:
ja: 次に grub 設定を更新します。Ubuntu などの Debian 系のオペレーティングシステムの場合、このコマンドを実行します。

source: On Fedora-based systems, such as RHEL and CentOS, and on openSUSE, run this command:
fr: Sur les systèmes basés sur Fedora, comme RHEL et CentOS, et sur openSUSE, lancez cette commande:
ja: RHEL、CentOS などの Fedora 系の場合、openSUSE の場合、このコマンドを実行します。

source: Paravirtualized Xen support in the kernel (Xen hypervisor only)
fr: Support Xen Para-virtualisé dans le kernel (Hyperviseur Xen seulement)
ja: カーネルの準仮想化 Xen サポート (Xen ハイパーバイザーのみ)

source: Prior to Linux kernel version 3.0, the mainline branch of the Linux kernel did not have support paravirtualized Xen virtual machine instances (what Xen calls DomU guests). If you are running the Xen hypervisor with paravirtualization, and you want to create an image for an older Linux distribution that has a pre 3.0 kernel, you must ensure that the image boots a kernel that has been compiled with Xen support.
fr: Avant la version 3.0 du noyau Linux, la branche principale du kernel Linux ne disposait pas de support para-virtualisé Xen pour les instances de machines virtuelles (ce que Xen appelle des invités DomU). Si vous utilisez l'hyperviseur Xen avec la para-virtualisation, et que vous souhaitez créer une image pour une distribution de Linux plus ancienne ayant un kernel en-dessous de 3.0, vous devez vous assurer que l'image démarre un kernel qui a été compilé avec le support Xen.
ja: Linux カーネルバージョン 3.0 以前は、メインラインのブランチが準仮想化 Xen 仮想マシンインスタンス (Xen が DomU ゲストを呼び出します) をサポートしません。準仮想化で Xen を動かしていて、カーネル 3.0 以前の古い Linux イメージを作成したい場合、カーネルが Xen サポートありでコンパイルされていることを確認する必要があります。

source: Manage the image cache
fr: Gérer le cache d'image
ja: イメージキャッシュの管理

source: Use options in <filename>nova.conf</filename> to control whether, and for how long, unused base images are stored in <filename>/var/lib/nova/instances/_base/</filename>. If you have configured live migration of instances, all your compute nodes share one common <filename>/var/lib/nova/instances/</filename> directory.
fr: Utilisez les options dans <filename>nova.conf</filename> pour contrôler si, et pour combien de temps, les images de base inutilisées sont stockées dans <filename>/var/lib/nova/instances/_base/</filename>. Si vous avez configuré la migration à chaud des instances, tous vos noeuds de calcul partagent un dossier <filename>/var/lib/nova/instances/</filename> commun.
ja: <filename>nova.conf</filename> にあるオプションを使用して、未使用のイメージを <filename>/var/lib/nova/instances/_base/</filename> に保存するかどうか、どの期間保存するかを制御します。インスタンスのライブマイグレーションを設定した場合、すべてのコンピュートノードは 1 つの <filename>/var/lib/nova/instances/</filename> ディレクトリを共有します。

source: For information about libvirt images in OpenStack, see <link href="http://www.pixelbeat.org/docs/openstack_libvirt_images/">The life of an OpenStack libvirt image from Pádraig Brady</link>.
fr: Pour de plus amples informations à propos des images libvirt dans OpenStack, voyez <link href="http://www.pixelbeat.org/docs/openstack_libvirt_images/">La vie d'une image libvirt OpenStack par Pádraig Brady</link>.
ja: OpenStack における libvirt イメージの詳細は、<link href="http://www.pixelbeat.org/docs/openstack_libvirt_images/">Pádraig Brady 氏の The life of an OpenStack libvirt image</link> を参照してください。

source: Image cache management configuration options
fr: Options de configuration de gestion du cache d'Image
ja: イメージキャッシュ管理の設定オプション

source: Configuration option=Default value
fr: Option de configuration=Valeur par défaut
ja: 設定オプション=規定値

source: (Type) Description
ja: (型) 説明

source: (StrOpt) VM image preallocation mode:
fr: (StrOpt) mode de pré-allocation d'image VM:
ja: (文字列型) 仮想マシンイメージの事前割り当てのモード:

source: <literal>none</literal>. No storage provisioning occurs up front.
fr: <literal>none</literal>. Aucune allocation de capacité de stockage initiale.
ja: <literal>none</literal>。ストレージの事前プロビジョニングがありません。
