Repository: 25hours/openstack-manuals
Catalog: doc/image-guide/locale/*.po
Languages: fr, ja

source: Accept the default network mirror.
fr: Acceptez le miroir réseau par défaut.
ja: デフォルトのネットワークミラーを受け入れます。

source: Set up disk partitioning.
fr: Partitionnement du disque.
ja: ディスクパーティションをセットアップします。

source: Disk partitioning is a critical element of the image creation process and the auto-generated default partitioning scheme does not work with <application>bsd-cloudinit</application> at this time.
fr: Le partitionnement du disque est un élément crucial du processus de création d'image et le schéma de partitionnement auto-généré par défaut ne fonctionne pas avec <application>bsd-cloudinit</application> pour le moment.
ja: ディスクパーティションは、イメージ作成プロセスの重要な要素であり、自動生成されるデフォルトのパーティション構成は、今のところ <application>bsd-cloudinit</application> で動作しません。

source: Because the default does not work, you must select manual partitioning. The partition editor should list only one block device. If you use virtio for the disk device driver, it is named <literal>vtbd0</literal>. Select this device and run the <placeholder-1/> command three times:
fr: Puisque le réglage par défaut ne fonctionne pas, vous devez sélectionner un partitionnement manuel. L'éditeur de partition devrait lister uniquement un périphérique bloc. Si vous utilisez virtio pour le driver du périphérique disque, il est appelé <literal>vtbd0</literal>. Sélectionnez ce périphérique et lancez la commande <placeholder-1/> trois fois:
ja: デフォルトが正しく動作しないため、手動パーティションを選択する必要があります。パーティションエディターは、ブロックデバイスを 1 つだけ表示します。ディスクのデバイスドライバーに virtio を使用する場合、<literal>vtbd0</literal> という名前になります。このデバイスを選択し、<placeholder-1/> コマンドを 3 回実行します。

source: Select <guibutton>Create</guibutton> to create a partition table. This action is the default when no partition table exists. Then, select <guilabel>GPT GUID Partition Table</guilabel> from the list. This choice is the default.
fr: Sélectionnez <guibutton>Create</guibutton> pour créer une table de partitions. Cette action est l'action par défaut quand aucune table de partition n'existe. Puis, sélectionnez <guilabel>GPT GUID Partition Table</guilabel> dans la liste. C'est le choix par défaut.
ja: パーティションテーブルを作成するために、<guibutton>Create</guibutton> を選択します。この操作は、パーティションテーブルが存在しない場合のデフォルトです。次に、一覧から <guilabel>GPT GUID Partition Table</guilabel> を選択します。この選択がデフォルトです。

source: First partition: A 64kB freebsd-boot partition with no mount point.
fr: Première partition: une partition de boot freebsd de 64 ko sans point de montage.
ja: 1 番目のパーティション: マウントポイントを持たない 64kB freebsd-boot パーティション。

source: Second partition: A <literal>freebsd-ufs</literal> partition with a mount point of <filename>/</filename> with all remaining free space.
fr: Seconde partition: une partition <literal>freebsd-ufs</literal> avec le point de montage <filename>/</filename> configurée avec tout l'espace libre restant.
ja: 2 番目のパーティション: すべての残り領域を使用した <filename>/</filename> マウントポイントを持つ <literal>freebsd-ufs</literal> パーティション。

source: Create two partitions:<placeholder-1/>
fr: Créez deux partition:<placeholder-1/>
ja: 2 つのパーティションを作成します。<placeholder-1/>

source: The following figure shows a completed partition table with a 1GB virtual disk:
fr: La figure suivante montre une table de partitions complétée avec un disque virtuel de 1 Go:
ja: 以下の図は、1GB 仮想ディスクを持つ、完成したパーティションテーブルを示します。

source: Select <guibutton>Finish</guibutton> and then <guibutton>Commit</guibutton> to commit your changes.
fr: Sélectionnez <guibutton>Finish</guibutton> puis <guibutton>Commit</guibutton> pour confirmer vos changements.
ja: 変更を反映するために、<guibutton>Finish</guibutton> を選択し、<guibutton>Commit</guibutton> を選択します。

source: If you modify this example, the root partition, which is mounted on <filename>/</filename>, must be the last partition on the drive so that it can expand at run time to the disk size that your instance type provides. Also note that <application>bsd-cloudinit</application> currently has a hard-coded assumption that this is the second partition.
fr: Si vous modifiez cet exemple, la partition racine, qui est montée sur <filename>/</filename>, doit être la dernière partition sur le disque afin qu'elle puisse être étendue lors du fonctionnement à la taille du disque que votre type d'instance fournit. Veuillez aussi noter que <application>bsd-cloudinit</application> fait la supposition que c'est la seconde partition.
ja: この例を変更する場合、<filename>/</filename> にマウントされるルートパーティションは、インスタンスタイプが提供するディスク容量へと実行時に拡張できるよう、ドライブの最後のパーティションにする必要があります。<application>bsd-cloudinit</application> は、これが 2 番目のパーティションにあると仮定して、現在ハードコードされています。

source: Select a root password.
fr: Sélectionnez un mot de passe root.
ja: root パスワードを選択します。

source: Select the CMOS time zone.
fr: Sélectionnez la time zone CMOS.
ja: CMOS のタイムゾーンを選択します。

source: The virtualized CMOS almost always stores its time in UTC, so unless you know otherwise, select UTC.
fr: Le CMOS virtualisé stocke pratiquement toujours son heure au format UTC, donc à moins que vous ne connaissiez votre timezone, sélectionnez UTC.
ja: 仮想化された CMOS は、その時刻を必ず UTC で保存します。そのため、どちらかわからなければ、UTC を選択してください。

source: Select the time zone appropriate to your environment.
fr: Sélectionnez la time zone appropriée à votre environnement.
ja: 環境に合わせたタイムゾーンを選択します。

source: From the list of services to start on boot, you must select <systemitem class="service">ssh</systemitem>. Optionally, select other services.
fr: A partir de la liste de services à démarrer au boot, vous devez sélectionner <systemitem class="service">ssh</systemitem>. Optionnellement, sélectionnez d'autres services.
ja: ブート時に起動するサービス一覧から、<systemitem class="service">ssh</systemitem> を選択する必要があります。オプションとして、他のサービスを選択できます。

source: Optionally, add users.
fr: Optionnellement, ajoutez des utilisateurs.
ja: オプションとして、ユーザーを追加します。

source: You do not need to add users at this time. The <application>bsd-cloudinit</application> program adds a <literal>freebsd</literal> user account if one does not exist. The <systemitem class="service">ssh</systemitem> keys for this user are associated with OpenStack. To customize this user account, you can create it now. For example, you might want to customize the shell for the user.
fr: Il n'est pas nécessaire d'ajouter des utilisateurs à ce moment. Le programme <application>bsd-cloudinit</application> ajoute un compte d'utilisateur <literal>freebsd</literal> si aucun n'existe. Les clés <systemitem class="service">ssh</systemitem> de cet utilisateur sont associées avec OpenStack. Pour personnaliser ce compte utilisateur, vous pouvez le créer maintenant. Par exemple, vous pourriez personnaliser le shell de cet utilisateur.
ja: このとき、ユーザーを追加する必要がありません。<application>bsd-cloudinit</application> プログラムは、<literal>freebsd</literal> ユーザーアカウントが存在しない場合、それを追加します。このユーザーアカウント用の <systemitem class="service">ssh</systemitem> 鍵が OpenStack を用いて関連付けられます。このユーザーアカウントをカスタマイズする場合、いま作成します。例えば、ユーザーのシェルをカスタマイズしたい場合です。

source: Final config
fr: Configuration finale
ja: 最終設定

source: This menu enables you to update previous settings. Check that the settings are correct, and click <guibutton>exit</guibutton>.
fr: Ce menu vous permet de modifier des réglages précédents. Vérifiez que les réglages sont corrects, et cliquez sur <guibutton>exit</guibutton>.
ja: このメニューにより、これまでの設定を更新できます。設定が正しいことを確認して、<guibutton>exit</guibutton> をクリックします。

source: After you exit, you can open a shell to complete manual configuration steps. Select <guibutton>Yes</guibutton> to make a few OpenStack-specific changes:
fr: Après que vous ayez quitté, vous pouvez ouvrir un shell pour compléter les étapes de configuration manuelles. Sélectionnez <guibutton>Yes</guibutton> pour faire des changements spécifiques OpenStack:
ja: 終了後、手動設定ステップを実行するために、シェルを開けます。<guibutton>Yes</guibutton> を選択して、いくつかの OpenStack 固有の変更を実行します。

source: Set up the console:
fr: Configurez la console:
ja: コンソールをセットアップします。

source: This sets console output to go to the serial console, which is displayed by <placeholder-1/>, and the video console for sites with VNC or Spice configured.
fr: Cela configure la sortie de la console pour aller sur la console série, qui est affichée par <placeholder-1/>, et la console vidéo pour les sites configurés avec VNC ou Spice.
ja: これは、コンソールの出力先をシリアルコンソールに設定します。<placeholder-1/> により、ここに表示されます。これは、設定した VNC や SPICE を用いたサイトのビデオコンソールです。

source: Minimize boot delay:
fr: Minimiser le délai de boot:
ja: ブート遅延を最小化します。

source: Download the latest <application>bsd-cloudinit-installer</application>. The download commands differ between FreeBSD 10.0 and 9.2 because of differences in how the <placeholder-1/> command handles HTTPS URLs.
fr: Téléchargez le dernier <application>bsd-cloudinit-installer</application>. Les commandes de téléchargement diffèrent entre FreeBSD 10.0 et 9.2 en raison de différences dans la façon dont la commande <placeholder-1/> gère les URLs HTTPS.
ja: 最新の <application>bsd-cloudinit-installer</application> をダウンロードします。ダウンロードのコマンドは、<placeholder-1/> コマンドが HTTPS URL を処理する方法が異なるため、FreeBSD 10.0 と 9.2 で異なります。

source: In FreeBSD 10.0 the <placeholder-1/> command verifies SSL peers by default, so you need to install the <package>ca_root_nss</package> package that contains certificate authority root certificates and tell <placeholder-2/> where to find them. For FreeBSD 10.0 run these commands:
fr: Dans FreeBSD 10.0 la commande <placeholder-1/> vérifie les points SSL par défaut, donc il est nécessaire d'installer le package <package>ca_root_nss</package> qui contient les certificats racines de l'autorité de certification et il est nécessaire d'indiquer à <placeholder-2/> où les trouver. Pour FreeBSD 10.0 lancez ces commandes:
ja: FreeBSD 10.0 では、<placeholder-1/> コマンドがデフォルトで SSL 接続相手を検証します。そのため、CA ルート証明書を含む <package>ca_root_nss</package> パッケージをインストールし、その場所を <placeholder-2/> に伝える必要があります。FreeBSD 10.0 の場合、これらのコマンドを実行します。

source: FreeBSD 9.2 <placeholder-1/> does not support peer-verification for https. For FreeBSD 9.2, run this command:
fr: FreeBSD 9.2 <placeholder-1/> ne supporte pas la vérification des points pour https. Pour FreeBSD 9.2, lancez cette commande:
ja: FreeBSD 9.2 の <placeholder-1/> は、HTTPS の相互検証をサポートしません。FreeBSD 9.2 の場合、このコマンドを実行します。

source: Run the installer:
fr: Lancez l'installeur:
ja: インストーラーを実行します。

source: The installer installs necessary prerequisites and downloads and installs the latest <package>bsd-cloudinit</package>.
fr: Cet installateur installe les prérequis nécessaires et télécharge puis installe le dernier <package>bsd-cloudinit</package>.
ja: インストーラーは、必要な依存パッケージをインストールし、最新の <package>bsd-cloudinit</package> をダウンロードしてインストールします。

source: Install <package>sudo</package> and configure the <literal>freebsd</literal> user to have passwordless access:
fr: installez <package>sudo</package> et configurez l'utilisateur <literal>freebsd</literal> pour obtenir un accès sans mot de passe:
ja: <package>sudo</package> をインストールし、<literal>freebsd</literal> ユーザーがパスワードなしでアクセスできるよう設定します。

source: Power off the system:
fr: Eteignez le système:
ja: システムを電源オフします。

source: Converting between image formats
fr: Conversion entre formats d'image
ja: イメージ形式の変換

source: Converting images from one format to another is generally straightforward.
fr: Convertir des images d'un format à un autre est généralement sans difficulté.
ja: イメージをある形式から別の形式に変換することは、一般的に簡単です。

source: The <placeholder-1/> command can do conversion between multiple formats, including raw, qcow2, VDI (VirtualBox), VMDK (VMware) and VHD (Hyper-V).
fr: La commande <placeholder-1/> peut effectuer des conversions entre des formats multiples, incluant raw, qcow2, VDI (VirtualBox), VMDK (VMware) et VHD (Hyper-V).
ja: <placeholder-1/> コマンドは、raw、qcow2、VDI (VirtualBox)、VMDK (VMware)、VHD (Hyper-V) などの複数の形式を変換できます。

source: qemu-img format strings
fr: Format des chaines qemu-img
ja: qemu-img の形式の文字列

source: Image format
fr: Format d'Image
ja: イメージ形式

source: Argument to qemu-img
fr: Argument de qemu-img
ja: qemu-img の引数

source: This example will convert a raw image file named centos63.dsk to a qcow2 image file.
fr: Cet exemple va convertir un fichier d'image raw appelé centos63.dsk en un fichier d'image qcow2.
ja: この例は、centos63.dsk という名前の raw イメージファイルを qcow2 イメージファイルに変換します。

source: To convert from vmdk to raw, you would do: <placeholder-1/>
fr: Pour convertir de vmdk à raw, vous feriez: <placeholder-1/>
ja: 以下のコマンドを実行して、vmdk から raw に変換します。

source: The <literal>-f <replaceable>format</replaceable></literal> flag is optional. If omitted, qemu-img will try to infer the image format.
fr: Le drapeau <literal>-f <replaceable>format</replaceable></literal> est optionnel. Si il est omis, qemu-img tentera de déduire le format d'image.
ja: <literal>-f <replaceable>format</replaceable></literal> フラグはオプションです。省略すると、qemu-img がイメージ形式を推測しようとします。

source: VBoxManage: VDI (VirtualBox) to raw
fr: VBoxManage: VDI (VirtualBox) à raw
ja: VBoxManage: VDI (VirtualBox) から raw へ

source: If you've created a VDI image using VirtualBox, you can convert it to raw format using the <placeholder-1/> command-line tool that ships with VirtualBox. On Mac OS X, VirtualBox stores images by default in the <filename>~/VirtualBox VMs/</filename> directory. The following example creates a raw image in the current directory from a VirtualBox VDI image.<placeholder-2/>
fr: Si vous avez créé une image VDI en utilisant VirtualBox, vous pouvez la convertir au format raw en utilisant l'outil en ligne de commande <placeholder-1/> livré avec VirtualBox. Sur Mac OS X, VirtualBox stocke les images dans le dossier <filename>~/VirtualBox VMs/</filename> par défaut. l'exemple suivant crée une image raw dans le dossier courant à partir d'une image VirtualBox VDI.<placeholder-2/>
ja: VirtualBox を使用して VDI イメージを作成した場合、VirtualBox に同梱されている <placeholder-1/> コマンドラインツールを使用して、raw 形式に変換できます。Mac OS X の場合、VirtualBox はデフォルトで <filename>~/VirtualBox VMs/</filename> ディレクトリに保存します。以下の例は、VirtualBox VDI イメージから raw イメージをカレントディレクトリに作成します。<placeholder-2/>

source: Example: Fedora image
ja: 例: Fedora イメージ

source: Download a Fedora image from <link href="http://fedoraproject.org/en/get-fedora#clouds">Get Fedora</link>.
ja: <link href="http://fedoraproject.org/ja/get-fedora#clouds">Fedora を入手</link>から Fedora イメージをダウンロードします。

source: This procedure lets you create a Fedora 20 image.
ja: この手順により、Fedora 20 イメージを作成できます。

source: Start the installation using <placeholder-1/> as shown below:
ja: 以下に示すとおり、<placeholder-1/> を使用してインストールを開始します。

source: This will launch a VM and start the installation process.
ja: これにより、仮想マシンが起動され、インストールプロセスが開始します。

source: Choose the VNC or text mode to set the installation options.
ja: インストールオプションを設定するために、VNC モードまたはテキストモードを選択します。

source: Set the timezone, network configuration, installation source, and the root password. Optionally, you can choose to create a user.
ja: タイムゾーン、ネットワーク設定、インストールソース、root パスワードを設定します。オプションとして、ユーザーを作成できます。

source: Set up the installation destination as shown below:
ja: 以下に示すとおり、インストール先をセットアップします。

source: Run the following commands from the host to eject the disk and reboot using virsh, as root.
ja: ホストから root として以下の virsh コマンドを実行して、ディスクを取り出し、再起動します。

source: You can also use the GUI to detach and reboot it by manually stopping and starting.
ja: GUI を使用して、切断し、手動で停止して起動することにより再起動することもできます。

source: Log in as root user when you boot for the first time after installation.
ja: インストール後の初回起動時、root ユーザーとしてログインします。

source: Install and run the <literal>acpid</literal> service on the guest system to enable the virtual machine to reboot or shutdown an instance.
ja: ゲストシステムに <literal>acpid</literal> サービスをインストールし、実行して、仮想マシンがインスタンスを再起動やシャットダウンできるようにします。

source: Run the following commands inside the Fedora guest to install the ACPI service and configure it to start when the system boots:
ja: Fedora ゲスト内で以下のコマンドを実行して、ACPI サービスをインストールし、システム起動時に

source: Install <literal>cloud-init</literal> package inside the Fedora guest by adding the EPEL repo:
ja: Fedora ゲスト内に EPEL リポジトリーを追加して、<literal>cloud-init</literal> パッケージをインストールします。

source: The <literal>cloud-init</literal> package automatically fetches the public key from the metadata server and places the key in an account.
ja: <literal>cloud-init</literal> は、自動的にメタデータサーバから公開鍵を取得し、アカウントに鍵を保存します。

source: You can change the name of the account used by <literal>cloud-init</literal> by editing the <filename>/etc/cloud/cloud.cfg</filename> file and adding a line with a different user. For example, to configure <literal>cloud-init</literal> to put the key in an account named admin, add this line to the configuration file:
ja: <filename>/etc/cloud/cloud.cfg</filename> ファイルを編集し、別のユーザーの行を追加することにより、<literal>cloud-init</literal> により使用されるアカウント名を変更できます。例えば、<literal>cloud-init</literal> が admin という名前のアカウントに鍵を追加するよう設定するために、以下の行を設定ファイルに追加します。

source: Disable the default <literal>zeroconf</literal> route for the instance to access the metadata service:
ja: インスタンスがメタデータサービスにアクセスするために、デフォルトの <literal>zeroconf</literal> ルートを無効化します。

source: For the <placeholder-1/> command to work properly on Fedora 20, you might need to add the following lines to the <filename>/boot/grub/menu.lst</filename> file:
ja: <placeholder-1/> コマンドが Fedora 20 で正しく動作するために、以下の行を <filename>/boot/grub/menu.lst</filename> ファイルに追加する必要があるかもしれません。

source: Shut down the instance from inside the instance as a root user:
ja: インスタンス内から root ユーザーとしてインスタンスをシャットダウンします。

source: Clean up and remove MAC address details.
ja: MAC アドレスの詳細をクリーンアップし、削除します。

source: The operating system records the MAC address of the virtual Ethernet card in locations such as <filename>/etc/sysconfig/network-scripts/ifcfg-eth0</filename> and <filename>/etc/udev/rules.d/70-persistent-net.rules</filename> during the instance process. However, each time the image boots up, the virtual Ethernet card will have a different MAC address, so this information must be deleted from the configuration file.
fr: Le système d'exploitation enregistre l'adresse MAC de la carte virtuelle Ethernet installée dans <filename>/etc/sysconfig/network-scripts/ifcfg-eth0</filename> et <filename>/etc/udev/rules.d/70-persistent-net.rules</filename> pendant le processus de l'instance. Cependant, à chaque démarrage de l'image, la carte virtuelle Ethernet aura une adresse MAC différente alors cette information devra être supprimée du fichier de configuration.
ja: オペレーティングシステムは、インストール中に仮想ネットワークカードの MAC アドレスを <filename>/etc/sysconfig/network-scripts/ifcfg-eth0</filename> や <filename>/etc/udev/rules.d/70-persistent-net.rules</filename> などの場所に記録します。しかしながら、イメージが起動するたびに、仮想ネットワークカードは別の MAC アドレスになります。そのため、この情報は設定ファイルから削除する必要があります。

source: Use the <literal>virt-sysprep</literal> utility. This performs various cleanup tasks such as removing the MAC address references. It will clean up a virtual machine image in place:
ja: <literal>virt-sysprep</literal> ユーティリティーを使用します。これは、MAC アドレスの参照など、さまざまなクリーンアップ作業を実行します。仮想マシンイメージが正しい場所にクリーンアップされます。

source: Undefine the domain since you no longer need to have this virtual machine image managed by libvirt:
ja: この仮想マシンイメージを libvirt により管理する必要がなくなったので、ドメインの定義を削除します。

source: The underlying image file that you created with qemu-img create is ready to be uploaded to the Image Service.
ja: qemu-img create を用いて作成した、ベースとなるイメージを Image Service にアップロードする準備ができました。

source: Introduction
ja: はじめに

source: An OpenStack Compute cloud is not very useful unless you have virtual machine images (which some people call "virtual appliances"). This guide describes how to obtain, create, and modify virtual machine images that are compatible with OpenStack.
fr: Un cloud de calcul OpenStack n'est pas très utile à moins que vous ayez des images de machine virtuelle (que certains appellent "appliances virtuelles"). Ce guide décrit comment obtenir, créer, et modifier des images de machine virtuelle qui sont compatibles avec OpenStack.
ja: OpenStack Compute のクラウドは、仮想マシンイメージ (「仮想アプライアンス」と言う人もいます) がなければ、あまり役に立ちません。このガイドは、OpenStack と互換性のある仮想マシンイメージを取得、作成、編集する方法を説明します。

source: To keep things brief, we'll sometimes use the term "image" instead of "virtual machine image".
fr: Pour conservé une certaine brièveté des choses, nous utiliserons de temps en temps le terme "image" au lieu d'"image de machine virtuelle".
ja: 簡単にするために、「仮想マシンイメージ」の代わりに「イメージ」という言葉をときどき使用します。

source: What is a virtual machine image?
fr: Qu'est ce qu'une image de machine virtuelle?
ja: 仮想マシンイメージとは何でしょうか?

source: A virtual machine image is a single file which contains a virtual disk that has a bootable operating system installed on it.
fr: Une image de machine virtuelle est un fichier unique qui contient un disque virtuel sur lequel est installé un système d'exploitation bootable.
ja: 仮想マシンイメージは、ブート可能なオペレーティングシステムをインストールした仮想ディスクを含む、単一のファイルです。

source: Virtual machine images come in different formats, some of which are described below. In a later chapter, we'll describe how to convert between formats.
fr: Les images de machine virtuelle viennent avec des formats variés, dont certaines sont décrites ci-dessous. Dans un dernier chapitre, nous décrirons comment effectuer des conversions entre formats.
ja: 仮想マシンイメージは、さまざまな形式があります。いくつかは以下に記載しています。後ほどの章で、形式を変換する方法について説明します。

source: We don't recommend creating raw images by dd'ing block device files, we discuss how to create raw images later.
fr: Nous ne recommandons pas la création d'images raw en utilisant la commande dd sur des fichiers de périphérique bloc, nous discutons de la façon dont on peut créer des images raw plus loin.
ja: ブロックデバイスファイルを dd して、raw イメージを作成することは推奨しません。後ほど raw イメージを作成する方法について議論します。

source: The "raw" image format is the simplest one, and is natively supported by both KVM and Xen hypervisors. You can think of a raw image as being the bit-equivalent of a block device file, created as if somebody had copied, say, <filename>/dev/sda</filename> to a file using the <placeholder-1/> command. <placeholder-2/>
fr: Le format d'image "raw" est le plus simple, et il est nativement supporté à la fois par les hyperviseurs KVM et Xen. Vous pouvez vous représenter une image raw comme étant l'équivalent binaire d'un fichier de périphérique de bloc, créé comme si quelqu'un avait copié, disons, <filename>/dev/sda</filename> vers un fichier en utilisant la commande <placeholder-1/>.<placeholder-2/>
ja: 「raw」イメージ形式は最もシンプルです。KVM と Xen が元々サポートしています。raw イメージは、ブロックデバイスファイル (<filename>/dev/sda</filename> など) を <placeholder-1/> コマンドでコピーして作成したファイルとビット等価であると考えられます。<placeholder-2/>

source: Using sparse representation, so the image size is smaller
fr: En utilisant une représentation clairsemée, afin d'obtenir une taille d'image plus petite
ja: スパースな形式を使用するため、イメージ容量が小さいです。

source: Support for snapshots
fr: Support des copies instantanées
ja: スナップショットのサポート

source: The <link href="http://en.wikibooks.org/wiki/QEMU/Images">qcow2</link> (QEMU copy-on-write version 2) format is commonly used with the KVM hypervisor. It has some additional features over the raw format, such as:<placeholder-1/>
fr: Le format <link href="http://en.wikibooks.org/wiki/QEMU/Images">qcow2</link> (QEMU copie sur écriture version 2) est couramment utilisé avec l'hyperviseur KVM. Il possède des fonctionnalités additionnelles par rapport au format raw, comme:<placeholder-1/>
ja: <link href="http://en.wikibooks.org/wiki/QEMU/Images">qcow2</link> (QEMU copy-on-write version 2) 形式は、KVM ハイパーバイザーで一般的に使用されます。raw 形式に加えて、以下のような追加機能があります。

source: Because qcow2 is sparse, qcow2 images are typically smaller than raw images. Smaller images mean faster uploads, so it's often faster to convert a raw image to qcow2 for uploading instead of uploading the raw file directly.
ja: qcow2 はスパースであるので、qcow2 イメージは一般的に raw イメージより小さいです。イメージが小さいということは、アップロードが高速になるということを意味します。そのため、よく raw ファイルをそのままアップロードする代わりに、アップロード用に raw イメージを qcow2 イメージに変換することがあります。
