Repository: 25hours/openstack-manuals
Catalog: doc/image-guide/locale/*.po
Languages: fr, ja

source: Example: Microsoft Windows image
fr: Exemple: image Microsoft Windows
ja: 例: Microsoft Windows イメージ

source: This example creates a Windows Server 2012 qcow2 image, using <placeholder-1/> and the KVM hypervisor.
fr: Cet exemple crée une image qcow2 Windows Server 2012, en utilisant <placeholder-1/> et l'hyperviseur KVM.
ja: この例は、<placeholder-1/> と KVM ハイパーバイザーを用いて、Windows Server 2012 qcow2 イメージを作成します。

source: Follow this steps to prepare the installation:
fr: Suivre ces étapes pour préparer l'installation :
ja: この手順に沿って、インストールを準備します。

source: Download a Windows Server 2012 installation ISO. Evaluation images are available on <link href="http://www.microsoft.com/en-us/evalcenter/evaluate-windows-server-2012">the Microsoft website</link> (registration required).
fr: Télécharger une ISO d'installation de Windows Server 2012. Les images d'évaluation sont disponibles sur <link href="http://www.microsoft.com/en-us/evalcenter/evaluate-windows-server-2012">the Microsoft website</link> (inscription requise).
ja: Windows Server 2012 インストール ISO をダウンロードします。評価イメージが <link href="http://www.microsoft.com/en-us/evalcenter/evaluate-windows-server-2012">Microsoft の Web サイト</link>にあります (要登録)。

source: Download the signed VirtIO drivers ISO from the <link href="http://alt.fedoraproject.org/pub/alt/virtio-win/latest/images/">Fedora website</link>.
fr: Télécharger l'ISO des pilotes signés de VirtIO depuis <link href="http://alt.fedoraproject.org/pub/alt/virtio-win/latest/images/">Fedora website</link>.
ja: <link href="http://alt.fedoraproject.org/pub/alt/virtio-win/latest/images/">Fedora の Web サイト</link>から署名付き VirtIO ドライバーの ISO をダウンロードします。

source: Create a 10GB qcow2 image:
fr: Créer une image qcow2 de 10 Go :
ja: 10GB qcow2 イメージを作成します。

source: Start the Windows Server 2012 installation with the <placeholder-1/> command:
fr: Démarrer l'installation de Windows Serveur 2012 avec la commande <placeholder-1/> :
ja: <placeholder-1/> コマンドを用いて Windows Server 2012 のインストールを開始します。

source: Use <placeholder-1/> or <placeholder-2/> to connect to the VM and start the Windows installation.
fr: Utiliser <placeholder-1/> ou <placeholder-2/> pour se connecter à la VM et démarrer l'installation Windows.
ja: <placeholder-1/> または <placeholder-2/> を使用して、仮想マシンに接続し、Windows のインストールを

source: Enable the VirtIO drivers.
fr: Activer les pilotes VirtIO.
ja: VirtIO ドライバーを有効化します。

source: The disk is not detected by default by the Windows installer. When requested to choose an installation target, click <guibutton>Load driver</guibutton> and browse the file system to select the <filename>E:\WIN8\AMD64</filename> folder. The Windows installer displays a list of drivers to install. Select the VirtIO SCSI and network drivers, and continue the installation.
fr: Le disque n'est pas détecté par défaut par l'installateur Windows. Quand on demande de choisir une cible d'installation, cliquer <guibutton>Load driver</guibutton> naviguer dans le système de fichier pour sélectionner le dossier <filename>E:\WIN8\AMD64</filename>. L'installateur Windows affiche une liste de pilote à installer. Sélectionner le SCSI VirtIO et les pilotes réseau et continuer l'installation.
ja: ディスクは、デフォルトで Windows インストーラーから認識されません。インストール先を選択する画面で、<guibutton>ドライバーの読み込み</guibutton>をクリックし、ファイルシステムから <filename>E:\WIN8\AMD64</filename> フォルダーを選択します。Windows インストーラーは、インストールするドライバーの一覧を表示します。VirtIO SCSI ドライバーと VirtIO ネットワークドライバーを選択し、インストールを続行します。

source: Once the installation is completed, the VM restarts. Define a password for the administrator when prompted.
fr: Une fois l'installation terminée, les VM redémarre. Définir un mot de passe pour l'administrateur dans l'invite de commande.
ja: インストールが完了すると、仮想マシンが再起動します。プロンプトが表示されたとき、管理者のパスワードを設定します。

source: Log in as administrator and start a command window.
fr: Se connecter en tant qu'administrateur et démarrer une fenêtre de commande.
ja: 管理者としてログインし、コマンドウィンドウを起動します。

source: Complete the VirtIO drivers installation by running the following command:
fr: Compléter l'installation des pilotes VirtIO en exécutant la commande suivante :
ja: 以下のコマンドを実行して、VirtIO ドライバーのインストールを完了します。

source: To allow <glossterm>Cloudbase-Init</glossterm> to run scripts during an instance boot, set the PowerShell execution policy to be unrestricted:
fr: Pour autoriser <glossterm>Cloudbase-Init</glossterm> à lancer des scripts durant le démarrage d'une instance, positionner la priorité d'exécution de PowerShell à illimitée :
ja: インスタンスの起動時に、<glossterm>Cloudbase-Init</glossterm> がスクリプトを実行できるようにするために、PowerShell の実行ポリシーを無制限に設定します。

source: Download and install Cloudbase-Init:
fr: Télécharger et installer Cloudbase-Init :
ja: Cloudbase-Init をダウンロードして、インストールします。

source: In the <guilabel>configuration options</guilabel> window, change the following settings:
fr: Dans la fenêtre <guilabel>options configuration</guilabel>, changer les paramètres suivants :
ja: <guilabel>設定オプション</guilabel>ウィンドウで、以下の設定を変更します。

source: Username: <literal>Administrator</literal>
fr: Utilisateur : <literal>Administrator</literal>
ja: ユーザー名: <literal>Administrator</literal>

source: Network adapter to configure: <literal>Red Hat VirtIO Ethernet Adapter</literal>
fr: Adaptateur réseau pour configurer : <literal>Red Hat VirtIO Ethernet Adapter</literal>
ja: 設定するネットワークアダプター: <literal>Red Hat VirtIO Ethernet Adapter</literal>

source: Serial port for logging: <literal>COM1</literal>
fr: Port série pour la connexion : <literal>COM1</literal>
ja: ロギングするシリアルポート: <literal>COM1</literal>

source: When the installation is done, in the <guilabel>Complete the Cloudbase-Init Setup Wizard</guilabel> window, select the <guilabel>Run Sysprep</guilabel> and <guilabel>Shutdown</guilabel> check boxes and click <guibutton>Finish</guibutton>.
fr: Quand l'installation est effectuée, dans la fenêtre <guilabel>Complete the Cloudbase-Init Setup Wizard</guilabel>, sélectionner les cases <guilabel>Run Sysprep</guilabel> et <guilabel>Shutdown</guilabel> et cliquer sur <guibutton>Finish</guibutton>.
ja: インストール完了後、<guilabel>Complete the Cloudbase-Init Setup Wizard</guilabel> ウィンドウで、<guilabel>Run Sysprep</guilabel> と <guilabel>Shutdown</guilabel> のチェックボックスを選択し、<guibutton>Finish</guibutton> をクリックします。

source: Wait for the machine shutdown.
fr: Attendre l'arrêt de la machine.
ja: マシンがシャットダウンされるのを待ちます。

source: Your image is ready to upload to the Image Service:
fr: Votre image est prête à télécharger le Service Image :
ja: お使いのイメージを Image Service にアップロードする準備ができました。

source: Disk and container formats for images
fr: Formats de disque et de conteneur pour les images
ja: イメージのディスク形式とコンテナー形式

source: When you add an image to the Image Service, you can specify its disk and container formats.
fr: Lorsque vous ajoutez une image au Service d'Image, vous pouvez indiquer ses formats de disque et de conteneur.
ja: イメージを Image Service に追加するとき、そのディスク形式とコンテナー形式を指定できます。

source: Disk formats
fr: Formats de disque
ja: ディスク形式

source: The disk format of a virtual machine image is the format of the underlying disk image. Virtual appliance vendors have different formats for laying out the information contained in a virtual machine disk image.
fr: Le format de disque d'une image de machine virtuelle est le format de l'image disque sous-jacente. Les vendeurs d'appliances virtuelles possèdent différents formats pour organiser les données contenues dans une image disque de machine virtuelle.
ja: 仮想マシンイメージのディスク形式は、元になるディスクイメージの形式です。仮想アプライアンスベンダーは、仮想マシンのディスクイメージに含める情報により、さまざまな形式を使用します。

source: Set the disk format for your image to one of the following values:
fr: Réglez le format disque pour votre image sur une des valeurs suivantes:
ja: お使いのイメージのディスク形式を以下のどれかに設定します。

source: <literal>raw</literal>. An unstructured disk image format; if you have a file without an extension it is possibly a raw format
fr: <literal>raw</literal>. Format d'image disque non structuré; si vous disposez d'un fichier sans extension il s'agit probablement d'un format raw
ja: <literal>raw</literal>。非構造化ディスクイメージ形式。拡張しないファイルの場合、おそらく raw 形式です。

source: <literal>vhd</literal>. The VHD disk format, a common disk format used by virtual machine monitors from VMware, Xen, Microsoft, VirtualBox, and others
fr: <literal>vhd</literal>. Le format de disque VHD, un format de disque courant utilisé par des moniteurs de machine virtuelle VMware, Xen, Microsoft, VirtualBox, et d'autres
ja: <literal>vhd</literal>。VMware, Xen, Microsoft, VirtualBox, およびその他から、仮想マシンモニターにより使用される一般的なディスク形式である VHD ディスク形式です。

source: <literal>vmdk</literal>. Common disk format supported by many common virtual machine monitors
fr: <literal>vmdk</literal>. Format de disque courant supporté par beaucoup de moniteurs de machine virtuelle
ja: <literal>vmdk</literal>。多くの仮想マシンモニターによりサポートされる一般的なディスク形式です。

source: <literal>vdi</literal>. Supported by VirtualBox virtual machine monitor and the QEMU emulator
fr: <literal>vdi</literal>. Supporté par le moniteur de machine virtuelle VirtualBox et par l'émulateur QEMU
ja: <literal>vdi</literal>。VirtualBox 仮想マシンモニターおよび QEMU エミュレーターによりサポートされます。

source: <literal>iso</literal>. An archive format for the data contents of an optical disc, such as CD-ROM.
fr: <literal>iso</literal>. Un format d'archive pour les contenus de données d'un disque optique, comme un CD-ROM.
ja: <literal>iso</literal>。CD-ROM などの光学ディスクのデータコンテンツ用のアーカイブ形式です。

source: <literal>qcow2</literal>. Supported by the QEMU emulator that can expand dynamically and supports Copy on Write
fr: <literal>qcow2</literal>. Supporté par l'émulateur QEMU, qui peut s'étendre dynamiquement et supporte la copie sur écriture
ja: <literal>qcow2</literal>。QEMU エミュレーターによりサポートされ、動的に拡張でき、コピー・オン・ライトをサポートします。

source: <literal>aki</literal>. An Amazon kernel image.
fr: <literal>aki</literal>. Une image de kernel Amazon.
ja: <literal>aki</literal>。Amazon カーネルイメージ。

source: <literal>ari</literal>. An Amazon ramdisk image.
fr: <literal>ari</literal>. Une image disque RAM Amazon.
ja: <literal>ari</literal>。Amazon ラムディスクイメージ。

source: <literal>ami</literal>. An Amazon machine image.
fr: <literal>ami</literal>. Une image de machine Amazon.
ja: <literal>ami</literal>。Amazon マシンイメージ。

source: Container formats
fr: Formats de conteneur
ja: コンテナー形式

source: The container format indicates whether the virtual machine image is in a file format that also contains metadata about the actual virtual machine.
fr: Le format de conteneur indique si oui ou non l'image de machine virtuelle est dans un format de fichier qui contient aussi les métadonnées de la machine virtuelle courante.
ja: コンテナー形式は、仮想マシンイメージが、実際の仮想マシンに関するメタデータも含むファイル形式にあるかどうかを示します。

source: The Image Service and other OpenStack projects do not currently support the container format. It is safe to specify <literal>bare</literal> as the container format if you are unsure.
fr: Le Service d'Image et les autres projets OpenStack ne supportent actuellement pas le format de conteneur. Vous pouvez indiquer <literal>bare</literal> en tant que format de conteneur si vous n'êtes pas sûr du choix.
ja: Image Service および他の OpenStack プロジェクトは、現在コンテナー形式をサポートしません。不確かな場合、コンテナー形式として <literal>bare</literal> を指定すると安全です。

source: You can set the container format for your image to one of the following values:
fr: Vous pouvez régler le format de conteneur pour votre image sur l'une des valeurs suivantes:
ja: イメージのコンテナー形式に以下のどれかを設定できます。

source: <literal>bare</literal>. The image does not have a container or metadata envelope.
fr: <literal>bare</literal>. L'image ne possède pas de conteneur ou d'enveloppe de métadonnées.
ja: <literal>bare</literal>。コンテナーやメタデータを持たないイメージです。

source: <literal>ovf</literal>. The OVF container format.
fr: <literal>ovf</literal>. Le format de conteneur OVF.
ja: <literal>ovf</literal>。OVF コンテナー形式です。

source: Modify images
fr: Modifier les images
ja: イメージの変更

source: Do not attempt to use these tools to modify an image that is attached to a running virtual machine. These tools are designed to only modify images that are not currently running.
fr: Ne tentez pas d'utiliser ces outils pour modifier une image qui est attachée à une machine virtuelle en fonctionnement. Ces outils sont conçus pour modifier les images qui ne sont pas en fonctionnement uniquement.
ja: 実行中の仮想マシンに接続されているイメージを変更するために、これらのツールを使用しないでください。これらのツールは、動作していないイメージのみを変更するために設計されています。

source: Once you have obtained a virtual machine image, you may want to make some changes to it before uploading it to the OpenStack Image Service. Here we describe several tools available that allow you to modify images.<placeholder-1/>
fr: Une fois votre image de machine virtuelle obtenue, vous pourrez éventuellement la modifier avant de la télécharger dans le Service d'Image OpenStack. Ici nous décrivons plusieurs outils disponibles qui vous permettent de modifier ces images. <placeholder-1/>
ja: 仮想マシンイメージを取得すると、OpenStack Image Service にアップロードする前に、いくつか変更したいかもしれません。イメージを変更できる、いくつかの利用可能なツールを説明しています。<placeholder-1/>

source: The <placeholder-1/> program is a tool from the <link href="http://libguestfs.org/">libguestfs</link> project that allows you to modify the files inside of a virtual machine image.
fr: Le programme <placeholder-1/> est un outil du projet <link href="http://libguestfs.org/">libguestfs</link> qui vous permet de modifier les fichiers à l'intérieur d'une image de machine virtuelle.
ja: <placeholder-1/> プログラムは、仮想マシンイメージ内のファイルを編集できる、<link href="http://libguestfs.org/">libguestfs</link> プロジェクトのツールです。

source: <placeholder-1/> does not mount the image directly into the local file system. Instead, it provides you with a shell interface that enables you to view, edit, and delete files. Many of <placeholder-2/> commands, such as <placeholder-3/>, <placeholder-4/>, and <placeholder-5/>, resemble traditional bash commands.
fr: <placeholder-1/> ne monte pas l'image directement dans le système de fichiers local. Il vous donne une interface shell vous permettant de voir, éditer, et supprimer les fichiers. La plupart des commandes <placeholder-2/>, comme <placeholder-3/>, <placeholder-4/>, et <placeholder-5/>, sont similaires aux commandes bash traditionnelles.
ja: <placeholder-1/> は、イメージをローカルファイルシステムに直接マウントしません。代わりに、ファイルを表示、編集、削除するためのシェルインターフェースを提供します。<placeholder-3/>、<placeholder-4/>、<placeholder-5/> など、多くの <placeholder-2/> コマンドは、伝統的な bash コマンドに似ています。

source: Example guestfish session
fr: Exemple de session guestfish
ja: guestfish 実行例

source: Sometimes, you must modify a virtual machine image to remove any traces of the MAC address that was assigned to the virtual network interface card when the image was first created, because the MAC address will be different when it boots the next time. This example shows how to use guestfish to remove references to the old MAC address by deleting the <filename>/etc/udev/rules.d/70-persistent-net.rules</filename> file and removing the <literal>HWADDR</literal> line from the <filename>/etc/sysconfig/network-scripts/ifcfg-eth0</filename> file.
fr: Quelques fois, vous devrez modifier une image de machine virtuelle pour y enlever toute trace de l'adresse MAC qui était attribuée à la carte de l''interface réseau virtuelle lors de la création originale de l'image, car l'adresse MAC sera différente lorsque qu'elle bootera la prochaine fois. Cet exemple montre comment utiliser guestfish pour supprimer les références à la vieille adresse MAC en supprimant le fichier <filename>/etc/udev/rules.d/70-persistent-net.rules</filename> et en enlevant la ligne <literal>HWADDR</literal> du fichier <filename>/etc/sysconfig/network-scripts/ifcfg-eth0</filename>.
ja: ときどき、仮想マシンイメージが最初に作成されたときに、仮想ネットワークインターフェースカードに割り当てられた MAC アドレスの設定を削除するために、イメージを編集する必要があります。その理由は、仮想マシンの次回起動時、MAC アドレスが異なるものになるからです。この例は、<filename>/etc/udev/rules.d/70-persistent-net.rules</filename> ファイルを削除し、<filename>/etc/sysconfig/network-scripts/ifcfg-eth0</filename> ファイルの <literal>HWADDR</literal> 行を削除することにより、古い MAC アドレスへの参照を削除するために、guestfish を使用する方法を示しています。

source: Assume that you have a CentOS qcow2 image called <filename>centos63_desktop.img</filename>. Mount the image in read-write mode as root, as follows:
fr: Nous considérons ici que vous avec une image qcow2 CentOS appelée <filename>centos63_desktop.img</filename>. Montez l'image en mode lecture-écriture en tant que root, comme suit:
ja: <filename>centos63_desktop.img</filename> という名前の CentOS qcow2 イメージがあると仮定します。以下のとおり、root としてイメージを読み書きモードでマウントします。

source: This starts a guestfish session. Note that the guestfish prompt looks like a fish: <literal>&gt; &lt;fs&gt;</literal>.
fr: Cela lance une session guestfish. Notez que le prompt guestfish ressemble à un poisson: <literal>&gt; &lt;fs&gt;</literal>.
ja: これにより guestfish セッションが始まります。guestfish プロンプトは <literal>&gt; &lt;fs&gt;</literal> のようになることに注意してください。

source: We must first use the <placeholder-1/> command at the guestfish prompt before we can do anything else. This will launch a virtual machine, which will be used to perform all of the file manipulations.<placeholder-2/> We can now view the file systems in the image using the <placeholder-3/> command:<placeholder-4/>We need to mount the logical volume that contains the root partition: <placeholder-5/>
fr: Pour commencer nous devons utiliser la commande <placeholder-1/> au prompt guestfish avant de pouvoir faire quoique ce soit d'autre. Une machine virtuelle sera lancée, qui sera utilisée pour réaliser toutes les manipulations de fichier.<placeholder-2/> Nous pouvons maintenant visualiser les systèmes de fichiers de l'image en utilisant la commande <placeholder-3/>:<placeholder-4/>Nous avons besoin de monter le volume logique qui contient la partition root: <placeholder-5/>
ja: 何かしらの処理を実行する前に、まず guestfish プロンプトで <placeholder-1/> コマンドを実行する必要があります。これにより、すべてのファイル操作を実行するために使用する、仮想マシンが起動します。<placeholder-2/>これで、<placeholder-3/> コマンドを使用して、イメージにあるファイルシステムを表示できます。<placeholder-4/>ルートパーティションを含む、論理ボリュームをマウントする必要があります。<placeholder-5/>

source: Next, we want to delete a file. We can use the <placeholder-1/> guestfish command, which works the same way it does in a traditional shell.
fr: Ensuite, nous voulons supprimer un fichier. Nous pouvons utiliser la commande guestfish <placeholder-1/>, qui fonctionne de la même façon que dans un shell traditionnel.
ja: 次に、ファイルを削除します。<placeholder-1/> guestfish コマンドを使用できます。これは、伝統的なシェルと同じ方法で動作します。

source: <placeholder-1/>We want to edit the <filename>ifcfg-eth0</filename> file to remove the <literal>HWADDR</literal> line. The <placeholder-2/> command will copy the file to the host, invoke your editor, and then copy the file back. <placeholder-3/>
fr: <placeholder-1/>Nous désirons éditer le fichier <filename>ifcfg-eth0</filename> pour y enlever la ligne <literal>HWADDR</literal>. La commande <placeholder-2/> va copier le fichier sur l'hôte, invoquer votre éditeur, et recopier le fichier.<placeholder-3/>
ja: <placeholder-1/> <literal>HWADDR</literal> 行を削除するために、 <filename>ifcfg-eth0</filename> ファイルを編集したいです。<placeholder-2/> コマンドは、ファイルをホストにコピーし、エディターを実行し、ファイルを書き戻します。<placeholder-3/>

source: If you want to modify this image to load the 8021q kernel at boot time, you must create an executable script in the <filename>/etc/sysconfig/modules/</filename> directory. You can use the <placeholder-1/> guestfish command to create an empty file, the <placeholder-2/> command to edit it, and the <placeholder-3/> command to make it executable.<placeholder-4/> We add the following line to the file and save it:<placeholder-5/>Then we set to executable: <placeholder-6/>
fr: Si vous voulez modifier cette image pour charger le kernel 8021q au boot, vous devez créer un script exécutable dans le dossier <filename>/etc/sysconfig/modules/</filename>. Vous pouvez utiliser la commande guestfish <placeholder-1/> pour créer un fichier vide, la commande <placeholder-2/> pour l'éditer, et la commande <placeholder-3/> pour le rendre exécutable.<placeholder-4/> Nous ajoutons la ligne suivante au fichier et nous le sauvegardons:<placeholder-5/>Puis on le rend exécutable: <placeholder-6/>
ja: このイメージの起動時に 8021q カーネルを読み込むために、イメージを編集したい場合、<filename>/etc/sysconfig/modules/</filename> ディレクトリに実行可能なスクリプトを作成する必要があります。<placeholder-1/> guestfish コマンドを使用して空のファイルを作成し、<placeholder-2/> コマンドを使用して編集できます。そして、<placeholder-3/> コマンドを使用して実行可能にします。<placeholder-4/>以下の行をファイルに追加し、保存します。<placeholder-5/>続けて、実行可能にします。<placeholder-6/>

source: We're done, so we can exit using the <placeholder-1/> command:<placeholder-2/>
fr: Ceci étant fait, nous pouvons quitter en utilisant la commande <placeholder-1/>: <placeholder-2/>
ja: これで完了したので、<placeholder-1/> コマンドを用いて終了できます。<placeholder-2/>

source: Go further with guestfish
fr: Aller plus loin avec guestfish
ja: guestfish のさらなる利用

source: There is an enormous amount of functionality in guestfish and a full treatment is beyond the scope of this document. Instead, we recommend that you read the <link href="http://libguestfs.org/guestfs-recipes.1.html">guestfs-recipes</link> documentation page for a sense of what is possible with these tools.
fr: Il y a une énorme quantité de fonctionnalités dans guestfish et les traiter toutes irait au-delà du périmètre de ce document. Ainsi nous vous recommandons de lire la page de documentation <link href="http://libguestfs.org/guestfs-recipes.1.html">guestfs-recipes</link> pour avoir une idée de ce qu'il est possible de faire avec ces outils.
ja: guestfish には、非常にさまざまな機能がありますが、このドキュメントの範囲を超えています。これらのツールを用いて実行できることは、 <link href="http://libguestfs.org/guestfs-recipes.1.html">guestfs-recipes</link> を参照することを推奨します。

source: For some types of changes, you may find it easier to mount the image's file system directly in the guest. The <placeholder-1/> program, also from the libguestfs project, allows you to do so.
fr: Pour certain types de changements, vous pourrez trouver plus aisé de monter le système de fichiers de l'image directement dans le client. le programme <placeholder-1/>, provenant aussi du projet libguestfs, vous permet de le faire.
ja: いくつかの種類の変更の場合、イメージのファイルシステムを直接マウントするほうが簡単かもしれません。libguestfs プロジェクトの <placeholder-1/> プログラムにより実行できます。

source: For example, to mount the root partition from our <filename>centos63_desktop.qcow2</filename> image to <filename>/mnt</filename>, we can do:
fr: Par exemple, pour monter la partition root à partir de notre image <filename>centos63_desktop.qcow2</filename> sur <filename>/mnt</filename>, nous pouvons faire:
ja: 例えば、<filename>centos63_desktop.qcow2</filename> イメージのルートパーティションを <filename>/mnt</filename> にマウントするために、以下のとおり実行します。

source: If we didn't know in advance what the mount point is in the guest, we could use the <literal>-i</literal>(inspect) flag to tell guestmount to automatically determine what mount point to use:<placeholder-1/>Once mounted, we could do things like list the installed packages using rpm:<placeholder-2/> Once done, we unmount:<placeholder-3/>
fr: Si nous ne pouvons pas savoir à l'avance quel est le point de montage dans le client, nous pouvons utiliser le drapeau <literal>-i</literal>(inspect) pour indiquer à guestmount de déterminer automatiquement quel point de montage utiliser:<placeholder-1/>Une fois monté, nous pouvons faire des choses comme lister les packages installés en utilisant rpm:<placeholder-2/> Une fois ceci fait, nous démontons:<placeholder-3/>
ja: マウントポイントがゲストのどこであるか不明な場合、guestmount が使用するマウントポイントを自動的に決定するために、<literal>-i</literal> (検査) フラグを使用できます。<placeholder-1/>マウントすると、rpm コマンドを使用してインストール済みパッケージを一覧表示するなどの操作を実行できます。<placeholder-2/>完了したら、アンマウントします。<placeholder-3/>

source: virt-* tools
ja: virt-* ツール

source: <link href="http://libguestfs.org/virt-edit.1.html">virt-edit</link> for editing a file inside of an image.
fr: <link href="http://libguestfs.org/virt-edit.1.html">virt-edit</link> pour éditer un fichier à l'intérieur d'une image.
ja: <link href="http://libguestfs.org/virt-edit.1.html">virt-edit</link> は、イメージ内のファイルを編集できます。
