Repository: 25hours/openstack-manuals
Catalog: doc/image-guide/locale/*.po
Languages: fr, ja

source: An instance must interact with the metadata service to perform several tasks on start up. For example, the instance must get the ssh public key and run the user data script. To ensure that the instance performs these tasks, use one of these methods:
fr: Une instance doit interagir avec le service de métadonnées pour accomplir plusieurs tâches au démarrage. Par exemple, l'instance doit obtenir la clé publique ssh et lancer le script de données utilisateur. Pour s'assurer que l'instance réalise ces tâches, utilisez l'une de ces méthodes:
ja: インスタンスは、起動時にいくつかの処理を実行するために、メタデータサービスと通信する必要があります。例えば、インスタンスが SSH 公開鍵を取得し、ユーザーデータエージェントを実行する必要があります。インスタンスが確実にこれらの処理を実行するために、これらの方法のどれかを使用します。

source: Install a <systemitem class="service">cloud-init</systemitem> RPM, which is a port of the Ubuntu <link href="https://launchpad.net/cloud-init">cloud-init</link> package. This is the recommended approach.
fr: Installez un RPM <systemitem class="service">cloud-init</systemitem>, qui est un portage du package Ubuntu <link href="https://launchpad.net/cloud-init">cloud-init</link>. C'est l'approche recommandée.
ja: <systemitem class="service">cloud-init</systemitem> RPM をインストールします。これは、Ubuntu <link href="https://launchpad.net/cloud-init">cloud-init</link> パッケージを移植したものです。これが推奨アプローチです。

source: Modify <filename>/etc/rc.local</filename> to fetch desired information from the metadata service, as described in the next section.
fr: Modifiez <filename>/etc/rc.local</filename> pour prendre les informations voulues depuis le service de métadonnées, comme décrit dans la section suivante.
ja: メタデータサービスから必要な情報を取得するために、次のセクションに記載されているとおり、<filename>/etc/rc.local</filename> を編集します。

source: Use cloud-init to fetch the public key
fr: Utilisez cloud-init pour prendre la clé publique.
ja: 公開鍵の取得のための coud-init の使用

source: The <systemitem class="service">cloud-init</systemitem> package automatically fetches the public key from the metadata server and places the key in an account. You can install <systemitem class="service">cloud-init</systemitem> inside the CentOS guest by adding the EPEL repo:
fr: Le package <systemitem class="service">cloud-init</systemitem> prend automatiquement la clé publique depuis le serveur de métadonnées et place la clé dans un compte. Vous pouvez installer <systemitem class="service">cloud-init</systemitem> à l'intérieur de l'invité CentOS en ajoutant le dépôt EPEL:
ja: <systemitem class="service">cloud-init</systemitem> パッケージは、メタデータサーバーから公開鍵を自動的に取得し、その鍵をアカウントの中に置きます。EPEL リポジトリを追加することにより、CentOS ゲストの中に <systemitem class="service">cloud-init</systemitem> をインストールできます。

source: The account varies by distribution. On Ubuntu-based virtual machines, the account is called <literal>ubuntu</literal>. On Fedora-based virtual machines, the account is called <literal>ec2-user</literal>.
fr: Le compte varie par distribution. Sur les machines virtuelles basées sur Ubuntu, le compte est dénommé <literal>ubuntu</literal>. Sur les machines virtuelles basées sur Fedora, le compte est dénommé <literal>ec2-user</literal>.
ja: アカウントはディストリビューションにより異なります。Ubuntu 系の仮想マシンの場合、アカウントは <literal>ubuntu</literal> という名前です。Fedora 系の仮想マシンの場合、アカウントは <literal>ec2-user</literal> という名前です。

source: You can change the name of the account used by <systemitem class="service">cloud-init</systemitem> by editing the <filename>/etc/cloud/cloud.cfg</filename> file and adding a line with a different user. For example, to configure <systemitem class="service">cloud-init</systemitem> to put the key in an account named <literal>admin</literal>, add this line to the configuration file:
fr: Vous pouvez modifier le nom du compte utilisé par <systemitem class="service">cloud-init</systemitem> en éditant le fichier <filename>/etc/cloud/cloud.cfg</filename> et en y ajoutant une ligne avec un utilisateur différent. Par exemple, pour configurer <systemitem class="service">cloud-init</systemitem> pour mettre la clé dans un compte dénommé <literal>admin</literal>, ajoutez cette ligne au fichier de configuration:
ja: <systemitem class="service">cloud-init</systemitem> により使用されるアカウント名を変更できます。<filename>/etc/cloud/cloud.cfg</filename> ファイルを編集し、別のユーザーの行を追加します。例えば、<literal>admin</literal> という名前のアカウントに鍵を置くために、<systemitem class="service">cloud-init</systemitem> を設定する場合、設定ファイルに以下の行を追加します。

source: Write a script to fetch the public key (if no cloud-init)
fr: Ecrire un script pour prendre la clé publique (si pas de cloud-init)
ja: 公開鍵取得のスクリプトの書き込み (cloud-init なしの場合)

source: If you are not able to install the <systemitem class="service">cloud-init</systemitem> package in your image, to fetch the ssh public key and add it to the root account, edit the <filename>/etc/rc.local</filename> file and add the following lines before the line <literal>touch /var/lock/subsys/local</literal>:
fr: Si vous n'êtes pas en mesure d'installer le package <systemitem class="service">cloud-init</systemitem> dans votre image, pour prendre la clé publique et l'ajouter au compte root, éditez le fichier <filename>/etc/rc.local</filename> et ajoutez les lignes suivantes avant la ligne <literal>touch /var/lock/subsys/local</literal>:
ja: <systemitem class="service">cloud-init</systemitem> パッケージをインストールできない場合、SSH 公開鍵を取得し、それを root アカウントに追加するために、<filename>/etc/rc.local</filename> ファイルを編集し、<literal>touch /var/lock/subsys/local</literal> 行の前に以下の行を追加します。

source: Some VNC clients replace the colon (<literal>:</literal>) with a semicolon (<literal>;</literal>) and the underscore (<literal>_</literal>) with a hyphen (<literal>-</literal>). Make sure to specify <literal>http:</literal> and not <literal>http;</literal>. Make sure to specify <literal>authorized_keys</literal> and not <literal>authorized-keys</literal>.
fr: Quelques clients VNC remplacent les deux points (<literal>:</literal>) par un point virgule (<literal>;</literal>) et l'underscore (<literal>_</literal>) avec un tiret (<literal>-</literal>). Soyez sûr de spécifier <literal>http:</literal> et pas <literal>http;</literal>. Soyez sûr de spécifier <literal>authorized_keys</literal> et pas <literal>authorized-keys</literal>.
ja: いくつかの VNC クライアントは、コロン (:) を セミコロン (;) に、アンダースコア (_) をハイフン (-) に置き換えます。<literal>http;</literal> ではなく、<literal>http:</literal> であること、<literal>authorized-keys</literal> ではなく <literal>authorized_keys</literal> であることを確認してください。

source: The previous script only gets the ssh public key from the metadata server. It does not get user data, which is optional data that can be passed by the user when requesting a new instance. User data is often used to run a custom script when an instance boots.
fr: Le script précédent obtient la clé publique ssh seulement à partir du serveur de métadonnées. Il n'obtient pas les données utilisateur, qui sont des données optionnelles qui peuvent être transmises par l'utilisateur lorsqu'une nouvelle instance est demandée. Les données utilisateur sont souvent utilisées pour lancer un script personnalisé lorsqu'une instance démarre.
ja: 前のスクリプトは、メタデータサーバーから SSH 公開鍵のみを取得します。新しいインスタンスを要求時に、ユーザーにより渡せるオプションデータである、ユーザーデータを取得しません。ユーザーデータは、インスタンスの起動時に、カスタムスクリプトを実行するためにしばしば使用されます。

source: As the OpenStack metadata service is compatible with version 2009-04-04 of the Amazon EC2 metadata service, consult the Amazon EC2 documentation on <link href="http://docs.amazonwebservices.com/AWSEC2/2009-04-04/UserGuide/AESDG-chapter-instancedata.html">Using Instance Metadata</link> for details on how to get user data.
fr: Puisque qu'un service de métadonnées OpenStack est compatible avec la version 2009-04-04 du service de métadonnées d'Amazon EC2, veuillez consulter la documentation d'Amazon EC2 <link href="http://docs.amazonwebservices.com/AWSEC2/2009-04-04/UserGuide/AESDG-chapter-instancedata.html">Utiliser les Métadonnées d'Instance </link> pour obtenir des informations sur le moyen d'obtenir les données utilisateur.
ja: OpenStack メタデータサービスは、Amazon EC2 メタデータサービスの 2009-04-04 版と互換性があります。ユーザーデータの取得方法に関する詳細は <link href="http://docs.amazonwebservices.com/AWSEC2/2009-04-04/UserGuide/AESDG-chapter-instancedata.html">Using Instance Metadata</link> にある Amazon EC2 のドキュメントを参照してください。

source: Disable the zeroconf route
fr: Désactiver la route zeroconf
ja: zeroconf ルートの無効化

source: For the instance to access the metadata service, you must disable the default zeroconf route:
fr: Pour que l'instance puisse accéder au service de métadonnées, vous devez désactiver la route par défaut zeroconf:
ja: インスタンスがメタデータサービスにアクセスするために、デフォルトの zeroconf ルートを無効化する必要があります。

source: Configure console
fr: Configurer la console
ja: コンソールの設定

source: For the <placeholder-1/> command to work properly on CentOS 6.<replaceable>x</replaceable>, you might need to add the following lines to the <filename>/boot/grub/menu.lst</filename> file:
fr: Pour que la commande <placeholder-1/> fonctionne correctement sur CentOS 6.<replaceable>x</replaceable>, il peut être nécessaire d'ajouter les ligne suivantes au fichier <filename>/boot/grub/menu.lst</filename>:
ja: <placeholder-1/> コマンドが CentOS 6.<replaceable>x</replaceable> で正しく動作させるために、以下の行を <filename>/boot/grub/menu.lst</filename> ファイルに追加する必要があるでしょう。

source: Shut down the instance
fr: Arrêter l'instance
ja: インスタンスのシャットダウン

source: From inside the instance, as root:
fr: Depuis l'intérieur de l'instance, en tant que root:
ja: インスタンス内で root として以下を実行します。

source: Clean up (remove MAC address details)
fr: Nettoyage (enlever les informations d'adresse MAC)
ja: クリーンアップ (MAC アドレスの詳細の削除)

source: There is a utility called <placeholder-1/>, that performs various cleanup tasks such as removing the MAC address references. It will clean up a virtual machine image in place:
fr: Il y a un utilitaire appelé <placeholder-1/>, qui réalise différentes tâches de nettoyage comme enlever les références à l'adresse MAC. Il va nettoyer une image de machine virtuelle sur place:
ja: <placeholder-1/> というユーティリティーがあります。これは、MAC アドレス参照の削除など、さまざまなクリーンアップ作業を実行できます。決まった場所にある仮想マシンイメージをクリーンアップします。

source: Undefine the libvirt domain
fr: Suppression de la définition du domaine libvirt
ja: libvirt ドメインの定義削除

source: Now that you can upload the image to the Image Service, you no longer need to have this virtual machine image managed by libvirt. Use the <placeholder-1/> command to inform libvirt:
fr: Maintenant que vous pouvez uploader l'image dans le Service d'Image, il n'est plus nécessaire que cette machine virtuelle soit gérée par libvirt. Utilisez la commande <placeholder-1/> pour informer libvirt:
ja: これで、イメージを Image Service にアップロードできます。この仮想マシンイメージは libvirt により管理する必要がありません。<placeholder-1/> コマンドを使用して libvirt に通知します。

source: Image is complete
fr: L'image est complète
ja: イメージの完成

source: The underlying image file that you created with <placeholder-1/> is ready to be uploaded. For example, you can upload the <filename>/tmp/centos-6.4.qcow2</filename> image to the Image Service.
fr: Le fichier image que vous avez créé avec <placeholder-1/> est prêt à être uploadé. Par exemple, vous pouvez uploader l'image <filename>/tmp/centos-6.4.qcow2</filename> dans le Service d'Image.
ja: <placeholder-1/> を用いて作成した、ベースとなるイメージファイルは、アップロードする準備ができました。例えば、<filename>/tmp/centos-6.4.qcow2</filename> イメージを Image Service にアップロードできます。

source: OpenStack Virtual Machine Image Guide
fr: Guide de l'Image de Machine Virtuelle OpenStack
ja: OpenStack 仮想マシンイメージガイド

source: VM Image Guide
fr: Guide d'Image de VM
ja: 仮想マシンイメージガイド

source: current
fr: en cours
ja: カレント

source: This guide describes how to obtain, create, and modify virtual machine images that are compatible with OpenStack.
fr: Ce guide décrit comment obtenir, créer, et modifier des images de machine virtuelle qui sont compatibles avec OpenStack.
ja: このガイドは、OpenStack で利用可能な仮想マシンイメージを取得、作成、更新する方法について説明します。

source: Minor revisions for Juno.
ja: Juno 向けの微修正。

source: Minor revisions for Icehouse - moved property listing into <citetitle>Command-Line Interface Reference</citetitle> and added a note about Windows time zones.
fr: Révisions mineures de Icehouse - le listing des propriétés a été déplacé à l'intérieur de la <citetitle>Référence de l'Interface de Ligne de Commande</citetitle> et une note a été ajoutée à propos des time zones Windows.
ja: Icehouse 向けの軽微な修正。プロパティ一覧表示を<citetitle>コマンドラインインターフェースリファレンス</citetitle>に移動しました。Windows のタイムゾーンに関する注意を追加しました。

source: Adds information about image formats, properties.
fr: Ajout d'informations à propos des formats d'image, des propriétés.
ja: イメージ形式に関する情報、プロパティを追加します。

source: Havana release.
fr: Version d'Havana.
ja: Havana リリース。

source: Updated title for consistency.
fr: Mise à jour du titre pour une meilleure cohérence.
ja: 一貫性のために文書名の更新。

source: Initial release of this guide.
fr: Version initiale de ce guide.
ja: このガイドの初版。

source: Tool support for image creation
fr: Support de l'outil pour la création d'image
ja: イメージ作成のサポートツール

source: There are several tools that are designed to automate image creation.
fr: Il y a plusieurs outils qui sont conçus pour automatiser la création d'image.
ja: イメージ作成を自動化するために設計されたツールがいくつかあります。

source: As of this writing, there are no Oz packages for Ubuntu, so you will need to either install from source or build your own .deb file.
fr: Au moment de cet écrit, il n'y a pas de packages Oz pour Ubuntu, donc il sera nécessaire soit de l'installer à partir des sources ou de construire votre propre fichier .deb.
ja: 執筆時点で、Ubuntu 用 Oz パッケージがありません。そのため、ソースからインストールするか、自分で .deb ファイルをビルドする必要があります。

source: <link href="https://github.com/clalancette/oz/wiki">Oz</link> is a command-line tool that automates the process of creating a virtual machine image file. Oz is a Python app that interacts with KVM to step through the process of installing a virtual machine. It uses a predefined set of kickstart (Red Hat-based systems) and preseed files (Debian-based systems) for operating systems that it supports, and it can also be used to create Microsoft Windows images. On Fedora, install Oz with yum:<placeholder-1/><placeholder-2/>
fr: <link href="https://github.com/clalancette/oz/wiki">Oz</link> est un outil en ligne de commande qui automatise le processus de création de fichier image de machine virtuelle. Oz est une application Python qui interagit avec KVM pour passer à travers les étapes d'installation d'une machine virtuelle. Il utilise un jeu de fichiers kickstart (systèmes basés sur Red Hat) et preseed (systèmes basés sur Debian) prédéfinis pour les systèmes d'exploitation qui les supportent, et il peut aussi être utilisé pour créer des images Microsoft Windows. Sur Fedora, installez Oz avec yum:<placeholder-1/><placeholder-2/>
ja: <link href="https://github.com/clalancette/oz/wiki">Oz</link> は、仮想マシンイメージファイルの作成プロセスを自動化するコマンドラインツールです。仮想マシンのインストールプロセス全体を KVM とやりとりする Python アプリケーションです。サポートするオペレーティングシステムの kickstart (Red Hat 系システム)、preseed ファイル (Debian 系システム) の事前定義を使用します。Microsoft Windows イメージを作成するためにも使用できます。Fedora の場合、yum を用いて Oz をインストールします。<placeholder-1/><placeholder-2/>

source: A full treatment of Oz is beyond the scope of this document, but we will provide an example. You can find additional examples of Oz template files on GitHub at <link href="https://github.com/rackerjoe/oz-image-build/tree/master/templates">rackerjoe/oz-image-build/templates</link>. Here's how you would create a CentOS 6.4 image with Oz.
fr: Un traitement complet de Oz dépasse la portée de ce document, mais nous allons fournir un exemple. Vous pouvez trouver des exemples supplémentaires des fichiers modèles Oz sur GitHub à at <link href="https://github.com/rackerjoe/oz-image-build/tree/master/templates">rackerjoe/oz-image-build/templates</link>. Voici coment vous pourrez créer une image CentOs 6.4 avec Oz.
ja: Oz の詳細は、このドキュメントの範囲を超えていますが、例を示します。GitHub の <link href="https://github.com/rackerjoe/oz-image-build/tree/master/templates">rackerjoe/oz-image-build/templates</link> に Oz テンプレートの別の例があります。これは、Oz を用いて CentOS 6.4 イメージを作成する方法です。

source: Create a template file (we'll call it <filename>centos64.tdl</filename>) with the following contents. The only entry you will need to change is the <literal>&lt;rootpw&gt;</literal> contents.<placeholder-1/>
fr: Créez un fichier modèle (que nous allons appeler <filename>centos64.tdl</filename>) avec le contenu suivant. La seule entrée que vous devrez changer est le contenu <literal>&lt;rootpw&gt;</literal>.<placeholder-1/>
ja: 以下の内容のテンプレートファイルを作成します。<filename>centos64.tdl</filename> という名前にします。変更する必要がある項目は、<literal>&lt;rootpw&gt;</literal> の内容だけです。<placeholder-1/>

source: This Oz template specifies where to download the Centos 6.4 install ISO. Oz will use the version information to identify which kickstart file to use. In this case, it will be <link href="https://github.com/clalancette/oz/blob/master/oz/auto/RHEL6.auto">RHEL6.auto</link>. It adds EPEL as a repository and install the <literal>epel-release</literal>, <literal>cloud-utils</literal>, and <literal>cloud-init</literal> packages, as specified in the <literal>packages</literal> section of the file.
ja: この Oz テンプレートは、Centos 6.4 インストール ISO のダウンロード場所を指定します。Oz は、使用する kickstart ファイルを識別するために、バージョン情報を使用します。この場合、<link href="https://github.com/clalancette/oz/blob/master/oz/auto/RHEL6.auto">RHEL6.auto</link> になります。リポジトリーとして EPEL を追加します。そして、このファイルの <literal>packages</literal> セクションに指定されている、<literal>epel-release</literal>、<literal>cloud-utils</literal>、<literal>cloud-init</literal> パッケージをインストールします。

source: After Oz does the initial OS install using the kickstart file, it updates the image's install packages with <placeholder-1/>. It also removes any reference to the eth0 device that libvirt creates while Oz does the customizing, as specified in the <literal>command</literal> section of the XML file.
ja: Oz が、kickstart ファイルを用いて、初期 OS をインストールした後、<placeholder-1/> を用いてイメージのインストールパッケージを更新します。Oz によるカスタマイズ中、XML ファイルの <literal>command</literal> セクションに指定されたとおり、libvirt が作成した eth0 デバイスへのすべての参照を削除します。

source: To run this, do, as root:
fr: Pour lancer ça, faites, en tant que root:
ja: root として、このとおり実行します。

source: The <literal>-d3</literal> flag tells Oz to show status information as it runs.
fr: Le drapeau <literal>-d3</literal> indique à Oz de montrer les informations de status comme il fonctionne.
ja: <literal>-d3</literal> フラグにより、Oz が実行中の状態を表示します。

source: The <literal>-u</literal> tells Oz to do the customization (install extra packages, run the commands) once it does the initial install.
fr: Le drapeau <literal>-u</literal> indique à Oz de réaliser la personnalisation (installation de packages supplémentaires, lancement de commandes) une fois qu'il a fait l'installation initiale.
ja: <literal>-u</literal> により、Oz が初期インストール完了後、カスタマイズ (追加パッケージのインストール、コマンドの実行) をします。

source: The <literal>-x &lt;filename&gt;</literal> flag tells Oz what filename to use to write out a libvirt XML file (otherwise it will default to something like <filename>centos64Apr_03_2013-12:39:42</filename>).
fr: Le drapeau <literal>-x &lt;filename&gt;</literal> indique à Oz quel nom de fichier utiliser pour écrire un fichier XML libvirt (autrement le fichier par défaut serait sous la forme <filename>centos64Apr_03_2013-12:39:42</filename>).
ja: <literal>-x &lt;filename&gt;</literal> フラグにより、Oz が libvirt XML ファイル (指定しなければ、デフォルトで <filename>centos64Apr_03_2013-12:39:42</filename> のようなものになります) を書き込むために使用するファイル名を指定します。

source: <placeholder-1/><placeholder-2/>If you leave out the <literal>-u</literal> flag, or you want to edit the file to do additional customizations, you can use the <placeholder-3/> command, using the libvirt XML file that <placeholder-4/> creates. For example: <placeholder-5/> Oz will invoke libvirt to boot the image inside of KVM, then Oz will ssh into the instance and perform the customizations.
fr: <placeholder-1/><placeholder-2/>Si vous omettez le drapeau <literal>-u</literal>, ou si vous souhaitez éditer le fichier pour faire des personnalisations supplémentaires, vous pouvez utiliser la commande <placeholder-3/>, en utilisant le fichier XML libvirt que <placeholder-4/> génère. Par exemple: <placeholder-5/> Oz va invoquer libvirt pour booter l'image à l'intérieur de KVM, puis Oz va faire un ssh à l'intérieur de l'instance et réaliser les personnalisations.
ja: <placeholder-1/><placeholder-2/><literal>-u</literal> フラグを使用しない場合、またはファイルを編集して追加カスタマイズしたい場合、<placeholder-4/> が作成した libvirt XML ファイルを用いて、<placeholder-3/> コマンドを使用できます。例: <placeholder-5/> Oz は、KVM 内でイメージを起動するために、libvirt を呼び出します。次に、Oz はインスタンスに SSH し、カスタマイズを実行します。

source: <link href="https://launchpad.net/vmbuilder">VMBuilder</link> (Virtual Machine Builder) is a command-line tool that creates virtual machine images for different hypervisors. The version of VMBuilder that ships with Ubuntu can only create Ubuntu virtual machine guests. The version of VMBuilder that ships with Debian can create Ubuntu and Debian virtual machine guests.
fr: <link href="https://launchpad.net/vmbuilder">VMBuilder</link> (Constructeur de Machine Virtuelle) est un outil en ligne de commande qui génère des images de machine virtuelle pour différents hyperviseurs. La version de VMBuilder fournie avec Ubuntu peut seulement créer des invités de machine virtuelle Ubuntu. La version de VMBuilder fournie avec Debian peut créer des invités de machine virtuelle ubuntu et Debian.
ja: <link href="https://launchpad.net/vmbuilder">VMBuilder</link> (Virtual Machine Builder) は、さまざまなハイパーバイザー向けの仮想マシンイメージを作成するコマンドラインツールです。Ubuntu に同梱されている VMBuilder のバージョンは、Ubuntu 仮想マシンゲストのみを作成できます。Debian に同梱されている VMBuilder のバージョンは、Ubuntu と Debian の仮想マシンゲストを作成できます。

source: The <link href="https://help.ubuntu.com/12.04/serverguide/jeos-and-vmbuilder.html"><citetitle>Ubuntu Server Guide</citetitle></link> has documentation on how to use VMBuilder to create an Ubuntu image.
fr: Le <link href="https://help.ubuntu.com/12.04/serverguide/jeos-and-vmbuilder.html"><citetitle>Guide du Serveur Ubuntu</citetitle></link> comprend de la documentation sur la manière d'utiliser VMBuilder pour créer une image Ubuntu.
ja: <link href="https://help.ubuntu.com/12.04/serverguide/jeos-and-vmbuilder.html"><citetitle>Ubuntu Server Guide</citetitle></link> は、Ubuntu イメージを作成するために、VMBuilder を使用する方法がドキュメント化されています。

source: <link href="http://boxgrinder.org/">BoxGrinder</link> is another tool for creating virtual machine images, which it calls appliances. BoxGrinder can create Fedora, Red Hat Enterprise Linux, or CentOS images. BoxGrinder is currently only supported on Fedora.
fr: <link href="http://boxgrinder.org/">BoxGrinder</link> est un autre outil pour créer des images de machine virtuelle, qu'il appelle appliances. BoxGrinder peut créer des images Fedora, Red Hat Enterprise Linux, ou CentOS. BoxGrinder est actuellement seulement supporté sur Fedora.
ja: <link href="http://boxgrinder.org/">BoxGrinder</link> は、アプライアンスと呼ぶ仮想マシンイメージを作成するためのもう一つのツールです。BoxGrinder は Fedora、Red Hat Enterprise Linux、CentOS イメージを作成できます。BoxGrinder は現在 Fedora のみにおいてサポートされます。

source: <link href="https://github.com/jedi4ever/veewee"> VeeWee</link> is often used to build <link href="http://vagrantup.com">Vagrant</link> boxes, but it can also be used to build KVM images.
fr: <link href="https://github.com/jedi4ever/veewee"> VeeWee</link> est souvent utilisé pour construire des boites <link href="http://vagrantup.com">Vagrant</link>, mais il peut aussi être utilisé pour construire des images KVM.
ja: <link href="https://github.com/jedi4ever/veewee"> VeeWee</link> は、よく <link href="http://vagrantup.com">Vagrant</link> ボックスを構築するために使用されますが、KVM イメージを構築するためにも使用されます。

source: <link href="http://www.packer.io/"> Packer</link> is a tool for creating machine images for multiple platforms from a single source configuration.
fr: <link href="http://www.packer.io/"> Packer</link> est un outil pour créer des images de machine pour de multiples plateformes à partir d'une configuration source unique.
ja: <link href="http://www.packer.io/">Packer</link> は、単一のソース設定から複数のプラットフォームに対して、マシンイメージを作成するためのツールです。
