Repository: 25hours/openstack-manuals
Catalog: doc/image-guide/locale/*.po
Languages: fr, ja

source: <link href="http://libguestfs.org/virt-df.1.html">virt-df</link> for displaying free space inside of an image.
fr: <link href="http://libguestfs.org/virt-df.1.html">virt-df</link> pour afficher l'espace libre à l'intérieur d'une image.
ja: <link href="http://libguestfs.org/virt-df.1.html">virt-df</link> は、イメージ内の空き容量を表示できます。

source: <link href="http://libguestfs.org/virt-resize.1.html">virt-resize</link> for resizing an image.
fr: <link href="http://libguestfs.org/virt-resize.1.html">virt-resize</link> pour redimensionner une image.
ja: <link href="http://libguestfs.org/virt-resize.1.html">virt-resize</link> は、イメージの容量を変更できます。

source: <link href="http://libguestfs.org/virt-sysprep.1.html">virt-sysprep</link> for preparing an image for distribution (for example, delete SSH host keys, remove MAC address info, or remove user accounts).
fr: <link href="http://libguestfs.org/virt-sysprep.1.html">virt-sysprep</link> pour préparer une image à la distribution (par exemple, supprimer les clés d'hôtes SSH, supprimer les informations d'adresse MAC, ou enlever les comptes utilisateurs).
ja: <link href="http://libguestfs.org/virt-sysprep.1.html">virt-sysprep</link> は、イメージを配布する準備ができます (例えば、SSH ホスト鍵の削除、MAC アドレス情報の削除、ユーザーアカウントの削除)。

source: <link href="http://libguestfs.org/virt-sparsify.1.html">virt-sparsify</link> for making an image sparse
fr: <link href="http://libguestfs.org/virt-sparsify.1.html">virt-sparsify</link> pour rendre une image clairsemée
ja: <link href="http://libguestfs.org/virt-sparsify.1.html">virt-sparsify</link> は、イメージをスパース化できます。

source: <link href="http://libguestfs.org/virt-v2v/">virt-p2v</link> for converting a physical machine to an image that runs on KVM
fr: <link href="http://libguestfs.org/virt-v2v/">virt-p2v</link> pour convertir une machine physique en une image qui tourne sur KVM
ja: <link href="http://libguestfs.org/virt-v2v/">virt-p2v</link> は、物理マシンを KVM で動作するイメージに変換できます。

source: <link href="http://libguestfs.org/virt-v2v/">virt-v2v</link> for converting Xen and VMware images to KVM images
fr: <link href="http://libguestfs.org/virt-v2v/">virt-v2v</link> pour convertir les images Xen et VMware en images KVM
ja: <link href="http://libguestfs.org/virt-v2v/">virt-v2v</link> は、Xen や VMware のイメージを KVM のイメージに変換できます。

source: The <link href="http://libguestfs.org/">libguestfs</link> project has a number of other useful tools, including:<placeholder-1/>
fr: Le projet <link href="http://libguestfs.org/">libguestfs</link> dispose d'un certain nombre d'autres outils très utiles, incluant:<placeholder-1/>
ja: <link href="http://libguestfs.org/">libguestfs</link> プロジェクトは、他にも以下のような有用なツールを作成しています。<placeholder-1/>

source: Modify a single file inside of an image
fr: Modifier un fichier unique à l'intérieur d'une image
ja: イメージ内の単一ファイルの編集

source: This example shows how to use <placeholder-1/> to modify a file. The command can take either a filename as an argument with the <literal>-a</literal> flag, or a domain name as an argument with the <literal>-d</literal> flag. The following examples shows how to use this to modify the <filename>/etc/shadow</filename> file in instance with libvirt domain name <literal>instance-000000e1</literal> that is currently running:
fr: Cet exemple montre comment utiliser <placeholder-1/> pour modifier un fichier. La commande peut prendre soit un nom de fichier en argument avec le drapeau <literal>-a</literal>, soit un nom de domaine en argument avec le drapeau <literal>-d</literal>. Les exemples suivants montrent comment utiliser ça pour modifier le fichier <filename>/etc/shadow</filename> dans l'instance avec le nom de domaine libvirt <literal>instance-000000e1</literal> qui est actuellement en fonctionnement:
ja: この例は、<placeholder-1/> を使用して、ファイルを編集する方法を示します。このコマンドは、<literal>-a</literal> フラグの引数としてファイル名を、<literal>-d</literal> フラグの引数としてドメイン名を利用できます。以下の例は、これを使用して、現在動作中の libvirt ドメイン名 <literal>instance-000000e1</literal> のインスタンスにある <filename>/etc/shadow</filename> ファイルを編集する方法について示します。

source: Resize an image
fr: Redimensionner une image
ja: イメージのリサイズ

source: Here's a simple of example of how to use <placeholder-1/> to resize an image. Assume we have a 16GB Windows image in qcow2 format that we want to resize to 50GB. First, we use to identify the partitions:
fr: Voici un exemple simple montrant comment utiliser <placeholder-1/> pour redimensionner une image. Nous considérons que nous disposons d'une image Windows de 16 Go au format qcow2 que nous voulons agrandir à 50 Go. Pour commencer, nous devons identifier les partitions:
ja: これは、イメージの容量を変更するために、<placeholder-1/> を使用する方法の簡単な例です。容量を 50GB に変更したい、qcow2 形式の 16GB Windows イメージがあると仮定します。まず、パーティションを識別するために使用します。

source: In this case, it's the <filename>/dev/sda2</filename> partition that we want to resize. We create a new qcow2 image and use the <placeholder-1/> command to write a resized copy of the original into the new image: <placeholder-2/>
fr: Dans ce cas, il s'agit de la partition <filename>/dev/sda2</filename> que nous voulons redimensionner. Nous créons une nouvelle image qcow2 et nous utilisons la commande <placeholder-1/> pour écrire une copie redimensionnée de l'original dans la nouvelle image: <placeholder-2/>
ja: この場合、容量を変更したいパーティションは <filename>/dev/sda2</filename> です。新しい qcow2 イメージを作成し、容量を変更して元の内容を新しいイメージをコピーするために <placeholder-1/> コマンドを使用します。<placeholder-2/>

source: Loop devices, kpartx, network block devices
fr: Les périphériques de boucle, kpartx, et les périphériques de bloc réseau
ja: lopp デバイス、kpartx、ネットワークブロックデバイス

source: Mounting untrusted guest images using the tools described in this section is a security risk, always use libguestfs tools such as guestfish and guestmount if you have access to them. See <link href="https://www.berrange.com/posts/2013/02/20/a-reminder-why-you-should-never-mount-guest-disk-images-on-the-host-os/">A reminder why you should never mount guest disk images on the host OS</link> by Daniel Berrangé for more details.
fr: Monter des images qui n'ont pas été validées en utilisant les outils décris dans cette section constitue un risque de sécurité, utilisez toujours les outils libguestfs comme guestfish et guestmount si vous y avez accès. Voyez <link href="https://www.berrange.com/posts/2013/02/20/a-reminder-why-you-should-never-mount-guest-disk-images-on-the-host-os/">Un rappel des raisons pour lesquelles vous ne devriez jamais monter des images disque clientes sur l'OS d'hébergement</link> de Daniel Berrangé pour plus de détails.
ja: このセクションに記載されたツールを用いて、信頼されないゲストイメージをマウントすることは、セキュリティリスクがあります。それらにアクセスする場合、必ず guestfish や guestmount などの libguestfs ツール群を使用してください。詳細は Daniel Berrangé 氏の <link href="https://www.berrange.com/posts/2013/02/20/a-reminder-why-you-should-never-mount-guest-disk-images-on-the-host-os/">A reminder why you should never mount guest disk images on the host OS</link> を参照してください。

source: If you don't have access to libguestfs, you can mount image file systems directly in the host using loop devices, kpartx, and network block devices.<placeholder-1/>
fr: Si vous n'avez pas accès à libguestfs, vous pouvez monter des systèmes de fichiers d'image directement dans l'hôte en utilisant des périphériques de boucle, kpartx, et des périphériques de bloc réseau.<placeholder-1/>
ja: libguestfs にアクセスできない場合、loop デバイス、kpartx、ネットワークブロックデバイスを使用して、イメージのファイルシステムをホストに直接マウントできます。<placeholder-1/>

source: Mount a raw image (without LVM)
fr: Monter une image raw (sans LVM)
ja: raw イメージのマウント (LVM なし)

source: If you have a raw virtual machine image that is not using LVM to manage its partitions. First, use the <placeholder-1/> command to find an unused loop device. <placeholder-2/>
fr: Si vous avez une image de machine virtuelle au format raw qui n'utilise pas LVM pou gérer ses partitions: pour commencer, utilisez la commande <placeholder-1/> afin de trouver un périphérique de boucle inutilisé. <placeholder-2/>
ja: パーティション管理に LVM を使用していない raw 形式の仮想マシンイメージがある場合、まず、<placeholder-1/> コマンドを使用して未使用の loop デバイスを見つけます。<placeholder-2/>

source: In this example, <filename>/dev/loop0</filename> is free. Associate a loop device with the raw image:<placeholder-1/>
fr: Dans cet exemple, <filename>/dev/loop0</filename> est libre. Associez un périphérique de boucle avec l'image raw:<placeholder-1/>
ja: この例では、<filename>/dev/loop0</filename> が空いています。loop デバイスを raw イメージに関連付けます。<placeholder-1/>

source: If the image only has a single partition, you can mount the loop device directly:<placeholder-1/>
fr: Si l'image a seulement une partition unique, vous pouvez monter le périphérique de boucle directement:<placeholder-1/>
ja: イメージがパーティションを一つだけ持つ場合、loop デバイスを直接マウントできます。<placeholder-1/>

source: If the image has multiple partitions, use <placeholder-1/> to expose the partitions as separate devices (for example, <filename>/dev/mapper/loop0p1</filename>), then mount the partition that corresponds to the root file system:<placeholder-2/>
fr: Si l'image a des partitions multiples, utilisez <placeholder-1/> pour exposer les partitions en tant que périphériques séparés (par exemple, <filename>/dev/mapper/loop0p1</filename>), puis montez la partition qui correspond au système de fichier racine:<placeholder-2/>
ja: イメージが複数のパーティションを持つ場合、パーティションを別々のデバイス (<filename>/dev/mapper/loop0p1</filename>) として認識させるために <placeholder-1/> を使用します。そして、ルートファイルシステムに対応するパーティションをマウントします。<placeholder-2/>

source: If the image has, say three partitions (/boot, /, swap), there should be one new device created per partition:<placeholder-1/>To mount the second partition, as root:<placeholder-2/>Once you're done, to clean up:<placeholder-3/>
fr: Si l'image a, disons trois partitions (/boot, /, swap), il devrait y avoir un périphérique créé par partition:<placeholder-1/>Pour monter la seconde partition, en tant que root:<placeholder-2/>Une fois ceci fait, pour nettoyer:<placeholder-3/>
ja: イメージがいわゆる 3 パーティション (/boot、/、swap) を持つ場合、パーティションごとに 1 つの新しいデバイスにすべきです。<placeholder-1/> 2 番目のパーティションをマウントするために、root として次のとおり実行します。<placeholder-2/>完了すると、クリーンアップします。<placeholder-3/>

source: Mount a raw image (with LVM)
fr: Monter une image raw (avec LVM)
ja: raw イメージのマウント (LVM あり)

source: If your partitions are managed with LVM, use losetup and kpartx as in the previous example to expose the partitions to the host:
fr: Si vos partitions sont gérées avec LVM, utilisez losetup et kpartx comme dans l'exemple précédent pour exposer les partitions à l'hôte:
ja: LVM を用いてパーティションを管理している場合、パーティションをホストに公開するために、前の例にあるとおり losetup と kpartx を使用します。

source: Next, you need to use the <placeholder-1/> command to identify the LVM volume groups and then <placeholder-2/> to expose the volumes as devices:
fr: Ensuite, il vous sera nécessaire d'utiliser la commande <placeholder-1/> pour identifier les groupes de volume LVM et <placeholder-2/> pour exposer les volumes en tant que périphériques:
ja: 次に、LVM ボリュームグループを識別するために、<placeholder-1/> コマンドを使用する必要があります。また、ボリュームをデバイスとして公開するために <placeholder-2/> を実行します。

source: Clean up when you're done:
fr: Nettoyez lorsque vous avez terminé:
ja: 完了後、クリーンアップします。

source: Mount a qcow2 image (without LVM)
fr: Monter une image qcow2 (sans LVM)
ja: qcow2 イメージのマウント (LVM なし)

source: You need the <literal>nbd</literal> (network block device) kernel module loaded to mount qcow2 images. This will load it with support for 16 block devices, which is fine for our purposes. As root:<placeholder-1/>
fr: Vous avez besoin du module kernel <literal>nbd</literal> (network block device) chargé pour monter des images qcow2. Il sera chargé avec le support des périphériques 16 blocs, ce qui est parfait pour nos besoins. En tant que root:<placeholder-1/>
ja: qcow2 イメージをマウントするために、<literal>nbd</literal> (ネットワークブロックデバイス) カーネルモジュールを読み込む必要があります。この例は、今回の目的に十分である、16 個のブロックデバイスをサポートします。root として、以下のとおり実行します。<placeholder-1/>

source: Assuming the first block device (<filename>/dev/nbd0</filename>) is not currently in use, we can expose the disk partitions using the <placeholder-1/> and <placeholder-2/> commands. As root:<placeholder-3/>
fr: Considérant que le premier périphérique bloc (<filename>/dev/nbd0</filename>) n'est pas en cours d'utilisation, nous pouvons exposer les partitions du disque en utilisant les commandes <placeholder-1/> et <placeholder-2/>. En tant que root:<placeholder-3/>
ja: 1 番目のブロックデバイス (<filename>/dev/nbd0</filename>) が現在未使用であると仮定して、<placeholder-1/> コマンドと <placeholder-2/> コマンドを使用して、ディスクパーティションを利用できます。root として以下のとおり実行します。<placeholder-3/>

source: If the image has, say three partitions (/boot, /, swap), there should be one new device created for each partition:
fr: Si l'image a, disons trois partitions (/boot, /, swap), il devrait y avoir un périphérique créé pour chacune d'entre elles:
ja: イメージがいわゆる 3 パーティション (/boot、/、swap) を持つ場合、パーティションごとに 1 つの新しいデバイスにすべきです。

source: If the network block device you selected was already in use, the initial <placeholder-1/> command will fail silently, and the <filename>/dev/nbd3p{1,2,3}</filename> device files will not be created.
fr: Si le périphérique de bloc réseau que vous avez sélectionné est déjà en cours d'usage, la commande initiale <placeholder-1/> échouera de façon silencieuse, et les fichiers de périphérique <filename>/dev/nbd3p{1,2,3}</filename> ne seront pas créés.
ja: 選択したネットワークブロックデバイスが使用中の場合、最初の <placeholder-1/> コマンドがエラーを表示せず失敗します。そして、<filename>/dev/nbd3p{1,2,3}</filename> デバイスファイルが作成されません。

source: If the image partitions are not managed with LVM, they can be mounted directly:
fr: Si les partitions de l'image ne sont pas gérées par LVM, elles peuvent être montées directement:
ja: イメージのパーティションが LVM で管理されていない場合、直接マウントできます。

source: When you're done, clean up:
fr: Une fois ceci terminé, nettoyez:
ja: 完了後、クリーンアップします。

source: Mount a qcow2 image (with LVM)
fr: Monter une image qcow2 (avec LVM)
ja: qcow2 イメージのマウント (LVM あり)

source: If the image partitions are managed with LVM, after you use <placeholder-1/> and <placeholder-2/>, you must use <placeholder-3/> and <placeholder-4/> in order to expose the LVM partitions as devices that can be mounted:<placeholder-5/>
fr: Si les partitions de l'image sont gérées avec LVM, après avoir utilisé <placeholder-1/> et <placeholder-2/>, vous devez utiliser <placeholder-3/> et <placeholder-4/> afin d'exposer les partitions LVM en tant que périphériques pouvant être montés:<placeholder-5/>
ja: イメージのパーティションが LVM で管理されている場合、<placeholder-1/> と <placeholder-2/> を実行後、マウントできるデバイスとして LVM パーティションを認識するために、<placeholder-3/> と <placeholder-4/> を使用する必要があります。<placeholder-5/>

source: When you're done, clean up:<placeholder-1/>
fr: Une fois ceci fait, nettoyez:<placeholder-1/>
ja: 完了後、クリーンアップします。<placeholder-1/>

source: Example: FreeBSD image
fr: Exemple: image FreeBSD
ja: 例: FreeBSD イメージ

source: This example creates a minimal FreeBSD image that is compatible with OpenStack and <application>bsd-cloudinit</application>. The <application>bsd-cloudinit</application> program is independently maintained and in active development. The best source of information on the current state of the project is at <link href="http://pellaeon.github.io/bsd-cloudinit/">http://pellaeon.github.io/bsd-cloudinit/</link>.
ja: この例は、OpenStack と <application>bsd-cloudinit</application> と互換性がある、最小の FreeBSD イメージを作成します。<application>bsd-cloudinit</application> プログラムは、独立してメンテナンスされ、活発に開発されています。プロジェクトの現状に関する最良の情報源は <link href="http://pellaeon.github.io/bsd-cloudinit/">http://pellaeon.github.io/bsd-cloudinit/</link> です。

source: KVM with virtio drivers is used as the virtualization platform because that is the most widely used among OpenStack operators. If you use a different platform for your cloud virtualization, use that same platform in the image creation step.
fr: KVM avec les drivers virtio est utilisé en tant que plateforme de virtualisation car il est le plus largement utilisé parmi les opérateurs openStack. Si vous utilisez une plateforme différente pour votre virtualisation de cloud, utilisez cette même plateforme lors de l'étape de création de l'image.
ja: virtio ドライバーありの KVM が、OpenStack 運用者の間で最も幅広く使用されているため、これを仮想化プラットフォームとして使用します。クラウド仮想化環境に別のプラットフォームを使用する場合、イメージの作成にそのプラットフォームを使用してください。

source: This example shows how to create a FreeBSD 10 image. To create a FreeBSD 9.2 image, follow these steps with the noted differences.
fr: Cet exemple montre comment créer une image FreeBSD 10. Pour créer une image FreeBSD 9.2, suivez ces étapes en notant bien les différences.
ja: この例は、FreeBSD 10 イメージを作成する方法を示しています。FreeBSD 9.2 イメージを作成する場合、違いを記載されたこれらの手順を実行します。

source: To create a FreeBSD image
fr: Pour créer une image FreeBSD
ja: FreeBSD イメージの作成方法

source: Make a virtual drive:
fr: Créez un périphérique virtuel:
ja: 仮想ドライブを作成します。

source: The minimum supported disk size for FreeBSD is 1GB. Because the goal is to make the smallest possible base image, the example uses that minimum size. This size is sufficient to include the optional doc, games, and lib32 collections. To include the ports collection, add another 1GB. To include src, add 512MB.
fr: La taille de disque minimale supportée pour FreeBSD est de 1 Go. Puisque le but est d'obtenir la taille la plus petite possible pour l'image de base, l'exemple utilise cette taille minimale. Cette taille est suffisante pour inclure la documentation optionnelle, les jeux, et les collections lib32. Pour inclure la collection de ports, ajoutez 1 Go supplémentaire. Pour inclure src, ajoutez 512 Mo.
ja: FreeBSD の最小サポートディスク容量は 1GB です。目標はできる限り最小のベースイメージを作成することなので、この例は最小容量を使用します。この容量は、オプションのドキュメント、ゲーム、lib32 コレクションを含めるために十分です。Ports Collection を含める場合、さらに 1GB 必要です。ソースを含める場合、512MB 追加します。

source: Get the installer ISO:
fr: Obtenir l'ISO de l'installeur:
ja: インストーラー ISO を取得します。

source: Launch a VM on your local workstation. Use the same hypervisor, virtual disk, and virtual network drivers as you use in your production environment.
fr: Lancez une VM sur votre station de travail locale. Utilisez le même hyperviseur, disque virtuel, et drivers de réseau virtuel que dans votre environnement de production.
ja: 手元のコンピューターで仮想マシンを起動します。本番環境で使用するものと、同じハイパーバイザー、仮想ディスクドライバー、仮想ネットワークドライバーを使用します。

source: The following command uses the minimum amount of RAM, which is 128MB:
fr: La commande suivante utilise la quantité minimale de RAM, qui est de 128 Mo:
ja: 以下のコマンドは、最小メモリ容量 128MB を使用します。

source: You can specify up to 1GB additional RAM to make the installation process run faster.
fr: Vous pouvez configurer jusqu'à 1 Go de RAM supplémentaire pour faire en sorte que le processus d'installation se déroule plus rapidement.
ja: インストールプロセスを高速化するために、メモリを 1GB まで指定できます。

source: This VM must also have Internet access to download packages.
fr: Cette VM doit aussi disposer d'un accès Internet afin de télécharger les packages.
ja: この仮想マシンは、パッケージをダウンロードするために、インターネットにアクセスできる必要があります。

source: By using the same hypervisor, you can ensure that you emulate the same devices that exist in production. However, if you use full hardware virtualization instead of paravirtualization, you do not need to use the same hypervisor; you must use the same type of virtualized hardware because FreeBSD device names are related to their drivers. If the name of your root block device or primary network interface in production differs than the names used during image creation, errors can occur.
fr: En utilisant le même hyperviseur, vous pouvez vous assurer que vous émulerez les même périphériques qui existent en production. Cependant, si vous utilisez une virtualisation matérielle complète au lieu de la para-virtualisation, vous n'avez pas besoin d'utiliser le même hyperviseur; vous devez utiliser le me type de matériel virtualisé car les noms des périphériques FreeBSD sont relatifs à leurs drivers. Si le nom de votre périphérique bloc racine ou interface de réseau primaire en production diffère des noms utilisés durant la création de l'image, des erreurs peuvent survenir.
ja: 同じハイパーバイザーを使用することにより、本番環境にあるデバイスと確実に同じものをエミュレートできます。しかしながら、準仮想化の代わりに完全仮想化を使用する場合、同じハイパーバイザーを使用する必要がありません。また、FreeBSD のデバイス名はデバイスドライバーと関連するため、同じ種類の仮想ハードウェアを使用する必要があります。本番環境のルートブロックデバイスの名前、主ネットワークインターフェースの名前がイメージの作成中に使用した名前と異なる場合、エラーが発生する可能性があります。

source: You now have a VM that boots from the downloaded install ISO and is connected to the blank virtual disk that you created previously.
fr: Vous disposez maintenant d'une VM qui boot depuis l'ISO d'installation téléchargée et qui est connectée au disque virtuel vierge que vous avez créé précédemment.
ja: これで、ダウンロードしたインストール ISO から起動し、前に作成した空の仮想ディスクを接続した、仮想マシンができました。

source: To install the operating system, complete the following steps inside the VM:
fr: Pour installer le système d'exploitation, complétez les étapes suivantes à l'intérieur de la VM:
ja: オペレーティングシステムをインストールするために、仮想マシン内で以下の手順を完了します。

source: When prompted, choose to run the ISO in <guibutton>Install</guibutton> mode.
fr: Lorsque cela vous est demandé, choisissez de lancez l'ISO en mode <guibutton>Installation</guibutton>.
ja: プロンプト表示時、<guibutton>Install</guibutton> モードで ISO の実行を選択します。

source: Accept the default keymap or select an appropriate mapping for your needs.
fr: Acceptez la disposition du clavier par défaut ou sélectionnez une disposition appropriée pour vos besoins.
ja: デフォルトのキーマップを使用するか、必要に応じて適切なキーマップを選択します。

source: Provide a host name for your image. If you use <application>bsd-cloudinit</application>, it overrides this value with the name provided by OpenStack when an instance boots from this image.
fr: Fournissez un nom d'hôte pour votre image. Si vous utilisez <application>bsd-cloudinit</application>, cela écrasera cette valeur avec le nom fourni par OpenStack lorsqu'une instance boot à partir de cette image.
ja: イメージのホスト名を指定します。<application>bsd-cloudinit</application> を使用する場合、このイメージからインスタンスを起動するとき、OpenStack により提供される名前でこの名前を上書きします。

source: When prompted about the optional <literal>doc</literal>, <literal>games</literal>, <literal>lib32</literal>, <literal>ports</literal>, and <literal>src</literal> system components, select only those that you need. It is possible to have a fully functional installation without selecting additional components selected. As noted previously, a minimal system with a 1GB virtual disk supports doc, games, and lib32 inclusive. The ports collection requires at least 1GB additional space and possibly more if you plan to install many ports. The src collection requires an additional 512MB.
fr: Lorsque vous serez consulté à propos des composants système optionnels <literal>doc</literal>, <literal>games</literal>, <literal>lib32</literal>, <literal>ports</literal>, et <literal>src</literal>, sélectionnez seulement ceux qui vous sont nécessaires. Il est aussi possible d'avoir une installation pleinement fonctionnelle sans prendre les composants sélectionnés additionnels. Comme noté précédemment, un système minimal avec un disque virtuel de 1 Go supporte la documentation, les jeux, et lib32. La collection de ports demande au moins 1 Go d'espace supplémentaire et peut être plus si vous prévoyez d'installer plusieurs ports. La collection src demande 512 Mo de plus.
ja: オプションのシステムコンポーネント <literal>doc</literal>、<literal>games</literal>、<literal>lib32</literal>、<literal>ports</literal>、<literal>src</literal> に関するプロンプトが表示されたとき、必要なもののみを選択します。追加コンポーネントを選択しなくても、完全に動作するインストールを実行できます。前に記載したとおり、1 GB 仮想ディスクを持つシステムは、doc、games、lib32 を含められます。ports コレクションは、少なくとも 1GB の追加領域が必要です。多くの ports をインストールする予定がある場合、さらに多くなるかもしれません。src コレクションは、512MB の追加が必要です。

source: Configure the primary network interface to use DHCP. In this example, which uses a virtio network device, this interface is named <literal>vtnet0</literal>.
fr: Configurez l'interface primaire de réseau pour utiliser DHCP. Dans cet exemple, qui utilise un périphérique réseau virtio, cette interface est appelée <literal>vtnet0</literal>.
ja: 主ネットワークインターフェースが DHCP を使用するよう設定します。この例では、このインターフェースは <literal>vtnet0</literal> という名前で、virtio ネットワークデバイスを使用します。
