Repository: 25hours/openstack-manuals
Catalog: doc/image-guide/locale/*.po
Languages: fr, ja

source: <link href="http://imgfac.org/">imagefactory</link> is a newer tool designed to automate the building, converting, and uploading images to different cloud providers. It uses Oz as its back-end and includes support for OpenStack-based clouds.
fr: <link href="http://imgfac.org/">imagefactory</link> est un nouvel outil conçu pour automatiser la construction, la conversion, et le téléchargement d'images à différents fournisseurs de cloud. Il utilise Oz en tant que backend et inclue le support pour les clouds basés sur OpenStack.
ja: <link href="http://imgfac.org/">imagefactory</link> は、さまざまなクラウドプロバイダーへのイメージの構築、変換、アップロードを自動化するために設計された、比較的新しいツールです。バックエンドとして Oz を使用し、OpenStack ベースのクラウドを

source: <link href="http://susestudio.com">SUSE Studio</link> is a web application for building and testing software applications in a web browser. It supports the creation of physical, virtual or cloud-based applications and includes support for building images for OpenStack based clouds using SUSE Linux Enterprise and openSUSE as distributions.
fr: <link href="http://susestudio.com">SUSE Studio</link> est une application web pour construire et tester les logiciels applicatifs dans un navigateur web. Il supporte la création d'applications physiques, virtuelles et basées sur le cloud et inclue le support pour la construction d'images pour les clouds basés sur OpenStack utilisant SUSE Linux Enterprise et openSUSE comme distributions.
ja: <link href="http://susestudio.com">SUSE Studio</link> は、ソフトウェアアプリケーションを Web ブラウザーで構築、テストするための Web アプリケーションです。物理、仮想、クラウドベースのアプリケーションの作成をサポートします。ディストリビューションとして SUSE Linux Enterprise と openSUSE を使用した OpenStack ベースのクラウド用にイメージを構築できます。

source: Get images
fr: Obtenir les images
ja: イメージの取得

source: The simplest way to obtain a virtual machine image that works with OpenStack is to download one that someone else has already created.
fr: La façon la plus simple pour obtenir une image de machine virtuelle qui fonctionne avec OpenStack est d'en télécharger une que quelqu'un d'autre a déjà créé.
ja: OpenStack で動作する仮想マシンイメージを取得する最も簡単な方法は、すでに作成されたものをダウンロードすることです。

source: CirrOS (test) images
fr: Images CirrOS (test)
ja: CirrOS (test) イメージ

source: CirrOS is a minimal Linux distribution that was designed for use as a test image on clouds such as OpenStack Compute. You can download a CirrOS image in various formats from the <link href="https://download.cirros-cloud.net">CirrOS download page</link>.
fr: CirrOS est une distribution Linux minimale qui est conçue pour être utiliser comme une image test sur les clouds comme OpenStack Compute. Vous pouvez télécharger l'image CirrOS dans divers formats depuis <link href="https://download.cirros-cloud.net">CirrOS download page</link>.
ja: CirrOS は、OpenStack Compute のようなクラウドでテストイメージとして使用するために設計された、最小の Linux ディストリビューションです。<link href="https://download.cirros-cloud.net">CirrOS ダウンロードページ</link>から CirrOS をさまざまな形式でダウンロードできます。

source: In a CirrOS image, the login account is <literal>cirros</literal>. The password is <literal>cubswin:)</literal>
fr: Dans une image CirrOS, le compte de login est <literal>cirros</literal>. Le mot de passe est <literal>cubswin:)</literal>
ja: CirrOS イメージでは、ログインアカウントは <literal>cirros</literal> です。パスワードは <literal>cubswin:)</literal> です。

source: If your deployment uses QEMU or KVM, we recommend using the images in qcow2 format. The most recent 64-bit qcow2 image as of this writing is <link href="http://download.cirros-cloud.net/0.3.3/cirros-0.3.3-x86_64-disk.img">cirros-0.3.3-x86_64-disk.img</link><placeholder-1/>
fr: Si votre déploiement utilise QEMU ou KVM, nous recommandons d'utiliser des images avec le format qcow2. L'image 64 bits qcow2 la plus récente est <link href="http://download.cirros-cloud.net/0.3.3/cirros-0.3.3-x86_64-disk.img">cirros-0.3.3-x86_64-disk.img</link><placeholder-1/>
ja: お使いの環境で QEMU や KVM を使用している場合、qcow2 形式のイメージを使用することを推奨します。執筆時点で最新の 64 ビット qcow2 イメージは <link href="http://download.cirros-cloud.net/0.3.3/cirros-0.3.3-x86_64-disk.img">cirros-0.3.3-x86_64-disk.img</link> です。<placeholder-1/>

source: Official Ubuntu images
fr: Images Ubuntu officielles
ja: Ubuntu 公式イメージ

source: Canonical maintains an <link href="http://cloud-images.ubuntu.com/">official set of Ubuntu-based images</link>.
fr: Canonical maintient un <link href="http://cloud-images.ubuntu.com/">jeu officiel d'images basées sur Ubuntu</link>.
ja: Canonical は、<link href="http://cloud-images.ubuntu.com/">Ubuntu ベースの公式イメージ</link>をメンテナンスしています。

source: Images are arranged by Ubuntu release, and by image release date, with "current" being the most recent. For example, the page that contains the most recently built image for Ubuntu 14.04 "Trusty Tahr" is <link href="http://cloud-images.ubuntu.com/trusty/current/">http://cloud-images.ubuntu.com/trusty/current/</link>. Scroll to the bottom of the page for links to images that can be downloaded directly.
fr: Les images sont arrangées par version Ubuntu, et par date de disponibilité des images, avec l'image "courante" qui est la plus récente. Par exemple, la page qui contient le build de l'image le plus récent pour Ubuntu 14.04 "Trusty Tahr" est <link href="http://cloud-images.ubuntu.com/trusty/current/">http://cloud-images.ubuntu.com/trusty/current/</link>. Faites défiler jusqu'en bas de la page pour obtenir des liens sur les images qui peuvent être directement téléchargées.
ja: イメージは、Ubuntu のリリース、イメージのリリース日により配置されます。最新は「current」になっています。例えば、Ubuntu 14.04 "Trusty Tahr" の最新イメージのページは、<link href="http://cloud-images.ubuntu.com/trusty/current/">http://cloud-images.ubuntu.com/trusty/current/</link> です。ページの最下部にスクロールすると、直接ダウンロードできるイメージへのリンクがあります。

source: In an Ubuntu cloud image, the login account is <literal>ubuntu</literal>.
fr: Dans une image de cloud Ubuntu, le compte de login est <literal>ubuntu</literal>.
ja: Ubuntu クラウドイメージでは、ログインアカウントは <literal>ubuntu</literal> です。

source: If your deployment uses QEMU or KVM, we recommend using the images in qcow2 format. The most recent version of the 64-bit QCOW2 image for Ubuntu 14.04 is <link href="http://uec-images.ubuntu.com/trusty/current/trusty-server-cloudimg-amd64-disk1.img">trusty-server-cloudimg-amd64-disk1.img</link>.<placeholder-1/>
fr: Si votre déploiement utilise QEMU ou KVM, nous recommandons d'utiliser les images au format qcow2. La version la plus récente de l'image QCOW2 64 bits pour ubuntu 14.04 est <link href="http://uec-images.ubuntu.com/trusty/current/trusty-server-cloudimg-amd64-disk1.img">trusty-server-cloudimg-amd64-disk1.img</link>.<placeholder-1/>
ja: お使いの環境で QEMU や KVM を使用する場合、イメージを qcow2 形式で使用することを推奨します。最近の Ubuntu 14.04 の 64 ビット qcow2 イメージは、<link href="http://uec-images.ubuntu.com/trusty/current/trusty-server-cloudimg-amd64-disk1.img">trusty-server-cloudimg-amd64-disk1.img</link>。<placeholder-1/>

source: Official Red Hat Enterprise Linux images
fr: Images officielles Red Hat Enterprise Linux
ja: Red Hat Enterprise Linux 公式イメージ

source: Red Hat maintains official Red Hat Enterprise Linux cloud images. A valid Red Hat Enterprise Linux subscription is required to download these images:
fr: Red Hat maintient des images de cloud officielles Red Hat Enterprise Linux. une souscription valide Red Hat Enterprise Linux est requise pour pouvoir télécharger ces images:
ja: Red Hat は、Red Hat Enterprise Linux の公式クラウドイメージを作成しています。これらのイメージをダウンロードするために、Red Hat Enterprise Linux の有効なサブスクリプションが必要になります。

source: Red Hat Enterprise Linux 7 KVM Guest Image
fr: Image Invité KVM Red Hat Enterprise Linux 7
ja: Red Hat Enterprise Linux 7 KVM ゲストイメージ

source: Red Hat Enterprise Linux 6 KVM Guest Image
fr: Image Invité KVM Red Hat Enterprise Linux 6
ja: Red Hat Enterprise Linux 6 KVM ゲストイメージ

source: In a RHEL image, the login account is <literal>cloud-user</literal>.
fr: Dans l'image RHEL, le compte de connexion est <literal>cloud-user</literal>.
ja: RHEL イメージの場合、ログインアカウントは <literal>cloud-user</literal> です。

source: Official Fedora images
fr: Images officielles Fedora
ja: Fedora 公式イメージ

source: In a Fedora image, the login account is <literal>fedora</literal>.
fr: Dans une image Fedora, le compte de login est <literal>fedora</literal>.
ja: Fedora イメージの場合、ログインアカウントは <literal>fedora</literal> です。

source: The Fedora project maintains a list of official cloud images at <link href="https://getfedora.org/en/cloud/download/"/>. The images include the <systemitem class="process">cloud-init</systemitem> utility to support key and user data injection. The default user name is <systemitem class="username">fedora</systemitem>. <placeholder-1/>
ja: Fedora プロジェクトは、<link href="https://getfedora.org/ja/cloud/download/"/> に公式クラウドイメージの一覧を公開しています。このイメージは、鍵とユーザーデータのインジェクションをサポートするために、<systemitem class="process">cloud-init</systemitem> ユーティリティを含みます。デフォルトのユーザー名は <systemitem class="username">fedora</systemitem> です。<placeholder-1/>

source: Official openSUSE and SLES images
fr: Images officielles openSUSE et SLES
ja: openSUSE、SLES 公式イメージ

source: SUSE does not provide openSUSE or SUSE Linux Enterprise Server (SLES) images for direct download. Instead, they provide a web-based tool called <link href="http://susestudio.com">SUSE Studio</link> that you can use to build openSUSE and SLES images.
fr: SUSE ne fournit pas d'images openSUSE ou SUSE Linux Enterprise Server (SLES) en téléchargement direct. A la place, ils fournissent un outil basé sur le web dénommé <link href="http://susestudio.com">SUSE Studio</link> que vous pouvez utiliser pour construire des images openSUSE et SLES.
ja: SUSE は、直接ダウンロードするための、openSUSE や SUSE Linux Enterprise Server (SLES) のイメージを提供していません。代わりに、openSUSE や SLES のイメージを作成するために使用できる、<link href="http://susestudio.com">SUSE Studio</link> という Web ベースのツールを提供しています。

source: For example, Christian Berendt used <link href="http://www.opensuse.org">openSUSE</link> to create <link href="http://susestudio.com/a/YRUrwO/testing-instance-for-openstack-opensuse-12-3"> a test openSUSE 12.3 image</link>.
fr: Par exemple, Christian Berendt à utilisé <link href="http://www.opensuse.org">openSUSE</link> pour créer <link href="http://susestudio.com/a/YRUrwO/testing-instance-for-openstack-opensuse-12-3"> une image de test openSUSE 12.3</link>.
ja: 例えば、Christian Berendt は、<link href="http://susestudio.com/a/YRUrwO/testing-instance-for-openstack-opensuse-12-3">openSUSE 12.3 テストイメージ</link>を作成するために、<link href="http://www.opensuse.org">openSUSE</link> を使用しました。

source: Official Debian images
ja: 公式 Debian イメージ

source: Debian does not (yet) provide images for direct download. Instead, a package named <package>openstack-debian-images</package> provides a simple script for building them. This package is available in Debian Unstable, Debian Jessie, and through the wheezy-backports repositories. To produce a Wheezy image, simply run: <placeholder-1/>
ja: Debian は、直接ダウンロードするイメージをまだ提供していません。代わりに、<package>openstack-debian-images</package> という名前のパッケージが、イメージを構築するためのシンプルなスクリプトを提供します。このパッケージは、Debian Unstable、Debian Jessie、wheezy バックポートリポジトリー経由で利用可能です。以下を実行して、Wheezy イメージを作成します。<placeholder-1/>

source: If building the image for Wheezy, packages like <package>cloud-init</package>, <package>cloud-utils</package> or <package>cloud-initramfs-growroot</package> will be pulled from wheezy-backports. Also, the current version of <package>bootlogd</package> in Wheezy doesn't support logging to multiple consoles, which is needed so that both the OpenStack Dashboard console and the <placeholder-1/> console works. However, a <link href="http://archive.gplhost.com/debian/pool/juno-backports/main/s/sysvinit/bootlogd_2.88dsf-41+deb7u2_amd64.deb"> fixed version is available from the non-official GPLHost repository</link>. To install it on top of the image, it is possible to use the <option>--hook-script</option> option of the <placeholder-2/> script, with this kind of script as parameter: <placeholder-3/>
ja: Wheezy イメージを構築している場合、<package>cloud-init</package>、<package>cloud-utils</package>、<package>cloud-initramfs-growroot</package> のようなパッケージが wheezy バックポートから取得されます。また、Wheezy の <package>bootlogd</package> の最新版は、複数コンソールへのログインをサポートしません。これは OpenStack Dashboard のコンソールと <placeholder-1/> のコンソールを動作させるために必要になります。しかしながら、<link href="http://archive.gplhost.com/debian/pool/juno-backports/main/s/sysvinit/bootlogd_2.88dsf-41+deb7u2_amd64.deb">修正バージョンが非公式 GPLHost リポジトリーから取得できます</link>。イメージの上にインストールするために、パラメーターとしてこの種類のスクリプトを用いて、<placeholder-2/> スクリプトの <option>--hook-script</option> オプションを使用できます。

source: Official images from other Linux distributions
fr: Images officielles pour d'autres distributions de Linux
ja: 他の Linux ディストリビューションの公式イメージ

source: As of this writing, we are not aware of other distributions that provide images for download.
fr: Au moment où nous écrivons ces lignes, nous n'avons pas connaissance d'autres distributions qui fourniraient des images en téléchargement.
ja: 執筆時点では、ダウンロード用のイメージを提供している他のディストリビューションを把握していません。

source: Rackspace Cloud Builders (multiple distros) images
fr: Images Rackspace Cloud Builders (distributions multiples)
ja: Rackspace Cloud Builders (複数ディストリビューション) イメージ

source: Rackspace Cloud Builders maintains a list of pre-built images from various distributions (Red Hat, CentOS, Fedora, Ubuntu). Links to these images can be found at <link href="https://github.com/rackerjoe/oz-image-build">rackerjoe/oz-image-build on GitHub</link>.
fr: Rackspace Cloud Builders maintient une liste d'images pré-générées issues de diverses distributions (Red Hat, CentOS, Fedora, Ubuntu). Les liens vers ces images peuvent être trouvés à <link href="https://github.com/rackerjoe/oz-image-build">rackerjoe/oz-image-build on GitHub</link>.
ja: Rackspace Cloud Builders は、さまざまなディストリビューション (Red Hat, CentOS, Fedora, Ubuntu) の事前構築済みイメージを維持しています。これらのイメージへのリンクは、<link href="https://github.com/rackerjoe/oz-image-build">GitHub の rackerjoe/oz-image-build</link> にあります。

source: Microsoft Windows images
fr: Images Microsoft Windows
ja: Microsoft Windows イメージ

source: Cloudbase Solutions hosts an <link href="http://www.cloudbase.it/ws2012r2/">OpenStack Windows Server 2012 Standard Evaluation image</link> that runs on Hyper-V, KVM, and XenServer/XCP.
fr: Cloudbase Solutions héberge une <link href="http://www.cloudbase.it/ws2012r2/">image d'évaluation OpenStack de Windows Server 2012 Standard</link> qui tourne sur Hyper-V, KVM, et XenServer/XCP.
ja: Cloudbase Solutions は、Hyper-V、KVM、XenServer/XCP で動作する <link href="http://www.cloudbase.it/ws2012r2/">OpenStack Windows Server 2012 Standard 評価イメージ</link> を配布しています。

source: Example: Ubuntu image
fr: Exemple: image Ubuntu
ja: 例: Ubuntu イメージ

source: This example installs a Ubuntu 14.04 (Trusty Tahr) image. To create an image for a different version of Ubuntu, follow these steps with the noted differences.
fr: Cet exemple installe une image Ubuntu 14.04 (Trusty Tahr). Pour créer une image pour une version différente d'ubuntu, suivez ces étapes en prenant garde aux différences portées à votre attention.
ja: この例は、Ubuntu 14.04 (Trusty Tahr) イメージをインストールします。別のバージョンの Ubuntu イメージを作成する場合、注記した差分の手順を実行してください。

source: Download an Ubuntu install ISO
fr: Téléchargement d'un ISO d'installation Ubuntu
ja: Ubuntu インストール ISO のダウンロード

source: Because the goal is to make the smallest possible base image, this example uses the network installation ISO. The Ubuntu 64-bit 14.04 network installer ISO is at <link href="http://archive.ubuntu.com/ubuntu/dists/trusty/main/installer-amd64/current/images/netboot/mini.iso">http://archive.ubuntu.com/ubuntu/dists/trusty/main/installer-amd64/current/images/netboot/mini.iso</link>.
fr: Puisque le but est de réaliser la plus petite image de base possible, cet exemple utilise l'ISO d'installation par le réseau. L'ISO d'installation par le réseau Ubuntu 64-bits 14.04 est disponible sur <link href="http://archive.ubuntu.com/ubuntu/dists/trusty/main/installer-amd64/current/images/netboot/mini.iso">http://archive.ubuntu.com/ubuntu/dists/trusty/main/installer-amd64/current/images/netboot/mini.iso</link>.
ja: 目標は利用可能な最小のベースイメージを作成することなので、この例はネットワークインストール ISO を使用します。Ubuntu 64 ビット 14.04 ネットワークインストーラー ISO は <link href="http://archive.ubuntu.com/ubuntu/dists/trusty/main/installer-amd64/current/images/netboot/mini.iso">http://archive.ubuntu.com/ubuntu/dists/trusty/main/installer-amd64/current/images/netboot/mini.iso</link> にあります。

source: Start the install process
fr: Commencer le processus d'installation
ja: インストールプロセスの開始

source: Start the installation process by using either <placeholder-1/> or <placeholder-2/> as described in the previous section. If you use <placeholder-3/>, do not forget to connect your VNC client to the virtual machine.
fr: Commencez le processus d'installation en utilisant soit <placeholder-1/> ou <placeholder-2/> comme décrit dans la section précédente. Si vous utilisez <placeholder-3/>, n'oubliez pas de connecter votre client VNC à la machine virtuelle.
ja: 前のセクションに記載されている <placeholder-1/> や <placeholder-2/> を使用して、インストールプロセスを開始します。<placeholder-3/> を使用する場合、VNC クライアントを仮想マシンに接続し忘れないでください。

source: Assume that the name of your virtual machine image is <literal>ubuntu-14.04</literal>, which you need to know when you use <placeholder-1/> commands to manipulate the state of the image.
fr: En considérant que le nom de votre image de machine virtuelle est <literal>ubuntu-14.04</literal>, et qu'il vous est nécessaire de connaitre lorsque vous utilisez les commandes <placeholder-1/> pour manipuler l'état de l'image.
ja: 仮想マシンイメージの名前が <literal>ubuntu-14.04</literal> であると仮定します。これは、イメージを操作するために <placeholder-1/> コマンドを使用する際に、知っている必要があります。

source: If you are using <placeholder-1/>, the commands should look something like this:
fr: Si vous utilisez <placeholder-1/>, les commandes devraient ressembler à quelque chose comme ça:
ja: <placeholder-1/> を使用している場合、このコマンドは以下のようになるでしょう。

source: Step through the install
fr: Accomplir les étapes d'installation
ja: インストールのステップ実行

source: At the initial Installer boot menu, choose the <guilabel>Install</guilabel> option. Step through the install prompts, the defaults should be fine.
fr: Lorsque le menu initial de l'installeur apparaît, choisissez l'option <guilabel>Installer</guilabel>. Complétez les informations demandées lors des étapes d'installation, les choix par défaut devraient convenir.
ja: インストーラーの初期ブートメニューで、<guilabel>Install</guilabel> を選択します。インストールのプロンプトを一つずつ実行します。デフォルトのままが良いでしょう。

source: The installer may ask you to choose a hostname. The default (<literal>ubuntu</literal>) is fine. We will install the cloud-init package later, which will set the hostname on boot when a new instance is provisioned using this image.
fr: L'installeur peut vous demander de choisir un nom d'hôte. Le nom par défaut (<literal>ubuntu</literal>) convient. Nous installerons le package cloud-init plus tard, qui configurera le nom d'hôte au boot lorsqu'une nouvelle instance utilisant cette image est provisionnée.
ja: インストーラーがホスト名を聞いてくるかもしれません。デフォルトの <literal>ubuntu</literal> が良いでしょう。後から cloud-init パッケージをインストールします。これは、このイメージを使用して、新しいインスタンスを展開する際、ブート時にホスト名を設定します。

source: Select a mirror
fr: Sélection d'un miroir
ja: ミラーの選択

source: The default mirror proposed by the installer should be fine.
fr: Le miroir par défaut proposé par l'installeur devrait convenir.
ja: インストーラーにより提案されるデフォルトのミラーが良いでしょう。

source: Step through the install, using the default options. When prompted for a user name, the default (<systemitem class="username">ubuntu</systemitem>) is fine.
fr: Effectuez les étapes d'installation, en utilisant les options par défaut. Lorsqu'un nom d'utilisateur sera demandé, le nom par défaut (<systemitem class="username">ubuntu</systemitem>) est correct.
ja: デフォルトのオプションを使用して、インストールを進めます。ユーザー名を聞かれた際、デフォルトの <systemitem class="username">ubuntu</systemitem> が良いでしょう。

source: There are different options for partitioning the disks. The default installation will use LVM partitions, and will create three partitions (<filename>/boot</filename>, <filename>/</filename>, swap), and this will work fine. Alternatively, you may wish to create a single ext4 partition, mounted to "<literal>/</literal>", should also work fine.
fr: Il y a différentes options pour partitionner les disques. L'installation par défaut utilise des partitions LVM, et va créer trois partitions (<filename>/boot</filename>, <filename>/</filename>, swap), et cela conviendra parfaitement. Alternativement, vous pouvez choisir de créer une unique partition ext4, montée sur "<literal>/</literal>", et cela devrait convenir aussi.
ja: ディスクのパーティションは、さまざまな選択肢があります。デフォルトは、うまく動作する LVM パーティションを使用し、3 つのパーティション (<filename>/boot</filename>、<filename>/</filename>、swap) を作成します。この代わりに、単一の ext4 パーティション を作成し、<literal>/</literal> にマウントすることもうまく動作するでしょう。

source: If unsure, we recommend you use the installer's default partition scheme, since there is no clear advantage to one scheme or another.
fr: Si vous n'êtes pas sûr, nous vous recommandons d'utiliser le schéma de partitionnement par défaut proposé par l'installeur, puisqu'il n'y a pas d'avantage clair à choisir un schéma par rapport à un autre.
ja: よくわからない場合、インストーラーのデフォルトのパーティション構成を使用することを推奨します。別の構成にする明確な利点がないためです。

source: Automatic updates
fr: Mises à jour automatiques
ja: 自動更新

source: The Ubuntu installer will ask how you want to manage upgrades on your system. This option depends on your specific use case. If your virtual machine instances will be connected to the Internet, we recommend "Install security updates automatically".
fr: L'installeur Ubuntu vous demandera comment vous souhaitez gérer les mises à jour sur votre système. Cette option dépend de votre cas spécifique d'utilisation. Si vos instances de machines virtuelles seront reliées à Internet, nous recommandons l'option "Installer les mises à jour de sécurité automatiquement".
ja: Ubuntu のインストーラーは、お使いのシステムのアップグレードを管理する方法を確認してきます。この選択肢は具体的なユースケースにより決まります。仮想マシンインスタンスがインターネットに接続される場合、「Install security updates automatically」(セキュリティ更新を自動的にインストール) を推奨します。

source: Software selection: OpenSSH server
fr: Sélection logicielle: serveur OpenSSH
ja: ソフトウェア選択: OpenSSH サーバー

source: Choose "OpenSSH server"so that you will be able to SSH into the virtual machine when it launches inside of an OpenStack cloud.
fr: Choisissez "Serveur OpenSSH" afin que vous soyez en mesure de faire un SSH sur la machine virtuelle lorsqu'elle est lancée à l'intérieur d'un cloud OpenStack.
ja: OpenStack クラウド内で起動したときに、仮想マシン内に SSH できるよう、「OpenSSH server」を選択します。

source: Install GRUB boot loader
fr: Installer le chargeur de démarrage GRUB
ja: GRUB ブートローダーのインストール

source: Select "Yes" when asked about installing the GRUB boot loader to the master boot record.
fr: Sélectionnez "Oui" lorsque vous serez interrogé à propos de l'installation du chargeur de démarrage GRUB dans le master boot record (MBR).
ja: GRUB ブートローダーをマスターブートレコードにインストールするかを確認された際、「Yes」を選択します。

source: Select the defaults for all of the remaining options. When the installation is complete, you will be prompted to remove the CD-ROM.
fr: Sélectionnez les réglages par défaut pour toutes les autres options. Lorsque l'installation est terminée, il vous sera demandé d'enlever le CD-ROM.
ja: 残りのオプションは、すべてデフォルトを選択します。インストール完了時、CD-ROM を取り出すようプロンプトが表示されます。

source: When you hit "Continue" the virtual machine will shut down, even though it says it will reboot.
fr: Lorsque vous cliquez sur "Continuer" la machine virtuelle va s'arrêter, même si elle indique qu'elle va rebooter.
ja: 「続行」を選択すると、仮想マシンがシャットダウンし、再起動してきます。
