Repository: 25hours/openstack-manuals
Catalog: doc/image-guide/locale/*.po
Languages: fr, ja

source: To eject a disk using <placeholder-1/>, libvirt requires that you attach an empty disk at the same target that the CDROM was previously attached, which should be <literal>hdc</literal>. You can confirm the appropriate target using the <placeholder-2/> command.
fr: Pour éjecter un disque en utilisant <placeholder-1/>, libvirt a besoin que vous attachiez un disque vide sur la même cible à laquelle le CDROM était attaché auparavant, et qui devrait être <literal>hdc</literal>. Vous pouvez confirmer la cible appropriée en utilisant la commande <placeholder-2/>.
ja: <placeholder-1/> を使用して、ディスクを取り出すために、CD-ROM が前に接続されていた場所と同じ場所に、libvirt が空のディスクを接続する必要があります。この場所は、<literal>hdc</literal> でしょう。<placeholder-2/> コマンドを使用して、適切な接続先を確認できます。

source: Run the following commands in the host as root to start up the machine again as paused, eject the disk and resume. If you are using virt-manager, you may use the GUI instead.
fr: Lancez les commandes suivantes dans l'hôte en tant que root pour démarrer la machine une fois de plus une fois mise en pause, éjectez le disque et réveillez-la. Si vous utilisez virt-manager, vous pouvez utiliser l'interface utilisateur graphique à la place.
ja: ホストで root として以下のコマンドを実行して、マシンを一時停止し、ディスクを取り出し、再開します。仮想マシンマネージャーを使用している場合、代わりに GUI を使用することもできます。

source: In the previous example, you paused the instance paused, ejected the disk, and unpaused the instance. In theory, you could have ejected the disk at the <guilabel>Installation complete</guilabel> screen. However, our testing indicates that the Ubuntu installer locks the drive so that it cannot be ejected at that point.
fr: Dans l'exemple précédent, vous avez mis l'instance en pause, éjecté le disque, et réveillé l'instance. En théorie, vous pourriez avoir éjecté le disque lorsque l'écran <guilabel>Installation terminée</guilabel> est apparu. Cependant, nos tests indiquent que l'installeur Ubuntu bloque le lecteur empêchant ainsi l'éjection du disque à ce point.
ja: 前の例では、インスタンスを一時停止した状態で起動し、ディスクを取り出し、インスタンスを再開します。理論的には、<guilabel>Installation complete</guilabel> 画面でディスクを取り出せます。しかしながら、私たりのテストでは、Ubuntu インストーラーが、その時点で取り出せないように、ドライブをロックしていました。

source: When you boot for the first time after install, it may ask you about authentication tools, you can just choose 'Exit'. Then, log in as root using the root password you specified.
fr: Lorsque vous bootez pour la première fois après l'installation, des outils d'authentification peuvent vous demander certaines configurations, mais vous pouvez juste choisir 'Sortir'. Ensuite, loguez-vous en tant que root en utilisant le mot de passe root que vous avez spécifié.
ja: インストール後に初めて起動するとき、認証ツールに関するプロンプトが表示されるかもしれませんが、そのまま「Exit」を選択します。そして、指定した root のパスワードを使用して、root としてログインします。

source: Install cloud-init
fr: Installation de cloud-init
ja: cloud-init のインストール

source: The <placeholder-1/> script starts on instance boot and will search for a metadata provider to fetch a public key from. The public key will be placed in the default user account for the image.
fr: Le script <placeholder-1/> démarre lors du boot de l'instance et va chercher un fournisseur de métadonnées à partir duquel prendre une clé publique. La clé publique sera placée dans le compte utilisateur par défaut pour l'image.
ja: <placeholder-1/> スクリプトは、インスタンス起動時に起動し、メタデータサービスプロバイダーから公開鍵を取得するために、それを検索します。公開鍵は、イメージのデフォルトユーザーアカウントに置かれます。

source: Install the <package>cloud-init</package> package:
fr: Installation du package <package>cloud-init</package>:
ja: <package>cloud-init</package> パッケージをインストールします。

source: When building Ubuntu images <placeholder-1/> must be explicitly configured for the metadata source in use. The OpenStack metadata server emulates the EC2 metadata service used by images in Amazon EC2.
fr: Lorsque des images Ubuntu sont construites <placeholder-1/> doit être explicitement configuré pour la source de métadonnées utilisée. Le serveur de métadonnées OpenStack émule le service de métadonnées EC2 utilisé par les images dans Amazon EC2.
ja: Ubuntu イメージの構築時、<placeholder-1/> が使用するメタデータのソースを明示的に設定する必要があります。OpenStack メタデータサーバーは、Amazon EC2 のイメージにより使用される EC2 メタデータサービスを真似ています。

source: To set the metadata source to be used by the image run the <placeholder-1/> command against the <package>cloud-init</package> package. When prompted select the <literal>EC2</literal> data source:
fr: Pour configurer la source de métadonnées que l'image doit utiliser lancez la commande <placeholder-1/> contre le package <package>cloud-init</package>. Lorsque cela vous sera demandé, sélectionnez la source de données <literal>EC2</literal>:
ja: イメージにより使用されるメタデータのソースを設定するために、<package>cloud-init</package> パッケージに対して <placeholder-1/> コマンドを実行します。プロンプトの表示時、<literal>EC2</literal> データソースを選択します。

source: The account varies by distribution. On Ubuntu-based virtual machines, the account is called "ubuntu". On Fedora-based virtual machines, the account is called "ec2-user".
fr: Le compte varie par distribution. Sur des machines virtuelles basées sur Ubuntu, le compte est dénommé "ubuntu". Sur des machines virtuelles basées sur Fedora, le compte est dénommé "ec2-user".
ja: アカウントは、ディストリビューションにより異なります。Ubuntu 系の仮想マシンでは、アカウントが「ubuntu」という名前です。Fedora 系の仮想マシンでは、アカウントが「ec2-user」という名前です。

source: You can change the name of the account used by cloud-init by editing the <filename>/etc/cloud/cloud.cfg</filename> file and adding a line with a different user. For example, to configure cloud-init to put the key in an account named "admin", edit the config file so it has the line:
fr: Vous pouvez modifier le nom du compte utilisé par cloud-init en éditant le fichier <filename>/etc/cloud/cloud.cfg</filename> pour y ajouter une ligne avec un utilisateur différent. Par exemple, pour configurer cloud-init afin qu'il mette la clé dans un compte dénommé "admin", éditez le fichier de configuration afin qu'il comporte la ligne:
ja: <filename>/etc/cloud/cloud.cfg</filename> ファイルを編集し、別のユーザー名を書いた行を追加して、cloud-init により使用されるアカウント名を変更できます。例えば、「admin」という名前のアカウントに SSH 鍵を置くよう cloud-init を設定する場合、次の行のように設定ファイルを編集します。

source: The operating system records the MAC address of the virtual Ethernet card in locations such as <filename>/etc/udev/rules.d/70-persistent-net.rules</filename> during the instance process. However, each time the image boots up, the virtual Ethernet card will have a different MAC address, so this information must be deleted from the configuration file.
fr: Le système d'exploitation enregistre l'adresse MAC de la carte Ethernet virtuelle dans <filename>/etc/udev/rules.d/70-persistent-net.rules</filename> durant l'instance de processus. Cependant, à chaque démarrage de l'image, la carte Ethernet virtuelle aura une adresse MAC différente, alors cette information devra être supprimer du fichier configuration.
ja: オペレーティングシステムは、インストール中に仮想ネットワークカードの MAC アドレスを <filename>/etc/sysconfig/network-scripts/ifcfg-eth0</filename> などの場所に記録します。しかしながら、イメージが起動するたびに、仮想ネットワークカードは別の MAC アドレスになります。そのため、この情報は設定ファイルから削除する必要があります。

source: Now that the image is ready to be uploaded to the Image Service, you no longer need to have this virtual machine image managed by libvirt. Use the <placeholder-1/> command to inform libvirt:
fr: Maintenant que l'image est prête à être téléchargée dans le Service d'Image, il n'est plus nécessaire que cette image de machine virtuelle soit gérée par libvirt. Utilisez la commande <placeholder-1/> pour informer libvirt:
ja: これでイメージを Image Service にアップロードする準備ができました。もうこの仮想マシンイメージを libvirt により管理する必要がありません。<placeholder-1/> コマンドを使用して、libvirt に通知します。

source: The underlying image file that you created with <placeholder-1/>, such as <filename>/tmp/trusty.qcow2</filename>, is now ready for uploading to the OpenStack Image Service.
fr: Le fichier image que vous avez créé avec <placeholder-1/>, comme <filename>/tmp/trusty.qcow2</filename>, est maintenant prêt pour être envoyé au Service d'Image OpenStack.
ja: <filename>/tmp/trusty.qcow2</filename> のような、<placeholder-1/> を用いて作成したイメージファイルは、これで OpenStack Image Service にアップロードする準備ができました。

source: Image metadata
ja: イメージメタデータ

source: Image metadata can help end users determine the nature of an image, and is used by associated OpenStack components and drivers which interface with the Image Service.
fr: Les métadonnées d'Image peuvent aider les utilisateurs finaux à déterminer la nature de l'image, et sont utilisées par des composants d'OpenStack associés et des drivers qui s’interfacent avec le Service d'Image.
ja: イメージメタデータは、エンドユーザーがイメージの原型を判断する手助けになります。また、Image Service とやりとりする、関連する OpenStack コンポーネントやドライバーにより使用されます。

source: Metadata can also determine the scheduling of hosts. If the <option>property</option> option is set on an image, and Compute is configured so that the <systemitem>ImagePropertiesFilter</systemitem> scheduler filter is enabled (default), then the scheduler only considers compute hosts that satisfy that property.
fr: Les métadonnées peuvent aussi déterminer l'ordonnancement des hôtes. Si l'option <option>property</option> est réglée sur une image, et que Compute est configuré de manière à ce que le filtre d'ordonnancement <systemitem>ImagePropertiesFilter</systemitem> soit activé (par défaut), alors l'ordonnanceur considère seulement les hôtes de calcul qui satisfont cette propriété.
ja: メタデータは、ホストのスケジューリングも決められます。<option>property</option> オプションがイメージに設定されていて、<systemitem>ImagePropertiesFilter</systemitem> スケジューラーが有効 (デフォルト) になるよう Compute が設定されている場合、スケジューラーはプロパティーを満たすコンピュートホストのみを考慮します。

source: Compute's <systemitem>ImagePropertiesFilter</systemitem> value is specified in the <option>scheduler_default_filter</option> value in the <filename>/etc/nova/nova.conf</filename> file.
fr: La valeur de calcul <systemitem>ImagePropertiesFilter</systemitem> est spécifiée dans la valeur <option>scheduler_default_filter</option> du fichier <filename>/etc/nova/nova.conf</filename>.
ja: Compute の <systemitem>ImagePropertiesFilter</systemitem> 値は、<filename>/etc/nova/nova.conf</filename> ファイルの <option>scheduler_default_filter</option> 値に指定されます。

source: You can add metadata to Image Service images by using the <parameter>--property <replaceable>key</replaceable>=<replaceable>value</replaceable></parameter> option with the <placeholder-1/> or <placeholder-2/> command. More than one property can be specified. For example:
fr: Vous pouvez ajouter des métadonnées aux images du Service Image en utilisant l'option <parameter>--property <replaceable>key</replaceable>=<replaceable>value</replaceable></parameter> avec la commande <placeholder-1/> ou <placeholder-2/>. Plusieurs propriétés peuvent être spécifiées. Par exemple :
ja: <placeholder-1/> や <placeholder-2/> コマンドに <parameter>--property <replaceable>key</replaceable>=<replaceable>value</replaceable></parameter> オプションを使用することにより、Image Service のイメージにメタデータを追加できます。複数のプロパティを指定できます。例:

source: Common image properties are also specified in the <filename>/etc/glance/schema-image.json</filename> file. For a complete list of valid property keys and values, refer to the <link href="http://docs.openstack.org/cli-reference/content/chapter_cli-glance-property.html"><citetitle>OpenStack Command-Line Reference</citetitle></link>.
fr: Les propriétés d'image courantes sont aussi configurées dans le fichier <filename>/etc/glance/schema-image.json</filename>. Pour une liste complète des clés et valeurs de propriété valides, reportez-vous au document <link href="http://docs.openstack.org/cli-reference/content/chapter_cli-glance-property.html"><citetitle>Référence de la ligne de Commande OpenStack</citetitle></link>.
ja: イメージの共通のプロパティも <filename>/etc/glance/schema-image.json</filename> ファイルに指定されます。有効なキーと値の一覧は、<link href="http://docs.openstack.org/cli-reference/content/chapter_cli-glance-property.html"><citetitle>OpenStack コマンドラインリファレンス</citetitle></link>を参照してください。

source: All associated properties for an image can be displayed using the <placeholder-1/> command. For example:
fr: Toutes les propriétés associées pour une image peuvent être affichées en utilisant la commande <placeholder-1/>. Par exemple:
ja: すべての関連するイメージのプロパティーは、<placeholder-1/> コマンドを使用して表示できます。例:

source: Volume-from-Image properties
ja: Volume-from-Image プロパティ

source: When creating Block Storage volumes from images, also consider your configured image properties. If you alter the core image properties, you should also update your Block Storage configuration. Amend <option>glance_core_properties</option> in the <filename>/etc/cinder/cinder.conf</filename> file on all controller nodes to match the core properties you have set in the Image service.
ja: Block Storage のボリュームをイメージから作成した場合、イメージのプロパティを設定することを考慮します。イメージの主要プロパティを変更する場合、Block Storage の設定も更新すべきです。すべてのコントローラーノードで <filename>/etc/cinder/cinder.conf</filename> ファイルの <option>glance_core_properties</option> を修正して、Image Service に設定した主要プロパティを一致させます。

source: OpenStack Linux image requirements
fr: Pré-requis pour image Linux OpenStack
ja: OpenStack の Linux イメージ要件

source: For a Linux-based image to have full functionality in an OpenStack Compute cloud, there are a few requirements. For some of these, you can fulfill the requirement by installing the <link href="https://cloudinit.readthedocs.org/en/latest/"><package>cloud-init</package></link> package. Read this section before you create your own image to be sure that the image supports the OpenStack features that you plan to use.
fr: Afin qu'une image basée sur Linux puisse bénéficier de toutes les fonctionnalités dans un cloud de Calcul OpenStack, il y a quelques pré-requis à satisfaire. Pour certain d'entre eux, vous pouvez satisfaire ces pré-requis en installant le package <link href="https://cloudinit.readthedocs.org/en/latest/"><package>cloud-init</package></link>. Lisez cette section avant de créer votre propre image afin d'être certain que l'image supporte les fonctionnalités OpenStack que vous comptez utiliser.
ja: Linux イメージが OpenStack クラウドで全機能を利用する場合、いくつかの要件があります。これらのいくつかは、<link href="https://cloudinit.readthedocs.org/en/latest/"><package>cloud-init</package></link> をインストールすることにより、要件を満たせます。イメージを作成する前に、使用する OpenStack の機能をイメージがきちんとサポートするために、このセクションを確認してください。

source: Disk partitions and resize root partition on boot (<package>cloud-init</package>)
fr: Partitions disque et redimensionnement de la partition racine lors du boot (<package>cloud-init</package>)
ja: 起動時のディスクパーティション設定およびルートパーティションのサイズ変更 (<package>cloud-init</package>)

source: No hard-coded MAC address information
fr: Aucune information d'adresse MAC codée en dur
ja: MAC アドレス情報の組み込みなし

source: SSH server running
fr: Serveur SSH en fonctionnement
ja: SSH サーバーの実行

source: Disable firewall
fr: Firewall désactivé
ja: ファイアウォールの無効化

source: Access instance using ssh public key (<package>cloud-init</package>)
fr: Accès à l'instance en utilisant une clé ssh publique (<package>cloud-init</package>)
ja: SSH 公開鍵を使用したインスタンスへのアクセス (<package>cloud-init</package>)

source: Process user data and other metadata (<package>cloud-init</package>)
fr: Traitement des données utilisateur et autres métadonnées (<package>cloud-init</package>)
ja: ユーザーデータと他のメタデータの処理 (<package>cloud-init</package>)

source: Paravirtualized Xen support in Linux kernel (Xen hypervisor only with Linux kernel version &lt; 3.0)
fr: Support para-virtualisé Xen dans le kernel Linux (hyperviseur Xen seulement à partir des versions &lt; 3.0 du kernel Linux)
ja: Linux カーネルの準仮想化 Xen サポート (Linux カーネルバージョン &lt; 3.0 の Xen ハイパーバイザーのみ)

source: Disk partitions and resize root partition on boot (cloud-init)
fr: Partitions disque et redimensionnement de la partition racine au boot (cloud-init)
ja: 起動時のディスクパーティション設定およびルートパーティションのサイズ変更 (cloud-init)

source: When you create a Linux image, you must decide how to partition the disks. The choice of partition method can affect the resizing functionality, as described in the following sections.
fr: Lorsque vous créez une image Linux, vous devez décider comment partitionner les disques. Le choix d'une méthode de partitionnement peut affecter la fonctionnalité de redimensionnement, comme décrit dans les sections suivantes.
ja: Linux イメージの作成時、ディスクをパーティション化する方法を決める必要があります。パーティション方法の選択により、以下のセクションに記載されているとおり、リサイズ機能に影響を与える可能性があります。

source: The size of the disk in a virtual machine image is determined when you initially create the image. However, OpenStack lets you launch instances with different size drives by specifying different flavors. For example, if your image was created with a 5GB disk, and you launch an instance with a flavor of m1.small. The resulting virtual machine instance has, by default, a primary disk size of 10GB. When the disk for an instance is resized up, zeros are just added to the end.
fr: La taille d'un disque dans une image de machine virtuelle est déterminées lorsque vous créez l'image initialement. Cependant, OpenStack vous laisse la liberté de lancer les instances avec des lecteurs de tailles différentes en indiquant différentes branches. Par exemple, si votre image a été créée avec un disque de 5 Go, et que vous lancez une instance avec la branche m1.small. L'instance de machine virtuelle résultante a, par défaut, un disque primaire d'une taille de 10 Go. Lorsque le disque d'une instance est agrandit, des zéros sont juste ajoutés à la fin.
ja: 仮想マシンイメージのディスク容量は、イメージの初期作成時に決められます。しかしながら、OpenStack により、別のフレーバーを指定して、インスタンスを別の容量で起動できます。例えば、イメージが 5GB ディスクで作成し、インスタンスを m1.small のフレーバーで起動した場合、仮想マシンインスタンスはデフォルトで 10GB の主ディスクを持ちます。インスタンスのディスクが容量拡張された場合、単に最後に 0 が書き込まれます。

source: Your image must be able to resize its partitions on boot to match the size requested by the user. Otherwise, after the instance boots, you must manually resize the partitions to access the additional storage to which you have access when the disk size associated with the flavor exceeds the disk size with which your image was created.
fr: Votre image doit être capable de redimensionner ses partitions au boot pour correspondre à la taille requise par l'utilisateur. Autrement, une fois que l'instance démarre, vous devez redimensionner manuellement les partitions pour accéder à l'espace de stockage supplémentaire auquel vous avez accès lorsque la taille du disque associé avec la branche excède la taille disque avec laquelle votre image a été créée.
ja: イメージは、ユーザーにより要求された容量になるよう、起動時にパーティションをリサイズできる必要があります。そうでなければ、インスタンスのディスク容量がイメージ作成時のディスク容量を超えるフレーバーと関連づけられている場合、インスタンスの起動後、追加のストレージにアクセスできるよう、手動でリサイズする必要があります。

source: Xen: 1 ext3/ext4 partition (no LVM, no /boot, no swap)
fr: Xen: 1 partition ext3/ext4 (pas de LVM, pas de /boot, pas de swap)
ja: Xen: 1 ext3/ext4 パーティション (LVM なし、/boot なし、swap なし)

source: If you use the OpenStack XenAPI driver, the Compute service automatically adjusts the partition and file system for your instance on boot. Automatic resize occurs if the following conditions are all true:
fr: Si vous utilisez le driver XenAPI OpenStack, le service de calcul ajuste automatiquement la partition et le système de fichier pour votre instance au démarrage. Un redimensionnement automatique survient si les conditions suivantes sont toutes remplies:
ja: OpenStack XenAPI ドライバーを使用する場合、Compute のサービスは、インスタンスの起動時にパーティションとファイルシステムを自動的に調整します。以下の条件がすべて満たされる場合、自動リサイズが実行されます。

source: <literal>auto_disk_config=True</literal> is set as a property on the image in the image registry.
fr: <literal>auto_disk_config=True</literal> est configuré en tant que propriété sur l'image dans le registre d'image.
ja: <literal>auto_disk_config=True</literal> が、イメージレジストリーにあるイメージのプロパティとして設定されている。

source: The disk on the image has only one partition.
fr: Le disque sur l'image possède seulement une partition.
ja: イメージのディスクが 1 つのパーティションを持ちます。

source: The file system on the one partition is ext3 or ext4.
fr: Le système de fichiers sur cette partition est ext3 ou ext4.
ja: 1 つのパーティションのファイルシステムが ext3 または ext4 です。

source: Therefore, if you use Xen, we recommend that when you create your images, you create a single ext3 or ext4 partition (not managed by LVM). Otherwise, read on.
fr: C'est pourquoi, si vous utilisez Xen, nous recommandons lors de la création de vos images, de créer une unique partition ext3 ou ext4 (non gérée par LVM). Dans le cas contraire, continuez à lire.
ja: そのため、Xen を使用する場合、イメージの作成時に、(LVM により管理されていない) ext3 / ext4 パーティションを作成することを推奨します。それ以外の場合、このまま読み進んでください。

source: Non-Xen with cloud-init/cloud-tools: One ext3/ext4 partition (no LVM, no /boot, no swap)
fr: Non Xen avec cloud-init/cloud-tools: une partition ext3/ext4 (pas de LVM, pas de /boot, pas de swap)
ja: cloud-init/cloud-tools ありの非 Xen : 1 つの ext3/ext4 パーティション (LVM なし、/boot なし、swap なし)

source: You must configure these items for your image:
fr: Vous devez configurer ces éléments pour votre image:
ja: イメージのこれらの項目を設定する必要があります。

source: The partition table for the image describes the original size of the image
fr: La table de partitions pour l'image décrit la taille originale de l'image
ja: イメージのパーティションテーブルは、イメージの元々の容量を記載しています。

source: The file system for the image fills the original size of the image
fr: Le système de fichiers pour l'image occupe toute la taille originale de l'image
ja: イメージのファイルシステムは、イメージの元々の容量になっています。

source: Then, during the boot process, you must:
fr: Ensuite, durant le processus de démarrage, vous devez:
ja: そして、ブート中に以下を実行する必要があります。

source: Modify the partition table to make it aware of the additional space:
fr: Modifier la table de partitions pour qu'elle ait connaissance de l'espace additionnel:
ja: 追加領域を認識させるためにパーティションテーブルを変更します。

source: If you do not use LVM, you must modify the table to extend the existing root partition to encompass this additional space.
fr: Si vous n'utilisez pas LVM, vous devez modifier la table afin d'étendre la partition racine existante pour inclure cet espace supplémentaire.
ja: LVM を使用してない場合、既存のルートパーティションをこの追加領域を含むまで拡張するために、テーブルを変更する必要があります。

source: If you use LVM, you can add a new LVM entry to the partition table, create a new LVM physical volume, add it to the volume group, and extend the logical partition with the root volume.
fr: Si vous utilisez LVM, vous pouvez ajouter une nouvelle entrée LVM à la table de partitions, créer un nouveau volume physique LVM, l'ajouter au groupe de volumes, et étendre la partition logique avec le volume racine.
ja: LVM を使用している場合、新規 LVM 項目をパーティションテーブルに追加し、新規 LVM 物理ボリュームを作成し、それをボリュームグループに追加し、ルートボリュームの論理パーティションを拡張できます。

source: Resize the root volume file system.
fr: Redimensionner le système de fichiers du volume racine.
ja: ルートボリュームのファイルシステムをリサイズします。

source: The simplest way to support this is to install in your image the:
ja: これをサポートするための最も簡単な方法は、イメージに以下をインストールすることです。

source: <link href="https://launchpad.net/cloud-utils">cloud-utils</link> package, which contains the <placeholder-1/> tool for extending partitions.
ja: <link href="https://launchpad.net/cloud-utils">cloud-utils</link> パッケージ。パーティションを拡張するための <placeholder-1/> ツールを含みます。

source: <link href="https://launchpad.net/cloud-initramfs-tools">cloud-initramfs-growroot</link> package for Ubuntu, Debian and Fedora, which supports resizing root partition on the first boot.
ja: Ubuntu、Debian、Fedora の場合、<link href="https://launchpad.net/cloud-initramfs-tools">cloud-initramfs-growroot</link> パッケージ。最初に起動するルートパーティションの容量を変更できます。

source: <package>cloud-initramfs-growroot</package> package for Centos and RHEL.
ja: CentOS、RHEL の場合、<package>cloud-initramfs-growroot</package> パッケージ。

source: <link href="https://launchpad.net/cloud-init">cloud-init</link> package.
ja: <link href="https://launchpad.net/cloud-init">cloud-init</link> パッケージ。
