Repository: 25hours/openstack-manuals
Catalog: doc/image-guide/locale/*.po
Languages: fr, ja

source: <literal>space</literal>. Storage is fully allocated at instance start. The <literal>$instance_dir/</literal> images are <link href="http://www.kernel.org/doc/man-pages/online/pages/man2/fallocate.2.html">fallocate</link>d to immediately determine if enough space is available, and to possibly improve VM I/O performance due to ongoing allocation avoidance, and better locality of block allocations.
fr: <literal>space</literal>. Le stockage est pleinement alloué au démarrage de l'instance. Les images <literal>$instance_dir/</literal> sont allouées avec <link href="http://www.kernel.org/doc/man-pages/online/pages/man2/fallocate.2.html">fallocate</link> pour déterminer si suffisamment d'espace est disponible, et pour tenter d'améliorer les performances I/O de la VM en raison de la couverture d'allocation en cours, et pour une meilleur distribution des allocations de bloc.
ja: <literal>space</literal>。ストレージはインスタンスの起動時に完全に割り当てられます。<literal>$instance_dir/</literal> のイメージが <link href="http://www.kernel.org/doc/man-pages/online/pages/man2/fallocate.2.html">fallocate</link> され、十分な空き領域が利用できるかをすぐに判断します。また、動作中の割り当てを避け、ブロック割り当てのより良い局所性により、仮想マシン I/O パフォーマンスを改善するでしょう。

source: (BoolOpt) Should unused base images be removed? When set to True, the interval at which base images are removed are set with the following two settings. If set to False base images are never removed by Compute.
fr: (BoolOpt) Est-ce que les images de base inutilisées doivent être enlevées? Lorsque configuré à True, l'intervalle auquel les images de base sont enlevées est configuré avec les deux réglages suivant. Si configuré à False les images de base ne sont jamais enlevées par Compute.
ja: (論理型) 未使用のイメージが削除されるかどうかです。True (真) に設定した場合、ベースイメージが削除される間隔は、以下の 2 つの設定で設定されます。False (偽) に設定した場合、ベースイメージは Compute により削除されません。

source: (IntOpt) Unused unresized base images younger than this are not removed. Default is 86400 seconds, or 24 hours.
fr: (IntOpt) Les images de base non redimensionnées inutilisées plus récentes que celle-ci ne sont pas enlevées. Par défaut, réglé sur 86400 seconds, soit 24 heures.
ja: (整数型) この時間内は、未使用かつ容量変更のないベースイメージが削除されません。デフォルトは 86400 秒 (24 時間) です。

source: (IntOpt) Unused resized base images younger than this are not removed. Default is 3600 seconds, or one hour.
fr: (IntOpt) Les images de base non redimensionnées inutilisées plus récentes que celle-ci sont enlevées. Par défaut, réglé sur 3600 seconds, soit 1 heure.
ja: (整数型) この時間内は、未使用かつ容量変更のあるベースイメージが削除されません。デフォルトは 3600 秒 (1 時間) です。

source: To see how the settings affect the deletion of a running instance, check the directory where the images are stored:
fr: Pour voir comment les réglages affectent la suppression d'une instance en cours de fonctionnement, vérifiez le dossier où les images sont stockées:
ja: この設定が、稼働中のインスタンスの削除にどのような影響を与えるかを確認する場合、イメージが保存されているディレクトリを確認してください。

source: In the <filename>/var/log/compute/compute.log</filename> file, look for the identifier:
fr: Dans le fichier <filename>/var/log/compute/compute.log</filename>, recherchez l'identifiant:
ja: <filename>/var/log/compute/compute.log</filename> ファイルで識別子を検索します。

source: Because 86400 seconds (24 hours) is the default time for <literal>remove_unused_original_minimum_age_seconds</literal>, you can either wait for that time interval to see the base image removed, or set the value to a shorter time period in <filename>nova.conf</filename>. Restart all nova services after changing a setting in <filename>nova.conf</filename>.
fr: Puisque 86400 secondes (24 heuhres) est le temps par défaut pour <literal>remove_unused_original_minimum_age_seconds</literal>, vous pouvez soit attendre pour que l'image de base soit enlevée à l'issue de cet intervalle de temps, soit régler cette valeur à un intervalle de temps plus court dans <filename>nova.conf</filename>. Redémarrez tous les services nova après avoir modifié un réglage dans <filename>nova.conf</filename>.
ja: <literal>remove_unused_original_minimum_age_seconds</literal> のデフォルト時間は 86400 秒 (24 時間) なので、ベースイメージが削除されたことを確認するために、その時間待つことができます。または、<filename>nova.conf</filename> により短い時間を設定します。<filename>nova.conf</filename> の設定を変更した後、すべての nova サービスを再起動してください。

source: Create images manually
fr: Créer des images manuellement
ja: イメージの手動作成

source: Creating a new image is a step done outside of your OpenStack installation. You create the new image manually on your own system and then upload the image to your cloud.
fr: La création d'une nouvelle image est une étape réalisée en-dehors de votre installation OpenStack. Vous créez la nouvelle image manuellement sur votre propre système et vous envoyez l'image à votre cloud.
ja: 新しいイメージの作成は、OpenStack インストール環境の外部で実行する手順です。お使いのシステムで新しいイメージを手動作成し、そのイメージをクラウドにアップロードします。

source: To create a new image, you will need the installation CD or DVD ISO file for the guest operating system. You'll also need access to a virtualization tool. You can use KVM for this. Or, if you have a GUI desktop virtualization tool (such as, VMware Fusion and VirtualBox), you can use that instead and just convert the file to raw once you're done.
fr: Pour créer une nouvelle image, vous aurez besoin du fichier ISO du CD ou du DVD d'installation pour le système d'exploitation invité. Vous aurez aussi besoin d'accéder à un outil de virtualisation. Vous pouvez utiliser KVM pour cela. Ou, si vous disposez d'un outil graphique de virtualisation de bureau (comme VMware Fusion et VirtualBox), vous pouvez l'utiliser à la place et vous contenter de convertir le fichier en raw une fois que vous êtes prêt.
ja: 新しいイメージを作成するために、ゲストオペレーティングシステムのインストール CD/DVD の ISO ファイルが必要になります。また、仮想化のツールにアクセスする必要があります。このために KVM を使用できます。または、(VMware Fusion や VirtualBox などの) GUI デスクトップ仮想化ツールを持っている場合、代わりにそれを使用し、完了後にファイルを raw に変更できます。

source: When you create a new virtual machine image, you will need to connect to the graphical console of the hypervisor, which acts as the virtual machine's display and allows you to interact with the guest operating system's installer using your keyboard and mouse. KVM can expose the graphical console using the <link href="https://en.wikipedia.org/wiki/Virtual_Network_Computing">VNC</link> (Virtual Network Computing) protocol or the newer <link href="http://spice-space.org">SPICE</link> protocol. We'll use the VNC protocol here, since you're more likely to be able to find a VNC client that works on your local desktop.
fr: Lorsque vous créez une nouvelle image de machine virtuelle, vous aurez besoin de vous connecter à la console graphique de l'hyperviseur, qui agit en tant qu'affichage graphique pour la machine virtuelle et vous permet d'interagir avec l'installeur du système d'exploitation invité en utilisant votre clavier et votre souris. KVM peut exposer la console graphique en utilisant le protocole <link href="https://en.wikipedia.org/wiki/Virtual_Network_Computing">VNC</link> (Virtual Network Computing) ou encore le nouveau protocole <link href="http://spice-space.org">SPICE</link>. Nous allons utiliser ici le protocole VNC, puisque qu'il est plus facile de trouver un client VNC qui fonctionne sur votre station locale.
ja: 新しい仮想マシンイメージの作成時、ハイパーバイザーのグラフィカルコンソールに接続する必要があります。これは、仮想マシンのディスプレイとして機能し、お使いのキーボードとマウスを使用して、ゲストオペレーティングシステムのインストーラーを操作できます。KVM は、<link href="https://en.wikipedia.org/wiki/Virtual_Network_Computing">VNC</link> (Virtual Network Computing) プロトコル、より新しい <link href="http://spice-space.org">SPICE</link> プロトコルを使用して、グラフィカルコンソールを利用できます。ここでは、お使いのデスクトップで動作する VNC クライアントを見つけやすいので、VNC プロトコルを使用します。

source: Verify the libvirt default network is running
fr: Vérifier que le réseau par défaut libvirt est en fonctionnement
ja: libvirt default ネットワークの動作確認

source: Before starting a virtual machine with libvirt, verify that the libvirt "default" network has been started. This network must be active for your virtual machine to be able to connect out to the network. Starting this network will create a Linux bridge (usually called <literal>virbr0</literal>), iptables rules, and a dnsmasq process that will serve as a DHCP server.
fr: Avant de démarrer une machine virtuelle avec libvirt, vérifiez que le réseau "default" de libvirt a été démarré. Ce réseau doit être actif pour que votre machine virtuelle soit en mesure de se connecter en-dehors du réseau. Démarrer ce réseau va créer un pont Linux (habituellement appelé <literal>virbr0</literal>), des règles iptables, et un process dnsmasq qui servira de serveur DHCP.
ja: libvirt を用いて仮想マシンを作成する前に、libvirt の「default"」ネットワークが起動していることを確認します。このネットワークは、仮想マシンが外部のネットワークに接続できるよう、有効化されている必要があります。このネットワークを起動することにより、Linux ブリッジ (通常 <literal>virbr0</literal>)、iptables ルール、DHCP サーバーとして動作する dnsmasq が作成されます。

source: To verify that the libvirt "default" network is enabled, use the <placeholder-1/> command and verify that the "default" network is active:
fr: Pour vérifier que le réseau "défaut" de libvirt soit activé, utilisez la commande <placeholder-1/> et vérifiez que le réseau "défaut" soit actif:
ja: libvirt の「default」ネットワークが有効化されていることを確認するために、<placeholder-1/> コマンドを使用して、「default」ネットワークが有効であることを確認します。

source: If the network is not active, start it by doing:
fr: Si le réseau n'est pas actif, lancez-le en faisant:
ja: ネットワークが動作していない場合、以下を実行して起動します。

source: Use the virt-manager X11 GUI
fr: Utilisation de l'interface graphique X11 virt-manager
ja: 仮想マシンマネージャー X11 GUI の使用

source: If you plan to create a virtual machine image on a machine that can run X11 applications, the simplest way to do so is to use the <placeholder-1/> GUI, which is installable as the <literal>virt-manager</literal> package on both Fedora-based and Debian-based systems. This GUI has an embedded VNC client in it that will let you view and interact with the guest's graphical console.
fr: Si vous prévoyez de créer une image de machine virtuelle sur une machine qui peut lancer des applications X11, la façon la plus simple de le faire est d'utiliser l'interface graphique <placeholder-1/>, qui est installable par le package <literal>virt-manager</literal> à la fois sur les systèmes basés sur Fedora ou Debian. Cette interface graphique possède un client VNC amélioré qui vous laissera voir et interagir avec la console graphique de l'invité.
ja: X11 アプリケーションを実行できるマシンに仮想マシンイメージを作成する予定ならば、最も簡単にそうする方法は、<placeholder-1/> GUI を使用することです。これは、Fedora 系と Debian 系のシステムにおいて、<literal>virt-manager</literal> パッケージとしてインストールできます。この GUI は、ゲストのグラフィカルコンソールを表示および操作できる、組み込みの VNC クライアントを持ちます。

source: If you are building the image on a headless server, and you have an X server on your local machine, you can launch <placeholder-1/> using ssh X11 forwarding to access the GUI. Since virt-manager interacts directly with libvirt, you typically need to be root to access it. If you can ssh directly in as root (or with a user that has permissions to interact with libvirt), do:<placeholder-2/>
fr: Si vous construisez l'image sur un serveur sans serveur graphique, et que vous avez un serveur X sur votre machine locale, vous pouvez lancer <placeholder-1/> en utilisant le transfert X11 ssh pour accéder à l'interface graphique. Puisque virt-manager interagit directement avec libvirt, il vous sera nécessaire d'être administrateur pour y accéder. Si vous pouvez vous connecter en ssh en tant que root directement (ou avec un utilisateur qui possède les permissions lui permettant d'interagir avec libvirt), faites:<placeholder-2/>
ja: コンソールの無いサーバーにイメージを構築していて、ローカルマシンに X サーバーが有る場合、GUI にアクセスするために、SSH の X11 転送を使用して <placeholder-1/> を起動できます。仮想マシンマネージャーは、libvirt と直接通信するため、アクセスするためには、一般的に root になる必要があります。root (または、libvirt と通信する権限を持つユーザー) として直接 SSH できる場合、次のとおり実行します。<placeholder-2/>

source: The <literal>-X</literal> flag passed to ssh will enable X11 forwarding over ssh. If this does not work, try replacing it with the <literal>-Y</literal> flag.
fr: Le drapeau <literal>-X</literal> passé à ssh va activer le transfert X11 au travers d'ssh. Si cela ne fonctionne pas, essayez de le remplacer par le drapeau <literal>-Y</literal>.
ja: SSH に渡す <literal>-X</literal> フラグが、SSH 経由の X11 転送を有効化します。これが動作しない場合、<literal>-Y</literal> フラグに変更してみてください。

source: If the account you use to ssh into your server does not have permissions to run libvirt, but has sudo privileges, do:<placeholder-1/><placeholder-2/>
fr: Si le compte que vous utilisez pour faire du ssh à l'intérieur de votre serveur ne dispose pas des permissions pour lancer libvirt, mais dispose par contre des privilèges sudo, faites: <placeholder-1/><placeholder-2/>
ja: サーバーに SSH するために使用するアカウントが、libvirt を実行する権限を持たず、sudo 権限を持つ場合、次のとおり実行します。<placeholder-1/><placeholder-2/>

source: Click the "New" button at the top-left and step through the instructions. <placeholder-1/>You will be shown a series of dialog boxes that will allow you to specify information about the virtual machine.
fr: Cliquez sur le bouton "Nouveau" en haut à gauche et suivez les instructions.<placeholder-1/>Il vous sera montré une série de boites de dialogue qui vous permettront d'indiquer des informations à propos de la machine virtuelle.
ja: 画面左上にある「New」ボタンをクリックし、指示にしたがって進めます。<placeholder-1/>仮想マシンに関する情報を指定できる、一連のダイアログボックスが表示されます。

source: When using qcow2 format images you should check the option 'customize before install', go to disk properties and explicitly select the qcow2 format. This ensures the virtual machine disk size will be correct.
fr: Lorsque vous utilisez des images au format qcow2 vous devriez vérifier l'option 'personnaliser avant l'installation', aller dans les propriétés du disque et explicitement sélectionner le format qcow2. Cela donne la garantie que la taille du disque de la machine virtuelle sera correcte.
ja: qcow2 形式のイメージを使用している場合、「customize before install」オプションをチェックし、ディスクのプロパティから明示的に qcow2 形式を選択すべきです。これにより、仮想マシンのディスク容量が正しくなります。

source: Use virt-install and connect by using a local VNC client
fr: Utilisation de virt-install et connexion en utilisant un client local VNC
ja: virt-install の使用とローカル VNC クライアントを用いた接続

source: If you do not wish to use virt-manager (for example, you do not want to install the dependencies on your server, you don't have an X server running locally, the X11 forwarding over SSH isn't working), you can use the <placeholder-1/> tool to boot the virtual machine through libvirt and connect to the graphical console from a VNC client installed on your local machine.
fr: Si vous ne souhaitez pas utiliser virt-manager (par exemple, vous ne voulez pas installer les dépendances sur votre serveur, vous n'avez pas de serveur X qui tourne localement, le transfert X11 à travers SSH ne fonctionne pas), vous pouvez utiliser l'outil <placeholder-1/> pour démarrer la machine virtuelle au travers de libvirt et vous connecter à la console graphique à partir d'un client VNC installé sur votre machine locale.
ja: 仮想マシンマネージャーを使用したくない場合 (例えば、サーバーに関連パッケージをインストールしたくない場合、ローカルで X サーバーを動作させていない場合、SSH の X11 転送が動作しない場合)、libvirt から仮想マシンを起動するために <placeholder-1/> ツールを利用できます。また、ローカルマシンにインストールした VNC クライアントからグラフィカルコンソールに接続できます。

source: Because VNC is a standard protocol, there are multiple clients available that implement the VNC spec, including <link href="http://sourceforge.net/apps/mediawiki/tigervnc/index.php?title=Welcome_to_TigerVNC">TigerVNC</link> (multiple platforms), <link href="http://tightvnc.com/">TightVNC</link> (multiple platforms), <link href="http://realvnc.com/">RealVNC</link> (multiple platforms), <link href="http://sourceforge.net/projects/chicken/">Chicken</link> (Mac OS X), <link href="http://userbase.kde.org/Krdc">Krde</link> (KDE), and <link href="http://projects.gnome.org/vinagre/">Vinagre</link> (GNOME).
fr: Puisque VNC est un protocole standard, il y a de multiples clients disponibles implémentant les spécifications VNC, incluant <link href="http://sourceforge.net/apps/mediawiki/tigervnc/index.php?title=Welcome_to_TigerVNC">TigerVNC</link> (plateformes multiples), <link href="http://tightvnc.com/">TightVNC</link> (plateformes multiples), <link href="http://realvnc.com/">RealVNC</link> (plateformes multiples), <link href="http://sourceforge.net/projects/chicken/">Chicken</link> (Mac OS X), <link href="http://userbase.kde.org/Krdc">Krde</link> (KDE), et <link href="http://projects.gnome.org/vinagre/">Vinagre</link> (GNOME).
ja: VNC は標準的なプロトコルなので、VNC の仕様を実装した複数のクライアントが利用できます。<link href="http://sourceforge.net/apps/mediawiki/tigervnc/index.php?title=Welcome_to_TigerVNC">TigerVNC</link> (複数のプラットフォーム)、<link href="http://tightvnc.com/">TightVNC</link> (複数のプラットフォーム)、<link href="http://realvnc.com/">RealVNC</link> (複数のプラットフォーム)、<link href="http://sourceforge.net/projects/chicken/">Chicken</link> (Mac OS X)、<link href="http://userbase.kde.org/Krdc">Krde</link> (KDE)、<link href="http://projects.gnome.org/vinagre/">Vinagre</link> (GNOME) などがあります。

source: The following example shows how to use the <placeholder-1/> command to create an empty image file <placeholder-2/> command to start up a virtual machine using that image file. As root:
fr: L'exemple suivant montre comment utiliser la commande <placeholder-1/> pour créer un fichier image vide, la commande <placeholder-2/> pour démarrer une machine virtuelle en utilisant ce fichier image. En tant que root:
ja: 以下の例は、<placeholder-1/> コマンドを使用して、空のイメージファイルを作成する方法、および <placeholder-2/> コマンドを使用して、そのイメージファイルを用いて仮想マシンを作成する方法を示します。以下を root として実行します。

source: When using the libvirt <literal>default</literal> network, libvirt will connect the virtual machine's interface to a bridge called <literal>virbr0</literal>. There is a dnsmasq process managed by libvirt that will hand out an IP address on the 192.168.122.0/24 subnet, and libvirt has iptables rules for doing NAT for IP addresses on this subnet.
fr: Lorsque le réseau <literal>default</literal> de libvirt est utilisé, libvirt va connecter l'interface de la machine virtuelle à un pont appelé <literal>virbr0</literal>. Il y a un process dnsmasq géré par libvirt qui v délivrer une adresse IP sur le sous-réseau 192.168.122.0/24, et libvirt possède des règles iptables pour réaliser du NAT pour les adresses IP de ce sous-réseau.
ja: libvirt <literal>default</literal> ネットワークの利用時、libvirt が仮想マシンのインターフェースを <literal>virbr0</literal> という名前のブリッジに接続します。libvirt により管理される dnsmasq プロセスが動作しています。192.168.122.0/24 サブネットに IP アドレスを払い出します。また、libvirt がこのサブネットに IP アドレスを NAT する iptables ルールを作成します。

source: The KVM hypervisor starts the virtual machine with the libvirt name, <literal>centos-6.4</literal>, with 1024MB of RAM. The virtual machine also has a virtual CD-ROM drive associated with the /data/CentOS-6.4-x86_64-netinstall.iso file and a local 10GB hard disk in qcow2 format that is stored in the host at /data/centos-6.4.qcow2. It configures networking to use libvirt's default network. There is a VNC server that is listening on all interfaces, and libvirt will not attempt to launch a VNC client automatically nor try to display the text console (--no-autoconsole). Finally, libvirt will attempt to optimize the configuration for a Linux guest running a RHEL 6.x distribution.
fr: L'hyperviseur KVM démarre la machine virtuelle avec le nom libvirt, <literal>centos-6.4</literal>, avec 1024 Mo de RAM. La machine virtuelle possède aussi un lecteur de CD-ROM virtuel associé avec le fichier /data/CentOS-6.4-x86_64-netinstall.iso et un disque dur local de 10 Go au format qcow2 qui est stocké dans l'hôte sur /data/centos-6.4.qcow2. Le réseau est configuré pour utiliser le réseau par défaut de libvirt. Il y a un serveur VNC qui écoute sur toutes les interfaces, et libvirt ne tentera pas de lancer un client VNC automatiquement ni ne tentera d'afficher la console texte (--no-autoconsole). Finalement, libvirt tentera d'optimiser la configuration pour un invité Linux faisant tourner une distribution RHEL 6.x.
ja: KVM は、libvirt 名 <literal>centos-6.4</literal>、メモリ 1024MB の仮想マシンを起動します。仮想マシンは、/data/CentOS-6.4-x86_64-netinstall.iso ファイルを接続した仮想 CD-ROM ドライブ、ホストの /data/centos-6.4.qcow2 に保存した qcow2 形式の 10GB ハードディスクを持ちます。また、libvirt の default ネットワークを使用するよう設定します。すべてのインターフェースでリッスンしている VNC サーバーがあります。libvirt は、VNC クライアントを自動的に起動しません。テキストコンソールを表示しません (--no-autoconsole)。最後に、libvirt は RHEL 6.x ディストリビューションを実行する Linux ゲスト向けに設定を最適化しようとします。

source: Run the <placeholder-1/> command to see a range of allowed <literal>--os-variant</literal> options.
fr: Lancez la commande <placeholder-1/> pour voir les options <literal>--os-variant</literal> autorisées.
ja: <placeholder-1/> コマンドを実行し、<literal>--os-variant</literal> オプションの利用できる値を確認します。

source: Use the <placeholder-1/> command to get the VNC port number.
fr: Utilisez la commande <placeholder-1/> pour obtenir le numéro de port VNC.
ja: <placeholder-1/> コマンドを使用して、VNC ポート番号を取得します。

source: In the example above, the guest <literal>centos-6.4</literal> uses VNC display <literal>:1</literal>, which corresponds to TCP port <literal>5901</literal>. You should be able to connect a VNC client running on your local machine to display :1 on the remote machine and step through the installation process.
fr: Dans l'exemple au-dessus, l'invité <literal>centos-6.4</literal> utilise l'écran VNC <literal>:1</literal>, qui correspond au port TCP <literal>5901</literal>. Vous devriez être en mesure de connecter un client VNC lancé sur votre machine locale pour afficher :1 sur la machine distante et passer à l'étape du processus d'installation.
ja: 上の例では、ゲストの <literal>centos-6.4</literal> が VNC ディスプレイ <literal>:1</literal> を使用します。これは、TCP ポート <literal>5901</literal> 番に対応します。ローカルマシンの VNC クライアントをリモートマシンのディスプレイ :1 に接続できます。そして、インストールプロセスを進めていきます。

source: translator-credits
fr: Olivier Buisson <olivier@obn.me>, 2012 | Cloudwatt Team <contact@cloudwatt.com>, 2013
ja: Tomoyuki KATO <tomo@dream.daynight.jp>, 2013-2014

source: qemu-img convert: raw, qcow2, VDI, VMDK
fr: Conversion qemu-img: raw, qcow2, VDI, VMDK

source: AMI (Amazon Machine Image):
fr: AMI (Image de Machine Amazon Machine):

source: AKI (Amazon Kernel Image)
fr: AKI (Image de Kernel Amazon Kernel)

source: ARI (Amazon Ramdisk Image)
fr: ARI (Image Ram-disque Amazon)

source: OpenStack Foundation
fr: Fondation OpenStack

source: Remaining licensing details are filled in by the template.
fr: Les détails supplémentaires concernant la licence sont intégrés dans le modèle de document.

source: After Oz does the initial OS install using the kickstart file, it customizes the image by doing an update. It also removes any reference to the eth0 device that libvirt creates while Oz does the customizing, as specified in the <literal>command</literal> section of the XML file.
fr: Après que Oz ait réalisé l'installation du système d'exploitation initiale, il personnalise l'image en réalisant une mise à jour. Il enlève aussi toute référence au périphérique eth0 que libvirt crée pendant que Oz réalise la personnalisation, comme indiqué dans la section <literal>command</literal> du fichier XML.

source: The Fedora project maintains a list of official cloud images at <link href="http://cloud.fedoraproject.org/"/>. The images include the <systemitem class="process">cloud-init</systemitem> utility to support key and user data injection. The default user name is <systemitem class="username">fedora</systemitem>. <placeholder-1/>
fr: Le projet Fedora maintient une liste d'images de cloud officielles sur <link href="http://cloud.fedoraproject.org/"/>. Les images comprennent l'utilitaire <systemitem class="process">cloud-init</systemitem> pour supporter l'injection de clé et de données utilisateur. Le nom d'utilisateur par défaut est <systemitem class="username">fedora</systemitem>. <placeholder-1/>

source: node-root
fr: noeud-racine
