Repository: 25hours/openstack-manuals
Catalog: doc/install-guide/locale/*.po
Languages: ja, ru, vi_vn, zh_cn

source: Floating IPs and router gateway ports that are configured in an external network, and a physical router that connects the floating IPs and router gateway ports to the outside world.
ja: 外部ネットワークで設定される Floating IP とルーターゲートウェイ、Floating IP とルーターゲートウェイを外部に接続する物理ルーター。

source: Because this example runs a DHCP agent and L3 agent on one node, you must set the <literal>use_namespace</literal> option to <literal>True</literal> in the configuration file for each agent. The default is <literal>True</literal>.
ja: この例は 1 つのノードで DHCP エージェントと L3 エージェントを実行するので、各エージェントの設定ファイルで <literal>use_namespace</literal> オプションを <literal>True</literal> に設定する必要があります。デフォルトは <literal>True</literal> です。

source: This table describes the nodes:
ja: この表はノードを記載します。

source: Node
ja: ノード

source: Controller Node
ja: コントローラーノード

source: Runs Networking, Identity Service, and all Compute services that are required to deploy VMs (<systemitem class="service">nova-api</systemitem>, <systemitem class="service">nova-scheduler</systemitem>, for example). The node must have at least one network interface, which connects to the Management Network. The host name is <literal>controlnode</literal>, which other nodes resolve to the IP of the controller node.
ja: Networking Service、Identity Service、仮想マシンの配備を要求する Compute Service (例: <systemitem class="service">nova-api</systemitem>、<systemitem class="service">nova-scheduler</systemitem>) を実行します。このノードは管理ネットワークと接続するネットワークインターフェースを少なくとも 1 つ持つ必要があります。ホスト名は <literal>controlnode</literal> です。すべての他のノードはコントローラーノードの IP を名前解決します。

source: The <systemitem class="service">nova-network</systemitem> service should not be running. This is replaced by Networking.
ja: <systemitem class="service">nova-network</systemitem> サービスは実行すべきではありません。これは Networking により置き換えられます。

source: Compute Node
ja: コンピュートノード

source: Runs the Networking L2 agent and the Compute services that run VMs (<placeholder-1/> specifically, and optionally other <placeholder-2/> services depending on configuration). The node must have at least two network interfaces. One interface communicates with the controller node through the management network. The other node is used for the VM traffic on the data network. The VM receives its IP address from the DHCP agent on this network.
ja: Networking L2 エージェントと、仮想マシンを実行する Compute Service (とくに <placeholder-1/> と、設定に依存したオプションの他の <placeholder-2/> サービス) を実行します。ノードは少なくとも 2 つのネットワークインターフェースを持つ必要があります。1 つ目は管理ネットワーク経由でコントローラーノードを通信します。2 つ目のインターフェースはデータネットワークで仮想マシンの通信を処理します。仮想マシンはこのネットワークで DHCP エージェントから IP アドレスを受け取ります。

source: Network Node
ja: ネットワークノード

source: Runs Networking L2 agent, DHCP agent and L3 agent. This node has access to the external network. The DHCP agent allocates IP addresses to the VMs on data network. (Technically, the addresses are allocated by the Networking server, and distributed by the dhcp agent.) The node must have at least two network interfaces. One interface communicates with the controller node through the management network. The other interface is used as external network. GRE tunnels are set up as data networks.
ja: Networking L2 エージェント、DHCP エージェント、L3 エージェントを実行します。このノードは外部ネットワークにアクセスできます。DHCP エージェントはデータネットワーク上で IP アドレスを仮想マシンに割り当てます。(技術的には、アドレスが Networking サーバーにより割り当てられ、DHCP エージェントにより配布されます。) ノードは少なくとも 2 つのネットワークインターフェースを持つ必要があります。1 つ目は管理ネットワーク経由でコントローラーノードと通信します。もう一方は外部ネットワークとして使用されます。GRE トンネルがデータネットワークとしてセットアップされます。

source: Router
ja: ルーター

source: Router has IP 30.0.0.1, which is the default gateway for all VMs. The router must be able to access public networks.
ja: ルーターが IP 30.0.0.1 を持ちます。これはすべての仮想マシンのデフォルトゲートウェイになります。ルーターはパブリックネットワークにアクセスできる必要があります。

source: The use case assumes the following:
ja: このユースケースは以下を仮定しています。

source: Relevant Compute services are installed, configured, and running.
ja: 関連のある Compute サービスがインストールされ、設定され、実行されています。

source: Glance is installed, configured, and running. In addition, an image named <literal>tty</literal> must be present.
ja: Glance がインストールされ、設定され、実行中であること。さらに、<literal>tty</literal> という名前のイメージが存在する必要があります。

source: Identity is installed, configured, and running. A Networking user named <emphasis role="bold">neutron</emphasis> should be created on tenant <emphasis role="bold">service</emphasis> with password <replaceable>NEUTRON_PASS</replaceable>.
ja: Identity がインストールされ、設定され、実行中であること。Networking ユーザー <emphasis role="bold">neutron</emphasis> が <replaceable>NEUTRON_PASS</replaceable> というパスワードでプロジェクト <emphasis role="bold">service</emphasis> にあること。

source: RabbitMQ is running with default guest and password <replaceable>RABBIT_PASS</replaceable>.
ja: RabbitMQ が標準のゲストとパスワード <replaceable>RABBIT_PASS</replaceable> で実行中であること。

source: MySQL server (user is <emphasis role="bold">root</emphasis>).
ja: MySQL サーバー (ユーザーは <emphasis role="bold">root</emphasis>)。

source: Additional services: <placeholder-1/>
ja: 追加のサービス: <placeholder-1/>

source: Install and configure Compute.
ja: Compute をインストールして設定します。

source: Install
ja: インストール

source: Controller node - Networking server
ja: コントローラーノード - Networking サーバー

source: Install the Networking server.
ja: Networking サーバーをインストールします。

source: Create database <emphasis role="bold">ovs_neutron</emphasis>.
ja: データベース <emphasis role="bold">ovs_neutron</emphasis> を作成します。

source: Update the Networking configuration file, <filename> /etc/neutron/neutron.conf</filename>, with plug-in choice and Identity Service user as necessary:
ja: 必要に応じて選択したプラグインと Identity Service ユーザーで Networking の設定ファイル <filename> /etc/neutron/neutron.conf</filename> を更新します。

source: Update the plug-in configuration file, <filename>/etc/neutron/plugins/openvswitch/ovs_neutron_plugin.ini</filename>:
ja: プラグインの設定ファイル <filename>/etc/neutron/plugins/openvswitch/ovs_neutron_plugin.ini</filename> を更新します。

source: Start the Networking server.
ja: Networking サーバーを起動します。

source: The Networking server can be a service of the operating system. The command to start the service depends on your operating system. The following command runs the Networking server directly:
ja: Networking サーバーはオペレーティングシステムのサービスになれます。サービスを起動するコマンドはお使いのオペレーティングシステムに依存します。以下のコマンドは Networking サーバーを直接実行します。

source: Compute node - Compute
ja: コンピュートノード - Compute

source: Install Compute services.
ja: Compute サービスをインストールします。

source: Update the Compute <filename> /etc/nova/nova.conf</filename> configuration file. Make sure the following line appears at the end of this file:
ja: Compute の設定ファイル <filename> /etc/nova/nova.conf</filename> を更新します。以下の行がこのファイルの最後にあることを確認します。

source: Restart relevant Compute services.
ja: 関連する Compute Service を再起動します。

source: Compute and Networking node - L2 agent
ja: コンピュートノードとネットワークノード - L2 エージェント

source: Install and start Open vSwitch.
ja: Open vSwitch をインストールし、起動します。

source: Install the L2 agent (Neutron Open vSwitch agent).
ja: L2 エージェント (Neutron Open vSwitch エージェント) をインストールします。

source: Add the integration bridge to the Open vSwitch:
ja: 統合ブリッジを Open vSwitch に追加します:

source: Update the Networking configuration file, <filename> /etc/neutron/neutron.conf</filename>:
ja: Networking 設定ファイル <filename> /etc/neutron/neutron.conf</filename> を更新します。

source: Update the plug-in configuration file, <filename> /etc/neutron/plugins/openvswitch/ovs_neutron_plugin.ini</filename>.
ja: プラグインの設定ファイル <filename> /etc/neutron/plugins/openvswitch/ovs_neutron_plugin.ini</filename> を更新します。

source: Compute node:
ja: コンピュートノード:

source: Network node:
ja: ネットワークノード:

source: Create the integration bridge <emphasis role="bold">br-int</emphasis>:
ja: 統合ブリッジ <emphasis role="bold">br-int</emphasis> を作成します。

source: Start the Networking L2 agent
ja: etworking L2 エージェントを起動します。

source: The Networking Open vSwitch L2 agent can be a service of the operating system. The command to start depends on your operating system. The following command runs the service directly:
ja: Networking Open vSwitch L2 エージェントはオペレーティングシステムのサービスになれます。サービスを起動するコマンドはお使いのオペレーティングシステムに依存します。以下のコマンドはサービスを直接実行します。

source: Network node - DHCP agent
ja: ネットワークノード - DHCP エージェント

source: Install the DHCP agent.
ja: DHCP エージェントをインストールします。

source: Update the Networking configuration file, <filename> /etc/neutron/neutron.conf</filename>
ja: Networking の設定ファイル <filename> /etc/neutron/neutron.conf</filename> を更新します。

source: Set <placeholder-1/> because TenantA and TenantC use overlapping subnets.
ja: TenantA と TenantC が同じサブネットを使用するため、<placeholder-1/> を設定します。

source: Update the DHCP <filename> /etc/neutron/dhcp_agent.ini</filename> configuration file:
ja: DHCP の <filename>/etc/neutron/dhcp_agent.ini</filename> 設定ファイルを更新します。

source: Start the DHCP agent.
ja: DHCP エージェントを起動します。

source: The Networking DHCP agent can be a service of operating system. The command to start the service depends on your operating system. The following command runs the service directly:
ja: Networking DHCP エージェントはオペレーティングシステムのサービスになれます。サービスを起動するコマンドはお使いのオペレーティングシステムに依存します。以下のコマンドはサービスを直接実行します。

source: Network node - L3 agent
ja: ネットワークノード - L3 エージェント

source: Install the L3 agent.
ja: L3 エージェントをインストールします。

source: Add the external network bridge
ja: 外部ネットワークブリッジの追加

source: Add the physical interface, for example eth0, that is connected to the outside network to this bridge:
ja: 外部ネットワークに接続される物理インターフェース、例えば eth0 をこのブリッジに追加します。

source: Update the L3 configuration file <filename> /etc/neutron/l3_agent.ini</filename>:
ja: L3 設定ファイル <filename> /etc/neutron/l3_agent.ini</filename> を更新します。

source: Set the <placeholder-1/> option (it is True by default) because TenantA and TenantC have overlapping subnets, and the routers are hosted on one l3 agent network node.
ja: TenantA と TenantC がオーバーラップするサブネットを持ち、ルーターが 1 つの L3 エージェントのネットワークノードにホストされるので、<placeholder-1/> オプション (デフォルトは True) を設定します。

source: Start the L3 agent
ja: L3 エージェントを開始します。

source: The Networking L3 agent can be a service of the operating system. The command to start the service depends on your operating system. The following command starts the agent directly:
ja: Networking L3 エージェントはオペレーティングシステムのサービスになれます。サービスを起動するコマンドはお使いのオペレーティングシステムに依存します。以下のコマンドはサービスを直接実行します。

source: Configure logical network
ja: 論理ネットワークの設定

source: You can run these commands on the network node.
ja: ネットワークノードでこれらのコマンドを実行できます。

source: Ensure that the following environment variables are set. Various clients use these to access the Identity Service.
ja: 以下の環境設定が設定されていることを確認します。さまざまなクライアントが Identity Service にアクセスするために、これらを使用します。

source: Get the tenant ID (Used as $TENANT_ID later):
ja: テナント ID を取得します (後から $TENANT_ID として使用します)。

source: Get user information:
ja: ユーザー情報を取得します。

source: Create the external network and its subnet by admin user:
ja: 管理ユーザーにより外部ネットワークとそのサブネットを作成します。

source: <placeholder-1/> means that Networking does not have to realize this network through provider network. <placeholder-2/> means that an external network is created where you can create the floating IP and router gateway port.
ja: <placeholder-1/> は、Networking がプロバイダーネットワークからこのネットワークを理解する必要がないことを意味します。<placeholder-2/> は、Floating IP とルーターゲートウェイポートを作成できる外部ネットワークが作成されることを意味します。

source: Add an IP on the external network to br-ex.
ja: br-ex に外部ネットワークの IP を追加します。

source: Because br-ex is the external network bridge, add an IP 30.0.0.100/24 to br-ex and ping the floating IP of the VM from our network node.
ja: br-ex は外部ネットワークブリッジであるので、IP 30.0.0.100/24 を br-ex に追加し、ネットワークノードから仮想マシンの Floating IP に ping します。

source: Serve TenantA.
ja: TenantA を取り扱います。

source: For TenantA, create a private network, subnet, server, router, and floating IP.
ja: TenantA 用にプライベートネットワーク、サブネット、サーバー、ルーター、Floating IP を作成します。

source: Create a network for TenantA:
ja: TenantA 用のネットワークを作成します。

source: After that, you can use admin user to query the provider network information:
ja: その後、プロバイダーネットワーク情報を問い合わせるために管理ユーザーを使用できます。

source: The network has GRE tunnel ID (for example, provider:segmentation_id) 1.
ja: ネットワークは GRE トンネル ID (例: provider:segmentation_id) 1 を持ちます。

source: Create a subnet on the network TenantA-Net:
ja: ネットワーク TenantA-Net にサブネットを作成します。

source: Create a server for TenantA:
ja: TenantA のサーバーを作成します。

source: It is important to understand that you should not attach the instance to Ext-Net directly. Instead, you must use a floating IP to make it accessible from the external network.
ja: インスタンスに Ext-Net を直接接続すべきではないことを理解することが重要です。代わりに、外部ネットワークからアクセスできるように Floating IP を使用する必要があります。

source: Create and configure a router for TenantA:
ja: TenantA 用のルーターを作成して設定します。

source: Added interface to router TenantA-R1
ja: インターフェースをルーター TenantA-R1 に追加しました。

source: Associate a floating IP for TenantA_VM1.
ja: TenantA_VM1 用の Floating IP を割り当てます。

source: Create a floating IP:
ja: Floating IP を作成します。

source: Get the port ID of the VM with ID 7c5e6499-7ef7-4e36-8216-62c2941d21ff:
ja: ID 7c5e6499-7ef7-4e36-8216-62c2941d21ff を持つ仮想マシンのポート ID を取得します。

source: Associate the floating IP with the VM port:
ja: Floating IP を仮想マシンのポートに割り当てます。

source: Ping the public network from the server of TenantA.
ja: TenantA のサーバーからパブリックネットワークに ping します。

source: In my environment, 192.168.1.0/24 is my public network connected with my physical router, which also connects to the external network 30.0.0.0/24. With the floating IP and virtual router, you can ping the public network within the server of tenant A:
ja: 私の環境では、192.168.1.0/24 が物理ルーターと接続されたパブリックネットワークです。これは外部ネットワーク 30.0.0.0/24 にも接続されます。Floating IP と仮想ルーターを用いると、tenant A のサーバーの中でパブリックネットワークに ping できます。

source: Ping the floating IP of TenantA's server:
ja: TenantA のサーバーの Floating IP に ping します。

source: Create other servers for TenantA.
ja: TenantA 用の他のサーバーを作成します。

source: You can create more servers for TenantA and add floating IPs for them.
ja: TenantA 用のサーバーをさらに作成でき、それら用に Floating IP を追加できます。

source: Serve TenantC.
ja: TenantC を取り扱います。

source: For TenantC, you create two private networks with subnet 10.0.0.0/24 and subnet 10.0.1.0/24, some servers, one router to connect to these two subnets and some floating IPs.
ja: TenantC 向けに、サブネット 10.0.0.0/24 とサブネット 10.0.1.0/24 を持つ 2 つのプライベートネットワーク、いくつかのサーバー、これら 2 つのサブネットといくつかの Floating IP に接続するためのルーター 1 つを作成します。

source: Create networks and subnets for TenantC:
ja: TenantC 用のネットワークとサブネットを作成します。

source: After that you can use admin user to query the network's provider network information:
ja: その後、ネットワークのプロバイダーネットワーク情報を問い合わせるために管理ユーザーを使用できます。

source: You can see GRE tunnel IDs (such as, provider:segmentation_id) 2 and 3. And also note the network IDs and subnet IDs because you use them to create VMs and the router.
ja: (provider:segmentation_id のような) GRE トンネル ID 2 と 3 を参照できます。仮想マシンとルーターを作成するために、それらを使用するので、ネットワーク ID とサブネット ID も記録します。

source: Create a server TenantC-VM1 for TenantC on TenantC-Net1.
ja: TenantC-Net1 に TenantC 用のサーバー TenantC-VM1 を作成します。

source: Create a server TenantC-VM3 for TenantC on TenantC-Net2.
ja: TenantC-Net2 に TenantC 用のサーバー TenantC-VM3 を作成します。

source: List servers of TenantC.
ja: TenantC のサーバーを一覧表示します。

source: Note the server IDs because you use them later.
ja: 後からサーバー ID を使用するので、それらを記録します。

source: Make sure servers get their IPs.
ja: サーバーが IP を取得していることを確認します。

source: You can use VNC to log on the VMs to check if they get IPs. If not, you must make sure that the Networking components are running correctly and the GRE tunnels work.
ja: 仮想マシンが IP を取得したかどうかを確認するために、VNC を使用して仮想マシンにログオンできます。取得していなければ、Networking のコンポーネントが正しく実行中であり、GRE トンネリングが動作していることを確認する必要があります。

source: Create and configure a router for TenantC:
ja: TenantC 用のルーターを作成して設定します。

source: Checkpoint: ping from within TenantC's servers.
ja: チェックポイント: TenantC のサーバーの中から ping します。

source: Because a router connects to two subnets, the VMs on these subnets can ping each other. And because the gateway for the router is set, TenantC's servers can ping external network IPs, such as 192.168.1.1, 30.0.0.1, and so on.
ja: ルーターが 2 つのサブネットに接続されるので、これらのサブネットの仮想マシンはお互いに ping できます。そして、ルーター向けのゲートウェイが設定されるので、TenantC のルーターは 192.168.1.1 や 30.0.0.1 などのような外部ネットワーク IP に ping できます。

source: Associate floating IPs for TenantC's servers.
ja: TenantC のサーバーの Floating IP を割り当てます。

source: Because a router connects to two subnets, the VMs on these subnets can ping each other. And because the gateway interface for the router is set, TenantC's servers can ping external network IPs, such as 192.168.1.1, 30.0.0.1, and so on.
ja: ルーターが 2 つのサブネットに接続されるので、これらのサブネットの仮想マシンはお互いに ping できます。そして、ルーター向けのゲートウェイインターフェースが設定されるので、TenantC のルーターは 192.168.1.1 や 30.0.0.1 などのような外部ネットワーク IP に ping できます。

source: You can use similar commands to the ones used in the section for TenantA.
ja: TenantA のセクションで使用したものと同じようなコマンドを使用できます。

source: Use case: per-tenant routers with private networks
ja: ユースケース: プライベートネットワークを持つプロジェクトごとのルーター

source: This use case represents a more advanced router scenario in which each tenant gets at least one router, and potentially has access to the Networking API to create additional routers. The tenant can create their own networks, potentially uplinking those networks to a router. This model enables tenant-defined, multi-tier applications, with each tier being a separate network behind the router. Because there are multiple routers, tenant subnets can overlap without conflicting, because access to external networks all happens through SNAT or floating IPs. Each router uplink and floating IP is allocated from the external network subnet.
ja: このユースケースはより高度なルーターのシナリオを表します。各プロジェクトが少なくとも 1 つのルーターを取得し、追加のルーターを作成するために Networking API にアクセスする可能性があります。プロジェクトは自身のネットワークを作成でき、これらのネットワークを上位のルーターに接続する可能性があります。このモデルは、ルーターの後ろで別々のネットワークとなる各階層を持つ、プロジェクト定義の複数階層のアプリケーションを可能にします。複数のルーターがあるので、外部ネットワークへのすべてのアクセスが SNAT または Floating IP 経由になるため、プロジェクトのサブネットは競合することなく重複できます。各ルーターのアップリンクと Floating IP は外部ネットワークのサブネットから割り当てられます。

source: Add a networking service
ja: Networking Service の追加

source: We are updating this material for Icehouse. You may find structure and/or content issues during this process.
ja: Icehouse 向けにこのドキュメントを更新中です。この作業中、構造や内容の問題が見つかるかもしれません。

source: Modular Layer 2 (ML2) plug-in
ja: Modular Layer 2 (ML2) プラグイン

source: Open vSwitch (OVS) plug-in
ja: Open vSwitch (OVS) プラグイン

source: The OpenStack dashboard, also known as <link href="https://github.com/openstack/horizon/">Horizon</link>, is a Web interface that enables cloud administrators and users to manage various OpenStack resources and services.
ja: OpenStack Dashboard は <link href="https://github.com/openstack/horizon/">Horizon</link> としても知られ、クラウド管理者やユーザーがさまざまな OpenStack のリソースとサービスを管理できるようになるウェブインターフェースです。
ru: Панель управления OpenStack, известная как <link href="https://github.com/openstack/horizon/">Horizon</link>, это веб-интерфейс управления ресурсами и службами облака для администраторов и пользователей.

source: These instructions show an example deployment configured with an Apache web server.
ja: ここからの説明は Apache ウェブサーバーを用いて設定する導入例を示します。

source: After you <link linkend="install_dashboard">install and configure the dashboard</link>, you can complete the following tasks:
ja: <link linkend="install_dashboard">Dashboard のインストールと設定</link>をした後、以下の作業を完了できます。

source: Customize your dashboard. See section <link href="http://docs.openstack.org/admin-guide-cloud/content/ch_install-dashboard.html#dashboard-custom-brand">Customize the dashboard</link> in the <link href="http://docs.openstack.org/admin-guide-cloud/content/"><citetitle>OpenStack Cloud Administrator Guide</citetitle></link>.
ja: Dashboard のカスタマイズ。<link href="http://docs.openstack.org/admin-guide-cloud/content/"><citetitle>OpenStack クラウド管理者ガイド</citetitle></link>の <link href="http://docs.openstack.org/admin-guide-cloud/content/ch_install-dashboard.html#dashboard-custom-brand">Dashboard のカスタマイズ</link>セクション参照。

source: Set up session storage for the dashboard. See <xref linkend="dashboard-sessions"/>.
ja: Dashboard 用セッションストレージのセットアップ。<xref linkend="dashboard-sessions"/> 参照。

source: Verify the Orchestration service installation
ja: Orchestration Service のインストールの検証

source: To verify that the Orchestration service is installed and configured correctly, make sure that your credentials are set up correctly in the <filename>openrc.sh</filename> file. Source the file, as follows:
ja: Orchestration Service が正しくインストールされ、設定されていることを検証するために、クレデンシャルが <filename>openrc.sh</filename> ファイルに正しくセットアップされていることを確認します。このファイルを以下のように読み込みます。

source: Next, create some stacks by using the samples.
ja: 次に、サンプルを使用して、いくつかのスタックを作成します。

source: Telemetry provides a framework for monitoring and metering the OpenStack cloud. It is also known as the Ceilometer project.
ja: Telemetry は OpenStack クラウドのモニタリングとメータリングのフレームワークを提供します。これは Ceilometer プロジェクトとしても知られています。

source: Configure the Identity Service
ja: Identity Service の設定

source: Add the Orchestration service
ja: Orchestration Service の追加

source: Use the Orchestration module to create cloud resources using a template language called HOT. The integrated project name is Heat.
ja: HOT と呼ばれるテンプレート言語を使用してクラウドリソースを作成するために Orchestration モジュールを使用します。統合プロジェクト名は Heat です。

source: Provider router with private networks
ja: プライベートネットワークを持つプロバイダールーター

source: This section describes how to install the OpenStack Networking service and its components for a single router use case: a provider router with private networks.
ja: このセクションは、単一ルーターのユースケース「プライベートネットワークを持つプロバイダールーター」向けに OpenStack Networking Service とそのコンポーネントをインストールする方法について記載します。

source: This figure shows the set up:
ja: この図はセットアップ内容を示します。

source: Because you run the DHCP agent and L3 agent on one node, you must set <literal>use_namespaces</literal> to <literal>True</literal> (which is the default) in the configuration files for both agents.
ja: 1 つのノードで DHCP エージェントと L3 エージェントを実行するので、両方のエージェントの設定ファイルで <literal>use_namespace</literal> オプションを <literal>True</literal> (これがデフォルト) に設定する必要があります。

source: The configuration includes these nodes:
ja: この設定はこれらのノードを含みます。

source: Nodes for use case
ja: ユースケース向けのノード

source: Controller
ja: コントローラー

source: Runs the Networking service, Identity Service, and all Compute services that are required to deploy a VM.
ja: Networking Service、Identity Service、および仮想マシンを配備するために必要となるすべての Compute Service を実行します。

source: The service must have at least two network interfaces. The first should be connected to the Management Network to communicate with the compute and network nodes. The second interface should be connected to the API/public network.
ja: このサービスは少なくとも 2 つのネットワークインターフェースを持つ必要があります。1 つ目はコンピュートノードとネットワークノードで通信するために管理ネットワークに接続されます。2 つ目のインターフェースは API/パブリックネットワークに接続されます。

source: Compute
ja: コンピュート

source: Runs Compute and the Networking L2 agent.
ja: Compute と Networking L2 エージェントを実行します。

source: This node does not have access to the public network.
ja: このノードはパブリックネットワークにアクセスできません。

source: The node must have a network interface that communicates with the controller node through the management network. The VM receives its IP address from the DHCP agent on this network.
ja: このノードは管理ネットワーク経由でコントローラーノードと通信するネットワークインターフェースを持つ必要があります。仮想マシンはこのネットワークにある DHCP エージェントから IP アドレスを受け取ります。

source: Network
ja: ネットワーク

source: Runs Networking L2 agent, DHCP agent, and L3 agent.
ja: Networking L2 エージェント、DHCP エージェント、L3 エージェントを実行します。

source: This node has access to the public network. The DHCP agent allocates IP addresses to the VMs on the network. The L3 agent performs NAT and enables the VMs to access the public network.
ja: このノードはパブリックネットワークにアクセスできます。DHCP エージェントがネットワーク上の仮想マシンに IP アドレスを割り当ます。L3 エージェントは NAT を実行し、仮想マシンがパブリックネットワークにアクセスできるようにします。

source: A network interface that communicates with the controller node through the management network
ja: 管理ネットワーク経由でコントローラーノードと通信するネットワークインターフェース

source: A network interface on the data network that manages VM traffic
ja: データネットワークで仮想マシンの通信を管理するネットワークインターフェース

source: A network interface that connects to the external gateway on the network
ja: ネットワーク上で外部ネットワークに接続するネットワークインターフェース
