Repository: 25hours/openstack-manuals
Catalog: doc/install-guide/locale/*.po
Languages: ja, ru, vi_vn, zh_cn

source: In the <literal>[keystone_authtoken]</literal> section, configure Identity service access:
ru: В секции <literal>[keystone_authtoken]</literal>, настройте доступ до службы Идентификаци:
vi_vn: Trong phần <literal>[keystone_authtoken]</literal>, cấu hình truy cập dịch vụ Identity:
zh_cn: 在 <literal>[keystone_authtoken]</literal> 段，配置身份认证服务相关信息：

source: In the <literal>[lvm]</literal> section, configure the LVM back end with the LVM driver, <literal>cinder-volumes</literal> volume group, iSCSI protocol, and appropriate iSCSI service:
vi_vn: Trong mục <literal>[lvm]</literal, cấu hình LVM back end với LVM driver, nhóm ổ lưu trữ <literal>cinder-volumes</literal>, giao thức iSCSI và dịch vụ iSCSI thích hợp:

source: In the <literal>[memcache]</literal> section, configure the Memcache service:
vi_vn: Trong phần <literal>[memcache]</literal>, cấu hình dịch vụ Memcache:

source: In the <literal>[mysqld]</literal> section, set the <literal>bind-address</literal> key to the management IP address of the controller node to enable access by other nodes via the management network:
ru: В секции <literal>[mysqld]</literal>, назначьте ключу <literal>bind-address</literal> IP адрес Управляющего узла, чтобы дать доступ другим узлам через управляющую сеть:
vi_vn: Trong phần <literal>[mysqld]</literal>, thiết lập khoá <literal>bind-address</literal> bằng địa chỉ IP quản lí của controller node để cho phép truy cập bởi các node khác thông qua mạng quản lí:
zh_cn: 在 <literal>[mysqld]</literal> 段，将配置项 <literal>bind-address</literal> 设置为控制节点服务器的管理 IP 地址，其它节点服务器可以通过管理网络访问数据库：

source: In the <literal>[mysqld]</literal> section, set the following keys to enable useful options and the UTF-8 character set:
ru: В секции <literal>[mysqld]</literal>, задайте следующие параметры, чтобы включить полезные возможности и поддержку UTF-8:
vi_vn: Trong phần <literal>[mysqld]</literal>, thiết lập những khoá sau để bật các tính năng hữu dụng và bộ kí tự UTF-8:
zh_cn: 在 <literal>[mysqld]</literal> 段，通过修改下列配置项以一些有用的配置并使用 UTF-8 编码：

source: In the <literal>[neutron]</literal> section, configure access parameters:
ru: В секции <literal>[neutron]</literal>, настройте параметры доступа:
vi_vn: Trong mục <literal>[neutron]</literal>, cấu hình các thông số truy cập:
zh_cn: 在 <literal>[neutron]</literal> 部分，配置访问的参数：

source: In the <literal>[neutron]</literal> section, enable the metadata proxy and configure the secret:
ru: В секции <literal>[neutron]</literal> включите прокси метаданных и настройте секрет:
vi_vn: Trong mục <literal>[neutron]</literal> section, bật metadata proxy và cấu hình bí mật:
zh_cn: 在 <literal>[neutron]</literal> 部分，启用 metadata 代理并配置 secret：

source: In the <literal>[pipeline:main]</literal> section, add <literal>ceilometer</literal>:
vi_vn: Trong phần <literal>[pipeline:main]</literal>, thêm <literal>ceilometer</literal>:
zh_cn: 在 <literal>[pipeline:main]</literal> 部分，添加 <literal>ceilometer</literal>：

source: In the <literal>[pipeline:main]</literal> section, enable the appropriate modules:
vi_vn: Trong phần <literal>[pipeline:main]</literal>, cho phép các mô đun thích hợp:

source: In the <literal>[publisher]</literal> section, configure the telemetry secret:
vi_vn: Trong phần <literal>[publisher]</literal>, cấu hình mã mật telemetry:
zh_cn: 在 <literal>[publisher]</literal> 部分，配置 telemetry 的 secret：

source: In the <literal>[revoke]</literal> section, configure the SQL revocation driver:
ru: В секции <literal>[revoke]</literal>, настройте SQL драйвер отзыва:
vi_vn: Trong phần <literal>[revoke]</literal>, cấu hình trình điều khiển thu hồi SQL:
zh_cn: 在 <literal>[revoke]</literal> 部分，配置 SQL 的撤回驱动：

source: In the <literal>[securitygroup]</literal> section, enable security groups, enable <glossterm>ipset</glossterm>, and configure the OVS <glossterm>iptables</glossterm> firewall driver:
ru: В секции <literal>[securitygroup]</literal>, включите группы безопасности, включите <glossterm>ipset</glossterm> и настройте драйвер OVS фаерволла <glossterm>iptables</glossterm>:
vi_vn: Trong mục <literal>[securitygroup]</literal> , bật các nhóm bảo mật,<glossterm>ipset</glossterm> và cấu hình driver firewall OVS <glossterm>iptables</glossterm>:
zh_cn: 在 <literal>[securitygroup]</literal> 部分，启用安全组，启用 <glossterm>ipset</glossterm> 并配置 OVS <glossterm>iptables</glossterm> 防火墙驱动：

source: In the <literal>[service_credentials]</literal> section, configure service credentials:
ru: В секции <literal>[service_credentials]</literal>, настройте учётные данные службы:
vi_vn: Trong mục <literal>[service_credentials]</literal>, cấu hình các thông tin xác thực dịch vụ:
zh_cn: 在 <literal>[service_credentials]</literal> 部分，配置服务的证书：

source: In the <literal>[storage-policy:0]</literal> section, configure the default storage policy:
vi_vn: Trong mục <literal>[storage-policy:0]</literal>, cấu hình chính sách lưu trữ mặc định:
zh_cn: 在 <literal>[storage-policy:0]</literal> 部分，配置默认存储策略：

source: In the <literal>[swift-hash]</literal> section, configure the hash path prefix and suffix for your environment.
vi_vn: Trong phần <literal>[swift-hash]</literal> sẽ tiến hành cấu hình cho tiền tố và hậu tố của đường băm cho môi trường của bạn.

source: In the <literal>[token]</literal> section, configure the UUID token provider and Memcached driver:
vi_vn: Trong phần <literal>[token]</literal>, cấu hình trình cung cấp UUID token và trình điều khiển Memcached:

source: In the <literal>devices</literal> section, add a filter that accepts the <literal>/dev/sdb</literal> device and rejects all other devices:
vi_vn: Trong mục <literal>devices</literal>, thêm một bộ lọc cho phép thiết bị <literal>/dev/sdb</literal> và từ chối tất cả các thiết bị khác:
zh_cn: 在 <literal>devices</literal> 部分，添加一个过滤器，接受 <literal>/dev/sdb</literal> 设备，拒绝其他所有设备：

source: Initial networks
ja: 初期ネットワーク
ru: Начальные сети
vi_vn: Các hệ thống mạng ban đầu
zh_cn: 初始网络

source: Initialize the database:
vi_vn: Khởi tạo cơ sở dữ liệu:
zh_cn: 初始化数据库：

source: Install and configure
ru: Установка и настройка
vi_vn: Cài đặt và cấu hình
zh_cn: 安装和配置

source: Install and configure <glossterm baseform="Network Time Protocol (NTP)">NTP</glossterm> using the instructions in <xref linkend="basics-ntp-other-nodes"/>.
vi_vn: Cài đặt và cấu hình <glossterm baseform="Network Time Protocol (NTP)">NTP</glossterm> bằng cách sử dụng hướng dẫn trong phần <xref linkend="basics-ntp-other-nodes"/>.
zh_cn: 使用 <xref linkend="basics-ntp-other-nodes"/> 中的指示安装和配置 <glossterm baseform="Network Time Protocol (NTP)">NTP</glossterm>。

source: Install and configure Block Storage volume components
vi_vn: Cài đặt và cấu hình các thành phần ổ lưu trữ của Block Storage
zh_cn: 安装并配置块存储卷组件

source: Install and configure Orchestration
vi_vn: Cài đặt và cấu hình Orchestration
zh_cn: 安装和配置

source: Install and configure a compute node
ru: Установка и настройка вычислительного узла
vi_vn: Cài đặt và cấu hình một nút compute
zh_cn: 安装和配置计算节点

source: Install and configure a storage node
ru: Установка и настройка узла хранилища
vi_vn: Cài đặt và cấu hình storage node
zh_cn: 安装并配置一个存储节点

source: Install and configure compute node
ru: Установка и настройка Вычислительного узла
vi_vn: Cài đặt và cấu hình node tính toán
zh_cn: 安装和配置计算节点

source: Install and configure controller node
ru: Установка и настройка Управляющего узла
vi_vn: Cài đặt và cấu hình node điều khiển
zh_cn: 安装配置控制节点服务器

source: Install and configure network node
ru: Установка и настройка сетевого узла
vi_vn: Cài đặt và cấu hình node mạng
zh_cn: 安装和配置网络节点

source: Install and configure storage node components
vi_vn: Cài đặt và cấu hình các thành tố trong nút lưu trữ
zh_cn: 安装并配置存储节点组件

source: Install and configure the controller node
vi_vn: Cài đặt và cấu hình node điều khiển
zh_cn: 安装并配置控制器节点

source: Install and configure the storage nodes
vi_vn: Cài đặt và cấu hình các nút lưu trữ
zh_cn: 安装和配置存储节点

source: Install required packages:
ru: Установите необходимые пакеты:
vi_vn: Cài đặt các gói bắt buộc:
zh_cn: 安装所需的包：

source: Install the <package>ceilometermiddleware</package> package:
vi_vn: Cài đặt gói <package>ceilometermiddleware</package>:

source: Install the <package>rdo-release-kilo</package> package to enable the RDO repository:
vi_vn: Cài đặt gói <package>rdo-release-kilo</package> để cho phép RDO repository:

source: Install the Data processing service
ru: Установка службы Обработки Данных
vi_vn: Cài đặt dịch vụ xử lý Data:
zh_cn: 安装数据处理服务

source: Install the Database service
vi_vn: Cài đặt dịch vụ Database
zh_cn: 安装数据库服务

source: Install the Debian Wheezy OpenStack repository for Juno:
ru: Установите репозитории OpenStack Juno под Debian Wheezy:
vi_vn: Cài đặt Debian Wheezy OpenStack repository cho Juno:
zh_cn: 为 Juno 版本安装 Debian Wheezy OpenStack 仓库：

source: Install the LVM packages:
ru: Установите пакеты LVM:
vi_vn: Cài đặt các gói LVM:
zh_cn: 安装 LVM 包：

source: Install the MongoDB package:
vi_vn: Cài đặt gói MongoDB:
zh_cn: 安装MongoDB包：

source: Install the Ubuntu Cloud archive keyring and repository:
ru: Установите ключи и репозиторий архива Ubuntu Cloud:
vi_vn: Cài đặt archive keyring và repository của Ubuntu Cloud:
zh_cn: 安装 Ubuntu Cloud 档案认证环和仓库：

source: Install the package:
ru: Установите пакет:
vi_vn: Cài gói tin:
zh_cn: 安装包：

source: Install the packages:
ja: パッケージをインストールします。
ru: Установите пакеты:
vi_vn: Cài đặt các gói phần mềm:
zh_cn: 安装软件包：

source: Install the required packages:
ru: Установите необходимые пакеты:
vi_vn: Cài đặt những gói cần thiết:
zh_cn: 安装需要的包：

source: Install the supporting utility packages:
vi_vn: Cài đặt các gói hỗ trợ tiện ích:
zh_cn: 安装支持的工具包：

source: Instance tunnels on 10.0.1.0/24 without a gateway
ru: Туннели инстансов на 10.0.1.0/24 без шлюза
vi_vn: Các đường hầm cho máy ảo sử dụng dải mạng 10.0.1./24 và không cần gateway
zh_cn: 实例通道使用 10.0.1.0/24 无网关

source: Keep these values secret and do not change or lose them.
vi_vn: Giữ bí mật các giá trị này, không được đổi hoặc làm mất chúng.
zh_cn: 这些值要保密，并且不要修改或丢失。

source: Kill any existing <systemitem role="process">dnsmasq</systemitem> processes:
ru: Убейте все существующие процессы <systemitem role="process">dnsmasq</systemitem>:
vi_vn: Ngừng bất kì quá trình <systemitem role="process">dnsmasq</systemitem> đang tồn tại:
zh_cn: 杀死所有存在的 <systemitem role="process">dnsmasq</systemitem> 进程：

source: Later on, the package will configure the below directive with the value you entered:
ru: Позже пакет заполнит указанную ниже директиву введённым вами значением:
vi_vn: Sau này, gói phần mềm sẽ cấu hình chỉ lệnh sau với giá trị mà bạn nhập vào:
zh_cn: 然后，这个包会以您输入的值配置以下指令：

source: Launch an instance
ja: インスタンスの起動
ru: Запуск инстанса
vi_vn: Khởi tạo một máy ảo
zh_cn: 启动一个实例

source: Launch an instance using <link linkend="launch-instance-neutron">OpenStack Networking (neutron) </link> or <link linkend="launch-instance-nova">legacy networking (nova-network) </link>. For more information, see the <link xlink:href="http://docs.openstack.org/user-guide/cli_launch_instances.html"><citetitle>OpenStack User Guide</citetitle></link>.
vi_vn: Khởi tạo một instance sử dụng <link linkend="launch-instance-neutron">OpenStack Networking (neutron) </link> hoặc <link linkend="launch-instance-nova">legacy networking (nova-network) </link>. Để biết thêm chi tiết, xem <link xlink:href="http://docs.openstack.org/user-guide/cli_launch_instances.html"><citetitle>OpenStack User Guide</citetitle></link>.

source: Launch an instance with OpenStack Networking (neutron)
ru: Запуск инстанса с Сетью OpenStack (neutron)
vi_vn: Chạy một instance với OpenStack Networking (neutron)
zh_cn: 使用 OpenStack 网络 (neutron) 启动一台实例

source: Launch an instance with legacy networking (nova-network)
ru: Запуск инстанса с старой сетью (nova-network)
vi_vn: Khởi tạo một instance với hệ thống mạng legacy (nova-network)
zh_cn: 使用传统网络 (nova-network) 启动一个实例

source: Launch the instance:
ja: インスタンスを起動します。
ru: Запустите инстанс:
vi_vn: Chạy một instance:
zh_cn: 启动实例：

source: Launching a virtual machine or instance involves many interactions among several services. The following diagram provides the conceptual architecture of a typical OpenStack environment.
ja: 仮想マシンやインスタンスの起動には、いくつかのサービスがいくつも通信します。以下の図は一般的な OpenStack 環境の概念アーキテクチャーです。
ru: Запуск виртуальной машины или инстанса включает множество взаимодействий между несколькими службами. Представленная диаграмма демонстрирует концептуальную архитектуру типичной среды OpenStack.
vi_vn: Khởi chạy một máy ảo hoặc instance liên quan đến nhiều tương tác giữa các dịch vụ. Giản đồ dưới đây cung cấp kiến trúc dạng khái niệm của một môi trường OpenStack điển hình.
zh_cn: 启动一台虚拟机或示例会包含很多服务之间的交互。下面的图展示了一个普通的 OpenStack 环境的概念架构。

source: Legacy networking primarily involves compute nodes. However, you must configure the controller node to use legacy networking.
ru: Старая сеть по большей части задействует вычислительные узлы. Однако, вам необходимо настроить управляющий узел на использование старой сети.
vi_vn: Legacy networking chủ yếu xoay quanh các node tính toán. Tuy nhiên, bạn phải cấu hình node điều khiển để sử dụng legacy networking.
zh_cn: 传统网络主要涉及到计算节点。但是，您必须配置控制节点以使用传统网络。

source: Like a physical network, a virtual network requires a <glossterm>subnet</glossterm> assigned to it. The external network shares the same subnet and <glossterm>gateway</glossterm> associated with the physical network connected to the external interface on the network node. You should specify an exclusive slice of this subnet for <glossterm>router</glossterm> and floating IP addresses to prevent interference with other devices on the external network.
ru: Как и физической сети, виртуальной сети требуется задать <glossterm>подсеть</glossterm>. Внешняя сеть разделяет подсети и <glossterm>шлюз</glossterm> назначенные физической сети, к которой подключен внешний интерфейс на сетевом узле. Вы должны указать эксклюзивный фрагмент из этой подсети для <glossterm>маршрутизатора</glossterm> и плавающих IP-адресов для предотвращения помех с другими устройствами во внешней сети.
vi_vn: Giống như mạng vật lý, một mạng ảo cũng cần có một <glossterm>subnet</glossterm> để gán cho nó. Mạng ngoại vùng chia sẻ cùng một subnet và <glossterm>gateway</glossterm> liên kết với mạng vật lý mà đã được kết nối với giao diệnngoại vùng trên node mạng. Bạn cần phần xác định rõ một phần của subnet này cho <glossterm>router</glossterm> và các địa chỉ IP động để ngăn ngừa xung đột với các thiết bị khác nằm trên hệ thống mạng ngoại vùng.
zh_cn: 如同一个物理网络，一个虚拟网络需要为其分配一个<glossterm>子网</glossterm>。外部网络通过网络节点上的外部接口，分享与物理网络关联的相同的子网和<glossterm>网关</glossterm>。您需要为<glossterm>路由</glossterm>和浮动IP来指定一个此子网上的独有段，以免与外部网络上的其他设备相冲突。

source: Like the external network, your tenant network also requires a subnet attached to it. You can specify any valid subnet because the architecture isolates tenant networks. By default, this subnet uses DHCP so your instances can obtain IP addresses.
vi_vn: Cũng giống như mạng ngoại vùng, mạng tenant của bạn cũng phải được gán với một subnet. Bạn có thể sử dụng bất kì một subnet khả dụng nào bởi vì kiến trúc này đã cô lập các mạng tenant. Mặc định, subnet này sử dụng DHCP để cấp phát địa chỉ IP cho các instance của bạn.

source: List API endpoints in the Identity service to verify connectivity with the Identity service:
vi_vn: Danh sách các điểm cuối API trong dịch vụ Identity để xác thực việc kết nối với dịch vụ Identity:
zh_cn: 列出身份认证服务中的 API 端点来验证身份认证服务的连通性：

source: List agents to verify successful launch of the neutron agents:
ru: Получите список агентов для подтверждения успешного запуска агентов neutron:
vi_vn: Liệt kê ra danh sách các agent để xác nhận đã chạy thành công các neutron agent:
zh_cn: 列出代理以验证启动 neutron 代理是否成功：

source: List available flavors:
ru: Получите список доступных схем:
vi_vn: Danh sách các flavor có sẵn:
zh_cn: 列出可用类型：

source: List available images:
ja: 利用可能なイメージを一覧表示します。
ru: Получите список доступных образов:
vi_vn: Danh sách các image có sẵn:
zh_cn: 列出可用镜像：

source: List available meters again to validate detection of the image download:
vi_vn: Liệt kê ra lại danh sách các thước đo hiện hành để xác nhận việc tìm thấy phần image tải về:
zh_cn: 再次列出可用的 meters 以验证镜像下载的检查：

source: List available meters:
vi_vn: Liệt kê ra danh sách các thước đo hiện có:
zh_cn: 列出可用的 meters：

source: List available networks:
ru: Получите список доступных сетей:
vi_vn: Danh sách các mạng có sẵn:
zh_cn: 列出可用网络：

source: List available security groups:
ru: Получите список групп безопасности:
vi_vn: Danh sách các nhóm bảo mật có sẵn:
zh_cn: 列出可用的安全组：

source: List containers:
vi_vn: Liệt kê ra danh sách các container:
zh_cn: 列出容器：

source: List images in the Image service catalog to verify connectivity with the Image service:
vi_vn: Liệt kê ra danh sách các image trong danh mục dịch vụ Image để xác nhận kết nối với dịch vụ Image:

source: List loaded extensions to verify successful launch of the <literal>neutron-server</literal> process:
ru: Получите список загруженных расширений, для подтверждения успешного запуска процесса <literal>neutron-server</literal>:
vi_vn: Liệt kê ra danh sách các phần mở rộng đã được tải để xác nhận quá trình <literal>neutron-server</literal> đã chạy thành công:
zh_cn: 列出加载的扩展，以验证是否成功启动了一个 <literal>neutron-server</literal> 进程：

source: List service components to verify successful launch and registration of each process:
vi_vn: Danh sách các thành tố dịch vụ mà đã kiểm chứng chạy thành công và việc đăng ký sau mỗi quá trình:
zh_cn: 列出服务组件，以验证是否成功启动并注册了每个进程：

source: List service components to verify successful launch of each process:
ru: Получите список компонент службы для подтверждения успешного запуска каждого процесса:
vi_vn: Liệt kê ra danh sách các thành phần dịch vụ để xác nhận chúng đều đã khởi động thành công:
zh_cn: 列出服务组件以验证是否每个进程都成功启动：

source: List volumes:
ru: Получите список дисков:
vi_vn: Liệt kê ra các ổ lưu trữ:
zh_cn: 列出卷：

source: Load the <filename>admin-openrc.sh</filename> file to populate environment variables with the location of the Identity service and the <literal>admin</literal> project and user credentials:
vi_vn: Tải file <filename>admin-openrc.sh</filename> để truyền địa chỉ của dịch vụ Identity cùng với thông tin xác thực project và người dùng <literal>admin</literal> vào trong các biến môi trường:

source: Management on 10.0.0.0/24 with gateway 10.0.0.1
ru: Управляющая на 10.0.0.0/24 со шлюзом 10.0.0.1
vi_vn: Quản lý trên 10.0.0.0/24 với gateway là 10.0.0.1
zh_cn: 管理使用 10.0.0.0/24 带有网关 10.0.0.1

source: Manually install python-argparse
ja: python-argparse の手動インストール
ru: Вручную установите
vi_vn: Cài đặt bằng tay python-argparse
zh_cn: 手动安装python-argparse

source: Many of the OpenStack services need to be configured to access a database. These are configured through a DSN (Database Source Name) directive as follows:
ru: Многие сервисы OpenStack должны быть настроены для получения доступа к базам данных. Это делается через директиву DSN (Database Source Name) следующим образом:
vi_vn: Nhiều dịch vụ của OpenStack cần được cấu hình để truy cập vào cơ sở dữ liệu và được cấu hình qua DSN (Database Source Name) với chỉ lệnh như sau:
zh_cn: 很多 OpenStack 服务组件需要配置对数据库的访问，可以通过下面的命令对 DSN (Database Source Name) 进行配置：

source: Many users build their test environments on <glossterm baseform="virtual machine (VM)">virtual machines (VMs)</glossterm>. The primary benefits of VMs include the following:
ru: Многие пользователи строят своих тестовые среды на <glossterm baseform="virtual machine (VM)">Виртуальных Машинах (ВМ)</glossterm>. Основные преимущества ВМ включают:
vi_vn: Nhiều người dùng xây dựng môi trường thử nghiệm của họ trên <glossterm baseform="máy ảo(VM)">các máy ảo (VMs)</glossterm>. Lợi ích chính khi sử dụng các máy ảo bao gồm:
zh_cn: 很多用户将他们的测试环境搭建在<glossterm baseform="virtual machine (VM)">虚拟机 (VMs)</glossterm>上。使用虚拟机的主要好处包括以下几点：

source: Message queue
vi_vn: Hàng đợi message
zh_cn: 消息队列

source: Minimal architecture example with OpenStack Networking (neutron)Hardware requirements
ru: Минимальная примерная архитектура с сетью OpenStack (neutron) требует
vi_vn: Ví dụ về kiến trúc tối thiểu sử dụng OpenStack Networking (neutron)Yêu cầu phần cứng
zh_cn: 包含 OpenStack 网络 (neutron) 的最小架构样例的硬件需求

source: Minimal architecture example with OpenStack Networking (neutron)Network layout
ru: Минимальный пример архитектуры с сетью на основе OpenStack Networking (neutron)
vi_vn: Ví dụ về kiến trúc tối thiểu sử dụng sơ đồ mạng OpenStack Networking (neutron)
zh_cn: 包含 OpenStack 网络 (neutron) 的网络层的最小架构示例

source: Minimal architecture example with OpenStack Networking (neutron)Service layout
ru: Макет минимальной примерной архитектуры с сетью OpenStack (neutron)
vi_vn: Ví dụ về kiến trúc mạng tối thiểu sử dụng OpenStack Networking (neutron)Cách bố trí dịch vụ
zh_cn: 包含 OpenStack 网络 (neutron) 服务层的最小架构样例

source: Minimal architecture example with legacy networking (nova-network)Hardware requirements
ru: Минимальная примерная архитектура со старой сетью (nova-network) требует
vi_vn: Ví dụ về kiến trúc tối thiểu sử dụng legacy networking (nova-network)Yêu cầu phần cứng
zh_cn: 包含 OpenStack 传统网络 (nova-network) 的最小架构样例的硬件需求

source: Minimal architecture example with legacy networking (nova-network)Network layout
ru: Минимальный пример архитектуры на основе старой сети (nova-network)
vi_vn: Ví dụ về kiến trúc tối thiểu sử dụng legacy networking (nova-network)Cách bố trí hệ thống mạng
zh_cn: 包含 OpenStack 传统网络的网络层的最小架构示例

source: Minimal architecture example with legacy networking (nova-network)Service layout
ru: Макет минимальной примерной архитектуры на основе старой сети (nova-network)
vi_vn: Ví dụ về kiến trúc mạng tối thiểu sử dụng legacy networking (nova-network)Cách bố trí dịch vụ
zh_cn: 包含 OpenStack 传统网络 (nova-network) 服务层的最小架构样例

source: Most OpenStack services use an SQL database to store information. The database typically runs on the controller node. The procedures in this guide use <application>MariaDB</application> or <application>MySQL</application> depending on the distribution. OpenStack services also support other SQL databases including <link xlink:href="http://www.postgresql.org/">PostgreSQL</link>.
vi_vn: Phần lớn các dịch vụ OpenStack sử dụng một cơ sở dữ liệu SQL để lưu trữ thông tin. Cơ sở dữ liệu thường được chạy trên node điều khiển. Các quy trình trong bài hướng dẫn này sử dụng <application>MariaDB</application> hoặc <application>MySQL</application> tùy thuộc vào từng triển khai. Các dịch vụ OpenStack cũng hỗ trợ các cơ sở dữ liệu SQL khác trong đó có <link xlink:href="http://www.postgresql.org/">PostgreSQL</link>.

source: Most cloud images support <glossterm>public key authentication</glossterm> rather than conventional user name/password authentication. Before launching an instance, you must generate a public/private key pair using <placeholder-1/> and add the public key to your OpenStack environment.
ru: Большенство облачных образов поддерживают <glossterm>аутентификацию по открытым ключам</glossterm> кроме обычной аутентификации по имени/паролю. Прежде чем запускать инстанс, вам необходимо сгенерировать пару из открытого/закрытого ключей используя <placeholder-1/> и добавить открытый ключ в вашу среду OpenStack.
vi_vn: Đa phần các image máy ảo vật lý hỗ trợ <glossterm>xác thực public key</glossterm> hơn là sự thuận tiện về tên người dùng/mật khẩu trong việc xác thực. Trước khi chạy một instance, bạn cần tạo ra một cặp khóa công khai/riêng sử dụng <placeholder-1/> và thêm một khóa công khai cho môi trường OpenStack của bạn.
zh_cn: 大部分的云镜像支持 <glossterm>公钥认证</glossterm> 而不是传统的用户名/密码认证的方式。在启动实例之前，您必须生成一个公钥/私钥对使用<placeholder-1/>并将公钥添加到您的 OpenStack 环境中。
