Repository: 25hours/openstack-manuals
Catalog: doc/install-guide/locale/*.po
Languages: ja, ru, vi_vn, zh_cn

source: Most cloud images support <glossterm>public key authentication</glossterm> rather than conventional user name/password authentication. Before launching an instance, you must generate a public/private key pair.
vi_vn: Phần lớn các cloud image hỗ trợ <glossterm>xác thực sử dụng khóa public</glossterm> hơn là xác thực bằng tên người dùng/mật khẩu. Trước khi chạy một instance, bạn phải sinh ra một cặp khóa public/private.

source: Mount the devices:
vi_vn: Mount các thiết bị:
zh_cn: 挂载设备：

source: Name
ja: 名前
ru: Имя
vi_vn: Tên
zh_cn: 名称

source: Network Node: 1 processor, 512 MB memory, and 5 GB storage
ja: ネットワークノード: 1 CPU、512 MB メモリ、5 GB ストレージ
ru: Сетевой узел: 1 процессор, 512 МБ памяти и 5 ГБ хранилища
vi_vn: Node mạng: 1 bộ xử lý, 512 MB bộ nhớ và 5 GB lưu trữ
zh_cn: 网络节点: 1 处理器, 512MB 内存, 及5 GB 存储

source: Network Time Protocol (NTP)
ru: Протокол сетевого времени (NTP)
vi_vn: Giao thức Thời gian Mạng (NTP)
zh_cn: 网络时间协议(NTP)

source: Network interface names vary by distribution. Traditionally, interfaces use "eth" followed by a sequential number. To cover all variations, this guide simply refers to the first interface as the interface with the lowest number and the second interface as the interface with the highest number.
ru: Имена сетевых интерфейсов различаются в зависимости от дистрибутива. Традиционно, интерфейсы используют "eth" и порядковый номер. Чтобы учесть все варианты, в этом руководстве первый интерфейс обозначает интерфейс с наименьшим номером и второй обозначает интерфейс с наибольшим номером.
vi_vn: Tên của giao diện mạng khác nhau tùy theo từng triển khai. Thường thì các giao diện bắt đầu bằng "eth" và theo sau bởi một chuỗi số. Để bao gồm hết tất cả các biến thể, bài hướng dẫn này đơn giản gọi giao diện mạng đầu tiên là giao diện mạng có số nhỏ nhất và giao diện mạng thứ hai là giao diện có số lớn nhất.
zh_cn: 网络接口由分配不通而有各种名称。传统上，接口使用 "eth" 加上一个数字序列命名。为了覆盖到所有不同的名称，本指南简单地将数字最小的接口引用为第一个接口，第二个接口则为更大数字的接口。

source: Network interface names vary by distribution. Traditionally, interfaces use "eth" followed by a sequential number. To cover all variations, this guide simply refers to the first interface as the interface with the lowest number, the second interface as the interface with the middle number, and the third interface as the interface with the highest number.
ru: Имена сетевых интерфейсов различаются в зависимости от дистрибутива. Традиционно интерфейсы используют "eth" и порядковый номер. Чтобы учесть все варианты, в этом руководстве первый интерфейс обозначает интерфейс с наименьшим номером, второй обозначает интерфейс со средним номером и третий обозначает интерфейс с наибольшим номером.
vi_vn: Giao diện mạng có nhiều tên khác nhau tuỳ vào bản phân phối. Thường thì các giao diện sẽ dùng "eth" kèm theo một số thứ tự. Để bao quát hết các biến thể, hướng dẫn này đơn giản coi giao diện đầu tiên là giao diện có số thứ tự nhỏ nhất, giao diện thứ hai có thứ tự ở giữa và giao diện thứ ba có thứ tự cao nhất.
zh_cn: 网络接口名称在不同发布版本上各异。通常，接口使用 “eth” 并跟着一个顺序值。为了涵盖各种差异，本指南简单的指代为第一个接口为最小数值的接口，第二个接口为中间数值的接口，第三个接口为最高数值的接口。

source: Network mask: 255.255.255.0 (or /24)
ru: Маска сети: 255.255.255.0 (или /24)
vi_vn: Mặt nạ mạng: 255.255.255.0 (hoặc /24)
zh_cn: 子网掩码: 255.255.255.0 (or /24)

source: Network node
ja: ネットワークノード
ru: Сетевой узел
vi_vn: Node mạng
zh_cn: 网络节点

source: Networking
ja: ネットワーク
ru: Сеть
vi_vn: Mạng
zh_cn: 网络

source: Networking also supports <emphasis role="italic">security groups</emphasis>. Security groups enable administrators to define firewall rules in groups. A VM can belong to one or more security groups, and Networking applies the rules in those security groups to block or unblock ports, port ranges, or traffic types for that VM.
vi_vn: Networking cũng hỗ trợ <emphasis role="italic">các nhóm bảo mật</emphasis> . Các nhóm bảo mật cho phép các quản trị viên định nghĩa các quy tắc tường lửa. Một máy ảo có thể thuộc một hoặc nhiều nhóm bảo mật, và Networking áp dụng các quy tắc trong các nhóm bảo mật đó để chặn hoặc mở các port, các dải port hoặc các dạng lưu thông dữ liệu cho máy ảo đó.
zh_cn: Networking也支持<emphasis role="italic">安全组</emphasis>。安全组允许管理员分组定义防火墙规则。一个虚拟机可以属于一个或多个安全组，Networking针对这个虚拟机，应用这些安全组里的规则来阻塞或者开启端口，端口范围，或通讯类型。

source: Networking concepts
ru: Концепции сетевой подсистемы
vi_vn: Các khái niệm về Networking
zh_cn: 网络概念

source: Next specify <literal>admin_user</literal>, <literal>admin_password</literal> and <literal>admin_tenant_name</literal>. These parameters must specify a keystone user which has the <literal>admin</literal> role in the given tenant. These credentials allow sahara to authenticate and authorize its users.
vi_vn: Tiếp theo, chỉ rõ <literal>admin_user</literal>, <literal>admin_password</literal> và <literal>admin_tenant_name</literal>. Các tham số này phải định rõ một người dùng keystone có vai trò <literal>admin</literal> trong tenant cho trước. Các thông tin xác thực này cho phép sahara xác thực và trao quyền các người dùng của nó.
zh_cn: 下一步，指定 <literal>admin_user</literal>、<literal>admin_password</literal> 和 <literal>admin_tenant_name</literal>。这些参数必须指定一个 keystone 用户，且这个用户在给定的租户中有 <literal>admin</literal> 角色。这些证书允许 sahara 认证和授权它的用户。

source: Next steps
ru: Следующие шаги
vi_vn: Các bước tiếp theo
zh_cn: 下一步

source: Numerous archive.gplhost.com mirrors are available around the world. All are available with both FTP and HTTP protocols (you should use the closest mirror). The list of mirrors is available at <link xlink:href="http://archive.gplhost.com/readme.mirrors">http://archive.gplhost.com/readme.mirrors</link>.
vi_vn: Rất nhiều archive.gplhost.com mirror hiện có trên khắp thế giới. Tất cả đều hiện có với cả hai giao thức FTP và HTTP (bạn nên sử dụng mirror gần mình nhất). Danh sách các mirror có ở <link xlink:href="http://archive.gplhost.com/readme.mirrors">http://archive.gplhost.com/readme.mirrors</link>.

source: Obtain a <glossterm>Virtual Network Computing (VNC)</glossterm> session URL for your instance and access it from a web browser:
ru: Получите URL сессии <glossterm>Virtual Network Computing (VNC)</glossterm> для вашего инстанса и подключитесь к нему через веб-браузер:
vi_vn: Nhận về một URL phiên làm việc của <glossterm>Virtual Network Computing (VNC)</glossterm> cho instance của bạn và truy cập nó từ một trình duyệt web:
zh_cn: 获取一个实例的 <glossterm>Virtual Network Computing (VNC)</glossterm> 会话的 URL 并从 web 浏览器访问它：

source: Obtain the <filename>/etc/swift/swift.conf</filename> file from the Object Storage source repository:
vi_vn: Có được thư mục <filename>/etc/swift/swift.conf</filename> từ kho lưu trữ nguồn của Object Storage:
zh_cn: 从对象存储的仓库源中获取 <filename>/etc/swift/swift.conf</filename> 文件：

source: Obtain the proxy service configuration file from the Object Storage source repository:
vi_vn: Nhận về file cấu hình dịch vụ proxy từ repository gốc của Object Storage:
zh_cn: 从对象存储的仓库源中获取代理服务的配置文件：

source: On RHEL and CentOS, configure SELinux to permit the web server to connect to OpenStack services:
ru: На RHEL и CentOS, настройте SELinux разрешать веб-серверу соединяться со службами OpenStack:
vi_vn: Trên RHEL và CentOS, cấu hình SELinux để cho phép web server kết nối với các dịch vụ OpenStack:
zh_cn: 在 RHEL 和 CentOS 中，配置 SELinux 以允许 web 服务器链接到 OpenStack 服务：

source: On RHEL and CentOS, enable the <link xlink:href="https://fedoraproject.org/wiki/EPEL">EPEL</link> repository:
vi_vn: Trên RHEL và CentOS, bật kho dữ liệu <link xlink:href="https://fedoraproject.org/wiki/EPEL">EPEL</link>:

source: On SLES 12:
vi_vn: Trên SLES 12:

source: On SLES:
ru: На SLES:
vi_vn: Trên SLES:
zh_cn: 在 SLES 系统中：

source: On all nodes, ensure proper ownership of the configuration directory:
vi_vn: Trên tất cả các node, đảm bảo quyền sở hữu phù hợp của thư mục cấu hình:
zh_cn: 在所有节点上，确认配置文件目录是否有合适的所有权：

source: On all nodes, install the Debian Wheezy backport repository Juno:
ru: На всех узлах установите репозиторий перенесённых пакетов для Juno под Debian Wheezy:
vi_vn: Trên tất cả các node, cài đặt Debian Wheezy backport repository Juno:
zh_cn: 在所有节点上，安装 Debian Wheezy backport 仓库的 Juno 版本：

source: On openSUSE 13.2:
vi_vn: Trên openSUSE 13.2:

source: On openSUSE:
ru: На openSUSE:
vi_vn: Trên openSUSE:
zh_cn: 在 openSUSE 系统中：

source: On the <emphasis>controller</emphasis> node, edit the <filename>/etc/nova/nova.conf</filename> file and complete the following action:
ru: На <emphasis>управляющем</emphasis> узле, отредактируйте файл <filename>/etc/nova/nova.conf</filename> следующим образом:
vi_vn: Trên node <emphasis>điều khiển</emphasis>, sửa file <filename>/etc/nova/nova.conf</filename> và hoàn thành công việc sau:
zh_cn: 在<emphasis>控制</emphasis>节点上，修改配置文件 <filename>/etc/nova/nova.conf</filename> 并完成以下操作：

source: On the <emphasis>controller</emphasis> node, restart the Compute <glossterm>API</glossterm> service:
ru: На <emphasis>управляющем</emphasis> узле, перезапустите сервисы Вычислительного <glossterm>API</glossterm>:
vi_vn: Trên node <emphasis>điều khiển</emphasis>, khởi động lại dịch vụ Compute <glossterm>API</glossterm>:
zh_cn: 在<emphasis>控制</emphasis>节点上，重启 Compute <glossterm>API</glossterm> 服务：

source: On the controller node and any other nodes running the proxy service, restart the Object Storage proxy service including its dependencies:
ru: На управляющем узле и всех других узлах, на которых запущен сервис проксирования, перезапустите сервис проксирования Хранилища Объектов, включая его зависимости:
vi_vn: Trên node điều khiển và tất cả các node khác có chạy dịch vụ proxy, khởi động lại dịch vụ proxy của Object Storage bao gồm cả các thành phần phụ thuộc của nó:
zh_cn: 在控制节点和其他运行了代理服务的节点上，重启对象存储代理服务及其依赖的服务：

source: On the controller node and any other nodes running the proxy service, start the Object Storage proxy service including its dependencies and configure them to start when the system boots:
ru: На управляющем узле и всех других узлах, на которых запущен сервис проксирования, запустите сервис проксирования службы Хранилища Объектов, включая его зависимости, и настройте их автоматический запуск при загрузке системы:
vi_vn: Trên node điều khiển và bất kì node nào khác chạy dịch vụ proxy, khởi động dịch vụ proxy của Object Storage bao gồm các thành phần phụ thuộc của nó và cấu hình cho chúng khởi động cùng hệ thống:
zh_cn: 在控制节点和其他运行了代理服务的节点上，启动对象存储代理服务及其依赖服务，并将它们配置为随系统启动：

source: On the storage nodes, start the Object Storage services and configure them to start when the system boots:
ru: На узлах хранения, запустите сервисы службы Хранилища Объектов и настройте их автоматический запуск при загрузке системы:
vi_vn: Trên các node lưu trữ, khởi động các dịch vụ Object Storage và cấu hình cho chúng khởi động cùng với hệ thống:
zh_cn: 在存储节点上，启动对象存储服务，并将其设置为随系统启动：

source: On the storage nodes, start the Object Storage services:
vi_vn: Trên các node lưu trữ, khởi động các dịch vụ Object Storage:
zh_cn: 在存储节点上启动对象存储服务：

source: Once you configure the ML2 plug-in, changing values in the <literal>type_drivers</literal> option can lead to database inconsistency.
vi_vn: Sau khi bạn cấu hình plug-in ML2, thay đổi các giá trị trong tùy chọn có thể dẫn đến sự không nhất quán trong cơ sở dữ liệu.

source: One physical server can support multiple nodes, each with almost any number of network interfaces.
ru: Один физический сервер может поддердивать множество узлов, каждый с практически любым числом сетевых интерфейсов.
vi_vn: Một máy chủ vật lý có thể hỗ trợ nhiều node, với số lượng giao diện mạng tùy thích trên mỗi node.

source: Only instances can access Block Storage volumes. However, the underlying operating system manages the devices associated with the volumes. By default, the LVM volume scanning tool scans the <literal>/dev</literal> directory for block storage devices that contain volumes. If projects use LVM on their volumes, the scanning tool detects these volumes and attempts to cache them which can cause a variety of problems with both the underlying operating system and project volumes. You must reconfigure LVM to scan only the devices that contain the <literal>cinder-volume</literal> volume group. Edit the <filename>/etc/lvm/lvm.conf</filename> file and complete the following actions:
vi_vn: Chỉ các instance mới có thể truy cập vào các ổ lưu trữ Block Storage. Tuy nhiên hệ điều hành cơ sở quản lý các thiết bị liên kết với các ổ lưu trữ. Mặc định, công cụ quét ổ lưu trữ LVM quét thư mục <literal>/dev</literal> để tìm kiếm các thiết bị block storage có chứa các ổ lưu trữ. Nếu các dự án sử dụng LVM trên các ổ lưu trữ, công cụ quét sẽ tìm ra các ổ lưu trữ và cố gắng đưa chúng vào bộ nhớ cache, điều này có thể gây ra nhiều lỗi với cả hệ điều hành cơ sở và các ổ lưu trữ dự án. Bạn phải cấu hình lại LVM để cho nó chỉ quét các thiết bị có chứa nhóm ổ lưu trữ <literal>cinder-volume</literal>. Sửa file <filename>/etc/lvm/lvm.conf</filename> và hoàn thành các công việc sau:

source: OpenStack Installation Guide
ja: OpenStack インストールガイド
ru: Справочник по установке OpenStack
vi_vn: Hướng dẫn cài đặt OpenStack
zh_cn: OpenStack安装指南

source: OpenStack Installation Guide for <phrase os="rhel;centos;fedora">Red Hat Enterprise Linux 7, CentOS 7, and Fedora 21</phrase><phrase os="ubuntu">Ubuntu 14.04</phrase><phrase os="debian">Debian 7</phrase><phrase os="opensuse">openSUSE 13.2 and SUSE Linux Enterprise Server 12</phrase>
vi_vn: Hướng dẫn Cài đặt OpenStack cho <phrase os="rhel;centos;fedora">Red Hat Enterprise Linux 7, CentOS 7, và Fedora 21</phrase><phrase os="ubuntu">Ubuntu 14.04</phrase><phrase os="debian">Debian 7</phrase><phrase os="opensuse">openSUSE 13.2 và SUSE Linux Enterprise Server 12</phrase>

source: OpenStack Installation Guide for <placeholder-1/><placeholder-2/><placeholder-3/><placeholder-4/>
ru: Руководство по установке OpenStack для <placeholder-1/><placeholder-2/><placeholder-3/><placeholder-4/>
vi_vn: Hướng dẫn Cài đặt OpenStack cho <placeholder-1/><placeholder-2/><placeholder-3/><placeholder-4/>
zh_cn: <placeholder-1/><placeholder-2/><placeholder-3/><placeholder-4/> 的 OpenStack 安装手册

source: OpenStack Networking (neutron) manages all networking facets for the Virtual Networking Infrastructure (VNI) and the access layer aspects of the Physical Networking Infrastructure (PNI) in your OpenStack environment. OpenStack Networking enables tenants to create advanced virtual network topologies including services such as <glossterm baseform="firewall">firewalls</glossterm>, <glossterm baseform="load balancer">load balancers</glossterm>, and <glossterm baseform="virtual private network (VPN)">virtual private networks (VPNs)</glossterm>.
ru: Сеть OpenStack (neutron) управляет всеми сетевыми аспектами для Виртуальной Сетевой Инфраструктуры (VNI) и аспектами уровня доступа Физической Сетевой Инфраструктуры (PNI) в вашей среде OpenStack. Сеть OpenStack позволяет проектам создавать сложные топологии виртуальных сетей, включающие такие службы как <glossterm baseform="firewall">межсетевой экран</glossterm>, <glossterm baseform="load balancer">балансировщик нагрузки</glossterm> и <glossterm baseform="virtual private network (VPN)">виртуальная частная сеть (VPNs)</glossterm>.
vi_vn: OpenStack Networing (neutron) quản lý tất cả các khía cạnh về mạng cho Cơ sở hạ tầng Hệ thống mạng Ảo (VNI) và quản lý các mặt liên quan đến tầng truy cập của Cơ sở hạ tầng Hệ thống mạng Vật lý (PNI) trong môi trường OpenStack của bạn. OpenStack Networking cho phép các tenant khởi tạo các mô hình hệ thống mạng ảo nâng cao bao gồm các dịch vụ như <glossterm baseform="firewall">firewalls</glossterm>, <glossterm baseform="thiết bị cân bằng tải">cân bằng tải</glossterm>, and <glossterm baseform="hệ thống mạng riêng ảo (VPN)">hệ thống mạng riêng ảo (VPN)</glossterm>.
zh_cn: OpenStack Networking (neutron) 管理您的OpenStack环境中虚拟网络基础设施 (VNI) 的所有方面和物理网络基础设施 (PNI) 的接入层方面。OpenStack Networking 允许租户创建高级虚拟网络拓扑，包括<glossterm baseform="firewall">防火墙</glossterm>， <glossterm baseform="load balancer">负载均衡</glossterm>和<glossterm baseform="virtual private network (VPN)">虚拟私有网络(VPNs)</glossterm>等服务。

source: OpenStack ceilometer daemons
vi_vn: các daemon ceilometer của OpenStack

source: OpenStack cinder daemons
vi_vn: các daemon cinder của OpenStack

source: OpenStack generates IDs dynamically, so you will see different values in the example command output.
vi_vn: OpenStack tạo ra các ID động, vì vậy bạn sẽ thấy các giá trị khác nhau trong kết quả của lệnh ví dụ.
zh_cn: OpenStack 是动态生成 ID 的，因此您看到的输出会与示例中的命令行输出不相同。

source: OpenStack glance daemons
vi_vn: các daemon glance của OpenStack

source: OpenStack heat daemons
vi_vn: các daemon heat của OpenStack

source: OpenStack is highly configurable to meet different needs with various compute, networking, and storage options. This guide enables you to choose your own OpenStack adventure using a combination of core and optional services. This guide uses the following example architectures:
ru: OpenStack легко настраивается в зависимости от требований к вычислениям, сети и хранилищам. Это руководство позволяет вам выбрать своё собственное приклечение с OpenStack, используя комбинацию основных и дополнительных служб. Данное руководство использует следующие примеры архитектур:
vi_vn: OpenStack có khả năng tùy chỉnh cấu hình cao để đáp ứng những như cầu khác nhau của nhiều tùy chọn tính toán, lưu trữ, networking. Bài hướng dẫn này cho phép bạn chọn lựa hướng đi OpenStack riêng của mình bằng cách sử dụng kết hợp các dịch vụ chính và phụ theo các cách khác nhau. Bài hướng dẫn này sử dụng các kiến trúc mẫu sau:
zh_cn: OpenStack 是高度可配置的，以满足各种计算、网络和存储选项的需要。本指南使您能够选择使用内核的组合以及可选的服务来开启自己的 OpenStack 冒险之旅。本指南使用以下架构样例：

source: OpenStack keystone daemons
vi_vn: các daemon keystone của OpenStack

source: OpenStack neutron daemons
vi_vn: các daemon neutron của OpenStack

source: OpenStack nova daemons
vi_vn: các daemon nova của OpenStack

source: OpenStack packages
ja: OpenStack パッケージ
ru: Пакеты OpenStack
vi_vn: Các gói OpenStack
zh_cn: OpenStack包

source: OpenStack provides an Infrastructure-as-a-Service (<glossterm>IaaS</glossterm>) solution through a variety of complemental services. Each service offers an application programming interface (<glossterm>API</glossterm>) that facilitates this integration. The following table provides a list of OpenStack services:
ja: OpenStack はさまざまな相補サービスを通して Infrastructure-as-a-Service (<glossterm>IaaS</glossterm>) ソリューションを提供します。各サービスはこの統合を促す Application Programming Interface (<glossterm>API</glossterm>) を提供します。以下の表は OpenStack サービスの一覧です。
ru: OpenStack предоставляет Инфраструктуру-как-Сервис (<glossterm>IaaS</glossterm>) через ряд дополняющих друг друга служб. Каждая служба предоставляет программный интерфейс приложения (<glossterm>API</glossterm>) который облегчает интеграцию. Представленная таблица содержит список служб OpenStack:
vi_vn: OpenStack cung cấp giải pháp “Cơ sở hạ tầng như một dịch vụ” (<glossterm>IaaS</glossterm>) thông qua một loạt các dịch vụ bổ sung. Mỗi dịch vụ cung cấp một giao diện lập trình ứng dụng (<glossterm>API</glossterm>) tạo điều kiện cho sự tích hợp này. Bảng sau cun cấp danh sách các dịch vụ của OpenStack:
zh_cn: OpenStack 通过各种各样的补充服务提供基础设施即服务 (<glossterm>IaaS</glossterm>) 的解决方案。每个服务都提供了应用程序接口 (<glossterm>API</glossterm>)，这样有利于集成。下面表格中列出了 OpenStack 的服务列表：

source: OpenStack reserves certain user IDs to run specific services and own specific files. These user IDs are set up according to the distribution packages. The following table gives an overview.
vi_vn: OpenStack dành riêng một số ID người dùng để chạy một số dịch vụ và sở hữu một số file nhất định. Các ID người dùng này được thiết lập theo các gói phân phối. Bảng sau cho bạn một cái nhìn tổng quan.

source: OpenStack services support various security methods including password, policy, and encryption. Additionally, supporting services including the database server and message broker support at least password security.
ru: Службы OpenStack поддерживают различные механизмы безопасности, включая пароли, политики и шифрование. Дополнительно, вспомогательные службы, включающие сервер баз данных и брокер сообщений, поддерживают как минимум пароли.
vi_vn: Các dịch vụ OpenStack hỗ trợ nhiều phương thức bảo mật khác nhau bao gồm mật khẩu, chính sách và mã hóa. Thêm vào đó, các dịch vụ bổ trợ như máy chủ cơ sở dữ liệu và kênh truyền tin đều hỗ trợ ít nhất bảo mật bằng mật khẩu.
zh_cn: OpenStack 服务支持各种各样的安全方式，包括密码 password、policy 和 encryption，支持的服务包括数据库服务器，且消息 broker 至少支持 password 的安全方式。

source: OpenStack swift daemons
vi_vn: các daemon swift của OpenStack

source: OpenStack trove daemons
vi_vn: các daemon trove của OpenStack

source: OpenStack uses a <glossterm>message queue</glossterm> to coordinate operations and status information among services. The message queue service typically runs on the controller node. OpenStack supports several message queue services including <link xlink:href="http://www.rabbitmq.com">RabbitMQ</link>, <link xlink:href="http://qpid.apache.org">Qpid</link>, and <link xlink:href="http://zeromq.org">ZeroMQ</link>. However, most distributions that package OpenStack support a particular message queue service. This guide implements the RabbitMQ message queue service because most distributions support it. If you prefer to implement a different message queue service, consult the documentation associated with it.
vi_vn: OpenStack sử dụng một <glossterm>hàng đợi tin</glossterm> để điều phối quá trình và thông tin trạng thái giữa các dịch vụ. Dịch vụ hàng đợi tin thường chạy trên node điều khiển. OpenStack hỗ trợ một vài dịch vụ hàng đợi tin như <link xlink:href="http://www.rabbitmq.com">RabbitMQ</link>, <link xlink:href="http://qpid.apache.org">Qpid</link>, và <link xlink:href="http://zeromq.org">ZeroMQ</link>. Tuy nhiên, phần lớn các triển khai đóng gói OpenStack sẽ hỗ trợ một dịch vụ hàng đợi tin cụ thể. Bài hướng dẫn này cài đặt dịch vụ hàng đợi tin RabbitMQ bởi vì phần lớn các triển khai hỗ trợ nó. Nếu bạn mong muốn cài đặt một dịch vụ hàng đợi tin khác, tham khảo tài liệu đi kèm với nó.

source: OpenStack uses three API endpoint variants for each service: admin, internal, and public. The admin API endpoint allows modifying users and tenants by default, while the public and internal APIs do not. In a production environment, the variants might reside on separate networks that service different types of users for security reasons. For instance, the public API network might be reachable from outside the cloud for management tools, the admin API network might be protected, while the internal API network is connected to each host. Also, OpenStack supports multiple regions for scalability. For simplicity, this guide uses the management network for all endpoint variations and the default <literal>RegionOne</literal> region.
vi_vn: OpenStack sử dụng ba biến thể của API endpoint cho từng dịch vụ: admin, internal và public. Admin API endpoint mặc định cho phép việc chỉnh sửa các người dùng và tenant trong khi các public và internal API thì không. Trong môi trường thực tế, các biến thể này có thể nằm trên các hệ thống mạng riêng biệt phục vụ cho các loại người dùng khác nhau vì lý do bảo mật. Ví dụ, hệ thống mạng public API có thể được truy cập từ bên ngoài cloud bởi các công cụ quản lý, hê thống mạng admin API có thể được bảo vệ trong khi hệ thống mạng internal API được kết nối đến các máy chủ vật lý. Hơn nữa, OpenStack hỗ trợ đa vùng cho khả năng nâng cấp. Để đơn giản hóa vấn đề, phần cấu hình chúng ta đang làm sử dụng hệ thống mạng quản lý cho tất cả các biến thể của endpoint và sử dụng vùng <literal>RegionOne</literal> mặc định.

source: Optionally, configure the time zone:
ru: Дополнительно, можно настроить часовой пояс:
vi_vn: Không bắt buộc, cấu hình múi giờ:
zh_cn: 可以选择性地配置时区：
