Repository: 25hours/openstack-manuals
Catalog: doc/install-guide/locale/*.po
Languages: ja, ru, vi_vn, zh_cn

source: Configure the <application>RabbitMQ</application> access. Edit the <filename>/etc/neutron/neutron.conf</filename> file to modify the following parameters in the <literal>DEFAULT</literal> section.
ja: <application>RabbitMQ</application> のアクセス権を設定します。<literal>DEFAULT</literal> セクションにある以下のパラメーターを変更するために、<filename>/etc/neutron/neutron.conf</filename> ファイルを編集します。

source: Start Open vSwitch:
ja: Open vSwitch を起動します。

source: And configure it to start when the system boots:
ja: システム起動時に起動するよう設定します。

source: No matter which networking technology you use, you must add the <literal>br-int</literal> integration bridge, which connects to the VMs, and the <literal>br-ex</literal> external bridge, which connects to the outside world.
ja: どのネットワーク技術を使用するにしても、<literal>br-int</literal> 統合ブリッジを追加する必要があります。このブリッジは、仮想マシンと、外部に接続する <literal>br-ex</literal> 外部ブリッジを接続します。

source: Add a <glossterm>port</glossterm> (connection) from the <replaceable>EXTERNAL_INTERFACE</replaceable> interface to <literal>br-ex</literal> interface:
ja: <replaceable>EXTERNAL_INTERFACE</replaceable> インターフェースの <glossterm baseform="port">ポート</glossterm> (接続) を <literal>br-ex</literal> インターフェースに追加します。

source: The host must have an IP address associated with an interface other than <replaceable>EXTERNAL_INTERFACE</replaceable>, and your remote terminal session must be associated with this other IP address.
ja: ホストは <replaceable>EXTERNAL_INTERFACE</replaceable> 以外にインターフェースと関連づけられた IP アドレスを持つ必要があります。リモートターミナルセッションがこの他の IP アドレスと関連づけられる必要があります。

source: If you associate an IP address with <replaceable>EXTERNAL_INTERFACE</replaceable>, that IP address stops working after you issue the <placeholder-1/> command. If you associate a remote terminal session with that IP address, you lose connectivity with the host.
ja: IP アドレスを <replaceable>EXTERNAL_INTERFACE</replaceable> と関連づけた場合、<placeholder-1/> コマンドを実行した後、その IP アドレスが動作を停止します。リモートターミナルセッションをその IP アドレスと関連づけた場合、ホストへの接続が失われます。

source: For more details about this behavior, see the <emphasis>Configuration Problems</emphasis> section of the <link href="http://git.openvswitch.org/cgi-bin/gitweb.cgi?p=openvswitch;a=blob_plain;f=FAQ;hb=HEAD">Open vSwitch FAQ</link>.
ja: この動作に関する詳細は、<link href="http://git.openvswitch.org/cgi-bin/gitweb.cgi?p=openvswitch;a=blob_plain;f=FAQ;hb=HEAD">Open vSwitch FAQ</link> の <emphasis>Configuration Problems</emphasis> (接続の問題) を参照してください。

source: Configure the <replaceable>EXTERNAL_INTERFACE</replaceable> without an IP address and in promiscuous mode. Additionally, you must set the newly created <literal>br-ex</literal> interface to have the IP address that formerly belonged to <replaceable>EXTERNAL_INTERFACE</replaceable>.
ja: <replaceable>EXTERNAL_INTERFACE</replaceable> を IP アドレスなしでプロミスキャスモードに設定します。さらに、前に <replaceable>EXTERNAL_INTERFACE</replaceable> に含めた IP アドレスを持つよう、新しく作成した <literal>br-ex</literal> インターフェースを設定する必要があります。

source: Generic Receive Offload (GRO) should not be enabled on this interface as it can cause severe performance problems. It can be disabled with the ethtool utility.
ja: Generic Receive Offload (GRO) はこのインターフェースで有効化すべきではありません。深刻なパフォーマンス問題を引き起こす可能性があるためです。ethtool ユーティリティを用いて無効化できます。

source: Edit the <filename>/etc/sysconfig/network-scripts/ifcfg-EXTERNAL_INTERFACE</filename> file:
ja: <filename>/etc/sysconfig/network-scripts/ifcfg-EXTERNAL_INTERFACE</filename> ファイルを作成します。

source: Create and edit the <filename>/etc/sysconfig/network-scripts/ifcfg-br-ex</filename> file:
ja: <filename>/etc/sysconfig/network-scripts/ifcfg-br-ex</filename> を作成し、編集します。

source: You must set some common configuration options no matter which networking technology you choose to use with Open vSwitch. Configure the L3 and DHCP agents to use <acronym>OVS</acronym> and namespaces. Edit the <filename>/etc/neutron/l3_agent.ini</filename> and <filename>/etc/neutron/dhcp_agent.ini</filename> files, respectively:
ja: どのネットワーク技術を Open vSwitch と一緒に使用するかによらず、いくつかの共通設定オプションを設定する必要があります。<acronym>OVS</acronym> と名前空間を使用するために L3 エージェントと DHCP エージェントを設定する必要があります。それぞれ <filename>/etc/neutron/l3_agent.ini</filename> と <filename>/etc/neutron/dhcp_agent.ini</filename> ファイルを編集します。

source: While the examples in this guide enable network namespaces by default, you can disable them if issues occur or your kernel does not support them. Edit the <filename>/etc/neutron/l3_agent.ini</filename> and <filename>/etc/neutron/dhcp_agent.ini</filename> files, respectively:
ja: このガイドの例はデフォルトでネットワークの名前空間を有効化するとしても、問題が発生したり、カーネルがそれらをサポートしなかったりする場合、それらを無効化できます。<filename>/etc/neutron/l3_agent.ini</filename> ファイルと <filename>/etc/neutron/dhcp_agent.ini</filename> ファイルをそれぞれ編集します。

source: Edit the <filename>/etc/neutron/neutron.conf</filename> file to disable overlapping IP addresses:
ja: IP アドレスのオーバーラップを無効化するために <filename>/etc/neutron/neutron.conf</filename> を編集します。

source: Note that when network namespaces are disabled, you can have only one router for each network node and overlapping IP addresses are not supported.
ja: ネットワーク名前空間が無効化されているとき、各ネットワークノードに対してルーターを一つのみ持つことができ、IP アドレスのオーバーラップがサポートされないことに注意してください。

source: You must complete additional steps after you create the initial Neutron virtual networks and router.
ja: 初期 Neutron 仮想ネットワークとルーターを作成した後、追加のステップを完了する必要があります。

source: Similarly, you must also tell Neutron core to use <acronym>OVS</acronym>. Edit the <filename>/etc/neutron/neutron.conf</filename> file:
ja: 同様に、<acronym>OVS</acronym> を使用するよう Neutron コアに通知する必要があります。<filename>/etc/neutron/neutron.conf</filename> ファイルを編集します。

source: Configure a firewall plug-in. If you do not wish to enforce firewall rules, called <glossterm baseform="security group">security groups</glossterm> by OpenStack, you can use <literal>neutron.agent.firewall.NoopFirewall</literal>. Otherwise, you can choose one of the Networking firewall plug-ins. The most common choice is the Hybrid OVS-IPTables driver, but you can also use the Firewall-as-a-Service driver. Edit the <filename>/etc/neutron/plugins/openvswitch/ovs_neutron_plugin.ini</filename> file:
ja: ファイアウォールプラグインを設定します。OpenStack により<glossterm baseform="security group">セキュリティグループ</glossterm>と呼ばれるファイアウォールルールを強制したくない場合、<literal>neutron.agent.firewall.NoopFirewall</literal> を使用できます。そうでなければ、Networking ファイアウォールプラグインのどれかを選択できます。最も一般的な選択は OVS-iptables ハイブリッドドライバーですが、FWaaS (ファイアウォールアズアサービス) ドライバーを使用することもできます。<filename>/etc/neutron/plugins/openvswitch/ovs_neutron_plugin.ini</filename> ファイルを編集します。

source: Configure the <acronym>OVS</acronym> plug-in to use GRE tunneling, the <literal>br-int</literal> integration bridge, the <literal>br-tun</literal> tunneling bridge, and a local IP for the <replaceable>DATA_INTERFACE</replaceable> tunnel IP. Edit the <filename>/etc/neutron/plugins/openvswitch/ovs_neutron_plugin.ini</filename> file:
ja: GRE トンネリング、<literal>br-int</literal> 統合ブリッジ、<literal>br-tun</literal> トンネリングブリッジ、<replaceable>DATA_INTERFACE</replaceable> トンネル IP 用ローカル IP を使用するよう <acronym>OVS</acronym> プラグインを設定します。<filename>/etc/neutron/plugins/openvswitch/ovs_neutron_plugin.ini</filename> ファイルを編集します。

source: Configure the agents
ja: エージェントの設定

source: To perform DHCP on the software-defined networks, Networking supports several different plug-ins. However, in general, you use the <application>dnsmasq</application> plug-in.
ja: SDN で DHCP を実行するために、Networking はいくつかのプラグインをサポートします。しかしながら一般的に、 <application>dnsmasq</application> プラグインを使用します。

source: Configure the <filename>/etc/neutron/dhcp_agent.ini</filename> file:
ja: <filename>/etc/neutron/dhcp_agent.ini</filename> ファイルを設定します。

source: To allow virtual machines to access the Compute metadata information, the Networking metadata agent must be enabled and configured. The agent will act as a proxy for the Compute metadata service.
ja: 仮想マシンが Compute メタデータ情報にアクセスできるようにするために、Networking メタデータエージェントが有効化されて設定される必要があります。エージェントが Compute メタデータサービスのプロキシとして動作します。

source: On the controller, edit the <filename>/etc/nova/nova.conf</filename> file to define a secret key that will be shared between the Compute service and the Networking metadata agent.
ja: Compute サービスと Networking メタデータエージェントの間で共有される秘密鍵を定義するために、コントローラーで <filename>/etc/nova/nova.conf</filename> ファイルを編集します。

source: Add to the <literal>[DEFAULT]</literal> section:
ja: <literal>[DEFAULT]</literal> セクションに追加します。

source: Set the <literal>neutron_metadata_proxy_shared_secret</literal> key:
ja: <literal>neutron_metadata_proxy_shared_secret</literal> キーを設定します。

source: Restart the <systemitem class="service">nova-api</systemitem> service:
ja: <systemitem class="service">nova-api</systemitem> サービスを再起動します。

source: On the network node, modify the metadata agent configuration.
ja: ネットワークノードでメタデータエージェント設定を変更します。

source: Edit the <filename>/etc/neutron/metadata_agent.ini</filename> file and modify the <literal>[DEFAULT]</literal> section:
ja: <filename>/etc/neutron/metadata_agent.ini</filename> ファイルを編集し、<literal>[DEFAULT]</literal> セクションを変更します。

source: Set the required keys:
ja: 必要となるキーを設定します。

source: The value of <literal>auth_region</literal> is case-sensitive and must match the endpoint region defined in Keystone.
ja: <literal>auth_region</literal> の値は大文字小文字を区別します。Keystone で定義されたエンドポイントのリージョンと一致する必要があります。

source: If you serve the OpenStack Networking API over HTTPS with self-signed certificates, you must perform additional configuration for the metadata agent because Networking cannot validate the SSL certificates from the service catalog.
ja: 自己署名証明書を用いた HTTPS 経由で OpenStack Networking API を提供する場合、Networking がサービスカタログから SSL 証明書を検証できないため、メタデータエージェントに追加の設定をする必要があります。

source: Add this statement to the <literal>[DEFAULT]</literal> section:
ja: このステートメントを <literal>[DEFAULT]</literal> セクションに追加します。

source: In <systemitem class="library">debconf</systemitem>, the higher the priority for a screen, the greater the chance that the user sees that screen. If a <systemitem class="library">debconf</systemitem> screen has <literal>medium</literal> priority and you configure the Debian system to show only <literal>critical</literal> prompts, which is the default in Debian, the user does not see that <systemitem class="library">debconf</systemitem> screen. Instead, the default for the related package is used. In the Debian OpenStack packages, a number of <systemitem class="library">debconf</systemitem> screens are set with <literal>medium</literal> priority. Consequently, if you want to respond to all <systemitem class="library">debconf</systemitem> screens from the Debian OpenStack packages, you must run the following command and select the <literal>medium</literal> priority before you install any packages:
ja: <systemitem class="library">debconf</systemitem> では、画面の優先度が高ければ高いほど、ユーザーがその画面を参照する機会が増えます。<systemitem class="library">debconf</systemitem> 画面が <literal>medium</literal> (中) の優先度を持ち、Debian システムが <literal>critical</literal> (重要) のプロンプトのみを表示するよう設定している場合、その <systemitem class="library">debconf</systemitem> 画面が表示されません。代わりに、関連パッケージのデフォルトが使用されます。Debian OpenStack パッケージの場合、数多くの <systemitem class="library">debconf</systemitem> 画面が <literal>medium</literal> 優先度に設定されています。そのため、Debian OpenStack パッケージのすべての <systemitem class="library">debconf</systemitem> 画面をプロンプト表示したい場合、何らかのパッケージをインストールする前に、以下のコマンドを実行し、<literal>medium</literal> 優先度を選択する必要があります。

source: Configure the Object Storage service for Telemetry
ja: Telemetry 用 Object Storage Service の設定
ru: Настройте службу Объектного Хранилища для Телеметрии

source: To retrieve object store statistics, the Telemetry service needs access to Object Storage with the <literal>ResellerAdmin</literal> role. Give this role to your <literal>os_username</literal> user for the <literal>os_tenant_name</literal> tenant:
ja: オブジェクトストアの統計情報を取得するためには、Telemetry Service が <literal>ResellerAdmin</literal> ロールで Object Storage にアクセスする必要があります。このロールを <literal>os_tenant_name</literal> プロジェクトの <literal>os_username</literal> ユーザーに与えます。

source: You must also add the Telemetry middleware to Object Storage to handle incoming and outgoing traffic. Add these lines to the <filename>/etc/swift/proxy-server.conf</filename> file:
ja: 入力通信と出力通信を処理するために、Telemetry ミドルウェアを Object Storage に追加する必要もあります。これらの行を <filename>/etc/swift/proxy-server.conf</filename> ファイルに追加します。

source: Add <literal>ceilometer</literal> to the <literal>pipeline</literal> parameter of that same file:
ja: <literal>ceilometer</literal> を同じファイルの <literal>pipeline</literal> パラメーターに追加します。

source: Restart the service with its new settings:
ja: 新しい設定を用いてサービスを再起動します。
ru: Перезагрузите службу для принятия изменений:

source: Single flat network
ja: 単一のフラットなネットワーク

source: This section describes how to install the OpenStack Networking service and its components for a single flat network use case.
ja: このセクションは単一のフラットなネットワークのユースケース向けに OpenStack Networking サービスとそのコンポーネントをインストールする方法について説明します。

source: The following diagram shows the set up. For simplicity, all nodes should have one interface for management traffic and one or more interfaces for traffic to and from VMs. The management network is 100.1.1.0/24 with controller node at 100.1.1.2. The example uses the Open vSwitch plug-in and agent.
ja: 以下の図はセットアップ内容を示します。簡単のため、すべてのノードが管理通信用の 1 つのインターフェース、仮想マシンの通信用の 1 つ以上のインターフェースを持つべきです。管理ネットワークは 100.1.1.0/24 です。コントローラーノードは 100.1.1.2 です。この例は Open vSwitch プラグインとエージェントを使用します。

source: You can modify this set up to make use of another supported plug-in and its agent.
ja: サポートされている他のプラグインとエージェントを使用するために、このセットアップを変更できます。

source: The following table describes some nodes in the set up:
ja: 以下の表はこのセットアップのいくつかのノードを説明します。

source: Runs the Networking service, Identity Service, and Compute services that are required to deploy VMs (<systemitem class="service">nova-api</systemitem>, <systemitem class="service">nova-scheduler</systemitem>, for example). The node must have at least one network interface, which is connected to the Management Network. The host name is <literal>controller</literal>, which every other node resolves to the IP of the controller node.
ja: Networking Service、Identity Service、仮想マシンの配備を要求する Compute Service (例: <systemitem class="service">nova-api</systemitem>、<systemitem class="service">nova-scheduler</systemitem>) を実行します。このノードは管理ネットワークと接続するネットワークインターフェースを少なくとも 1 つ持つ必要があります。ホスト名は <literal>controller</literal> です。すべての他のノードはコントローラーノードの IP を名前解決します。

source: The <systemitem class="service">nova-network</systemitem> service should not be running. This is replaced by the OpenStack Networking component, <systemitem class="service">neutron</systemitem>. To delete a network, run this command:
ja: <systemitem class="service">nova-network</systemitem> サービスは実行すべきではありません。これは OpenStack Networking コンポーネント <systemitem class="service">neutron</systemitem> により置き換えられました。ネットワークを削除するために、このコマンドを使用します。

source: Note that a network must first be disassociated from a project using the <code>nova network-disassociate</code> command before it can be deleted.
ja: ネットワークは削除する前に、<code>nova network-disassociate</code> コマンドを使用して、まずプロジェクトから関連付けを解除する必要があることに注意してください。

source: Runs the Networking L2 agent and the Compute services that run VMs (<placeholder-1/> specifically, and optionally other nova-* services depending on configuration). The node must have at least two network interfaces. The first communicates with the controller node through the management network. The second interface handles the VM traffic on the data network. The VM can receive its IP address from the DHCP agent on this network.
ja: Networking L2 エージェントと、仮想マシンを実行する Compute Service (とくに <placeholder-1/> と、設定に依存したオプションの他の nova-* サービス) を実行します。ノードは少なくとも 2 つのネットワークインターフェースを持つ必要があります。1 つ目は管理ネットワーク経由でコントローラーノードを通信します。2 つ目のインターフェースはデータネットワークで仮想マシンの通信を処理します。仮想マシンはこのネットワークで DHCP エージェントから IP アドレスを受け取れます。

source: Runs Networking L2 agent and the DHCP agent. The DHCP agent allocates IP addresses to the VMs on the network. The node must have at least two network interfaces. The first communicates with the controller node through the management network. The second interface handles the VM traffic on the data network.
ja: Networking L2 エージェントと DHCP エージェントを実行します。DHCP エージェントはネットワーク上で IP アドレスを仮想マシンに割り当てます。ノードは少なくとも 2 つのネットワークインターフェースを持つ必要があります。1 つ目は管理ネットワーク経由でコントローラーノードと通信します。2 つ目のインターフェースはデータネットワーク上で仮想マシンの通信を処理します。

source: The demo assumes the following prerequisites:
ja: このデモは以下の前提条件を仮定しています。

source: Glance is installed, configured, and running. Additionally, an image must be available.
ja: Glance がインストールされ、設定され、実行中であること。さらに、イメージが利用可能であること。

source: OpenStack Identity is installed, configured, and running. A Networking user <emphasis role="bold">neutron</emphasis> is in place on tenant <emphasis role="bold">service</emphasis> with password <replaceable>NEUTRON_PASS</replaceable>.
ja: OpenStack Identity がインストールされ、設定され、実行中であること。Networking ユーザー <emphasis role="bold">neutron</emphasis> が <replaceable>NEUTRON_PASS</replaceable> というパスワードでプロジェクト <emphasis role="bold">service</emphasis> にあること。

source: Additional services:
ja: 追加サービス:

source: RabbitMQ is running with the default guest user and password <replaceable>RABBIT_PASS</replaceable>.
ja: RabbitMQ が標準のゲストユーザーとパスワード <replaceable>RABBIT_PASS</replaceable> で実行中であること。

source: Qpid is running with the default guest user and password.
ja: RabbitMQ が標準のゲストとパスワードで実行中であること。

source: Compute is installed and configured.
ja: コンピュートがインストールされ、設定されます。

source: Install the Networking server and respond to <systemitem class="library">debconf</systemitem> prompts to configure the database, the <code>keystone_authtoken</code>, and the RabbitMQ credentials.
ja: Networking サーバーをインストールします。データベース、<code>keystone_authtoken</code>、RabbitMQ クレデンシャルを設定するための <systemitem class="library">debconf</systemitem> プロンプトに答えます。

source: See <xref linkend="neutron-controller-node"/> for installation instructions.
ja: インストールの説明は<xref linkend="neutron-controller-node"/>を参照してください。

source: See <xref linkend="neutron-network-node"/> for database creation details.
ja: データベース作成の詳細は<xref linkend="neutron-network-node"/>を参照してください。

source: If not already configured, update the Networking <filename> /etc/neutron/neutron.conf</filename> configuration file to use the Identity Service, the plug-in, and database configuration:
ja: まだ設定していなければ、Identity Service、プラグイン、データベース設定を使用するよう Networking の設定ファイル <filename> /etc/neutron/neutron.conf</filename> を更新します。

source: Configure Networking to use your chosen plug-in:
ja: Networking が選択したプラグインを使用するよう設定します。

source: If not already configured, update the Networking <filename> /etc/neutron/neutron.conf</filename> configuration file to choose a plug-in and Identity Service user as necessary:
ja: まだ設定していなければ、必要に応じてプラグインと Identity Service のユーザーを選択するために、Networking の設定ファイル <filename> /etc/neutron/neutron.conf</filename> を更新します。

source: Update the plug-in <filename> /etc/neutron/plugins/openvswitch/ovs_neutron_plugin.ini</filename> configuration file with the bridge mappings:
ja: ブリッジのマッピングを用いてプラグインの設定ファイル <filename> /etc/neutron/plugins/openvswitch/ovs_neutron_plugin.ini</filename> を更新します。

source: Install the <systemitem class="service">nova-compute</systemitem> service.
ja: <systemitem class="service">nova-compute</systemitem> サービスをインストールします。

source: See <xref linkend="nova-compute"/> for installation instructions.
ja: インストールの説明は<xref linkend="nova-compute"/>を参照してください。

source: Update the Compute <filename> /etc/nova/nova.conf</filename> configuration file to make use of OpenStack Networking:
ja: OpenStack Networking を使用するために、Compute の設定ファイル <filename> /etc/nova/nova.conf</filename> を更新します。

source: Restart the Compute services
ja: Compute サービスの再起動

source: Compute and Network node - L2 agent
ja: コンピュートノードとネットワークノード - L2 エージェント

source: Install and start Open vSwitch. Then, configure <systemitem class="service">neutron</systemitem> accordingly.
ja: Open vSwitch をインストールし、起動します。そして、適宜 <systemitem class="service">neutron</systemitem> を設定します。

source: Add the integration bridge to Open vSwitch:
ja: 統合ブリッジを Open vSwitch に追加します。

source: Update the Networking <filename> /etc/neutron/neutron.conf</filename> configuration file:
ja: Networking の <filename>/etc/neutron/neutron.conf</filename> 設定ファイルを更新します。

source: If not already configured, update the Networking <filename> /etc/neutron/neutron.conf</filename> configuration file to use the plug-in, message queue, and database configuration:
ja: まだ設定していなければ、プラグイン、メッセージキュー、データベース設定を使用するよう Networking の設定ファイル <filename> /etc/neutron/neutron.conf</filename> を更新します。

source: Update the plug-in <filename> /etc/neutron/plugins/openvswitch/ovs_neutron_plugin.ini</filename> configuration file:
ja: プラグインの設定ファイル <filename> /etc/neutron/plugins/openvswitch/ovs_neutron_plugin.ini</filename> を更新します。

source: Create a symbolic link from <filename>/etc/neutron/plugin.ini</filename> to <filename>/etc/neutron/plugins/openvswitch/ovs_neutron_plugin.ini</filename> or <code>neutron-server</code> will not run:
ja: <filename>/etc/neutron/plugin.ini</filename> から <filename>/etc/neutron/plugins/openvswitch/ovs_neutron_plugin.ini</filename> へのシンボリックリンクを作成します。そうしないと <code>neutron-server</code> が実行されません。

source: Create the <emphasis role="bold">br-eth0</emphasis> network bridge to handle communication between nodes using eth0:
ja: eth0 を使用したノード間の通信を処理するために <emphasis role="bold">br-eth0</emphasis> ネットワークブリッジを作成します。

source: Restart the OpenStack Networking L2 agent:
ja: OpenStack Networking L2 エージェントを再起動します。

source: See <xref linkend="neutron-network-node"/> for <emphasis role="bold">generic</emphasis> installation instructions.
ja: <emphasis role="bold">一般的な</emphasis>インストールの説明は<xref linkend="neutron-network-node"/>を参照してください。

source: If not already configured, update the Networking <filename> /etc/neutron/neutron.conf</filename> configuration file to use the plug-in and message queue.
ja: まだ設定していなければ、プラグイン、メッセージキューを使用するよう Networking の設定ファイル <filename> /etc/neutron/neutron.conf</filename> を更新します。

source: Ensure that the DHCP agent is using the correct plug-in my changing the configuration in <filename> /etc/neutron/dhcp_agent.ini</filename>:
ja: DHCP エージェントが <filename> /etc/neutron/dhcp_agent.ini</filename> で設定を変更した正しいプラグインを使用していることを確認します。

source: Restart the DHCP agent:
ja: DHCP エージェントを再起動します。

source: Use the following commands on the network node.
ja: ネットワークノードで以下のコマンドを使用します。

source: Get the user information:
ja: ユーザー情報を取得します。

source: Create a internal shared network on the demo tenant ($TENANT_ID is b7445f221cda4f4a8ac7db6b218b1339):
ja: demo プロジェクト ($TENANT_ID は b7445f221cda4f4a8ac7db6b218b1339) に内部共有ネットワークを作成します。

source: Create a subnet on the network:
ja: ネットワークにサブネットを作成します。

source: Create a server for tenant A:
ja: プロジェクト A のサーバーを作成します。

source: Ping the server of tenant A:
ja: プロジェクト A のサーバーに ping します。

source: Ping the public network within the server of tenant A:
ja: プロジェクト A のサーバーの中からパブリックネットワークに ping します。

source: The 192.168.1.1 is an IP on public network to which the router connects.
ja: 192.168.1.1 はルーターに接続するパブリックネットワークの IP です。

source: Create servers for other tenants with similar commands. Because all VMs share the same subnet, they can access each other.
ja: 同様のコマンドで他のプロジェクト用のサーバーを作成します。すべての仮想マシンが同じサブネットを共有するため、お互いにアクセスできます。

source: Use case: single flat network
ja: ユースケース: 単一のフラットなネットワーク

source: The simplest use case is a single network. This is a "shared" network, meaning it is visible to all tenants via the Networking API. Tenant VMs have a single NIC, and receive a fixed IP address from the subnet(s) associated with that network. This use case essentially maps to the FlatManager and FlatDHCPManager models provided by Compute. Floating IPs are not supported.
ja: 一番シンプルなユースケースは単一のネットワークです。これは Networking API 経由ですべてのテナントから見える「共有」ネットワークです。プロジェクトの仮想マシンは単一の NIC を持ち、そのネットワークに関連づけられたサブネットから固定 IP アドレスを受け取ります。このユースケースは本質的に Compute により提供される FlatManager モデルと FlatDHCPManager モデルに対応づけられます。Floating IP はサポートされません。
