Repository: 25hours/openstack-manuals
Catalog: doc/install-guide/locale/*.po
Languages: ja, ru, vi_vn, zh_cn

source: The OpenStack Object Storage services (swift) work together to provide object storage and retrieval through a <glossterm baseform="RESTful">REST</glossterm> API. Your environment must at least include the Identity service (keystone) prior to deploying Object Storage.
ru: Службы Хранилища Объектов (swift) OpenStack работают вместе для обеспечения хранения и скачивания объектов через <glossterm baseform="RESTful">REST</glossterm> API. Ваша среда должна как минимум содержать службу Идентификации (keystone), чтобы развернуть Хранилище Объектов.
vi_vn: Các dịch vụ Object Storage của OpenStack (swift) hoạt động cùng nhau để cung cấp khả năng lưu trữ và nhận về các object thong qua một <glossterm baseform="RESTful">REST</glossterm> API. Môi trường của bạn ít nhất phải bao gồm dịch vụ Identity (keystone) trước khi triển khai Object Storage.
zh_cn: OpenStack 对象存储服务 (swift) 通过 <glossterm baseform="RESTful">REST</glossterm> API 来提供对象存储和检索。在部署对象存储前，您的环境必须至少包含认证服务 (keystone) 。

source: The OpenStack dashboard, also known as <link xlink:href="https://git.openstack.org/cgit/openstack/horizon">Horizon</link>, is a Web interface that enables cloud administrators and users to manage various OpenStack resources and services.
vi_vn: OpenStack dashboard, hay còn gọi là <link xlink:href="https://git.openstack.org/cgit/openstack/horizon">Horizon</link>, là một giao diện Web cho phép các quản trị viên và người dùng cloud quản lý các dịch vụ và tài nguyên OpenStack khác nhau.

source: The OpenStack® system consists of several key projects that you install separately. These projects work together depending on your cloud needs. These projects include Compute, Identity Service, Networking, Image Service, Block Storage, Object Storage, Telemetry, Orchestration, and Database. You can install any of these projects separately and configure them stand-alone or as connected entities. <phrase os="debian">This guide walks through an installation by using packages available through Debian 7 (code name: Wheezy).</phrase><phrase os="ubuntu">This guide walks through an installation by using packages available through Ubuntu 14.04.</phrase><phrase os="rhel;centos;fedora">This guide shows you how to install OpenStack by using packages available through Fedora 21 as well as on Red Hat Enterprise Linux 7 and its derivatives through the EPEL repository.</phrase><phrase os="opensuse;sles">This guide shows you how to install OpenStack by using packages on openSUSE 13.2 and SUSE Linux Enterprise Server 12 through the Open Build Service Cloud repository.</phrase> Explanations of configuration options and sample configuration files are included.
vi_vn: Hệ thống OpenStack® bao gồm một vài dự án chính mà bạn cài đặt riêng lẻ. Các dự án này làm việc với nhau tùy thuộc vào nhu cầu cloud của bạn. Các dự án này bao gồm Compute, Dịch vụ Identity, Networking, Dịch vụ Image, Block Storage, Object Storage, Telemetry, Orchestration và Database. Bạn có thể cài đặt bất kì dự án nào trong số các dự án này một cách riêng lẻ và cấu hình chúng một cách độc lập hoặc như là các thực thể được kết nối với nhau. <phrase os="debian">Bài này hướng dẫn cài đặt bằng cách sử dụng các gói hiện hành của Debian 7 (tên mã: Wheezy).</phrase><phrase os="ubuntu">Bài này hướng dẫn cài đặt bằng cách sử dụng các gói hiện hành của Ubuntu 14.04.</phrase><phrase os="rhel;centos;fedora">Bài này hướng dẫn cài đặt OpenStack bằng cách sử dụng các gói hiện hành của Fedora 21 cũng như Red Hat Enterprise Linux 7 và các biến thể của nó thông qua EPEL repository.</phrase><phrase os="opensuse;sles">Bài này hướng dẫn cài đặt OpenStack bằng cách sử dụng các gói của openSUSE 13.2 và SUSE Linux Enterprise Server 12 thông qua Open Build Service Cloud repository.</phrase> Đi kèm với các giải thích về các tùy chọn cấu hình và các file cấu hình mẫu.

source: The Orchestration module (heat) uses a heat orchestration template (HOT) to create and manage cloud resources.
vi_vn: Orchestration module (heat) sử udnjg một heat orchestration template (HOT) để khởi tạo và quản lý các tài nguyên cloud.
zh_cn: Orchestration 模块 (heat) 使用一个 heat orchestration template (HOT) 来创建和管理云资源。

source: The Orchestration service automatically assigns the <literal>heat_stack_user</literal> role to users that it creates during stack deployment. By default, this role restricts <glossterm>API</glossterm> operations. To avoid conflicts, do not add this role to users with the <literal>heat_stack_owner</literal> role.
ru: Сервис Оркестровки автоматически назначает роль <literal>heat_stack_user</literal> пользователям, которые создаёт во время разворачивания стека. По умолчанию, эта роль ограничивает операции <glossterm>API</glossterm>. Чтобы избежать конфликтов, не добавляйте эту роль пользователям с ролью <literal>heat_stack_owner</literal>.
vi_vn: Dịch vụ Orchestration tự động gán vai trò <literal>heat_stack_user</literal> cho những user mà nó khởi tạo trong quá trình triển khai stack. Mặc định, vai trò này giới hạn các tác vụ <glossterm>API</glossterm>. Để tránh xung đột, không thêm vai trò này vào trong các người dùng đã có vai trò <literal>heat_stack_owner</literal>.
zh_cn: Orchestration 自动地分配 <literal>heat_stack_user</literal> 给在 stack 部署过程中创建的用户。默认情况下，这个角色会限制 <glossterm>API</glossterm> 的操作。为了避免冲突，请不要为用户添加 <literal>heat_stack_owner</literal> 角色。

source: The Python MySQL library is compatible with MariaDB.
ru: Библиотека Python MySQL совместима с MariaDB.
vi_vn: Thư viện Python MySQL tương thích với MariaDB.
zh_cn: Python MySQL 库和 MariaDB 是兼容的。

source: The Telemetry chapter provides an Image service configuration that enables notifications.
vi_vn: Chương về Telemetry cung cấp một cấu hình dịch vụ Image cho phép hiển thị các thông báo.

source: The Telemetry service requires access to the Object Storage service using the <literal>ResellerAdmin</literal> role. Perform these steps on the controller node.
vi_vn: Dịch vụ Telemetry yêu cầu truy cập đến dịch vụ Object Storage bằng cách sử dụng vai trò <literal>ResellerAdmin</literal>. Thực hiện các bước sau trên node điều khiển.
zh_cn: Telemetry 服务需要使用 <literal>ResellerAdmin</literal> 角色访问对象存储服务。请在控制节点上执行这些步骤。

source: The account server uses the account ring to maintain lists of containers.
vi_vn: Máy chủ tài khoản sử dụng account ring để duy trì danh sách các container.

source: The automatic configuration process generates a self-signed SSL certificate. Consider obtaining an official certificate for production environments.
ru: Автоматическая настройка генерирует самоподписанный сертификат SSL. Обдумайте получение официального сертификата для производственной среды.
vi_vn: Quá trình tự động cấu hình sinh ra một chứng nhận SSL tự ký. Cân nhắc việc sử dụng một chứng chỉ chính thức cho các môi trường thực tế.
zh_cn: 自动化配置过程会生成一个自签证书。可以考虑为生产环境获取一个正式的证书。

source: The compute node handles connectivity and <glossterm baseform="security group">security groups</glossterm> for instances.
ru: Вычислительный узел обрабатывает связность и <glossterm baseform="security group">группы безопасности</glossterm> для инстансов.
vi_vn: Node tính toán xử lý kết nối và <glossterm baseform="nhóm bảo mật">các nhóm bảo mật</glossterm> cho các instance.
zh_cn: 计算节点处理实例的连接和<glossterm baseform="security group">安全组</glossterm>。

source: The container server uses the container ring to maintain lists of objects. However, it does not track object locations.
vi_vn: Container server sử dụng container ring để duy trì danh sách các object. Tuy nhiên, nó không theo dõi vị trí các object.

source: The dashboard enables web-based interactions with the OpenStack Compute cloud controller through the OpenStack APIs.
ja: Dashboard は OpenStack API を経由して OpenStack Compute クラウドコントローラーとウェブベースで操作できます。
ru: Панель управления включает возможность операции с OpenStack Compute на управляющем узел посредством OpenStack API.
vi_vn: Dashboard cho phép các giao tiếp chạy trên web với trình điểu khiển OpenStack Compute cloud thông qua các OpenStack API.
zh_cn: 控制面板使得通过OpenStack API与OpenStack计算云控制器进行基于web的交互成为可能。

source: The dashboard relies on functional core services including Identity, Image service, Compute, and either Networking (neutron) or legacy networking (nova-network). Environments with stand-alone services such as Object Storage cannot use the dashboard. For more information, see the <link xlink:href="http://docs.openstack.org/developer/horizon/topics/deployment.html">developer documentation</link>.
vi_vn: Dashboard hoạt động dựa vào việc hoạt động của các dịch vụ chính bao gồm Identity, Image, Compute, Networking (neutron) hoặc legacy networking (nova-network). Các môi trường với các dịch vụ độc lập như Object Storage không thể sử dụng dashboard. Để biết thêm thông tin, xem <link xlink:href="http://docs.openstack.org/developer/horizon/topics/deployment.html">tài liệu nhà phát triển</link>.

source: The debconf system helps users configure the <code>auth_uri</code>, <code>identity_uri</code>, <code>admin_tenant_name</code>, <code>admin_user</code> and <code>admin_password</code> options.
ru: Система debconf помогает пользователям настроить параметры <code>auth_uri</code>, <code>identity_uri</code>, <code>admin_tenant_name</code>, <code>admin_user</code> и <code>admin_password</code>.
vi_vn: Hệ thống debconf giúp người dùng cấu hình các tùy chọn <code>auth_uri</code>, <code>identity_uri</code>, <code>admin_tenant_name</code>, <code>admin_user</code> và <code>admin_password</code>.
zh_cn: debconf 系统会帮助用户配置 <code>auth_uri</code>、<code>identity_uri</code>、<code>admin_tenant_name</code>, <code>admin_user</code> 和 <code>admin_password</code> 选项。

source: The draft version of this guide focuses on the future Liberty release and will not work for the current Kilo release. If you want to install Kilo, you must use the <link xlink:href="http://docs.openstack.org">Kilo version</link> of this guide instead.
vi_vn: Phiên bản nháp của bài hướng dẫn này tập trung vào phiên bản Liberty và sẽ không hoạt động đối với phiên bản Kilo. Nếu bạn muốn cài Kilo, bạn phải sử dụng <link xlink:href="http://docs.openstack.org">bản Kilo</link> của hướng dẫn này.

source: The example architecture assumes use of the following networks:
ru: Пример архитектуры предполагает использование следующих сетей:
vi_vn: Kiến trúc mẫu này giả định sử dụng các hệ thống mạng sau đây:
zh_cn: 该样例架构假设使用以下网络：

source: The example architecture with OpenStack Networking (neutron) requires one controller node, one network node, and at least one compute node. The controller node contains one network interface on the <glossterm>management network</glossterm>. The network node contains one network interface on the management network, one on the <glossterm>instance tunnels network</glossterm>, and one on the <glossterm>external network</glossterm>. The compute node contains one network interface on the management network and one on the instance tunnels network.
ru: Пример архитектуры с Сетью OpenStack (neutron) требует один управляющий узел, один сетевой узел и как минимум один вычислительный узел. Управляющий узел содержит один сетевой интерфейс в <glossterm>управляющей сети</glossterm>. Сетевой узел имеет один сетевой интерфейс в управляющей сети, один в <glossterm>сети туннелей инстансов</glossterm> и один во <glossterm>внешней сети</glossterm>. Вычислительный узел имеет один сетевой интерфейс в управляющей сети и один интерфейс в сети туннелей инстансов.
vi_vn: Kiến trúc mẫu sử dụng OpenStack Networking (neutron) yêu cầu phải có một node điều khiển, một node mạng và ít nhất một node tính toán. Node điều khiển gồm một giao diện mạng trên <glossterm>mạng quản lý</glossterm>. Node mạng gồm một giao diện mạng trên mạng quản lý, một trên <glossterm>mạng các đường hầm cho máy ảo</glossterm>, và một dành cho <glossterm>mạng bên ngoài</glossterm>. Node tính toán gồm một giao diện mạng trên mạng quản lý và một trên mạng các đường hầm cho máy ảo.
zh_cn: 使用 OpenStack 网络 (neutron) 的架构样例中，需要一个控制节点、一个网络节点以及至少一个计算节点。控制节点一个在<glossterm>管理网络</glossterm>上的网络接口。网络节点在包含一个在管理网络上的网络接口，一个在<glossterm>实例隧道网络</glossterm>上，一个在<glossterm>外部网络上</glossterm>。计算节点包含一个在管理网络上的网络接口和一个在实例隧道网络上的接口。

source: The example architecture with legacy networking (nova-network) requires a controller node and at least one compute node. The controller node contains one network interface on the <glossterm>management network</glossterm>. The compute node contains one network interface on the management network and one on the <glossterm>external network</glossterm>.
ru: Пример архитектуры со старой сетью (nova-network) требует управляющий узел и как минимум один вычислительный узел. Управляющий узел содержит один сетевой интерфейс в <glossterm>управляющей сети</glossterm>. Вычислительный узел имеет один сетевой интерфейс в управляющей сети и один интерфейс во внешней сети.
vi_vn: Kiến trúc mẫu sử dụng legacy networking (nova-network) yêu cầu một node điều khiển và ít nhất là một node tính toán. Node điều khiển chứa một giao diện mạng trên <glossterm>hệ thống mạng quản lý</glossterm>. Node tính toán bao gồm một giao diện mạng trên hệ thống mạng quản lý và một trên <glossterm>hệ thống mạng ngoại vùng</glossterm>.
zh_cn: 使用传统网络 (nova-network) 的架构样例需要一个控制节点和至少一个计算节点。控制节点包含一个<glossterm>管理网络</glossterm>上的网络接口。计算节点包含一个管理网络上的网络接口和一个<glossterm>外部网络</glossterm>上的接口。

source: The external interface uses a special configuration without an IP address assigned to it. Configure the second interface as the external interface:
ru: Внешний интерфейс использует специальную конфигурацию без указания IP-адреса. Настройте второй интерфейс как внешний:
vi_vn: Giao diện ngoại vùng sẽ được cấu hình một cách đặc biệt mà không cần cấp phát một địa chỉ IP nào cả. Cấu hình giao diện thứ hai để dùng cho giao diện ngoại vùng:
zh_cn: 外部网络接口使用一个特定的配置，不分配 IP 地址给这个接口。将第二个接口配置为外部网络接口：

source: The external interface uses a special configuration without an IP address assigned to it. Configure the third interface as the external interface:
ru: Внешний интерфейс использует специальную конфигурацию без указания IP-адреса. Настройте третий интерфейс как внешний:
vi_vn: Giao diện kết nối bên ngoài sẽ được cấu hình một cách đặc biệt mà không cần gán một địa chỉ IP nào cả. Cấu hình giao diện thứ ba để dùng làm giao diện kết nối ngoài:
zh_cn: 外部网络接口使用特殊的配置，不分配 IP 地址。将第三个接口配置为外部网络接口：

source: The external network typically provides Internet access for your instances. By default, this network only allows Internet access <emphasis>from</emphasis> instances using <glossterm>Network Address Translation (NAT)</glossterm>. You can enable Internet access <emphasis>to</emphasis> individual instances using a <glossterm>floating IP address</glossterm> and suitable <glossterm>security group</glossterm> rules. The <literal>admin</literal> tenant owns this network because it provides external network access for multiple tenants.
ru: Внешняя сеть обычно предоставляет доступ в интернет для ваших инстансов. По умолчанию, эта сеть позволяет только Интернет доступ <emphasis>из</emphasis> инстансов используя <glossterm>Трансляцию сетевых адресов (NAT)</glossterm>. Вы можете дать Интернет доступ <emphasis>к</emphasis> отдельным инстансам используя <glossterm>внешний IP-адрес</glossterm> и подходящие правила <glossterm>групп безопасности</glossterm>. Проект <literal>admin</literal> является хозяином этой сети, поскольку она предоставляет доступ во внешнюю сеть для множества проектов.
vi_vn: Mạng ngoại vùng thường cung cấp việc truy nhập Internet cho các instance của bạn. Mặc định, mạng này chỉ cho phép truy nhập Internet <emphasis>từ</emphasis> các instance sử dụng <glossterm> Dịch chuyển Địa chỉ Mạng (NAT)</glossterm>. Bạn có thể bật tính năng truy cập Internet <emphasis>tới</emphasis> từng instance một bằng cách sử dụng một <glossterm> địa chỉ IP tĩnh</glossterm> và các quy tắc <glossterm>nhóm bảo mật</glossterm> thích hợp. Tenant <literal>admin</literal> sở hữu mạng này vì nó cung cấp quyền truy cập mạng ngoại vùng cho nhiều tenant khác nhau.
zh_cn: 外部网络为您的实例分配互联网连接。该网络一般仅允许<emphasis>通过</emphasis>使用<glossterm>网络地址转换 (NAT)</glossterm>的实例<emphasis>访问 Internet。您可以通过一个<glossterm>浮动IP地址</glossterm>和合适的<glossterm>安全组</glossterm>规则来启用 Internet 的访问<emphasis>到</emphasis>个别实例。<literal>admin</literal> 租户拥有这个网络，因为它为多个租户提供了外部网络的访问。

source: The following example shows how to pre-seed an automated MySQL Server installation:
ja: 以下の例は MySQL サーバーの自動インストールを事前シードする方法を示します。
vi_vn: Ví dụ dưới đấy chỉ các sắp xếp một cài đặt MySQL tự động:
zh_cn: 下面例子展示了MySQL服务器自动安装的前期处理：

source: The following screens show an example Image service configuration:
vi_vn: Các hình ảnh sau cho thấy ví dụ về cấu hình dịch vụ Image:

source: The following table provides a list of services that require passwords and their associated references in the guide: <table rules="all"><caption>Passwords</caption><thead><tr><th>Password name</th><th>Description</th></tr></thead><tbody><tr><td>Database password (no variable used)</td><td>Root password for the database</td></tr><tr><td><literal><replaceable>ADMIN_PASS</replaceable></literal></td><td>Password of user <literal>admin</literal></td></tr><tr><td><literal><replaceable>CEILOMETER_DBPASS</replaceable></literal></td><td>Database password for the Telemetry service</td></tr><tr><td><literal><replaceable>CEILOMETER_PASS</replaceable></literal></td><td>Password of Telemetry service user <literal>ceilometer</literal></td></tr><tr><td><literal><replaceable>CINDER_DBPASS</replaceable></literal></td><td>Database password for the Block Storage service</td></tr><tr><td><literal><replaceable>CINDER_PASS</replaceable></literal></td><td>Password of Block Storage service user <literal>cinder</literal></td></tr><tr><td><literal><replaceable>DASH_DBPASS</replaceable></literal></td><td>Database password for the dashboard</td></tr><tr><td><literal><replaceable>DEMO_PASS</replaceable></literal></td><td>Password of user <literal>demo</literal></td></tr><tr><td><literal><replaceable>GLANCE_DBPASS</replaceable></literal></td><td>Database password for Image service</td></tr><tr><td><literal><replaceable>GLANCE_PASS</replaceable></literal></td><td>Password of Image service user <literal>glance</literal></td></tr><tr><td><literal><replaceable>HEAT_DBPASS</replaceable></literal></td><td>Database password for the Orchestration service</td></tr><tr><td><literal><replaceable>HEAT_DOMAIN_PASS</replaceable></literal></td><td>Password of Orchestration domain</td></tr><tr><td><literal><replaceable>HEAT_PASS</replaceable></literal></td><td>Password of Orchestration service user <literal>heat</literal></td></tr><tr><td><literal><replaceable>KEYSTONE_DBPASS</replaceable></literal></td><td>Database password of Identity service</td></tr><tr><td><literal><replaceable>NEUTRON_DBPASS</replaceable></literal></td><td>Database password for the Networking service</td></tr><tr><td><literal><replaceable>NEUTRON_PASS</replaceable></literal></td><td>Password of Networking service user <literal>neutron</literal></td></tr><tr><td><literal><replaceable>NOVA_DBPASS</replaceable></literal></td><td>Database password for Compute service</td></tr><tr><td><literal><replaceable>NOVA_PASS</replaceable></literal></td><td>Password of Compute service user <literal>nova</literal></td></tr><tr><td><literal><replaceable>RABBIT_PASS</replaceable></literal></td><td>Password of user guest of RabbitMQ</td></tr><tr><td><literal><replaceable>SAHARA_DBPASS</replaceable></literal></td><td>Database password of Data processing service</td></tr><tr><td><literal><replaceable>SWIFT_PASS</replaceable></literal></td><td>Password of Object Storage service user <literal>swift</literal></td></tr><tr><td><literal><replaceable>TROVE_DBPASS</replaceable></literal></td><td>Database password of Database service</td></tr><tr><td><literal><replaceable>TROVE_PASS</replaceable></literal></td><td>Password of Database service user <literal>trove</literal></td></tr></tbody></table>
vi_vn: Bảng dưới đây cung cấp danh sách các dịch vụ yêu cầu mật khẩu và quy chiếu của chúng trong bài hướng dẫn: <table rules="all"><caption>Mật khẩu</caption><thead><tr><th>Tên mật khẩu</th><th>Mô tả</th></tr></thead><tbody><tr><td>Mật khẩu của cơ sở dữ liệu (không có biến được sử dụng)</td><td>Mật khẩu root cho cơ sở dữ liệu</td></tr><tr><td><literal><replaceable>ADMIN_PASS</replaceable></literal></td><td>Mật khẩu của người dùng <literal>admin</literal></td></tr><tr><td><literal><replaceable>CEILOMETER_DBPASS</replaceable></literal></td><td>Mật khẩu cho cơ sở dữ liệu của dịch vụ Telemetry</td></tr><tr><td><literal><replaceable>CEILOMETER_PASS</replaceable></literal></td><td>Mật khẩu cho người dùng <literal>ceilometer</literal> của dịch vụ Telemetry</td></tr><tr><td><literal><replaceable>CINDER_DBPASS</replaceable></literal></td><td>Mật khẩu cho cơ sở dữ liệu của dịch vụ Block Storage</td></tr><tr><td><literal><replaceable>CINDER_PASS</replaceable></literal></td><td>Mật khẩu cho người dùng <literal>cinder</literal> của dịch vụ Block Storage</td></tr><tr><td><literal><replaceable>DASH_DBPASS</replaceable></literal></td><td>Mật khẩu cho cơ sở dữ liệu của dashboard</td></tr><tr><td><literal><replaceable>DEMO_PASS</replaceable></literal></td><td>Mật khẩu của người dùng <literal>demo</literal></td></tr><tr><td><literal><replaceable>GLANCE_DBPASS</replaceable></literal></td><td>Mật khẩu cho cơ sở dữ liệu của dịch vụ Image</td></tr><tr><td><literal><replaceable>GLANCE_PASS</replaceable></literal></td><td>Mật khẩu cho người dùng <literal>glance</literal> của dịch vụ Image</td></tr><tr><td><literal><replaceable>HEAT_DBPASS</replaceable></literal></td><td>Mật khẩu cho cơ sở dữ liệu của dịch vụ Orchestration</td></tr><tr><td><literal><replaceable>HEAT_DOMAIN_PASS</replaceable></literal></td><td>Mật khẩu của miền Orchestration</td></tr><tr><td><literal><replaceable>HEAT_PASS</replaceable></literal></td><td>Mật khẩu cho người dùng <literal>heat</literal> của dịch vụ Orchestration</td></tr><tr><td><literal><replaceable>KEYSTONE_DBPASS</replaceable></literal></td><td>Mật khẩu cho cơ sở dữ liệu của dịch vụ Identity</td></tr><tr><td><literal><replaceable>NEUTRON_DBPASS</replaceable></literal></td><td>Mật khẩu cho cơ sở dữ liệu của dịch vụ Networking</td></tr><tr><td><literal><replaceable>NEUTRON_PASS</replaceable></literal></td><td>Mật khẩu cho người dùng <literal>neutron</literal> của dịch vụ Networking</td></tr><tr><td><literal><replaceable>NOVA_DBPASS</replaceable></literal></td><td>Mật khẩu cho cơ sở dữ liệu của dịch vụ Compute</td></tr><tr><td><literal><replaceable>NOVA_PASS</replaceable></literal></td><td>Mật khẩu cho người dùng <literal>nova</literal> của dịch vụ Compute</td></tr><tr><td><literal><replaceable>RABBIT_PASS</replaceable></literal></td><td>Mật khẩu cho người dùng guest của RabbitMQ</td></tr><tr><td><literal><replaceable>SAHARA_DBPASS</replaceable></literal></td><td>Mật khẩu cho cơ sở dữ liệu của dịch vụ xử lý Dữ liệu</td></tr><tr><td><literal><replaceable>SWIFT_PASS</replaceable></literal></td><td>Mật khẩu cho người dùng <literal>swift</literal> của dịch vụ Object Storage</td></tr><tr><td><literal><replaceable>TROVE_DBPASS</replaceable></literal></td><td>Mật khẩu cho cơ sở dữ liệu của dịch vụ Database</td></tr><tr><td><literal><replaceable>TROVE_PASS</replaceable></literal></td><td>Mật khẩu cho người dùng <literal>trove</literal> của dịch vụ Database</td></tr></tbody></table>

source: The installation process for this package can take a while.
ru: Процесс установки этого пакета может занять некоторое время.
vi_vn: Quá trình cài đặt của gói này có thể mất một lúc.
zh_cn: 这个包的安装过程需要一点时间。
