Repository: 25hours/openstack-manuals
Catalog: doc/install-guide/locale/*.po
Languages: ja, ru, vi_vn, zh_cn

source: Upload the image to the Image service using the <glossterm baseform="QEMU Copy On Write 2 (QCOW2)">QCOW2</glossterm> disk format, <glossterm>bare</glossterm> container format, and public visibility so all projects can access it:
vi_vn: Tải image lên dịch vụ Image sử dụng định dạng đĩa <glossterm baseform="QEMU Copy On Write 2 (QCOW2)">QCOW2</glossterm>, định dạng container <glossterm>bare</glossterm> và ở chế độ công khai để tất cả project đều có thể truy cập vào nó:

source: Use the <glossterm baseform="Database service">Database service</glossterm> to create cloud database resources. The integrated project name is <glossterm>trove</glossterm>.
vi_vn: Sử dụng <glossterm baseform="Database service"> dịch vụ Database </glossterm> để tạo các nguồn database cloud. Tên dự án đã được hợp nhất là <glossterm>trove</glossterm>.

source: Use the <placeholder-1/> command to create a stack from the template:
vi_vn: Sử dụng <placeholder-1/> câu lệnh để khởi tạo một chồng từ mẫu có sẵn:
zh_cn: 使用<placeholder-1/>命令行以模板创建一个栈：

source: Use the <placeholder-1/> command to retrieve meters on demand. For more information, see <link xlink:href="http://docs.openstack.org/admin-guide-cloud/content/section_telemetry-cinder-audit-script.html"><citetitle>Block Storage audit script setup to get notifications</citetitle></link>.
vi_vn: Sử dụng lệnh <placeholder-1/> để nhận về các metric theo yêu cầu. Để biết thêm thông tin, xem <link xlink:href="http://docs.openstack.org/admin-guide-cloud/content/section_telemetry-cinder-audit-script.html"><citetitle>Thiết lập script kiểm tra Block Storage để nhận thông báo</citetitle></link>.

source: Use the <placeholder-1/> command to verify successful creation of the stack:
vi_vn: Sử dụng <placeholder-1/> câu lệnh sau để xác nhận việc tạo một chồng là thành công:
zh_cn: 使用<placeholder-1/>命令行来验证栈的创建是否成功：

source: Use the YaST network module:
ru: Используйте сетевой модуль YaST:
vi_vn: Sử dụng module mạng YaST:
zh_cn: 使用 YaST 网络模块：

source: Use the database access client to connect to the database server as the <literal>root</literal> user:
ru: Используйте клиент базы данных, чтобы соединиться с ней как пользователь <literal>root</literal>:
vi_vn: Sử dụng client để kết nối tới máy chủ cơ sở dữ liệu với tư cách người dùng <literal>root</literal>:
zh_cn: 以 <literal>root</literal> 用户身份通过数据库客户端连接到数据库服务：

source: Use the random value that you generated in a previous step. If you install using non-interactive mode or you do not specify this token, the configuration tool generates a random value.
ru: Используйте случайную строку, которую вы сгенерировали на предыдущем шаге. Если вы устанавливаете в неинтерактивном режиме или не укажете этот токен, инструмент настройки задаст случайное значение.
vi_vn: Sử dụng giá trị ngẫu nhiên mà bạn tạo ra ở bước trước đó. Nếu bạn cài đặt sử dụng chế độ không tương tác hoặc bạn không chỉ rõ token này, công cụ cấu hình sẽ tạo ra một giá trị ngẫu nhiên.
zh_cn: 使用在上一步中生成的随机字符串。如果处于非交互模式或者没有指定令牌，配置工具将自动生成一段随机字符串。

source: Verify addition of the key pair:
vi_vn: Xác nhận việc thêm cặp khóa:

source: Verify addition of the public key:
ru: Проверьте добавление публичного ключа:
vi_vn: Xác minh việc thêm khóa công khai:
zh_cn: 验证公钥的添加：

source: Verify connectivity
ja: 接続性の検証
ru: Проверка соединения
vi_vn: Kiểm tra kết nối
zh_cn: 验证连通性

source: Verify creation and availability of the volume:
vi_vn: Xác nhận việc khởi tạo và tính sẵn sàng của ổ lưu trữ:
zh_cn: 验证卷的创建和可用性：

source: Verify creation of the network:
ru: Проверьте, создалась ли сеть:
vi_vn: Kiểm tra việc khởi tạo hệ thống mạng:
zh_cn: 验证网络的创建：

source: Verify network connectivity using <placeholder-1/> from the controller node or any host on the external network:
ru: Проверьте связность сети используя <placeholder-1/> с управляющего узла или любого хоста во внешней сети:
vi_vn: Kiểm tra kết nối mạng bằng cách sử dung <placeholder-1/> từ node điều khiển hoặc bất kỳ máy vật lý nào trên hệ thống mạng ngoại vùng:
zh_cn: 在控制节点或其他主机的外部网络上使用 <placeholder-1/> 验证网络的连通性：

source: Verify operation
ru: Проверьте работу
vi_vn: Xác nhận hoạt động
zh_cn: 验证操作

source: Verify operation of the Compute service.
vi_vn: Kiểm tra hoạt động của dịch vụ Compute.
zh_cn: 验证计算服务的操作。

source: Verify operation of the Identity service before installing other services.
vi_vn: Kiểm tra hoạt động của dịch vụ Identity trước khi cài đặt các dịch vụ khác.

source: Verify operation of the Image service using <link xlink:href="http://launchpad.net/cirros">CirrOS</link>, a small Linux image that helps you test your OpenStack deployment.
vi_vn: Kiểm tra hoạt động của dịch vụ Image bằng cách sử dụng <link xlink:href="http://launchpad.net/cirros">CirrOS</link>, một image Linux nhỏ giúp bạn kiểm tra hoạt động của hệ thống OpenStack của mình.

source: Verify the <literal>demo-net</literal> network:
ja: <literal>demo-net</literal> ネットワークを検証します。
ru: Проверьте сеть <literal>demo-net</literal>:
vi_vn: Xác thực mạng <literal>demo-net</literal>
zh_cn: 验证 <literal>demo-net</literal> 网络：

source: Verify the <literal>demo-net</literal> tenant network gateway:
ru: Проверьте шлюз сети проекта <literal>demo-net</literal>:
vi_vn: Xác nhận gateway của mạng tenant <literal>demo-net</literal>:
zh_cn: 验证 <literal>demo-net</literal> 租户的网络网关：

source: Verify the <literal>ext-net</literal> external network:
ru: Проверьте внешнюю сеть <literal>ext-net</literal>:
vi_vn: Kiểm tra hệ thống mạng ngoại vùng <literal>ext-net</literal>:
zh_cn: 验证 <literal>ext-net</literal> 的外部网络：

source: Verify the Data processing service installation
vi_vn: Xác nhận việc cài đặt dịch vụ xử lý Dữ liệu
zh_cn: 验证数据处理服务的安装

source: Verify the Database service installation
vi_vn: Xác nhận việc cài đặt dịch vụ Database
zh_cn: 验证数据服务的安装

source: Verify the Telemetry installation
ja: Telemetry のインストールの検証
ru: Проверка установки Телеметрии
vi_vn: Xác nhận việc cài đặt Telemetry
zh_cn: 验证 Telemetry 的安装

source: Verify the ring contents:
ru: Проверьте содержимое кольца:
vi_vn: Kiểm tra nội dung của ring:

source: We recommend that you verify NTP synchronization before proceeding further. Some nodes, particularly those that reference the controller node, can take several minutes to synchronize.
ru: Мы рекомендуем вам проверить синхронизацию NTP перед тем, как двигаться дальше. Некоторым узлам, особенно тем, которые используют управляющий узел, может потребоваться несколько минут.
vi_vn: Chúng tôi khuyên bạn nên xác thực việc đồng bộ hóa NTP trước khi làm các bước tiếp theo. Một vài nút, đặc biệt là những nút có tham chiếu tới nút controller, có thể mất một chút thời gian cho việc đồng bộ hóa.
zh_cn: 我们建议您在继续进一步的操作之前验证 NTP 的同步。有些节点，特别是哪些引用了控制节点的，需要花费一些时间去同步。

source: We recommend that you verify network connectivity and resolve any issues before proceeding further. Following the external network subnet example using <literal>203.0.113.0/24</literal>, the tenant router gateway should occupy the lowest IP address in the floating IP address range, <literal>203.0.113.101</literal>. If you configured your external physical network and virtual networks correctly, you should be able to <placeholder-1/> this IP address from any host on your external physical network.
ru: Мы рекомендуем вам проверить связность сети и решить все проблемы прежде чем продолжать дальше. Используя пример подсети внешней сети использующий <literal>203.0.113.0/24</literal>, шлюз маршрутизатора проекта должен занять самый нижний IP-адрес в диапозоне внешних IP-адресов, <literal>203.0.113.101</literal>. Если вы настроили ваши внешнюю физческую и виртуальную сеть правильно, у вас получится сделать <placeholder-1/> на этот IP адрес с любого хоста в вашей внешней физической сети.
vi_vn: Chúng tôi khuyên bạn nên kiểm tra các kết nối mạng và xử lý bất kì vấn đề nào nảy sinh trước khi tiếp tục các phần cài đặt tiếp theo. Ví dụ như khi subnet của hệ thống mạng ngoại vùng sử dụng dải mạng <literal>203.0.113.0/24</literal>, tenant router gateway nên nhận địa chỉ nhỏ nhất trong dải IP động, <literal>203.0.113.101</literal>. Nếu như bạn cấu hình mạng vật lý ngoại vùng và các mạng ảo chính xác, bạn phải <placeholder-1/> được từ địa chỉ IP này đến bất kì máy vật lý nào trên hệ thống mạng vật lý ngoại vùng.
zh_cn: 我们建议您在继续进行前验证网络连通性和解决其他任何问题。沿袭外部网络子网使用<literal>203.0.113.0/24</literal>的例子，租户路由网关应该占用了浮动IP地址范围内的最小IP地址，<literal>203.0.113.101</literal>。如果您正确的配置了您的外部物理网络和虚拟网络，您应该能够从您的外部物理网络上的任意主机<placeholder-1/>这个IP地址。

source: We recommend that you verify network connectivity to the Internet and among the nodes before proceeding further.
ru: Мы рекомендуем проверить связь с Интернетом и между узлами перед тем как двигаться дальше.
vi_vn: Chúng tôi khuyên bạn kiểm tra kết nối mạng ra ngoài Internet và giữa các node trước khi tiếp tục.
zh_cn: 我们建议您在继续进行之前，验证到 Internet 和各个节点之间的连通性。

source: When you implement this architecture, skip <xref linkend="section_neutron-networking"/> in <xref linkend="ch_networking"/>. To use optional services, you might need to build additional nodes, as described in subsequent chapters.
ru: Когда вы воссоздадите эту архитектуру, перейдите к <xref linkend="section_neutron-networking"/> в <xref linkend="ch_networking"/>. Для использования дополнительных служб, вам может потребоваться создать дополнительные узлы, как описанов в последующих разделах.
vi_vn: Khi bạn cài đặt kiến trúc này, bỏ qua phần <xref linkend="section_neutron-networking"/> trong <xref linkend="ch_networking"/>. Để sử dụng các dịch vụ tùy chọn, bạn có thể phải xây dựn thêm các node khác như mô tả trong các chương kế sau.

source: When you implement this architecture, skip <xref linkend="section_nova-networking"/> in <xref linkend="ch_networking"/>. Optional services might require additional nodes or additional resources on existing nodes.
ru: Когда вы воссоздадите эту архитектуру, перейдите к <xref linkend="section_nova-networking"/> в <xref linkend="ch_networking"/>. Дополнительные службы могут потребовать дополнительные узлы или дополнительные ресурсы на имеющихся узлах.
vi_vn: Khi bạn cài đặt kiến trúc này, bỏ qua phần <xref linkend="section_nova-networking"/> trong <xref linkend="ch_networking"/>. Các dịch vụ tùy chọn có thể sẽ yêu cầu thêm các node hoặc thêm tài nguyên trên các node hiện hành.

source: When you install a package for an API service, you are prompted to register that service. However, after you install or upgrade the package for an API service, Debian immediately removes your response to this prompt from the <package>debconf</package> database. Consequently, you are prompted to re-register the service with the Identity Service. If you already registered the API service, respond <literal>no</literal> when you upgrade.
ja: API サービス用のパッケージをインストールするとき、サービスを登録するために、プロンプトが表示されます。しかしながら、API サービス用のパッケージをインストールまたはアップグレードした後、Debian はこのプロンプトの内容を <package>debconf</package> データベースからすぐに削除します。その結果として、Identity Service でサービスを設定するためにプロンプトが表示されます。すでに API サービスを登録していれば、アップグレードするときに <literal>no</literal> と答えます。
vi_vn: Khi cài đặt một gói của dịch vụ API, bạn sẽ được nhắc đăng ký dịch vụ đó. Tuy nhiên, sau khi bạn cài đặt hoặc nâng cấp các gói của một dịch vụ API, Debian ngay lập tức xóa phản hồi của bạn với nhắc nhở này từ cơ sở dữ liệu <package>debconf</package>. Do đó, bạn sẽ được nhắc đăng ký lại dịch vụ này với Dịch vụ Identity. Nếu bạn đã đăng ký dịch vụ API, trả lời <literal>no</literal> khi bạn nâng cấp.
zh_cn: 当你安装好API服务的包后，你被提示注册该服务。但是，在安装或者升级API包之后，Debian立即在 <package>debconf</package>数据库中删除了你的输入信息。所以，你又被再次提醒注册服务。如果你已经注册了API服务，只要在升级的时候回答<literal>no</literal>就可以了。

source: When you install or upgrade a Debian package, all configuration file values are preserved. Using the <systemitem class="library">debconf</systemitem> database as a registry is considered a bug in Debian. If you edit something in any OpenStack configuration file, the <systemitem class="library">debconf</systemitem> package reads that value when it prepares to prompt the user. For example, to change the log in name for the RabbitMQ messaging queue for a service, you can edit its value in the corresponding configuration file.
ja: Debian パッケージをインストールまたはアップグレードするとき、すべての設定値は保護されます。レジストリとして <systemitem class="library">debconf</systemitem> データベースを使用することは Debian でバグとみなされます。あらゆる OpenStack 設定ファイルで何かを編集する場合、ユーザーにプロンプトを表示するとき、<systemitem class="library">debconf</systemitem> パッケージがその値を読み込みます。例えば、サービス用の RabbitMQ メッセージングキューの名前でログを変更するために、対応する設定ファイルでその値を編集できます。
vi_vn: Khi bạn cài đặt hoặc cài đặt một gói Debian, tất cả các giá trị tập tin cấu hình đều được bảo quản. Sử dụng cơ sở dữ liệu <systemitem class="library">debconf</systemitem> như là một registry bị coi là một lỗi trong Debian. Nếu bạn thay đổi thông tin gì trong bất kỳ tập tin cáu hình OpenStack nào, gói sẽ đọc giá trị đó khi nó chuẩn bị để hỏi người dùng. Ví dụ, để thay đổi file ghi chép của hàng đợi tin RabbitMQ cho một dịch vụ, bạn có thể sửa giá trị của nó trong tập tin cấu hình tương ứng.
zh_cn: 当你安装或者升级Debian包时，所有的配置文件中的值都会被保留。把<systemitem class="library">debconf</systemitem>数据库作为注册表在Debian中被认为是一个bug。如果你编辑任何OpenStack配置文件，<systemitem class="library">debconf</systemitem>会读出该数据值并且提示给用户。例如，要改变RabbitMQ消息队列的登陆名称，你可以直接在相应的配置文件中编辑该数据值。

source: You are prompted for the Identity Service <literal>admin_token</literal> value. The Identity Service uses this value to register the API service. When you set up the <package>keystone</package> package, this value is configured automatically.
ja: Identity Service の <literal>admin_token</literal> 値に対するプロンプトが表示されます。Identity Service が API サービスを登録するためにこの値を使用します。<package>keystone</package> パッケージをセットアップするとき、この値が自動的に設定されます。
vi_vn: Bạn sẽ được hỏi đến giá trị <literal>admin_token</literal> của Dịch vụ Identity. Dịch vụ Identity sử dụng giá trị này để đăng ký dịch vụ API. Khi bạn thiết lập gói <package>keystone</package>, giá trị này được cấu hình tự động.
zh_cn: 你被提示要求输入Identity服务的<literal>admin_token</literal>值。Identity服务使用这个值注册API服务。当你安装了<package>keystone</package>之后，这个值会被自动配置。

source: You can also disable journaling. For more information, see the <link xlink:href="http://docs.mongodb.org/manual/">MongoDB manual</link>.
vi_vn: Bạn cũng có thể tắt ghi chép nhật ký. Để biết thêm thông tin, xem <link xlink:href="http://docs.mongodb.org/manual/">MongoDB manual</link>.

source: You can also reference a flavor by ID.
ru: Вы так же можете указывать схему по ID.
vi_vn: Bạn cũng có thể tham chiếu một flavor thông qua ID.
zh_cn: 您也可以以 ID 引用类型。

source: You can modify these ranges and gateways to work with your particular network infrastructure.
ru: Вы можете изменить эти диапазоны согласно вашей сетевой инфраструктуре.
vi_vn: Bạn cũng có thẻ tùy chỉnh các dải mạng và gateway này sao cho phù hợp với hạ tầng mạng riêng của bạn.
zh_cn: 您可以修改这些范围和网关来以您的特定网络设施进行工作。

source: You can pre-seed all <systemitem class="library">debconf</systemitem> prompts. To pre-seed means to store responses in the <package>debconf</package> database so that <package>debconf</package> does not prompt the user for responses. Pre-seeding enables a hands-free installation for users. The package maintainer creates scripts that automatically configure the services.
ja: すべての <systemitem class="library">debconf</systemitem> プロンプトに事前シードできます。事前シードとは <package>debconf</package> がユーザーにプロンプトを表示しないよう、<package>debconf</package> データベースに応答を保存することを意味します。事前シードによりユーザーの手がかからないインストールをできるようになります。パッケージのメンテナーがサービスを自動的に設定できるスクリプトを作成します。
vi_vn: Bạn có thể sắp xếp trước tất cả các nhắc nhở <systemitem class="library">debconf</systemitem>. Sắp xếp trước nghĩa là lưu các phản hồi trong cơ sở dữ liệu <package>debconf</package> để cho <package>debconf</package> không hiện lên và yêu cầu phản hồi từ người dùng. Sắp xếp trước giúp người dùng rảnh tay khi cài đặt. Trình duy trì gói khởi tạo các scipt tự động cấu hình các dịch vụ.
zh_cn: 你可以对所有的 <systemitem class="library">debconf</systemitem>提示进行预置输入。预置输入是指在<package>debconf</package>数据库中保存响应的内容，这样<package>debconf</package>就无需再提示用户进行响应。预置输入可以让用户不干预安装进程。软件包的维护者生成脚本来自动配置相关服务。

source: You can repeat this procedure to create additional projects and users.
vi_vn: Bạn có thể lặp lại quy trình này để tạo thêm các dự án và người dùng.

source: You must add the <literal>heat_stack_owner</literal> role to users that manage stacks.
ru: Вам небходимо добавить роль <literal>heat_stack_owner</literal> пользователям, которые управляют стеком.
vi_vn: Bạn phải thêm vai trò <literal>heat_stack_owner</literal> vào trong những người dùng quản lý các stack.
zh_cn: 您必须为管理栈的用户添加 <literal>heat_stack_owner</literal> 的角色。

source: You must configure each storage node before you install and configure the Object Storage service on it. Similar to the controller node, each storage node contains one network interface on the <glossterm>management network</glossterm>. Optionally, each storage node can contain a second network interface on a separate network for replication. For more information, see <xref linkend="ch_basic_environment"/>.
vi_vn: Bạn phải cấu hình từng node lưu trữ trước khi cài đặt và cấu hình Object Storage trên chúng. Tương tự như node điều khiển, mõi node lưu trữ đều bao gồm một giao diện mạng thuộc <glossterm>hệ thống mạng quản lý</glossterm>. Ngoài ra, mỗi node lưu trữ có thể bao gồm một giao diện mạng thứ hai nằm trên một hệ thống mạng riêng biệt dùng cho mục đích sao lưu. Để biết thêm chi tiết, xem <xref linkend="ch_basic_environment"/>.
zh_cn: 在您安装和配置卷服务之前，您必须先配置存储节点。类似于控制节点，存储节点包含一个 <glossterm>管理网络</glossterm> 接口上的网络。存储节点可以选择性地包含第二个网络接口到一个独立地网络上，用以复制。要了解更多信息，请阅读<xref linkend="ch_basic_environment"/>。

source: You must configure the storage node before you install and configure the volume service on it. Similar to the controller node, the storage node contains one network interface on the <glossterm>management network</glossterm>. The storage node also needs an empty block storage device of suitable size for your environment. For more information, see <xref linkend="ch_basic_environment"/>.
ru: Вам необходимо настроить узел хранилища, прежде чем вы установите и настроите службу дисков на нём. Так же как управляющий узел, узел хранилища содержит один сетевой интерфейс в <glossterm>управляющей сети</glossterm>. Узел хранилища так же требует пустое блочное устройство подходящего для вашей среды размера. Подробнее смотрите в <xref linkend="ch_basic_environment"/>.
vi_vn: Bạn phải cấu hình node lưu trữ trước khi cài đặt và cấu hình dịch vụ ổ lưu trữ trên nó. Tương tự như node điều khiển, node lưu trữ chứa một giao diện mạng nằm trên <glossterm>hệ thống mạng quản lý</glossterm>. Node lưu trữ cũng cần một thiết bị block storage trống có kích thước phù hợp với môi trường của bạn. Để biết thêm thông tin, xem <xref linkend="ch_basic_environment"/>.
zh_cn: 在您安装和配置卷服务之前，您必须先配置存储节点。类似于控制节点，存储节点包含一个 <glossterm>管理网络</glossterm> 接口上的网络。存储节点也需要一个适合您环境大小的空的块存储设备。要了解更多信息，请阅读<xref linkend="ch_basic_environment"/>。

source: You must create a partition table and file system to use the volume.
ru: Вам необходимо создать таблицу разделов и файловую систему, чтобы использовать диск.
vi_vn: Bạn phải tạo một bảng phân vùng và hệ thống thư mục để sử dụng volume.
zh_cn: 您必须创建一个分开的表和文件系统以使用卷。

source: You must enable remote access before you install OpenStack services on multiple nodes.
ru: Вам необходимо включить удалённый доступ, прежде чем устанавливать службы OpenStack на несколько узлов.
vi_vn: Bạn phải bật tính năng cho phép truy cập từ xa trước khi bạn cài đặt các dịch vụ OpenStack trên nhiều node.
zh_cn: 在你安装OpenStack服务到多节点上之前必须保证能远程访问。

source: You must install <glossterm baseform="Network Time Protocol (NTP)">NTP</glossterm> to properly synchronize services among nodes. We recommend that you configure the controller node to reference more accurate (lower stratum) servers and other nodes to reference the controller node.
ru: Вам необходимо установить <glossterm baseform="Network Time Protocol (NTP)">NTP</glossterm>, чтобы правильно синхронизировать службы между узлами. Мы рекомендуем настроить управляющий узел на использование более точных (нижнего уровня) серверов и другие узлы на использование управляющего узла.
vi_vn: Bạn cần phải cài đặt <glossterm baseform="Network Time Protocol (NTP)">NTP</glossterm> với các dịch dụ đồng bộ thích hợp giữa các nút với nhau. Chúng tôi khuyên bạn nên cấu hình nút điều khiển để tham chiếu tới các server chính xác hơn (ở các tầng thấp hơn) và các nút khác có thể tham chiếu lại tới nút điều khiển.
zh_cn: 您必须安装 <glossterm baseform="Network Time Protocol (NTP)">NTP</glossterm> 来正确地在各个节点之间同步服务。我们推荐您配置控制节点来关联更准确的 (下层的) 服务器，然后将其他节点与控制节点关联。

source: You must pass the value of the authentication token to the <placeholder-1/> command with the <parameter>--os-token</parameter> parameter or set the <envar>OS_TOKEN</envar> environment variable. Similarly, you must also pass the value of the Identity service URL to the <placeholder-2/> command with the <parameter>--os-url</parameter> parameter or set the <envar>OS_URL</envar> environment variable. This guide uses environment variables to reduce command length.
vi_vn: Bạn phải chuyển giá trị của token xác thực sang câu lệnh <placeholder-1/> với thông số <parameter>--os-token</parameter> hoặc đặt biến môi trường <envar>OS_TOKEN</envar>. Tương tự, bạn phải chuyển giá trị của URL của dịch vụ Identity sang câu lệnh <placeholder-2/> với thông số <parameter>--os-url</parameter> hoặc đặt biết môi trường <envar>OS_URL</envar>. Bài hướng dẫn này sử dụng các biến môi trường để giảm độ dài câu lệnh.

source: You must reference volumes using the IDs instead of names.
ru: Вам необходимо указывать диски по ID вместо имён.
vi_vn: Bạn phải trỏ đến các ổ lưu trữ bằng ID thay vì bằng tên của chúng.
zh_cn: 您必须使用实例的 ID 来关联卷，不能使用实例名称。

source: You must source the <literal>admin</literal> tenant credentials for this step and then source the <literal>demo</literal> tenant credentials for the remaining steps.
ru: Вам необходимо загрузить учётные данные проекта <literal>admin</literal> для этого шага и затем учётные данные проекта <literal>demo</literal> для последующих шагов.
vi_vn: Bạn phải đưa ra thông tin xác thực của <literal>admin</literal> tenant cho bước này và đưa ra thông tin xác thực của <literal>demo</literal> tenant cho các bước còn lại.
zh_cn: 您必需 source <literal>admin</literal> 租户的凭证来执行该步骤，然后再 source <literal>demo</literal> 租户的凭证来执行剩下的步骤。

source: You must use an account with administrative privileges to configure each node. Either run the commands as the <literal>root</literal> user or configure the <literal>sudo</literal> utility.
ru: Вам необходимо использовать аккаунт с административными привилегиями для настройки каждого узла. Исполняйте команды от пользователя <literal>root</literal> или настройте утилиту <literal>sudo</literal>.
vi_vn: Bạn phải sử dụng một tài khoản với các quyền quản trị để cấu hình từng node bằng cách chạy các lệnh với tư cách là người dùng <literal>root</literal> hoặc cấu hình tiện ích <literal>sudo</literal>.
zh_cn: 您必须使用一个包含管理员权限的帐户来配置每个节点。以 <literal>root</literal> 用户执行命令或配置使用 <literal>sudo</literal>。

source: You need to install the required packages. For now, sahara doesn't have packages for Ubuntu. Documentation will be updated once the packages are available. The rest of this document assumes that you have the sahara service packages installed on the system.
vi_vn: Bạn cần phải cài đặt các gói phần mềm cần thiết. Cho đến giờ sahara không có các gói cho Ubuntu. Tài liệu sẽ được cập nhật một khi các gói trở nên khả dụng. Phần còn lại của tài liệu giả định các gói phần mềm của dịch vụ sahara đã được cài đặt trên hệ thống của bạn.
zh_cn: 您需要安装依赖的包。目前，sahara 没有 Ubuntu 的包。包可用时，文档会更新。该文档会假设您已经在系统中安装了 sahara 服务的相关包。

source: You need to take upstream <filename>api-paste.ini</filename> and change content below in it:
vi_vn: Bạn cần thay đổi nội dung trong thư mục <filename>api-paste.ini</filename> với nội dung như sau:
zh_cn: 您需要采用上游的 <filename>api-paste.ini</filename> 并修改以下内容：
