Repository: 25hours/openstack-manuals
Catalog: doc/install-guide/locale/*.po
Languages: ja, ru, vi_vn, zh_cn

source: By default, MongoDB creates several 1GB journal files in the /var/lib/mongodb/journal directory. If you want to reduce the size of each journal file to 128MB and limit total journal space consumption to 512MB, assert the smallfiles key:
vi_vn: Mặc định, MongoDB tạo ra một vài file nhật ký nặng 1 GB trong thư mục /var/lib/mongodb/journal. Nếu bạn muốn giảm size của từng file nhật ký xuống 128 MB và giới hạn khả năng tiêu tốn dung lượng của nhật ký xuống 512 MB, yêu cầu khóa smallfiles :

source: By default, SLES and openSUSE use a SQL database for session storage. For simplicity, we recommend changing the configuration to use <application>memcached</application> for session storage.
ru: По умолчанию, SLES и openSUSE используют SQL СУБД для хранения сессий. Для простоты, мы рекоммендуем изменить конфигурацию на использование <application>memcached</application> для хранения сессий.
vi_vn: Mặc định, SLES và OpenSUSE sử dụng cơ sở dữ liệu SQL để lưu trữ phiên làm việc. Để cho đơn giản, chúng tôi khuyên bạn nên thay đổi cấu hình để sử dụng <application>memcached</application> làm kho lưu trữ phiên làm việc.
zh_cn: 默认情况下，SLES 和 openSUSE 为会话存储使用 SQL 数据库。简单起见，我们建议修改配置，为会话存储使用 <application>memcached</application>。

source: By default, distribution packages configure Compute to use legacy networking. You must reconfigure Compute to manage networks through Networking.
ru: По умолчанию, пакеты дистрибутива настраивают службу Вычислений на использование старой сети. Вам необходио перенастроить службу Вычислений на управление сетями через службу Сетей.
vi_vn: Mặc định, các gói phân phối cấu hình cho Compute sử dụng legacy networking. Bạn phải cấu hình lại để Compute quản lý các hệ thống mạng thông qua Networkin.
zh_cn: 默认情况下，分配的包会配置 Compute 使用传统网络。您必需重新配置 Compute 来通过 Networking 来管理网络。

source: By default, the <package>dbconfig-common</package> package configures the OpenStack services to use SQLite. So if you use <package>debconf</package> in non-interactive mode and without pre-seeding, the OpenStack services that you install will use SQLite.
ru: По умолчанию пакет <package>dbconfig-common</package> настраивает службы OpenStack на использование SQLite. Поэтому, если вы используете <package>debconf</package> в неинтерактивном режиме и без предварительной настройки, устанавливаемые службы OpenStack будут использовать SQLite.
vi_vn: Mặc định, gói <package>dbconfig-common</package> cấu hình các dịch vụ OpenStack sử dụng SQLite. Cho nên nếu bạn sử dụng package>debconf</package> ở chế độ không tương tác và không sắp đặt trước, các dịch vụ OpenStack mà bạn cài đặt sẽ sử dụng SQLite.
zh_cn: 默认情况下，<package>dbconfig-common</package> 的包将 OpenStack 服务配置为使用 SQLite。因此，如果您使用的是 <package>debconf</package> 的非交互模式且没有进行预先配置，那么您安装 OpenStack 服务时将会使用 SQLite。

source: By default, the Identity service database contains no information to support conventional authentication and catalog services. You must use a temporary authentication token that you created in <xref linkend="keystone-install"/> to initialize the service entity and API endpoint for the Identity service.
vi_vn: Mặc định, cơ sở dữ liệu của dịch vụ Identity không chứa các thông tin hỗ trợ việc xác thực thông thường và các dịch vụ danh mục. Bạn phải sử dụng một token xác thực tạm thời mà bạn đã tạo ra trong <xref linkend="keystone-install"/> để khởi tạo thực thể dịch vụ và API endpoint cho dịch vụ Identity.

source: By default, the Identity service stores expired tokens in the SQL database indefinitely. The accumulation of expired tokens considerably increases the database size and degrades performance over time, particularly in environments with limited resources.
vi_vn: Mặc định dịch vụ Identity sẽ lưu trữ vô thời hạn những token hết hạn trong cơ sở dữ liệu SQL. Sự tích luỹ những token hết hạn làm tăng kích thước của cơ sở dữ liệu một cách đáng kể và giảm hiệu năng theo thời gian, đặc biệt trong những môi trường với tài nguyên hạn chế.

source: By default, the Ubuntu packages create a SQLite database.
ru: По умолчанию, пакеты Ubuntu создают базу данных SQLite.
vi_vn: Mặc định các gói phần mềm Ubuntu tạo ra cơ sở dữ liệu SQLite.
zh_cn: Ubuntu 软件包默认会创建一个 SQLite 数据库。

source: By default, the Ubuntu packages create an SQLite database.
ru: По умолчанию, пакеты Ubuntu создают базу данных SQLite.
vi_vn: Mặc định thì các gói của Ubuntu khởi tạo một cơ sở dữ liệu của SQLite.
zh_cn: 默认情况下，Ubuntu 上的安装包会自动创建一个 SQLite 数据库。

source: By default, the Ubuntu packages create an SQLite database. Because this configuration uses a SQL database server, remove the SQLite database file:
vi_vn: Mặc định các gói Ubuntu tạo ra một cơ sở dữ liệu SQLite. Bởi vì phần cấu hình này sử dụng một máy chủ cơ sở dữ liệu SQL, bạn có thể xóa bỏ các tập tin cơ sở dữ liệu SQLite:
zh_cn: 默认情况下，Ubuntu 包会创建一个 SQLite 数据库。因为该配置要使用一个 SQL 的数据库服务器，因此要移除 SQLite 数据库文件：

source: By default, the controller node synchronizes the time via a pool of public servers. However, you can optionally edit the <filename>/etc/ntp.conf</filename> file to configure alternative servers such as those provided by your organization.
ru: По умолчанию управляющий узел синхронизует время через пул публичных серверов. Однако, вы можете изменить файл <filename>/etc/ntp.conf</filename> и использовать альтернативные сервера, например те, которые предоставляются вашей организацией.
vi_vn: Mặc định thì các nút điều khiển tự đồng bộ hóa thời gian thông qua khác server public khác. Tuy nhiên, bạn cũng có thể thay đổi thư mục <filename>/etc/ntp.conf</filename> để cấu hình các server thay thế khác ví dụ như các server trong tổ chức của bạn.
zh_cn: 默认情况下，控制节点通过有个公共服务器的池来同步时间。但是，您也可以选择修改配置文件 <filename>/etc/ntp.conf</filename> 来配置选择的服务器，例如，您的组织中自行提供的服务器。

source: CentOS and Fedora do not require these repositories.
vi_vn: CentOS và Fedora không yêu cầu cần có các repository này.

source: Change the ownership of <filename>/etc/keystone/keystone.conf</filename> to give the <literal>keystone</literal> system access to it:
vi_vn: Thay đổi chủ sở hữu của <filename>/etc/keystone/keystone.conf</filename> để giúp hệ thống <literal>keystone</literal> truy cập vào nó:

source: Change to the <literal>/etc/swift</literal> directory.
vi_vn: Chuyển đến thư mục <literal>/etc/swift</literal>.
zh_cn: 切换到<literal>/etc/swift</literal>目录。

source: Check the status of your floating IP address:
ja: Floating IP アドレスの状態を確認します。
ru: Проверьте статус своего внешнего IP-адреса:
vi_vn: Kiểm tra trạng thái địa chỉ IP động của bạn:
zh_cn: 检查这个浮动 IP 地址的状态：

source: Check the status of your instance:
ja: インスタンスの状態を確認します。
ru: Проверьте статус инстанса:
vi_vn: Kiểm tra tình trạng instance của bạn:
zh_cn: 检查实例的状态：

source: Choose a suitable password for the database root account.
ru: Выберите подходящий пароль для пользователя root в СУБД.
vi_vn: Chọn một mật khẩu thích hợp cho tài khoản root của cơ sở dữ liệu.
zh_cn: 为数据库用户 root 设置适当的密码。

source: Comment out any <literal>auth_host</literal>, <literal>auth_port</literal>, and <literal>auth_protocol</literal> options because the <literal>identity_uri</literal> option replaces them.
ru: Закомментируйте опции <literal>auth_host</literal>, <literal>auth_port</literal> и <literal>auth_protocol</literal>, поскольку они заменяются опцией <literal>identity_uri</literal>.
vi_vn: Đưa tất cả các lựa chọn <literal>auth_host</literal>, <literal>auth_port</literal> và <literal>auth_protocol</literal> vào phần chú thích bởi vì tùy chọn <literal>identity_uri</literal> sẽ thay thế chúng.
zh_cn: 注释所有 <literal>auth_host</literal>、<literal>auth_port</literal> 和 <literal>auth_protocol</literal> 选项，因为 <literal>identity_uri</literal> 已经包括了它们。

source: Comment out any other session storage configuration.
ru: Закомментируйте любые другие настройки хранилища сессии.
vi_vn: Đưa vào phần chú thích tất cả các cấu hình lưu trữ phiên làm việc khác.
zh_cn: 将其他的会话存储服务配置注释。

source: Comment out or remove all but one <literal>server</literal> key and change it to reference the controller node.
ru: Закоментируйте или удалите все ключи <literal>server</literal>, кроме одного, и замените его, чтобы использовался управляющий узел.
vi_vn: Chú thích hoặc xóa bỏ tất cả trừ khóa <literal>server</literal> và thay đổi để nó chó thể tham chiếu tới nút controller.
zh_cn: 注释或删除除了 <literal>server</literal> 之外的所有关键字，并将其修改为引用控制节点。

source: Comment out or remove any other options in the <literal>[filter:authtoken]</literal> section.
vi_vn: Đưa vào phần chú thích hoặc xóa tất cả các tùy chọn khác trong mục <literal>[filter:authtoken]</literal>.

source: Comment out or remove any other options in the <literal>[keystone_authtoken]</literal> section.
vi_vn: Đưa vào phần chú thích hoặc xóa tất cả các tùy chọn khác trong mục <literal>[keystone_authtoken]</literal>:

source: Complete OpenStack environments already include some of these packages.
vi_vn: Các môi trường OpenStack hoàn chỉnh đã bao gồm một vài gói này.
zh_cn: 完整的 OpenStack 环境已经包含了这些包的其中一部分。

source: Compute Node: 1 processor, 2 GB memory, and 10 GB storage
ja: コンピュートノード: 1 CPU、2 GB メモリ、10 GB ストレージ
ru: Вычислительный узел: 1 процессор, 2 ГБ памяти и 10 ГБ хранилища
vi_vn: Node tính toán: 1 bộ xử lý, 2 GB bộ nhớ và 10 GB lưu trữ
zh_cn: 计算节点: 1 处理器, 2 GB 内存, 及10 GB 存储

source: Compute node
ja: コンピュートノード
ru: Вычислительный узел
vi_vn: Node tính toán
zh_cn: 计算节点

source: Conceptual architecture
ja: 概念アーキテクチャー
ru: Концептуальная архитектура
vi_vn: Kiến trúc dạng khái niệm
zh_cn: 概念架构

source: Configure <literal>user</literal> as the default role for users that you create via the dashboard:
vi_vn: Cấu hình <literal>user</literal> là vai trò mặc định cho các người dùng mà bạn khởi tạo thông qua dashboard:

source: Configure OpenStack with debconf
ja: debconf を用いた OpenStack の設定
ru: Настройка OpenStack при помощи debconf
vi_vn: Cấu hình OpenStack bằng debconf
zh_cn: 使用debconf配置OpenStack

source: Configure compute node
ja: コンピュートノードの設定
ru: Настройте вычислительный узел
vi_vn: Cấu hình nút compute
zh_cn: 配置计算节点

source: Configure controller node
ja: コントローラーノードの設定
ru: Настройте управляющий узел
vi_vn: Cấu hình node điều khiển
zh_cn: 配置控制节点

source: Configure hashes and default storage policy
vi_vn: Cấu hình chính sách hàm băm và lưu trữ mặc định
zh_cn: 配置哈希和默认的存储策略

source: Configure shared items on both storage nodes:
vi_vn: Cấu hình chia sẻ các mục trên các nút lưu trữ:

source: Configure the <application>memcached</application> session storage service:
ru: Настройте службу хранилища сессий <application>memcached</application>:
vi_vn: Cấu hình dịch vụ lưu trữ phiên làm việc <application>memcached</application>:
zh_cn: 配置 <application>memcached</application> 会话存储服务：

source: Configure the <literal>bind_ip</literal> key to use the management interface IP address of the controller node.
vi_vn: Cấu hình khóa <literal>bind_ip</literal> để sử dụng địa chỉ IP giao diện mạng quản lý của node điều khiển.
zh_cn: 配置 <literal>bind_ip</literal> 关键字以使用控制节点的管理网络接口的 IP 地址。

source: Configure the Block Storage service
vi_vn: Cấu hình dịch vụ Block Storage
zh_cn: 配置块设备存储服务

source: Configure the Compute service
vi_vn: Cấu hình dịch vụ Compute.
zh_cn: 配置 Compute 服务

source: Configure the Compute service to send notifications to the message bus.
vi_vn: Cấu hình dịch vụ Compute để gửi các thông báo tới kênh thông điệp.
zh_cn: 配置计算服务以便发送通知到消息总线。

source: Configure the Database service to use the RabbitMQ message broker by setting the following options in the <literal>[DEFAULT]</literal> configuration group of each file:
vi_vn: Cấu hình để dịch vụ Database sử dụng kênh truyền tin RabbitMQ bằng cách tùy chỉnh các tùy chọn sau trong nhóm cấu hình <literal>[DEFAULT]</literal> của từng file:

source: Configure the Image service
vi_vn: Cấu hình dịch vụ Image

source: Configure the Object Storage service
vi_vn: Cấu hình dịch vụ Object Storage
zh_cn: 配置对象存储服务

source: Configure the authentication token:
vi_vn: Cấu hình token xác thực:

source: Configure the dashboard to use OpenStack services on the <literal>controller</literal> node:
ru: Настройте панель управления на использование служб OpenStack на узле <literal>controller</literal>:
vi_vn: Cấu hình dashboard để sử dụng các dịch vụ OpenStack trên node điều khiển:
zh_cn: 在<literal>控制</literal>节点上配置仪表板以使用 OpenStack 服务：

source: Configure the database with dbconfig-common
ja: dbconfig-common を用いたデータベースの設定
ru: Настройте базы данных с помощью dbconfig-common
vi_vn: Cấu hình cơ sở dữ liệu bằng dbconfig-common
zh_cn: 用dbconfig-common配置数据库

source: Configure the endpoint URL:
vi_vn: Cấu hình endpoint URL:

source: Configure the first interface as the management interface:
ru: Настройте первый интерфейс как управляющий интерфейс:
vi_vn: Cấu hình giao diện đầu tiên để dùng cho việc quản lý:
zh_cn: 将第一个接口配置为管理网络接口：

source: Configure the initial administration token:
ru: Настройте начальный административный токен:
vi_vn: Cấu hình token quản lí ban đầu:
zh_cn: 初始化管理员身份令牌：

source: Configure the management interface:
ru: Настройте управляющий интерфейс:
vi_vn: Cấu hình giao diện quản lý:
zh_cn: 配置管理网络接口：

source: Configure the network and compute nodes to reference the controller node.
ru: Настройте сетевой и вычислительный узлы на использование управляющего узла.
vi_vn: Cấu hình mạng và các nút compute để tham chiếu tới nút controller.
zh_cn: 配置网络节点和计算节点以引用控制节点。

source: Configure the second interface as the instance tunnels interface:
ru: Настройте второй интерфейс как интерфейс для туннелей инстансов:
vi_vn: Cấu hình giao diện thứ hai dành cho các đường hầm máy ảo:
zh_cn: 将第二个接口配置为实例的隧道网络接口：

source: Configure the web server:
ru: Настройте веб-сервер:
vi_vn: Cấu hình web server:
zh_cn: 配置 web 服务器：

source: Configure unique items on the second storage node:
vi_vn: Cấu hình các mục duy nhất trên nút lưu trữ thứ hai:

source: Confirm upload of the image and validate attributes:
ru: Подтвердите загрузку образа и проверьте атрибуты:
vi_vn: Xác nhận việc tải image và tính hợp lệ của các thuộc tính:
zh_cn: 确认镜像的上传并验证属性：

source: Contents in the <emphasis>condition</emphasis> column should indicate <literal>sys.peer</literal> for at least one server.
ru: Содержимое колонки <emphasis>condition</emphasis> должно быть <literal>sys.peer</literal> хотябы для одного сервера.
vi_vn: Những nội dung trong cột <emphasis>condition</emphasis> nên thể hiện <literal>sys.peer</literal> với ít nhất một server.
zh_cn: <emphasis>condition</emphasis> 这一列的内容应该填写至少一台服务器的 <literal>sys.peer</literal>。

source: Contents in the <emphasis>condition</emphasis> column should indicate <literal>sys.peer</literal>.
ru: Содержимое колонки <emphasis>condition</emphasis> должно быть <literal>sys.peer</literal>.
vi_vn: Những nội dung trong cột <emphasis>remote</emphasis> nên thể hiện <literal>sys.peer</literal>.
zh_cn: <emphasis>condition</emphasis> 这一列的内容应该填写 <literal>sys.peer</literal>。

source: Contents in the <emphasis>refid</emphasis> column typically reference IP addresses of upstream servers.
ru: Содержимое колонки <emphasis>refid</emphasis> обычно указывает IP-адреса апстрим серверов.
vi_vn: Nội dung của cột <emphasis>refid</emphasis> thường được tham chiếu tới các địa chỉ IP của các server ở trên.
zh_cn: <emphasis>refid</emphasis> 这一列的内容一般关联到上游服务器的 IP 地址。

source: Contents in the <emphasis>remote</emphasis> column should indicate the hostname of the controller node.
ru: Содержимое колонки <emphasis>remote</emphasis> должно указывать доменное имя управляющего узла.
vi_vn: Những nội dung trong cột <emphasis>remote</emphasis> nên thể hiện hostname của nút controller.
zh_cn: <emphasis>remote</emphasis> 这一列的内容应该填写控制节点的主机名。

source: Contents in the <emphasis>remote</emphasis> column should indicate the hostname or IP address of one or more NTP servers.
ru: Содержимое колонки <emphasis>remote</emphasis> должно указывать доменное имя или IP-адрес одного или более NTP серверов.
vi_vn: Những nội dung trong cột <emphasis>remove</emphasis> nên thể hiện được hostname hoặc địa chỉ IP của một hoặc nhiều server NTP.
zh_cn: <emphasis>remote</emphasis> 这一列的内容应该填写一个或多个 NTP 服务器的主机名或 IP 地址。

source: Controller Node: 1 processor, 2 GB memory, and 5 GB storage
ja: コントローラーノード: 1 CPU、2 GB メモリ、5 GB ストレージ
ru: Управляющий узел: 1 процессор, 2 ГБ памяти и 5 ГБ хранилища
vi_vn: Node điều khiển: 1 bộ xử lý, 2 GB bộ nhớ và 5 GB lưu trữ
zh_cn: 控制节点: 1 处理器, 2 GB 内存, 及5 GB 存储

source: Controller node
ja: コントローラーノード
ru: Управляющий узел
vi_vn: Node điều khiển
zh_cn: 控制节点服务器

source: Copy the <filename>/usr/share/cinder/cinder-dist.conf</filename> file to <filename>/etc/cinder/cinder.conf</filename>.
vi_vn: Sao chép thư mục <filename>/usr/share/cinder/cinder-dist.conf</filename> tới <filename>/etc/cinder/cinder.conf</filename>.

source: Copy the <filename>/usr/share/heat/heat-dist.conf</filename> file to <filename>/etc/heat/heat.conf</filename>.
vi_vn: Sao chép file <filename>/usr/share/heat/heat-dist.conf</filename> đến <filename>/etc/heat/heat.conf</filename>.

source: Copy the <filename>account.ring.gz</filename>, <filename>container.ring.gz</filename>, and <filename>object.ring.gz</filename> files to the <literal>/etc/swift</literal> directory on each storage node and any additional nodes running the proxy service.
vi_vn: Sao chép các file <filename>account.ring.gz</filename>, <filename>container.ring.gz</filename> và <filename>object.ring.gz</filename> đến thư mục <literal>/etc/swift</literal> trên từng node lưu trữ và bất kỳ node nào có chạy dịch vụ proxy.

source: Copy the <filename>swift.conf</filename> file to the <literal>/etc/swift</literal> directory on each storage node and any additional nodes running the proxy service.
vi_vn: Sao chép file <filename>swift.conf</filename> đến thư mục <literal>/etc/swift</literal> trên từng node lưu trữ và các node khác có chạy dịch vụ proxy.
zh_cn: 复制 <filename>swift.conf</filename> 文件到每个存储节点和其他运行了代理服务的额外节点的 <literal>/etc/swift</literal> 目录下：

source: Copy the WSGI components from the upstream repository into this directory:
vi_vn: Sao chép các thành phần của WSGI từ kho phần mềm tuyến trên vào thư mục này:

source: Copy the contents of the <filename>/etc/hosts</filename> file from the controller node and add the following to it:
ru: Скопируйте содержимое файла <filename>/etc/hosts</filename> с управляющего узла и добавьте в него следующее:
vi_vn: Sao chép nội dung của thư mục <filename>/etc/hosts</filename> từ nút điều khiển và chèn thêm các thông tin sau:

source: Copy the contents of the <filename>/etc/hosts</filename> file from the controller node to the storage node and add the following to it:
ru: Скопируйте содержимое файла <filename>/etc/hosts</filename> с управляющего узла на узел хранения и добавьте в него следующее:
vi_vn: Sao chép nội dung của file <filename>/etc/hosts</filename> từ node điều khiển sang node lưu trữ và thêm các dòng sau vào nó:
zh_cn: 从控制节点上复制 <filename>/etc/hosts</filename> 文件的内容到存储节点上，并将下列内容添加到其中：

source: Copyright details are filled in by the template.
ru: Сведения об авторском праве заполнены по шаблону.
vi_vn: Các chi tiết về bản quyền được điền vào theo mẫu.
zh_cn: 版权信息来自于模板

source: Create OpenStack client environment scripts
ru: Создайте скрипты клиентских сред OpenStack
vi_vn: Khởi tạo các script môi trường client của OpenStack
zh_cn: 创建 OpenStack 客户端环境脚本

source: Create a 1 GB volume:
ru: Создайте 1 ГБ диск:
vi_vn: Khởi tạo một ổ lưu trữ 1GB:
zh_cn: 创建一个 1 GB 的卷：

source: Create a <glossterm>floating IP address</glossterm> on the <literal>ext-net</literal> external network:
ru: Создайте <glossterm>внешний IP-адрес</glossterm> во внешней сети <literal>ext-net</literal>:
vi_vn: Khởi tạo một <glossterm>địa chỉ IP động</glossterm> trên hệ thống mạng ngoại vùng <literal>ext-net</literal>:
zh_cn: 在 <literal>ext-net</literal> 外部网络上创建一个 <glossterm>浮动 IP 地址</glossterm>：

source: Create a <literal>cinder</literal> user:
ru: Создайте пользователя <literal>cinder</literal>:
vi_vn: Tạo một tài khoản người dùng <literal>cinder</literal>:
zh_cn: 创建 <literal>cinder</literal> 用户：

source: Create a datastore. You need to create a separate datastore for each type of database you want to use, for example, MySQL, MongoDB, Cassandra. This example shows you how to create a datastore for a MySQL database:
vi_vn: Tạo kho dữ liệu. Với mỗi loại cơ sở dữ liệu bạn nên tạo các kho dữ liệu khác nhau, ví dụ, MySQL, MongoDB, Cassandra. Ví dụ sau sẽ giúp bạn cách để tạo một kho dữ liệu cho một cơ sở dữ liệu MySQL:
zh_cn: 创建一个数据库。您需要为每个您想使用的类型的数据库创建一个分离的数据存储，例如，MySQL、MongoDB、Cassandra。这个例子将向您展示如何为一个 MySQL 数据库创建数据存储：

source: Create a temporary local directory:
vi_vn: Tạo một thư mục cục bộ tạm thời:
zh_cn: 创建一个临时本地目录：

source: Create a test template in the <filename>test-stack.yml</filename> file with the following content:
vi_vn: Tạo một mẫu kiểm thử trong thư mục <filename>test-stack.yml</filename> với nội dung như sau:
zh_cn: 在 <filename>test-stack.yml</filename> 文件中使用以下内容创建一个测试模板：

source: Create a trove image.
vi_vn: Tạo một image trove
zh_cn: 创建trove镜像：

source: Create an administrative project, user, and role for administrative operations in your environment:
vi_vn: Khởi tạo một project quản trị, người dùng và vai trò cho các tác vụ quản trị trong môi trường của bạn:

source: Create an image for the type of database you want to use, for example, MySQL, MongoDB, Cassandra.
vi_vn: Tạo một image cho mỗi loại cơ sở dữ liệu mà bạn muốn dùng, ví dụ như MySQL, MongoDB, Cassandra.
zh_cn: 为您要使用的类型的数据库创建一个镜像，例如，MySQL、MongoDB、Cassandra。

source: Create and edit the <filename>/etc/my.cnf.d/mariadb_openstack.cnf</filename> file and complete the following actions:
vi_vn: Tạo và chỉnh sửa file <filename>/etc/my.cnf.d/mariadb_openstack.cnf</filename> sau đó hoàn tất các thao tác sau:

source: Create and edit the <filename>/etc/mysql/conf.d/mysqld_openstack.cnf</filename> file and complete the following actions:
vi_vn: Tạo và chỉnh sửa file <filename>/etc/mysql/conf.d/mysqld_openstack.cnf</filename> sau đó hoàn tất các thao tác sau:
zh_cn: 创建并编辑文件 <filename>/etc/mysql/conf.d/mysqld_openstack.cnf</filename>，然后完成以下操作：

source: Create and edit the <filename>/etc/neutron/dnsmasq-neutron.conf</filename> file and complete the following action:
ru: Создайте и заполните файл <filename>/etc/neutron/dnsmasq-neutron.conf</filename> следующим образом:
vi_vn: Khởi tạo và sửa file <filename>/etc/neutron/dnsmasq-neutron.conf</filename> và hoàn thành các công việc sau:
zh_cn: 创建并修改文件 <filename>/etc/neutron/dnsmasq-neutron.conf</filename>，完成以下操作：

source: Create client environment scripts for the <literal>admin</literal> and <literal>demo</literal> projects and users. Future portions of this guide reference these scripts to load appropriate credentials for client operations.
vi_vn: Khởi tạo các script môi trường client cho các project và người dùng <literal>admin</literal> và <literal>demo</literal>. Các phần tương lai của bài hướng dẫn này sẽ trỏ đến các script này để tải các thông tin xác thực phù hợp cho các tác vụ client.

source: Create database schema: <placeholder-1/>
ru: Создайте схему базы данных: <placeholder-1/>
vi_vn: Tạo lược đồ cơ sở dữ liệu: <placeholder-1/>
zh_cn: 创建数据库模式：<placeholder-1/>

source: Create initial network
ja: 初期ネットワークの作成
ru: Создайте первоначальную сеть
vi_vn: Khởi tạo hệ thống mạng ban đầu
zh_cn: 新建初始网络

source: Create initial networks
ja: 初期ネットワークの作成
ru: Создайте начальные сети
vi_vn: Khởi tạo các mạng ban đầu
zh_cn: 创建初始网络

source: Create initial rings
vi_vn: Khởi tạo các ring ban đầu

source: Create projects, users, and roles
vi_vn: Khởi tạo các project, người dùng và vai trò
