Repository: 25hours/openstack-manuals
Catalog: doc/install-guide/locale/*.po
Languages: ja, ru, vi_vn, zh_cn

source: The <glossterm>Juno</glossterm> release is available only in Debian Experimental (otherwise called rc-buggy), as Jessie is frozen soon, and will contain Icehouse. However, the Debian maintainers of OpenStack also maintain a non-official Debian repository for OpenStack containing Wheezy backports.
ru: Выпуск <glossterm>Juno</glossterm> доступен только в Debian Experimental (так же называемом rc-buggy), поскольку Jessie скоро будет заморожен и будет содержать Icehouse. Однако, сопровождающие пакеты OpenStack в Debian так же сопровождают неофициальный репозиторий для OpenStack, содержащий перенесённые пакеты Wheezy.
vi_vn: Phiên bản <glossterm>Juno</glossterm> chỉ có trong Debian Experimental (còn được gọi là rc-buggy) khi mà Jessie sẽ sớm ổn định và bao gồm Icehouse. Tuy nhiên các trình duy trì Debian của OpenStack cũng duy trì một repository Debian không chính thức cho các bản OpenStack chứa các Wheezy backport.
zh_cn: <glossterm>Juno</glossterm> 的发布仅在 Debian Experimental 上可用 (否则称之为 rc-buggy )，由于 Jessie 很快就要冰封，且将包括到 Icehouse。但是，OpenStack 的 Debian 维护人员也维护了一套非官方的 OpenStack 的 Debian 仓库，包括了 Wheezy backports。

source: The <glossterm>Layer-3 (L3) agent</glossterm> provides routing services for virtual networks.
ru: <glossterm>Агент Layer-3 (L3)</glossterm> предоставляет службы маршрутизации для виртуальных сетей.
vi_vn: <glossterm>Layer-3 (L3) agent</glossterm> cung cấp các dịch vụ định tuyến cho các hệ thống mạng ảo.
zh_cn: <glossterm>Layer-3 (L3) 代理</glossterm>为虚拟网络提供路由服务。

source: The <glossterm>OpenStack</glossterm> project is an open source cloud computing platform that supports all types of cloud environments. The project aims for simple implementation, massive scalability, and a rich set of features. Cloud computing experts from around the world contribute to the project.
ja: <glossterm>OpenStack</glossterm> プロジェクトは、あらゆる種類のクラウド環境をサポートする、オープンソースのクラウドコンピューティングプラットフォームです。シンプルな実装、大規模なスケーラビリティ、豊富な機能を目指しています。世界中のクラウドコンピューティング技術者がプロジェクトに貢献しています。
ru: Проект <glossterm>OpenStack</glossterm> это платформа для облачных вичислений с открытым исходным кодом, которая поддерживает все типы облачных сред. Целями проекта является простота реализации, широкое масштабирование и богатый набор возможностей. Эксперты в облсти облачных вычислений со всего мира участвуют в развитии проекта.
vi_vn: Dự án <glossterm>OpenStack</glossterm> là một nền tảng điên toán đám mây mã nguồn mở hỗ trợ tất cả các dạng môi trường điện toán đám mây. Dự án hướng đến sự đơn giản trong triển khai với khả năng mở rộng cao và một bộ tính năng phong phú. Dự án được đóng góp bởi các chuyên gia về điện toán đám mây trên khắp thế giới.
zh_cn: <glossterm>OpenStack</glossterm> 项目是一个开源的云计算平台，支持所有类型的云环境。项目的致力于简化实施、高可扩展性以及丰富的特性。全世界的云计算专家都在为这个项目做贡献。

source: The <glossterm>compute node</glossterm> runs the <glossterm>hypervisor</glossterm> portion of Compute that operates <glossterm>tenant</glossterm><glossterm baseform="virtual machine (VM)">virtual machines</glossterm> or instances. By default, Compute uses <glossterm baseform="kernel-based VM (KVM)">KVM</glossterm> as the <glossterm>hypervisor</glossterm>. Compute also provisions tenant networks and provides firewalling (<glossterm baseform="security group">security groups</glossterm>) services. You can run more than one compute node.
ru: <glossterm>Вычислительный узел</glossterm> содержит <glossterm>гипервизор</glossterm> службы Вычислений, который управляет <glossterm baseform="virtual machine (VM)">виртуальными машинами</glossterm> или экземплярами <glossterm>проектов</glossterm>. По-умолчанию, используется <glossterm baseform="kernel-based VM (KVM)">KVM</glossterm> в качестве <glossterm>гипервизора</glossterm>. Вычислительный узел так же сети проектов и фаерволы (<glossterm baseform="security group">группы безопасности</glossterm>). Вы можете иметь более одного вычислительного узла.
vi_vn: <glossterm>Node tính toán</glossterm> chạy phần <glossterm>hypervisor</glossterm> của Compute có nhiệm vụ vận hành <glossterm baseform="máy ảo (VM)">các máy ảo</glossterm><glossterm>tenant</glossterm> hoặc các instance. Mặc định, Compute sử dụng <glossterm baseform="kernel-based VM (KVM)">KVM</glossterm> làm hypervisor. Compute cũng cung cấp các hệ thống mạng tenant và các dịch vụ tường lửa (<glossterm baseform="nhóm bảo mật">các nhóm bảo mật</glossterm>) . Bạn có thể chạy nhiều hơn một node tính toán.

source: The <glossterm>compute node</glossterm> runs the <glossterm>hypervisor</glossterm> portion of Compute that operates <glossterm>tenant</glossterm><glossterm baseform="virtual machine (VM)">virtual machines</glossterm> or instances. By default, Compute uses <glossterm baseform="kernel-based VM (KVM)">KVM</glossterm> as the <glossterm>hypervisor</glossterm>. The compute node also runs the Networking plug-in and an agent that connect tenant networks to instances and provide firewalling (<glossterm baseform="security group">security groups</glossterm>) services. You can run more than one compute node.
ru: <glossterm>Вычислительный узел</glossterm> содержит <glossterm>гипервизор</glossterm> службы Вычислений, который управляет <glossterm baseform="virtual machine (VM)">виртуальными машинами</glossterm> или экземплярами <glossterm>проектов</glossterm>. По-умолчанию, используется <glossterm baseform="kernel-based VM (KVM)">KVM</glossterm> в качестве <glossterm>гипервизора</glossterm>. Вычислительный узел так же содержит Сетевые плагины и агент, который подключает сети проектов к машинам и предоставляет фаерволы (<glossterm baseform="security group">группы безопасности</glossterm>). Вы можете иметь более одного вычислительного узла.
vi_vn: <glossterm>Node tính toán</glossterm> chạy phần <glossterm>hypervisor</glossterm> của Compute có nhiệm vụ vận hành glossterm baseform="máy ảo (VM)">các máy ảo</glossterm> <glossterm>tenant</glossterm> hoặc các instance. Mặc định, Compute sử dụng <glossterm baseform="kernel-based VM (KVM)">KVM</glossterm> làm hypervisor. Node tính toán cũng có thể chạy các plug-in Networking và một agent có nhiệm vụ kết nối các mạng tenant đến các instance và cung cấp các dịch vụ tường lửa (<glossterm baseform="nhóm bảo mật">các nhóm bảo mật</glossterm>). Bạn có thể chạy nhiều hơn một node tính toán.

source: The <link linkend="launch-instance">launch an instance</link> chapter includes instructions for attaching this volume to an instance.
vi_vn: Chương <link linkend="launch-instance">Chạy một instance</link> bao gồm các hướng dẫn để gắn ổ lưu trữ này vào một instance.
zh_cn: <link linkend="launch-instance">启动实例</link>的章节包含了附加卷到一台实例上的指南。

source: The <literal>external_network_bridge</literal> option intentionally lacks a value to enable multiple external networks on a single agent.
vi_vn: Tùy chọn <literal>external_network_bridge</literal> thiếu một giá trị để cho phép nhiều hệ thống mạng ngoại vùng trên một agent một cách có chủ đích.

source: The <literal>swift</literal> client requires the <literal>-V 3</literal> parameter to use the Identity version 3 API.
vi_vn: <literal>Swift</literal> client yêu cầu thông số <literal>-V 3</literal> để sử dụng Identity API phiên bản 3.

source: The <package>dbconfig-common</package> package will configure MySQL for these access rights, and create the database for you. Since OpenStack 2014.1.1, all OpenStack packages in Debian are performing the following MySQL query after database creation (if you decide to use MySQL as a back-end):
ru: Пакет <package>dbconfig-common</package> настроить MySQL для этих прав доступа и создаст базу данных за вас. С OpenStack 2014.11 все пакеты OpenStack в Debian исполняют следующий SQL запрос после создания базы данных (если вы решили использовать MySQL в качестве бэкэнда):
vi_vn: Gói <package>dbconfig-common</package> sẽ cấu hình MySQL cho các quyền truy nhập này, và tạo cơ sở dữ liệu cho bạn. Từ phiên bản OpenStack 2014.1.1, sau khi cơ sở dữ liệu được tạo, tất cả các gói OpenStack trong Debian đều thực thi câu truy vấn MySQL sau (nếu như bạn quyết định sử dụng MySQL làm back-end):
zh_cn: <package>dbconfig-common</package> 包会为 MySQL 配置配置这些访问权限，然后为您创建好数据库。从 OpenStack 2014.1.1 开始，所有Debian 中的 OpenStack 包都会在数据库创建之后，执行下列 MySQL 的查询 (如果您决定使用 MySQL 作为后端的话)：

source: The <package>heat-common</package> package and not the <package>heat-api</package> package configures the Orchestration service.
ja: <package>heat-api</package> パッケージではなく、<package>heat-common</package> パッケージが Orchestration Service を設定します。
vi_vn: Gói <package>heat-common</package> chứ không phải gói <package>heat-api</package> cấu hình dịch vụ Orchestration.
zh_cn: <package>heat-common</package>包，而不是 <package>heat-api</package>包，配置在Orchestration服务中。

source: The <systemitem role="service">rsync</systemitem> service requires no authentication, so consider running it on a private network.
vi_vn: Dịch vụ <systemitem role="service">rsync</systemitem> không yêu cầu xác thực, vì vậy hãy cân nhắc điều này khi sử dụng trong mạng nội bộ.
zh_cn: <systemitem role="service">rsync</systemitem> 服务不需要认证，因此可以考虑将其运行在私有网络中。

source: The Block Storage service creates logical volumes in this volume group.
ru: Служба Блочного Хранения будет создавать логические диски в этой группе дисков.
vi_vn: Dịch vụ Block Storage khởi tạo các ổ lưu trữ logic trong nhóm ổ lưu trữ này.
zh_cn: 块存储服务会在这个卷组中创建逻辑卷。

source: The Block Storage service requires both the <literal>volume</literal> and <literal>volumev2</literal> services. However, both services use the same API endpoint that references the Block Storage version 2 API.
vi_vn: Dịch vụ Block Storage yêu cầu cả hai dịch vụ <literal>volume</literal> và <literal>volumev2</literal>. Tuy nhiên, hai dịch vụ này có thể dùng chung một điểm cuối API cái mà tham chiếu tới Block Storage API phiên bản 2.

source: The CirrOS image includes conventional user name/password authentication and provides these credentials at the login prompt. After logging into CirrOS, we recommend that you verify network connectivity using <placeholder-1/>.
ru: Образ CirrOS включает обычную аутентификацию по имени/паролю и предоставляет эти данные перед запросом входа. После входа в CirrOS, мы рекмендуем вам проверить связь используя <placeholder-1/>.
vi_vn: Image CirrOS bao gồm một quá trình xác thực tên/mật khẩu thông thường và cung cấp các xác thực này ở phần yêu cầu đăng nhập. Sau khi đăng nhập vào CirrOS, chúng tôi khuyên bạn nên kiểm tra các kết nối mạng bằng cách sử dụng <placeholder-1/>.
zh_cn: CirrOS 镜像包含传统的用户名/密码认证方式并需在登录提示中提供这些这些认证。登录到 CirrOS 后，我们建议您验证使用<placeholder-1/>验证网络的连通性。

source: The Data processing service (sahara) enables users to provide a scalable data processing stack and associated management interfaces. This includes provisioning and operation of data processing clusters as well as scheduling and operation of data processing jobs.
vi_vn: Dịch vụ xử lý Dữ liệu (sahara) cho phép người dùng cung cấp một stack xử lý dữ liệu có khả năng mở rộng và các giao diện quản lý liên quan. Nó bao gồm cả việc cung cấp và vận hành các cluster xử lý dữ liệu cũng như việc lên lịch và vận hành của các công việc xử lý dữ liệu.
zh_cn: 数据处理服务 (sahara) 允许用户提供一个可扩展的数据处理栈和相关的管理接口。这包括数据处理集群的提供和操作，以及数据处理任务的调度和运行。

source: The Debian OpenStack packages are maintained on Debian Sid (also known as Debian Unstable) - the current development version. Backported packages run correctly on Debian Wheezy with one caveat:
ja: Debian OpenStack パッケージは Debian Sid (Debian 不安定版としても知られ、現在の開発バージョン) でメンテナンスされています。バックポートされたパッケージは一つ注意して Debian Wheezy で正しく動作します。
vi_vn: Các gói OpenStack của Debian được duy trì trên Debian Sid (còn được biết đến là Debian Unstable) - phiên bản phát triển hiện tại. Các gói được backport chạy chính xác trên Debian Wheezy với một lưu ý:
zh_cn: Debian OpenStack包被含在Debian Sid(也被称为Debian不稳定版) - 当前开发版本中。反向移植的包在Debian Wheezy中可以正常运行，只是带有警告：

source: The Debian OpenStack packages offer automation for this, so OpenStack users do not have to manually edit the configuration files.
ja: Debian OpenStack パッケージがこれを自動化するため、OpenStack ユーザーは設定ファイルを手動で編集する必要がありません。
ru: Пакеты OpenStack в Debian предлагают автоматизацию для этого, так что пользователям OpenStack не нужно вручную редактировать файлы конфигурации.
vi_vn: Các gói OpenStack của Debian cung cấp khả năng tự động hóa cho việc này, nên người dùng OpenStack không phải tự tay chỉnh sửa các file cấu hình.
zh_cn: Debian OpenStack包可以自动实现这些，所以OpenStack用户不需要手动编辑配置文件。

source: The Debian package post installation scripts will then perform the below commands for you:
vi_vn: Các script sau khi cài đặt các gói của Debian sẽ thực hiện các câu lệnh dưới đây cho bạn:

source: The Debian packages
ja: Debian パッケージ
ru: Пакеты Debian
vi_vn: Các gói Debian
zh_cn: Debian包

source: The ID of the <literal>demo-volume1</literal> volume should indicate <literal>in-use</literal> status by the ID of the <literal>demo-instance1</literal> instance.
vi_vn: ID của ổ lưu trữ <literal>demo-volume1</literal> phải có trạng thái là <literal>in-use</literal> bởi ID của instance <literal>demo-instance1</literal>.

source: The Identity Service is installed with MySQL as the database back end, <literal>keystonedb</literal> as database name, and the localhost socket file. The corresponding DNS will then be:
ru: Служба Идентификации устанавливается с MySQL в качестве бэкэнда, <literal>keystonedb</literal> в качестве имени базы данных и файлом сокета на локальной машине. Соответствующий DNS тогда будет:
vi_vn: Indentity Service được cài đặt với MySQL làm cơ sở dữ liệu back-end với tên cở sở dữ liệu là <literal>keystonedb</literal>, và file socket trên localhost. DNS tương ứng sẽ là:
zh_cn: 身份认证服务安装 MySQL 作为数据库的后台，使用 <literal>keystonedb</literal> 作为数据库名称，并使用本机的套接字文件。相应的 DNS 为：

source: The Identity service manages a catalog of API endpoints associated with the services in your OpenStack environment. Services use this catalog to determine how to communicate with other services in your environment.
ru: Сервис Identity управляет каталогом точек доступа API, связанных с сервисами в вашем окружении OpenStack. Сервисы используют этот каталог, чтобы определить как связываться с другими сервисами в вашем окружении.
vi_vn: Dịch vụ Identity quản lý một danh mục các API endpoint liên kết với các dịch vụ trong môi trường OpenStack của bạn. Các dịch vụ sử dụng danh mục này để quyết định cách giao tiếp với các dịch vụ khác trong môi trường của bạn.
zh_cn: 身份认证服务管理了一个与您环境相关的 API 端点的目录。服务使用这个目录来决定如何与您环境中的其他服务进行通信。

source: The Identity service manages a catalog of services in your OpenStack environment. Services use this catalog to determine the other services available in your environment.
vi_vn: Dịch vụ Identity quản lý một danh mục các dịch vụ trong môi trường OpenStack của bạn. Các dịch vụ sử dụng danh mục này để quyết định tính sẵn sàng của các dịch vụ khác trong môi trường của bạn.

source: The Identity service provides a catalog of services and their locations. Each service that you add to your OpenStack environment requires a <glossterm>service</glossterm> entity and several <glossterm>API endpoint</glossterm> in the catalog.
vi_vn: Dịch vụ Identity cung cấp một danh mục các dịch vụ và địa chỉ của chúng. Mỗi dịch vụ mà bạn thêm vào môi trường OpenStack của mình đều yêu cầu một thực thể <glossterm>dịch vụ</glossterm> và một vài <glossterm>API endpoint</glossterm> trong danh mục.

source: The Identity service provides authentication services for each OpenStack service. The authentication service uses a combination of <glossterm baseform="domain">domains</glossterm>, <glossterm baseform="project">projects</glossterm> (tenants), <glossterm baseform="user">users</glossterm>, and <glossterm baseform="role">roles</glossterm>.
vi_vn: Dịch vụ Identity cung cấp các dịch vụ xác thực cho mỗi dịch vụ OpenStack. Dịch vụ xác thực sử dụng kết hợp thông tin của <glossterm baseform="domain">các miền</glossterm>, <glossterm baseform="project">các project</glossterm> (các tenant), <glossterm baseform="user">các người dùng</glossterm>, và <glossterm baseform="role">các vai trò</glossterm>.

source: The Identity version 3 API adds support for domains that contain projects and users. Projects and users can use the same names in different domains. Therefore, in order to use the version 3 API, requests must also explicitly contain at least the <literal>default</literal> domain or use IDs. For simplicity, this guide explicitly uses the <literal>default</literal> domain so examples can use names instead of IDs.
vi_vn: Identity API phiên bản 3 hỗ trợ thêm các miền chứa các project và người dùng. Các project và người dùng có thể sử dụng cùng tên trên các miền khác nhau. Vì thế, để sử dụng API phiên bản 3, các yêu cầu phải chứa rõ ràng ít nhất miền <literal>mặc định</literal> hoặc sử dụng ID. Để cho đơn giản, bài hướng dẫn này sử dụng rõ ràng miền <literal>mặc định</literal> để các ví dụ có thể sử dụng tên thay vì ID.

source: The ML2 plug-in uses the <glossterm baseform="Open vSwitch">Open vSwitch (OVS)</glossterm> mechanism (agent) to build the virtual networking framework for instances.
ru: Плагин ML2 использует механизм (агент) <glossterm baseform="Open vSwitch">Open vSwitch (OVS)</glossterm>, чтобы построить структуру виртуальной сети для инстансов.
vi_vn: Plug-in ML2 sử dụng cơ chế (agent) <glossterm baseform="Open vSwitch">Open vSwitch (OVS)</glossterm> để xây dựng networking framework ảo cho các instance.
zh_cn: ML2 插件使用 <glossterm baseform="Open vSwitch">Open vSwitch (OVS)</glossterm> 机制 (代理) 来为实例构建虚拟网络框架。

source: The ML2 plug-in uses the <glossterm baseform="Open vSwitch">Open vSwitch (OVS)</glossterm> mechanism (agent) to build the virtual networking framework for instances. However, the controller node does not need the OVS components because it does not handle instance network traffic.
ru: Плагин ML2 использует механизм (агент) <glossterm baseform="Open vSwitch">Open vSwitch (OVS)</glossterm>, чтобы построить структуру виртуальной сети для инстансов. Однако, на управляющем узле не требуются компоненты OVS, поскольку он не управляет траффиком сети инстансов.
vi_vn: Plug-in ML2 sử dụng cơ chế(agent) <glossterm baseform="Open vSwitch">Open vSwitch (OVS)</glossterm> để xây dựng framework networking ảo cho các instance. Tuy nhiên, node điều khiển không cần các thành phần của OVS bởi vì nó không phụ trách việc lưu thông dữ liệu mạng instance.
zh_cn: ML2 插件使用 <glossterm baseform="Open vSwitch">Open vSwitch (OVS)</glossterm> 机制 (代理) 来为实例构建虚拟网络架构。但是，控制节点不需要 OVS 组件，因为它并不处理实例网络的传输。

source: The ML2 plug-in uses the Open vSwitch (OVS) mechanism (agent) to build the virtual networking framework for instances.
ru: Плагин ML2 использует механизм (агент) Open vSwitch (OVS) для построения структуры виртуальной сети для инстансов.
vi_vn: Plug-in ML2 sử dụng cơ chế (agent) vSwitch (OVS) để xây dựng framework networking ảo cho các instance.
zh_cn: ML2 插件使用 Open vSwitch (OVS) 机制 (代理) 来为实例构建虚拟网络框架。

source: The Networking common component configuration includes the authentication mechanism, message queue, and plug-in.
vi_vn: Cáu hình thành phần thông thường của Networking bao gồm cơ chế xác thực, hàng đợi tin và plug-in.

source: The Networking server component configuration includes the database, authentication mechanism, message queue, topology change notifications, and plug-in.
vi_vn: Cấu hình thành phần của máy chủ Networking bao gồm cơ sở dữ liệu, cơ chế xác thực, hàng đợi tin, các thông báo về thay đổi mô hình và plug-in.

source: The Networking service initialization scripts expect the variable <literal>NEUTRON_PLUGIN_CONF</literal> in the <filename>/etc/sysconfig/neutron</filename> file to reference the ML2 plug-in configuration file. Edit the <filename>/etc/sysconfig/neutron</filename> file and add the following:
ru: Скрипты инициализации службы Сети ожидают, что переменная <literal>NEUTRON_PLUGIN_CONF</literal> в файле <filename>/etc/sysconfig/neutron</filename> ссылается на файл конфигурации плагина ML2. Отредактируйте файл <filename>/etc/sysconfig/neutron</filename>, добавив следующее:
vi_vn: Các script khởi tạo của dịch vụ Networking sẽ cho rằng biến <literal>NEUTRON_PLUGIN_CONF</literal> trong file <filename>/etc/sysconfig/neutron</filename> sẽ trỏ đến file cấu hình plug-in ML2. Sửa file <filename>/etc/sysconfig/neutron</filename> và thêm vào các nội dung sau:
zh_cn: Networking 服务的初始化脚本需要 <filename>/etc/sysconfig/neutron</filename> 配置文件中的 <literal>NEUTRON_PLUGIN_CONF</literal> 变量，以关联 ML2 插件的配置文件。修改 <filename>/etc/sysconfig/neutron</filename> 文件并添加以下内容：

source: The OVS service provides the underlying virtual networking framework for instances.
ru: Служба OVS предоставляет основную структуру виртуальной сети инстансам.
vi_vn: Dịch vụ OVS cung cấp framework networking ảo cơ sở cho các instance.
zh_cn: OVS 服务为实例提供了底层的虚拟网络框架。

source: The Object Storage service does not use a SQL database on the controller node. Instead, it uses distributed SQLite databases on each storage node.
vi_vn: Dịch vụ Object Storage không sử dụng một cơ sở dữ liệu SQL trên node điều khiển. Thay vào đó, nó sử dụng các cở dữ liệu SQLite được phân bố trên từng node lưu trữ.

source: The OpenStack Block Storage service provides block storage devices to guest instances. The method in which the storage is provisioned and consumed is determined by the Block Storage driver, or drivers in the case of a multi-backend configuration. There are a variety of drivers that are available: NAS/SAN, NFS, iSCSI, Ceph, and more. The Block Storage API and scheduler services typically run on the controller nodes. Depending upon the drivers used, the volume service can run on controllers, compute nodes, or standalone storage nodes. For more information, see the <link xlink:href="http://docs.openstack.org/kilo/config-reference/content/section_volume-drivers.html"><citetitle>Configuration Reference</citetitle></link>.
vi_vn: Dịch vụ Block Storage của OpenStack cung cấp các thiết bị block storage cho các instance khách. Phương thức mà các kho lưu trữ được cung cấp và tiêu thụ được quyết định bởi Block Storage driver hoặc các driver trong trường hợp cấu hình đa-backend. Có nhiều các driver hiện hành khác nhau như NAS/SAN, NFS, iSCSI, Ceph, và hơn nữa. Block Storage API và các dịch vụ lên lịch thường chạy trên các node điều khiển. Tùy thuộc vào driver nào được sử dụng, dịch vụ ổ lữu trữ có thể chạy trên các node điều khiển, tính oán hoặc các node lưu trữ độc lập. Để biết thêm thông tin, xem <link xlink:href="http://docs.openstack.org/kilo/config-reference/content/section_volume-drivers.html"><citetitle>Cấu hình Tham khảo</citetitle></link>.

source: The OpenStack Image service (glance) enables users to discover, register, and retrieve virtual machine images. It offers a <glossterm baseform="RESTful">REST</glossterm> API that enables you to query virtual machine image metadata and retrieve an actual image. You can store virtual machine images made available through the Image service in a variety of locations, from simple file systems to object-storage systems like OpenStack Object Storage.
vi_vn: Dịch vụ Image của OpenStack (glance) cho phép người dùng khám phá, đăng kí và nhận về các image máy ảo. Nó đưa ra lựa chọn REST API cho phép bạn có thể truy vấn metadata của image máy ảo và nhận về một image thật. Bạn có thể lưu trữ image máy ảo được tạo ra nhờ dịch vụ Image ở nhiều địa chỉ, từ các hệ thống tập tin đơn giản cho đến các hệ thống object-storage như OpenStack Object Storage.
