Repository: 25hours/openstack-manuals
Catalog: doc/install-guide/locale/*.po
Languages: ja, ru, vi_vn, zh_cn

source: This section assumes proper installation, configuration, and operation of the Identity service as described in <xref linkend="keystone-install"/> and <xref linkend="keystone-verify"/>.
ru: Эта глава подразумевает, что у вас корректно установлена, настроена и работает служба Идентификации как описано в <xref linkend="keystone-install"/> и <xref linkend="keystone-verify"/>.
zh_cn: 这个部分假设使用 <xref linkend="keystone-install"/> 和 <xref linkend="keystone-verify"/> 中所描述的身份认证服务的安装、配置和操作。

source: Before you install and configure the Image Service, you must create a database, service credentials, and API endpoints.
ru: Прежде чем устанавливать и настраивать службу Образов, вам необходимо создать базу данных, служебные учётные данные и точки доступа API.
zh_cn: 安装和配置镜像服务之前，您必须创建数据库、服务证书和 API 端点。

source: Create the Image Service API endpoints:
ru: Создайте точки доступа API для службы Образов:
zh_cn: 创建镜像服务的 API 端点：

source: To install and configure the Image Service components
ru: Для установки и настройки компонентов службы Образов
zh_cn: 安装和配置镜像服务组件

source: Default configuration files vary by distribution. You might need to add these sections and options rather than modifying existing sections and options.
zh_cn: 默认配置文件由于分布而有不同。您可能需要添加这些部分和选项，而不是修改已有的部分和选项。

source: Replace <replaceable>GLANCE_DBPASS</replaceable> with the password you chose for the Image Service database.
ru: Замените <replaceable>GLANCE_DBPASS</replaceable> на пароль, который вы выбрали для базы данных службы Образов.
zh_cn: 将其中的 <replaceable>GLANCE_DBPASS</replaceable> 替换为您为镜像服务数据库所设置的密码。

source: The Telemetry chapter provides an Image Service configuration that enables notifications.
ru: Глава о Телеметрии содержит конфигурацию службы Образов, которая включает оповещения.
zh_cn: Telemetry 章节提供了一个启用消息机制的镜像服务配置。

source: In the <literal>[DEFAULT]</literal> section, configure the log file:
zh_cn: 在 <literal>[DEFAULT]</literal> 部分，配置日志文件：

source: Populate the Image Service database:
ru: Заполните базу данных сервиса Образов:
zh_cn: 写入镜像服务数据库：

source: Select the <literal>keystone</literal> pipeline to configure the Image Service to use the Identity service:
ru: Выберите источник данных <literal>keystone</literal> для настройки службы Образов на использование службы Идентификации:
zh_cn: 选择 <literal>keystone</literal> 管道以配置镜像服务来使用身份认证服务：

source: Restart the Image Service services:
ru: Перезапустите сервисы службы Образов:
zh_cn: 重启镜像服务：

source: Start the Image Service services and configure them to start when the system boots:
ru: Запустите сервисы службы Образов и настройте их автоматический запуск при загрузке системы:
zh_cn: 启动镜像服务并将其配置为随系统启动：

source: Before you proceed, verify that your system meets the requirements in <xref linkend="dashboard-system-requirements"/>. Also, the dashboard relies on functional core services including Identity, Image Service, Compute, and either Networking (neutron) or legacy networking (nova-network). Environments with stand-alone services such as Object Storage cannot use the dashboard. For more information, see the <link href="http://docs.openstack.org/developer/horizon/topics/deployment.html">developer documentation</link>.
ru: Прежде чем продолжить, удостоверьтесь, что ваша система соответствует требованиям в <xref linkend="dashboard-system-requirements"/>. Кроме того, панель управления полагается на основные службы, включая службу Идентификации, Образов, Вычислений и, либо сетевую (neutron), либо старую сетевую (nova-network). Среды с самостоятельными службами, такими как Объектное Хранилище, не могут использовать панель. Подробнее смотрите в <link href="http://docs.openstack.org/developer/horizon/topics/deployment.html">документации разработчика</link>.
zh_cn: 在您执行之前，确认您的系统满足 <xref linkend="dashboard-system-requirements"/> 中描述的要求。并且，仪表盘依赖于功能的内核服务，包括身份认证服务、镜像服务、计算服务以及 Networking (neutron) 或传统网络 (nova-network) 服务。使用独立服务的环境，如对象存储，不能使用仪表盘。要了解更多信息，请阅读<link href="http://docs.openstack.org/developer/horizon/topics/deployment.html">开发文档</link>。

source: Replace <replaceable>TIME_ZONE</replaceable> with an appropriate time zone identifier. For more information, see the <link href="http://en.wikipedia.org/wiki/List_of_tz_database_time_zones">list of time zones</link>.
ru: Замените <replaceable>TIME_ZONE</replaceable> на соответствующий идентификатор часового пояса. За подробностями смотрите <link href="http://en.wikipedia.org/wiki/List_of_tz_database_time_zones">список часовых поясов</link>.
zh_cn: 将其中的 <replaceable>TIME_ZONE</replaceable> 替换为一个合适的时区标识符。要了解更多信息，请阅读 <link href="http://en.wikipedia.org/wiki/List_of_tz_database_time_zones">list of time zones</link>。

source: For more information, see the <link href="https://bugzilla.redhat.com/show_bug.cgi?id=1150678">bug report</link>.
ru: Подробнее смотрите в <link href="https://bugzilla.redhat.com/show_bug.cgi?id=1150678">отчёте об ошибке</link>.
zh_cn: 要了解更多信息，请阅读 <link href="https://bugzilla.redhat.com/show_bug.cgi?id=1150678">bug report</link>。

source: Restart the web server and session storage service:
ru: Перезапустите веб-сервер и сервис хранилища сессий:
zh_cn: 重启 web 服务器和会话存储服务：

source: After installing the operating system on each node for the architecture that you choose to deploy, you must configure the network interfaces. We recommend that you disable any automated network management tools and manually edit the appropriate configuration files for your distribution. For more information on how to configure networking on your distribution, see the <link os="ubuntu" href="https://help.ubuntu.com/lts/serverguide/network-configuration.html">documentation.</link><link os="debian" href="https://wiki.debian.org/NetworkConfiguration">documentation.</link><link os="rhel;centos;fedora" href="https://access.redhat.com/site/documentation/en-US/Red_Hat_Enterprise_Linux/6/html/Deployment_Guide/s1-networkscripts-interfaces.html">documentation.</link><link os="sles;opensuse" href="https://www.suse.com/documentation/sles11/book_sle_admin/data/sec_basicnet_manconf.html">SLES 11</link><phrase os="sles;opensuse"> or </phrase><link os="sles;opensuse" href="http://activedoc.opensuse.org/book/opensuse-reference/chapter-13-basic-networking">openSUSE documentation.</link>
ru: После установки операционной системы на каждый узел для выбранной вами архитектуры, вам необходимо настроить сетевые интерфейсы. Мы рекомендуем вам отключить любые инструменты автоматической настройки сети в вашем дистрибутиве. Подробнее о том, как настроить сеть в вашем дистрибутиве, смотрите в <link os="ubuntu" href="https://help.ubuntu.com/lts/serverguide/network-configuration.html">документации.</link><link os="debian" href="https://wiki.debian.org/NetworkConfiguration">документации.</link><link os="rhel;centos;fedora" href="https://access.redhat.com/site/documentation/en-US/Red_Hat_Enterprise_Linux/6/html/Deployment_Guide/s1-networkscripts-interfaces.html">документации.</link><link os="sles;opensuse" href="https://www.suse.com/documentation/sles11/book_sle_admin/data/sec_basicnet_manconf.html">документации SLES 11</link><phrase os="sles;opensuse"> или </phrase><link os="sles;opensuse" href="http://activedoc.opensuse.org/book/opensuse-reference/chapter-13-basic-networking">openSUSE.</link>
zh_cn: 在每个节点上为您所选择的架构安装好操作系统之后，那你必需配置网络接口。我们建议您禁用自动的网络管理工具，并为您的环境手动修改合适的配置。要了解更多入如何配置网络的信息，请阅读 <link os="ubuntu" href="https://help.ubuntu.com/lts/serverguide/network-configuration.html">documentation.</link><link os="debian" href="https://wiki.debian.org/NetworkConfiguration">documentation.</link><link os="rhel;centos;fedora" href="https://access.redhat.com/site/documentation/en-US/Red_Hat_Enterprise_Linux/6/html/Deployment_Guide/s1-networkscripts-interfaces.html">documentation.</link><link os="sles;opensuse" href="https://www.suse.com/documentation/sles11/book_sle_admin/data/sec_basicnet_manconf.html">SLES 11</link><phrase os="sles;opensuse"> 或 </phrase><link os="sles;opensuse" href="http://activedoc.opensuse.org/book/opensuse-reference/chapter-13-basic-networking">openSUSE documentation.</link>。

source: All nodes require Internet access for administrative purposes such as package installation, security updates, <glossterm>DNS</glossterm>, and <glossterm baseform="Network Time Protocol (NTP)">NTP</glossterm>. In most cases, nodes should obtain Internet access through the management network interface. To highlight the importance of network separation, the example architectures use <link href="https://tools.ietf.org/html/rfc1918">private address space</link> for the management network and assume that network infrastructure provides Internet access via <glossterm baseform="Network Address Translation (NAT)">NAT</glossterm>. To illustrate the flexibility of <glossterm>IaaS</glossterm>, the example architectures use public IP address space for the external network and assume that network infrastructure provides direct Internet access to instances in your OpenStack environment. In environments with only one block of public IP address space, both the management and external networks must ultimately obtain Internet access using it. For simplicity, the diagrams in this guide only show Internet access for OpenStack services.
ru: Всем узлам требуется доступ в Интернет для административных задач, таких как установка пакетов, обновления безопасности, <glossterm>DNS</glossterm>и <glossterm baseform="Network Time Protocol (NTP)">NTP</glossterm>. В большинстве случаев, узлы должны получать доступ в Интернет через интерфейс управляющей сети. Чтобы подчеркнуть важность разделения сетей, примеры архитектур используют <link href="https://tools.ietf.org/html/rfc1918">диапозоны серых адресов</link> для управляющей сети и предполагают, что сетевая инфраструктура предоставляет доступ в интернет через <glossterm baseform="Network Address Translation (NAT)">NAT</glossterm>. Для демонстрации гибкости <glossterm>IaaS</glossterm>, примеры архитектур используют публичные IP-адреса для внешней сети и предполагают, что сетевая инфраструктура предоставляет прямой Интернет доступ к вашим инстансам в вашей среде OpenStack. В среде с одним блоком публичных IP-адресов, управляющая и внешнаяя сеть должны получать Интернет доступ через него. Для простоты, диаграммы в этом руководстве демонстрируют только Интернет доступ для служб OpenStack.
zh_cn: 所有的节点为了管理的目的需要 Internet 的访问，例如包的安装、安全升级、<glossterm>DNS</glossterm> 和 <glossterm baseform="Network Time Protocol (NTP)">NTP</glossterm>。在多数情况下，节点应该通过管理网络接口包含 Internet 的访问。为了突出网络分离的重要性，架构样例为管理网络使用了<link href="https://tools.ietf.org/html/rfc1918">私有地址空间</link>，且假设网络基础设施通过 <glossterm baseform="Network Address Translation (NAT)">NAT</glossterm>. To illustrate the flexibility of <glossterm>IaaS</glossterm> 提供了 Internet 的访问。为了说明 <glossterm>IaaS</glossterm> 的灵活性，架构样例为外部网络使用了公共 IP 地址空间，且假设网络基础设施为您 OpenStack 环境中的实例提供了直接的 Internet 访问。在只有一块公共 IP 地址空间的环境中，管理网络和外部网络都必需最终使用它获得 Internet 的访问。简单来说，本指南中的图片仅仅展示了 OpenStack 服务的 Internet 访问。

source: For more information, see the <link href="https://www.suse.com/documentation/sles11/book_sle_admin/data/sec_nm_activate.html">SLES </link> or the <link href="http://activedoc.opensuse.org/book/opensuse-reference/chapter-13-basic-networking#sec.basicnet.yast.netcard.global"> openSUSE documentation</link>.
ru: Подробнее смотрите <link href="https://www.suse.com/documentation/sles11/book_sle_admin/data/sec_nm_activate.html">документацию SLES</link> или <link href="http://activedoc.opensuse.org/book/opensuse-reference/chapter-13-basic-networking#sec.basicnet.yast.netcard.global"> openSUSE</link>.
zh_cn: 要了解更多信息，请阅读 <link href="https://www.suse.com/documentation/sles11/book_sle_admin/data/sec_nm_activate.html">SLES </link> 或 <link href="http://activedoc.opensuse.org/book/opensuse-reference/chapter-13-basic-networking#sec.basicnet.yast.netcard.global"> openSUSE 文档</link>。

source: Your distribution enables a restrictive <glossterm>firewall</glossterm> by default. During the installation process, certain steps will fail unless you alter or disable the firewall. For more information about securing your environment, refer to the <link href="http://docs.openstack.org/sec/">OpenStack Security Guide</link>.
ru: Ваш дистрибутив включает ограничивающий <glossterm>межсетевой экран</glossterm> по умолчанию. Во время установки, некоторые шаги не сработают, если вы не измените или не отключите межсетевой экран. За дополнительной информацией о том, как обезопасить вашу среду, обратитесь к <link href="http://docs.openstack.org/sec/">Руководству по безопасности OpenStack</link>.
zh_cn: 您的环境默认情况下启用了限制的<glossterm>防火墙</glossterm>。在安装过程中，某些步骤会失败，除非您改变或禁用防火墙。要了解更多保护您环境的信息，请阅读 <link href="http://docs.openstack.org/sec/">OpenStack 安全指南</link>。

source: Your distribution does not enable a restrictive <glossterm>firewall</glossterm> by default. For more information about securing your environment, refer to the <link href="http://docs.openstack.org/sec/">OpenStack Security Guide</link>.
ru: Ваш дистрибутив не включает ограничивающий <glossterm>межсетевой экран</glossterm> по умолчанию. За дополнительной информацией о том, как обезопасить вашу среду, обратитесь к <link href="http://docs.openstack.org/sec/">Руководству по безопасности OpenStack</link>.
zh_cn: 您的环境默认情况下没有启用限制的<glossterm>防火墙</glossterm>。要了解更多保护您环境的信息，请阅读 <link href="http://docs.openstack.org/sec/">OpenStack 安全指南</link>。

source: The Networking common component configuration includes the authentication mechanism, message broker, and plug-in.
ru: Настройка общего Сетевого компонента включает механизм аутентификации, брокер сообщений и плагин.
zh_cn: 网络通用组件的配置包括认证机制、消息代理和插件。

source: In the <literal>[ml2]</literal> section, enable the <glossterm baseform="flat network">flat</glossterm> and <glossterm>generic routing encapsulation (GRE)</glossterm> network type drivers, GRE tenant networks, and the OVS mechanism driver:
ru: В секции <literal>[ml2]</literal>, включите <glossterm baseform="flat network">плоские</glossterm> и <glossterm>generic routing encapsulation (GRE)</glossterm> типы сетей, GRE сети проектов и драйвер механизма OVS:
zh_cn: 在 <literal>[ml2]</literal> 部分，启用 <glossterm baseform="flat network">flat</glossterm> 和 <glossterm>generic routing encapsulation (GRE)</glossterm> 网络类型驱动、GRE 租户网络和 OVS 机制驱动：

source: In the <literal>[ml2_type_gre]</literal> section, configure the tunnel identifier (id) range:
ru: В секции <literal>[ml2_type_gre]</literal>, настройте диапозон идентификаторов (id) туннелей:
zh_cn: 在 <literal>[ml2_type_gre]</literal> 部分，配置隧道标识符 (id) 的范围：

source: In the <literal>[ovs]</literal> section, enable tunnels and configure the local tunnel endpoint:
ru: В секции <literal>[ovs]</literal> включите туннели и настройте точку доступа локального туннеля:
zh_cn: 在 <literal>[ovs]</literal> 部分，启用隧道并配置本地隧道的端点：

source: Replace <replaceable>INSTANCE_TUNNELS_INTERFACE_IP_ADDRESS</replaceable> with the IP address of the instance tunnels network interface on your compute node.
ru: Замените <replaceable>INSTANCE_TUNNELS_INTERFACE_IP_ADDRESS</replaceable> на IP-адрес интерфейса сети туннелей инстансов на вашем вычислительном узле.
zh_cn: 将其中的 <replaceable>INSTANCE_TUNNELS_INTERFACE_IP_ADDRESS</replaceable> 替换为计算节点上的实例隧道网络接口的 IP 地址。

source: In the <literal>[agent]</literal> section, enable GRE tunnels:
ru: В секции <literal>[agent]</literal>, включите туннели GRE:
zh_cn: 在 <literal>[agent]</literal> 部分，启用 GRE 隧道：

source: The Networking service initialization scripts expect a symbolic link <filename>/etc/neutron/plugin.ini</filename> pointing to the ML2 plug-in configuration file, <filename>/etc/neutron/plugins/ml2/ml2_conf.ini</filename>. If this symbolic link does not exist, create it using the following command:
ru: Скрипты инициализации службы Сети ожидают символической ссылки <filename>/etc/neutron/plugin.ini</filename>, указывающей на файл конфигурации плагина ML2, <filename>/etc/neutron/plugins/ml2/ml2_conf.ini</filename>. Если эта символическая ссылка не существует, создайтей её следующей командой:
zh_cn: Networking 服务初始化脚本需要一个象征性的链接将 <filename>/etc/neutron/plugin.ini</filename> 指向 ML2 插件的配置文件 <filename>/etc/neutron/plugins/ml2/ml2_conf.ini</filename>。如果这个象征性的链接不存在，请用以下命令创建它：

source: Due to a packaging bug, the Open vSwitch agent initialization script explicitly looks for the Open vSwitch plug-in configuration file rather than a symbolic link <filename>/etc/neutron/plugin.ini</filename> pointing to the ML2 plug-in configuration file. Run the following commands to resolve this issue:
ru: Из-за ошибка в пакете, скрипт инициализации агента Open vSwitch ищет файлт конфигурации плагина Open vSwitch вместо символической ссылки <filename>/etc/neutron/plugin.ini</filename>, указывающей на файл настройки плагина ML2. Исполните следующую команду для решения этой проблемы:
zh_cn: 由于一个包的缺陷，Open vSwitch 代理初始化脚本会寻找 Open vSwitch 插件的配置文件，而不是指向 ML2 配置文件的象征性链接 <filename>/etc/neutron/plugin.ini</filename>。执行以下命令来解决这个问题：

source: For more information about how to manage volumes, see the <link href="http://docs.openstack.org/user-guide/content/index.html"><citetitle>OpenStack User Guide</citetitle></link>.
ru: Подробнее о том, как управлять дисками, смотрите <link href="http://docs.openstack.org/user-guide/content/index.html"><citetitle>Руководство пользователя OpenStack</citetitle></link>.
zh_cn: 要了解更多如何管理卷的信息，请阅读 link href="http://docs.openstack.org/user-guide/content/index.html"><citetitle>OpenStack 用户手册</citetitle></link>。

source: Source the <literal>demo</literal> tenant credentials to perform the following steps as a non-administrative tenant:
ru: Загрузите учётные данные проекта <literal>demo</literal> для выполнения следующих шагов от имени не-административного проекта:
zh_cn: Source <literal>demo</literal> 租户凭证，以非管理员租户的身份来执行下列步骤：

source: Before you configure the OpenStack Networking (neutron) service, you must create a database, service credentials, and API endpoints.
ru: Прежде чем настраивать службу Сети OpenStack (neutron), вам необходимо создать базу данных, служебные учётные данные и точки доступа API.
zh_cn: 配置 OpenStack 网络 (neutron) 服务之前，您必须创建一个数据库、服务证书和 API 端点。

source: Replace <replaceable>NEUTRON_PASS</replaceable> with a suitable password.
ru: Замените <replaceable>NEUTRON_PASS</replaceable> на подходящий пароль.
zh_cn: 将其中的 <replaceable>NEUTRON_PASS</replaceable> 替换为一个合适的密码。

source: Create the Networking service API endpoints:
ru: Создайте точки доступа API службы Сети:
zh_cn: 创建网络服务的 API 端点：

source: The Networking server component configuration includes the database, authentication mechanism, message broker, topology change notifications, and plug-in.
ru: Конфигурация компонента сервера службы Сети включает базу данных, механизм аутентификации, брокер сообщений, оповещения изменения топологии и плагины.
zh_cn: Networking 服务器组件的配置包括数据库、认证机制、消息 broker、拓扑变化通知和插件。

source: In the <literal>[DEFAULT]</literal> section, configure Networking to notify Compute of network topology changes:
ru: В секции <literal>[DEFAULT]</literal>, настройте службу Сети оповещать службу Вычислений об изменениях топологии сети:
zh_cn: 在 <literal>[DEFAULT]</literal> 部分，配置 Networking 以通知 Compute 网络拓扑的变化：

source: Replace <replaceable>SERVICE_TENANT_ID</replaceable> with the <literal>service</literal> tenant identifier (id) in the Identity service and <replaceable>NOVA_PASS</replaceable> with the password you chose for the <literal>nova</literal> user in the Identity service.
ru: Замените <replaceable>SERVICE_TENANT_ID</replaceable> на идентификатор (id) проекта <literal>service</literal> в службе Идентификации и <replaceable>NOVA_PASS</replaceable> на пароль, который вы выбрали для пользователя <literal>nova</literal> в службе Идентификации.
zh_cn: 将其中的 <replaceable>SERVICE_TENANT_ID</replaceable> 替换为 <literal>service</literal> 租户在身份认证服务中的标识符 (id)，将 <replaceable>NOVA_PASS</replaceable> 替换为您在身份认证服务中为 <literal>nova</literal> 用户设置的密码。

source: To obtain the <literal>service</literal> tenant identifier (id):
ru: Для получения идентификатора (id) сети проекта <literal>service</literal>:
zh_cn: 获取 <literal>service</literal> 租户的标识符 (id)：

source: Once you configure the ML2 plug-in, be aware that disabling a network type driver and re-enabling it later can lead to database inconsistency.
ru: Как только вы настроите плагин ML2, имейте в виду, что отключения драйвера типа сети и включение его позже приведёт к несогласованности базы данных.
zh_cn: 一旦您配置好了 ML2 插件，要注意如果禁用一个网络类型，然后再重新启用它，会导致数据库的不一致问题。

source: Some meters might not appear until after you successfully launch at least one instance.
zh_cn: 一些 meters 可能不会出现，直到您至少成功启动了一台实例之后。

source: Download an image from the Image Service:
ja: Image Service からイメージをダウンロードします。
ru: Загрузите образ со службы Образов:
zh_cn: 从映像服务器下载一个映像：

source: Replace <replaceable>INSTANCE_TUNNELS_INTERFACE_IP_ADDRESS</replaceable> with the IP address of the instance tunnels network interface on your network node.
ru: Замените <replaceable>INSTANCE_TUNNELS_INTERFACE_IP_ADDRESS</replaceable> на IP-адрес интерфейса сети туннелей инстансов на вашем сетевом узле.
zh_cn: 将其中的 <replaceable>INSTANCE_TUNNELS_INTERFACE_IP_ADDRESS</replaceable> 替换为网络节点上实例隧道网络接口的 IP 地址。

source: In the <literal>[DEFAULT]</literal> section, configure the driver, enable <glossterm baseform="network namespace">network namespaces</glossterm>, configure the external network bridge and enable deletion of defunct router namespaces:
ru: В секции <literal>[DEFAULT]</literal> настройте драйвер, включите <glossterm baseform="network namespace">пространства имён сетей</glossterm>, настройте внешний сетевой мост и включите удаление нерабочих пространств имён DHCP:
zh_cn: 在 <literal>[DEFAULT]</literal> 部分，配置驱动，启用 <glossterm baseform="network namespace">network namespaces</glossterm>，配置外部网络桥接并启用删除废弃的路由命名空间：

source: Due to an issue with old versions of the <application>iproute2</application> utility, we recommend that you do not configure the <placeholder-1/> option on SLES 11 SP3.
zh_cn: 由于 <application>iproute2</application> 功能的旧版本，我们建议您不要在 SLES 11 SP3 上配置 <placeholder-1/> 选项。

source: In the <literal>[DEFAULT]</literal> section, configure the drivers, enable namespaces and enable deletion of defunct DHCP namespaces:
ru: В секции <literal>[DEFAULT]</literal> настройте драйверы, включите пространства имён и включите удаление нерабочих пространств имён DHCP:
zh_cn: 在 <literal>[DEFAULT]</literal> 部分，配置驱动，启用命名空间并启用删除废弃 DHCP 命名空间的功能：
