Repository: 25hours/openstack-manuals
Catalog: doc/install-guide/locale/*.po
Languages: ja, ru, vi_vn, zh_cn

source: Compute stores information in a database. In this guide, we use a MySQL database on the controller node. Configure Compute with the database location and credentials. Replace <replaceable>NOVA_DBPASS</replaceable> with the password for the database that you will create in a later step.
ja: Compute は情報を保存するためにデータベースを使用します。このガイドでは、コントローラーノードで MySQL データベースを使用します。Compute をデータベースの位置とクレデンシャルで設定します。<replaceable>NOVA_DBPASS</replaceable> を後のステップで作成するデータベース用パスワードで置き換えます。

source: Edit the <literal>[database]</literal> section in the <filename>/etc/nova/nova.conf</filename> file to modify this key:
ja: このキーを変更するために <filename>/etc/nova/nova.conf</filename> ファイルの <literal>[database]</literal> セクションを編集します。

source: Set these configuration keys to configure Compute to use the Qpid message broker:
ja: Compute が Qpid メッセージブローカーを使用するよう設定するために、これらの設定キーを設定します。

source: Configure the Compute service to use the RabbitMQ message broker by setting these configuration keys in the <literal>[DEFAULT]</literal> configuration group of the <filename>/etc/nova/nova.conf</filename> file:
ja: <filename>/etc/nova/nova.conf</filename> ファイルの <literal>[DEFAULT]</literal> 設定グループにこれらの設定キーを設定することにより、Compute サービスが RabbitMQ メッセージブローカーを使用するよう設定します。

source: Set these configuration keys to configure Compute to use the RabbitMQ message broker:
ja: Compute が RabbitMQ メッセージブローカーを使用するよう設定するために、これらの設定キーを設定します。

source: Edit the <filename>/etc/nova/nova.conf</filename> file and add these lines to the <literal>[DEFAULT]</literal> section:
ja: <filename>/etc/nova/nova.conf</filename> ファイルを編集し、<literal>[DEFAULT]</literal> セクションにこれらの行を追加します。

source: In Debian, the <package>debconf</package> package automatically sets up <literal>my_ip</literal> parameter but you must edit the <filename>/etc/nova/nova.conf</filename> file to configure the <option>vncserver_listen</option> and <option>vncserver_proxyclient_address</option> options, which appear at the end of the file:
ja: Debian では、<package>debconf</package> パッケージが自動的に <literal>my_ip</literal> パラメーターをセットアップしますが、<filename>/etc/nova/nova.conf</filename> ファイルの最後にある <option>vncserver_listen</option> オプションと <option>vncserver_proxyclient_address</option> オプションを設定するために、このファイルを編集する必要があります。

source: Run the <placeholder-1/> command to create the Compute service database and tables and a <literal>nova</literal> database user.
ja: Compute Service のデータベース、テーブル、<literal>nova</literal> データベースユーザーを作成するために <placeholder-1/> コマンドを使用します。

source: Use the password you created previously to log in as root. Create a <literal>nova</literal> database user:
ja: root としてログインするために、前に作成したパスワードを使用します。<literal>nova</literal> データベースユーザーを作成します。

source: Create the Compute service tables:
ja: Compute サービスのテーブルを作成します。

source: Create a <literal>nova</literal> user that Compute uses to authenticate with the Identity Service. Use the <literal>service</literal> tenant and give the user the <literal>admin</literal> role:
ja: Compute が Identity Service で認証するために使用する <literal>nova</literal> ユーザーを作成します。<literal>service</literal> プロジェクトを使用し、ユーザーに <literal>admin</literal> ロールを与えます。

source: Configure Compute to use these credentials with the Identity Service running on the controller. Replace <replaceable>NOVA_PASS</replaceable> with your Compute password.
ja: コントローラーで実行している Identity Service でこれらのクレデンシャルを使用するよう Compute を設定します。<replaceable>NOVA_PASS</replaceable> をお使いの Compute パスワードで置き換えます。

source: Edit the <literal>[DEFAULT]</literal> section in the <filename>/etc/nova/nova.conf</filename> file to add this key:
ja: このキーを追加するために <filename>/etc/nova/nova.conf</filename> ファイルの <literal>[DEFAULT]</literal> セクションを編集します。

source: Add these keys to the <literal>[keystone_authtoken]</literal> section:
ja: これらのキーを <literal>[keystone_authtoken]</literal> セクションに追加します。

source: You must register Compute with the Identity Service so that other OpenStack services can locate it. Register the service and specify the endpoint:
ja: 他の OpenStack サービスから使用できるように、Compute を Identity Service に登録します。サービスを登録し、エンドポイントを指定します。

source: Start Compute services and configure them to start when the system boots:
ja: Compute サービスを起動し、システム起動時に起動するよう設定します。

source: Restart Compute services:
ja: Compute サービスを再起動します。

source: To verify your configuration, list available images:
ja: 設定を検証するために、使用可能なイメージを一覧表示します。

source: This section details set up for any node that runs the <literal>nova-compute</literal> component but does not run the full network stack.
ja: このセクションは <literal>nova-compute</literal> コンポーネントを実行するあらゆるノードのセットアップについて詳細に説明しますが、すべてのネットワークスタックを実行しません。

source: By default, the <literal>system-config-firewall</literal> automated firewall configuration tool is in place on RHEL. This graphical interface (and a curses-style interface with <literal>-tui</literal> on the end of the name) enables you to configure IP tables as a basic firewall. You should disable it when you work with OpenStack Networking unless you are familiar with the underlying network technologies, as, by default, it blocks various types of network traffic that are important to neutron services. To disable it, launch the program and clear the <guilabel>Enabled</guilabel> check box.
ja: <literal>system-config-firewall</literal> 自動ファイアウォール設定ツールが RHEL にデフォルトで入っています。このグラフィカルツール (および名前の最後に <literal>-tui</literal> を付けた端末スタイルのインターフェース) により、基本的なファイアウォールとして iptables を設定できます。基礎となるネットワーク技術に詳しくなければ、OpenStack Networking を利用しているときに、これを無効化すべきです。これは neutron サービスにとって重要であるさまざまな種類のネットワーク通信を遮断するためです。これを無効化する場合、プログラムを起動し、<guilabel>有効化</guilabel>チェックボックスを解除します。

source: After you successfully set up OpenStack Networking with Neutron, you can re-enable and configure the tool. However, during OpenStack Networking setup, disable the tool to make it easier to debug network issues.
ja: Neutron を用いて OpenStack Networking を正常にセットアップした後、ツールを再び有効化し、設定できます。しかしながら、OpenStack Networking のセットアップ中は、ネットワークの問題をデバッグしやすくするためにツールを無効化します。

source: Disable packet destination filtering (route verification) to let the networking services route traffic to the VMs. Edit the <filename>/etc/sysctl.conf</filename> file and run the following command to activate changes:
ja: Networking Service が仮想マシンへの通信をルーティングできるように、パケット宛先フィルタリング (ルート検証) を無効化します。<filename>/etc/sysctl.conf</filename> を編集し、変更を有効化するために以下のコマンドを実行します。

source: Install Open vSwitch plug-in
ja: Open vSwitch プラグインのインストール

source: OpenStack Networking supports a variety of plug-ins. For simplicity, we chose to cover the most common plug-in, Open vSwitch, and configure it to use basic GRE tunnels for tenant network traffic.
ja: OpenStack Networking はさまざまなプラグインをサポートします。簡単のために、最も一般的なプラグイン Open vSwitch を取り扱うことにし、プロジェクトのネットワーク通信のために基本的な GRE トンネルを使用するよう設定します。

source: Install the Open vSwitch plug-in and its dependencies:
ja: Open vSwitch プラグインと依存パッケージをインストールします。

source: Restart Open vSwitch:
ja: Open vSwitch を再起動します。

source: Start Open vSwitch and configure it to start when the system boots:
ja: Open vSwitch を起動し、システム起動時に起動するよう設定します。

source: You must set some common configuration options no matter which networking technology you choose to use with Open vSwitch. You must add the <literal>br-int</literal> integration bridge, which connects to the VMs.
ja: どのネットワーク技術を Open vSwitch と一緒に使用するかによらず、いくつかの共通設定オプションを設定する必要があります。仮想マシンを接続する <literal>br-int</literal> 統合ブリッジを追加する必要があります。

source: You must set some common configuration options. You must configure Networking core to use <acronym>OVS</acronym>. Edit the <filename>/etc/neutron/neutron.conf</filename> file:
ja: どのネットワーク技術を <acronym>OVS</acronym> と一緒に使用するかによらず、いくつかの共通設定オプションを設定する必要があります。<filename>/etc/neutron/neutron.conf</filename> ファイルを編集します。

source: You must configure a firewall as well. You should use the same firewall plug-in that you chose to use when you set up the network node. To do this, edit <filename>/etc/neutron/plugins/openvswitch/ovs_neutron_plugin.ini</filename> file and set the <literal>firewall_driver</literal> value under the <literal>securitygroup</literal> to the same value used on the network node. For instance, if you chose to use the Hybrid OVS-IPTables plug-in, your configuration looks like this:
ja: 同様にファイアウォールを設定する必要があります。ネットワークノードをセットアップするときに選択したものと同じファイアウォールプラグインを使用すべきです。そうするために、<filename>/etc/neutron/plugins/openvswitch/ovs_neutron_plugin.ini</filename> ファイルを編集し、<literal>securitygroup</literal> の下にある <literal>firewall_driver</literal> 値をネットワークノードで使用したものと同じ値に設定します。例えば、ハイブリッド OVS iptables プラグインを使用したい場合、設定はこのようになるでしょう。

source: You must use at least the No-Op firewall. Otherwise, Horizon and other OpenStack services cannot get and set required VM boot options.
ja: 少なくとも No-Op ファイアウォールを使用する必要があります。そうでなければ、Horizon と他の OpenStack サービスが必要となる仮想マシンのブートオプションを取得および設定できません。

source: Configure the <acronym>OVS</acronym> plug-in to start on boot.
ja: <acronym>OVS</acronym> プラグインをシステム起動時に起動するよう設定します。

source: Tell the <acronym>OVS</acronym> plug-in to use GRE tunneling with a <literal>br-int</literal> integration bridge, a <literal>br-tun</literal> tunneling bridge, and a local IP for the tunnel of <replaceable>DATA_INTERFACE</replaceable>'s IP Edit the <filename>/etc/neutron/plugins/openvswitch/ovs_neutron_plugin.ini</filename> file:
ja: <literal>br-int</literal> 統合ブリッジを持つ GRE トンネリング、<literal>br-tun</literal> トンネリングブリッジ、<replaceable>DATA_INTERFACE</replaceable> の IP のトンネル用ローカル IP を使用するよう <acronym>OVS</acronym> プラグインに通知します。<filename>/etc/neutron/plugins/openvswitch/ovs_neutron_plugin.ini</filename> ファイルを編集します。

source: Configure common components
ja: 共通コンポーネントの設定

source: Configure Networking to use <systemitem class="service">keystone</systemitem> for authentication:
ja: Networking が認証用に <systemitem class="service">keystone</systemitem> を使用するよう設定します。

source: Set the <literal>auth_strategy</literal> configuration key to <literal>keystone</literal> in the <literal>[DEFAULT]</literal> section of the file:
ja: このファイルの <literal>[DEFAULT]</literal> セクションで <literal>auth_strategy</literal> 設定キーを <literal>keystone</literal> に設定します。

source: Set the <systemitem class="service">neutron</systemitem> configuration for <systemitem class="service">keystone</systemitem> authentication:
ja: <systemitem class="service">keystone</systemitem> 認証用に <systemitem class="service">neutron</systemitem> を設定します。

source: To configure <systemitem class="service">neutron</systemitem> to use <systemitem class="service">keystone</systemitem> for authentication, edit the <filename>/etc/neutron/neutron.conf</filename> file.
ja: 認証に <systemitem class="service">keystone</systemitem> を使用するよう <systemitem class="service">neutron</systemitem> を設定するために <filename>/etc/neutron/neutron.conf</filename> ファイルを編集します。

source: Add these lines to the <literal>[keystone_authtoken]</literal> section of the file:
ja: このファイルの <literal>[keystone_authtoken]</literal> セクションにこれらの行を追加します。

source: Configure access to the <application>RabbitMQ</application> service:
ja: <application>RabbitMQ</application> サービスのアクセス権を設定します。

source: Configure the <application>RabbitMQ</application> access. Edit the <filename>/etc/neutron/neutron.conf</filename> file to modify the following parameters in the <literal>[DEFAULT]</literal> section.
ja: <application>RabbitMQ</application> のアクセス権を設定します。<literal>[DEFAULT]</literal> セクションにある以下のパラメーターを変更するために、<filename>/etc/neutron/neutron.conf</filename> ファイルを編集します。

source: Configure access to the <application>Qpid</application> message queue:
ja: <application>Qpid</application> メッセージキューのアクセス権を設定します。

source: Configure Compute services for Networking
ja: Compute サービスの Networking 用設定

source: Configure OpenStack Compute to use OpenStack Networking services. Configure the <filename>/etc/nova/nova.conf</filename> file as per instructions below:
ja: OpenStack Compute が OpenStack Networking Service を使用するよう設定します。以下のそれぞれの説明にあるとおり、<filename>/etc/nova/nova.conf</filename> ファイルを編集します。

source: Configure OpenStack Compute to use OpenStack Networking services. Edit the <filename>/etc/nova/nova.conf</filename> file:
ja: OpenStack Compute が OpenStack Networking Service を使用するよう設定します。<filename>/etc/nova/nova.conf</filename> ファイルを編集します。

source: No matter which firewall driver you chose when you configured the network and compute nodes, you must edit the <filename>/etc/nova/nova.conf</filename> file to set the firewall driver to <literal>nova.virt.firewall.NoopFirewallDriver</literal>. Because OpenStack Networking handles the firewall, this statement instructs Compute to not use a firewall.
ja: ネットワークとコンピュートノードを設定するときに、どのファイアウォールドライバーを選択しても、ファイアウォールドライバーを <literal>nova.virt.firewall.NoopFirewallDriver</literal> に設定するために、<filename>/etc/nova/nova.conf</filename> ファイルを編集する必要があります。OpenStack Networking はファイアウォールを取り扱うので、このステートメントは Compute がファイアウォールを使用しないことを指定します。

source: If you want Networking to handle the firewall, edit the <filename>/etc/neutron/plugins/openvswitch/ovs_neutron_plugin.ini</filename> file to set the <code>firewall_driver</code> option to the firewall for the plug-in. For example, with <acronym>OVS</acronym>, edit the file as follows:
ja: Networking にファイアウォールを取り扱わせたい場合、<code>firewall_driver</code> オプションをプラグイン用のファイアウォールに設定するために、<filename>/etc/neutron/plugins/openvswitch/ovs_neutron_plugin.ini</filename> ファイルを編集します。例えば、<acronym>OVS</acronym> を使用する場合、ファイルを次のとおり編集します。

source: If you do not want to use a firewall in Compute or Networking, edit both configuration files and set <code>firewall_driver=nova.virt.firewall.NoopFirewallDriver</code>. Also, edit the <filename>/etc/nova/nova.conf</filename> file and comment out or remove the <code>security_group_api=neutron</code> statement.
ja: Compute や Networking でファイアウォールを使用したくない場合、両方の設定ファイルを編集し、<code>firewall_driver=nova.virt.firewall.NoopFirewallDriver</code> を設定します。また、<filename>/etc/nova/nova.conf</filename> ファイルを編集し、<code>security_group_api=neutron</code> ステートメントをコメントアウトまたは削除します。

source: Otherwise, when you issue <placeholder-1/> commands, the <errortext>ERROR: The server has either erred or is incapable of performing the requested operation. (HTTP 500)</errortext> error might be returned.
ja: そうしなければ、<placeholder-1/> コマンドを実行したとき、<errortext>ERROR: The server has either erred or is incapable of performing the requested operation. (HTTP 500)</errortext> エラーが返されるでしょう。

source: The <systemitem class="service">neutron-server</systemitem> initialization script expects a symbolic link <filename>/etc/neutron/plugin.ini</filename> pointing to the configuration file associated with your chosen plug-in. Using Open vSwitch, for example, the symbolic link must point to <filename>/etc/neutron/plugins/openvswitch/ovs_neutron_plugin.ini</filename>. If this symbolic link does not exist, create it using the following commands:
ja: <systemitem class="service">neutron-server</systemitem> 初期化スクリプトは、選択したプラグインと関連する設定ファイルを指し示すシンボリックリンク <filename>/etc/neutron/plugin.ini</filename> を予期しています。例えば、Open vSwitch を使用する場合、シンボリックリンクが <filename>/etc/neutron/plugins/openvswitch/ovs_neutron_plugin.ini</filename> を指し示す必要があります。このシンボリックリンクが存在しなければ、以下のコマンドを使用して作成します。

source: The <systemitem class="service">openstack-neutron</systemitem> initialization script expects the variable <literal>NEUTRON_PLUGIN_CONF</literal> in file <filename>/etc/sysconfig/neutron</filename> to reference the configuration file associated with your chosen plug-in. Using Open vSwitch, for example, edit the <filename>/etc/sysconfig/neutron</filename> file and add the following:
ja: <systemitem class="service">neutron-server</systemitem> 初期化スクリプトは、<filename>/etc/sysconfig/neutron</filename> の <literal>NEUTRON_PLUGIN_CONF</literal> 変数が、選択したプラグインと関連づけられた設定ファイルを参照していることを予期します。例えば、Open vSwitch を使用する場合、<filename>/etc/sysconfig/neutron</filename> ファイルを編集し、以下を追加します。

source: Restart Networking services.
ja: Networking サービスを再起動します。

source: Restart the Compute service.
ja: Compute Service を再起動します。

source: Python 2.6 or 2.7. The Python version must support Django. The Python version should run on any system, including Mac OS X. Installation prerequisites might differ by platform.
ja: Python 2.6 または 2.7。Python が Django をサポートするバージョンである必要があります。この Python のバージョンは Mac OS X を含め、あらゆるシステムで実行すべきです。インストールの前提条件はプラットフォームにより異なるかもしれません。

source: Create the service endpoint:
ja: サービスエンドポイントを作成します。

source: Run the following commands:
ja: 以下のコマンドを実行します。

source: Edit the <filename>/etc/neutron/plugins/ml2/ml2_conf.ini</filename> file:
ja: <filename>/etc/neutron/plugins/ml2/ml2_conf.ini</filename> ファイルを編集します。

source: Add the following keys to the <literal>[ml2]</literal> section:
ja: 以下のキーを <literal>[ml2]</literal> セクションに追加します。

source: Add the following key to the <literal>[ml2_type_gre]</literal> section:
ja: 以下のキーを <literal>[ml2_type_gre]</literal> セクションに追加します。

source: Add the <literal>[securitygroup]</literal> section and the following keys to it:
ja: <literal>[securitygroup]</literal> セクションを追加し、そこに以下のキーを追加します。

source: Define services and API endpoints
ja: サービスと API エンドポイントの定義

source: So that the Identity Service can track which OpenStack services are installed and where they are located on the network, you must register each service in your OpenStack installation. To register a service, run these commands:
ja: Identity Service が、どの OpenStack サービスがインストールされているか、それらがネットワークのどこにあるかを追跡できるよう、OpenStack インストール環境の各サービスを登録する必要があります。サービスを登録するために、これらのコマンドを実行します。

source: <placeholder-1/>. Describes the service.
ja: <placeholder-1/>。サービスを定義します。

source: <placeholder-1/>. Associates <glossterm baseform="API endpoint">API endpoints</glossterm> with the service.
ja: <placeholder-1/>。<glossterm baseform="API endpoint">API エンドポイント</glossterm>とサービスを関連付けます。

source: You must also register the Identity Service itself. Use the <code>OS_SERVICE_TOKEN</code> environment variable, as set previously, for authentication.
ja: Identity Service 自身も登録する必要があります。前に設定した <code>OS_SERVICE_TOKEN</code> 環境変数を認証のために使用します。

source: Create a service entry for the Identity Service:
ja: Identity Service のサービスエントリーを作成します。

source: The service ID is randomly generated and is different from the one shown here.
ja: サービス ID はランダムに生成され、ここに表示されているものとは異なります。

source: Specify an API endpoint for the Identity Service by using the returned service ID. When you specify an endpoint, you provide URLs for the public API, internal API, and admin API. In this guide, the <literal>controller</literal> host name is used. Note that the Identity Service uses a different port for the admin API.
ja: 返されたサービス ID を使用することにより、Identity Service の API エンドポイントを指定します。エンドポイントを指定するとき、パブリック API、内部 API、管理 API の URL を指定します。このガイドでは、<literal>controller</literal> というホスト名を使用します。Identity Service は管理 API 用に異なるポートを使用することに注意してください。

source: You will need to create an additional endpoint for each service added to your OpenStack environment. The sections of this guide associated with the installation of each service include the endpoint creation step specific to the service.
ja: お使いの OpenStack 環境に追加した各サービス用の追加のエンドポイントを作成することが必要になります。各サービスのインストールと関連したこのガイドのセクションに、サービスへのエンドポイントの具体的な作成手順があります。

source: Verify the Identity Service installation
ja: Identity Service のインストールの検証

source: To verify that the Identity Service is installed and configured correctly, clear the values in the <envar>OS_SERVICE_TOKEN</envar> and <envar>OS_SERVICE_ENDPOINT</envar> environment variables:
ja: Identity Service が正しくインストールされ、設定されていることを確認するためには、<envar>OS_SERVICE_TOKEN</envar> 環境変数と <envar>OS_SERVICE_ENDPOINT</envar> 環境変数にある値を削除します。

source: These variables, which were used to bootstrap the administrative user and register the Identity Service, are no longer needed.
ja: 管理ユーザーをブートストラップし、Identity Service に登録するために使用された、これらの変数はもはや必要ありません。

source: You can now use regular user name-based authentication.
ja: これで通常のユーザー名による認証を使用できます。

source: Request a authentication token by using the <literal>admin</literal> user and the password you chose for that user:
ja: <literal>admin</literal> ユーザーと、そのユーザー用に選択したパスワードを使用して認証トークンを要求します。

source: In response, you receive a token paired with your user ID. This verifies that the Identity Service is running on the expected endpoint and that your user account is established with the expected credentials.
ja: 応答で、ユーザー ID とペアになったトークンを受け取ります。これにより、Identity Service が期待したエンドポイントで実行されていて、ユーザーアカウントが期待したクレデンシャルで確立されていることを検証できます。

source: Verify that authorization behaves as expected. To do so, request authorization on a tenant:
ja: 認可が期待したとおり動作することを検証します。そうするために、プロジェクトで認可を要求します。

source: In response, you receive a token that includes the ID of the tenant that you specified. This verifies that your user account has an explicitly defined role on the specified tenant and the tenant exists as expected.
ja: 応答で、指定したプロジェクトの ID を含むトークンを受け取ります。これにより、ユーザーアカウントが指定したプロジェクトで明示的に定義したロールを持ち、プロジェクトが期待したとおりに存在することを検証します。

source: You can also set your <literal>--os-*</literal> variables in your environment to simplify command-line usage. Set up a <filename>openrc.sh</filename> file with the admin credentials and admin endpoint:
ja: コマンドラインの使用を簡単にするために、お使いの環境で <literal>--os-*</literal> 変数を設定することもできます。admin クレデンシャルと admin エンドポイントを用いて <filename>openrc.sh</filename> ファイルをセットアップします。

source: Source this file to read in the environment variables:
ja: 環境変数を読み込むために、このファイルを source します。

source: Verify that your <filename>openrc.sh</filename> file is configured correctly. Run the same command without the <literal>--os-*</literal> arguments:
ja: <filename>openrc.sh</filename> ファイルが正しく設定されていることを検証します。同じコマンドを <literal>--os-*</literal> 引数なしで実行します。

source: The command returns a token and the ID of the specified tenant. This verifies that you have configured your environment variables correctly.
ja: コマンドはトークンと指定されたプロジェクトの ID を返します。これにより、環境変数が正しく設定されていることを確認します。

source: Verify that your admin account has authorization to perform administrative commands:
ja: admin アカウントが管理コマンドを実行する権限があることを検証します。

source: Seeing that the <literal>id</literal> in the output from the <placeholder-1/> command matches the <literal>user_id</literal> in the <placeholder-2/> command, and that the admin role is listed for that user, for the related tenant, this verifies that your user account has the <literal>admin</literal> role, which matches the role used in the Identity Service <filename>policy.json</filename> file.
ja: <placeholder-1/> コマンドの出力の <literal>id</literal> が <placeholder-2/> コマンドの <literal>user_id</literal> と同じであること、admin ロールがそのユーザー、その関連プロジェクトに対して表示されることを確認します。これにより、お使いのユーザーアカウントが <literal>admin</literal> ロールを持つことを確認します。このロールは Identity Service の <filename>policy.json</filename> ファイルで使用されるロールと対応します。

source: As long as you define your credentials and the Identity Service endpoint through the command line or environment variables, you can run all OpenStack client commands from any machine. For details, see <xref linkend="ch_clients"/>.
ja: コマンドラインや環境変数経由でクレデンシャルと Identity Service エンドポイントを定義する限り、すべてのマシンからすべての OpenStack クライアントコマンドを実行できます。詳細は <xref linkend="ch_clients"/> を参照してください。

source: Per-tenant routers with private networks
ja: プライベートネットワークを持つプロジェクトごとのルーター

source: This section describes how to install the OpenStack Networking service and its components for a use case that has per-tenant routers with private networks.
ja: このセクションは、プライベートネットワークを持つプロジェクトごとのルーターを持つユースケース向けに OpenStack Networking Service とそのコンポーネントをインストールする方法について記載します。

source: The following figure shows the setup:
ja: 以下の図はセットアップ内容を示します。

source: As shown in the figure, the setup includes:
ja: 図に示されているように、セットアップは以下のものを含みます。

source: An interface for management traffic on each node.
ja: 各ノードに管理通信用のインターフェース。

source: Use of the Open vSwitch plug-in.
ja: Open vSwitch プラグインの使用。

source: GRE tunnels for data transport on all agents.
ja: すべてのエージェントでのデータ通信用の GRE トンネル。
