Repository: 25hours/openstack-manuals
Catalog: doc/install-guide/locale/*.po
Languages: ja, ru, vi_vn, zh_cn

source: The node must have:<placeholder-1/>
ja: このノードは以下を持つ必要があります。<placeholder-1/>

source: To install and configure the controller node
ja: コントローラーノードをインストールし、設定する方法

source: Run this command:
ja: このコマンドを実行します。

source: Configure Networking services:
ja: Networking サービスを設定します。

source: Edit the <filename>/etc/neutron/neutron.conf</filename> file and add these lines:
ja: <filename>/etc/neutron/neutron.conf</filename> ファイルを編集し、これらの行を追加します。

source: Edit the <filename> /etc/neutron/plugins/openvswitch/ovs_neutron_plugin.ini</filename> file and add these lines:
ja: <filename> /etc/neutron/plugins/openvswitch/ovs_neutron_plugin.ini</filename> ファイルを編集し、これらの行を追加します。

source: Edit the <filename> /etc/neutron/api-paste.ini</filename> file and add these lines:
ja: <filename> /etc/neutron/api-paste.ini</filename> ファイルを編集し、これらの行を追加します。

source: Start the services:
ja: サービスを起動します。

source: Install and configure the network node
ja: ネットワークノードのインストールと設定

source: Start Open vSwitch<phrase os="rhel;centos;fedora;opensuse;sles"> and configure it to start when the system boots</phrase>:
ja: Open vSwitch を起動します。<phrase os="rhel;centos;fedora;opensuse;sles">また、システム起動時に起動するよう設定します。</phrase>

source: Update the OpenStack Networking <filename>/etc/neutron/neutron.conf</filename> configuration file:
ja: OpenStack Networking 設定ファイル <filename>/etc/neutron/neutron.conf</filename> を更新します。

source: Update the plug-in <filename>/etc/neutron/plugins/openvswitch/ovs_neutron_plugin.ini</filename> configuration file:
ja: プラグインの設定ファイル <filename>/etc/neutron/plugins/openvswitch/ovs_neutron_plugin.ini</filename> を更新します。

source: All VM communication between the nodes occurs through the <literal>br-eth1</literal> bridge.
ja: ノード間のすべての仮想マシンの通信は <literal>br-eth1</literal> 経由で行われます。

source: Create the <literal>br-eth1</literal> network bridge:
ja: <literal>br-eth1</literal> ネットワークブリッジを作成します。

source: Create the external network bridge to the Open vSwitch:
ja: Open vSwitch に外部ネットワークブリッジを作成します。

source: Edit the <filename>/etc/neutron/l3_agent.ini</filename> file and add these lines:
ja: <filename>/etc/neutron/l3_agent.ini</filename> ファイルを編集し、これらの行を追加します。

source: Edit the <filename>/etc/neutron/api-paste.ini</filename> file and add these lines:
ja: <filename>/etc/neutron/api-paste.ini</filename> ファイルを編集し、これらの行を追加します。

source: Edit the <filename>/etc/neutron/dhcp_agent.ini</filename> file and add this line:
ja: <filename>/etc/neutron/dhcp_agent.ini</filename> ファイルを編集し、この行を追加します。

source: Restart networking services:
ja: ネットワークサービスを再起動します。

source: Start and permanently enable networking services:
ja: Networking Service を起動し、永続的に有効化します。

source: Enable the <systemitem class="service">neutron-ovs-cleanup</systemitem> service. This service starts on boot and ensures that Networking has full control over the creation and management of <literal>tap</literal> devices.
ja: <systemitem class="service">neutron-ovs-cleanup</systemitem> サービスを有効化します。このサービスはシステム起動時に起動し、Networking が <literal>tap</literal> デバイスの作成と管理のフルコントロールを持つことを確実にします。

source: Install and configure the compute node
ja: コンピュートノードのインストールと設定

source: Start the OpenvSwitch service<phrase os="rhel;centos;fedora;opensuse;sles"> and configure it to start when the system boots</phrase>:
ja: Open vSwitch サービスを起動します。<phrase os="rhel;centos;fedora;opensuse;sles">また、システム起動時に起動するよう設定します。</phrase>

source: Create the integration bridge:
ja: 統合ブリッジを作成します。

source: All VM communication between the nodes occur through the <literal>br-eth1</literal> bridge.
ja: ノード間のすべての仮想マシンの通信は <literal>br-eth1</literal> 経由で行われます。

source: Edit the OpenStack Networking <filename>/etc/neutron/neutron.conf</filename> configuration file and add this line:
ja: OpenStack Networking 設定ファイル <filename>/etc/neutron/neutron.conf</filename> を編集し、この行を追加します。

source: Restart the OpenvSwitch Neutron plug-in agent:
ja: Open vSwitch Neutron プラグインエージェントを再起動します。

source: Logical network configuration
ja: 論理ネットワーク設定

source: Run these commands on the network node.
ja: ネットワークノードでこれらのコマンドを実行します。

source: Ensure that the following environment variables are set. Various clients use these variables to access the Identity Service.
ja: 以下の環境設定が設定されていることを確認します。さまざまなクライアントが Identity Service にアクセスするために、これらの変数を使用します。

source: Create an <filename>adminrc</filename> file that contains these lines:
ja: これらの行を含む <filename>adminrc</filename> ファイルを作成します。

source: Export the environment variables in the <filename>adminrc</filename> file:
ja: <filename>adminrc</filename> ファイルにある環境変数をエクスポートします。

source: The <literal>admin</literal> tenant can define resources that other tenants can use but cannot modify. These resources are a provider network and its associated router.
ja: <literal>admin</literal> プロジェクトは、他のプロジェクトからアクセスできるが、変更できない リソースを定義できます。これらのリソースには、プロバイダーネットワークやそれに関連付けられたルーターがあります。

source: The <literal>admin</literal> user creates a network and subnet on behalf of <literal>tenant_A</literal>.
ja: <literal>admin</literal> ユーザーが <literal>tenant_A</literal> としてネットワークとサブネットを作成します。

source: A <literal>tenant_A</literal> user can also complete these steps.
ja: <literal>tenant_A</literal> のユーザーもこれらの手順を実行できます。

source: Configure internal networking
ja: 内部ネットワークの設定

source: Get the <literal>tenant_A</literal> tenant ID:
ja: <literal>tenant_A</literal> のプロジェクト ID を取得します。

source: Create the <literal>net1</literal> internal network for the <literal>tenant_A</literal> tenant:
ja: <literal>tenant_A</literal> プロジェクト用の内部ネットワーク <literal>net1</literal> を作成します。

source: Create a subnet on the <literal>net1</literal> network and store its ID in a variable:
ja: ネットワーク <literal>net1</literal> にサブネットを作成し、その ID を変数に保存します。

source: The <literal>id</literal> value will be different on your system.
ja: <literal>id</literal> の値はお使いのシステムにより異なります。

source: A user with the <literal>admin</literal> role in the <literal>admin</literal> tenant must complete these steps.
ja: <literal>admin</literal> プロジェクトで <literal>admin</literal> ロールを持つユーザーがこれらの手順を完了する必要があります。

source: Configure the router and external networking
ja: ルーターの外部ネットワークの作成

source: Create a <literal>router1</literal> router and store its ID in the <literal>ROUTER_ID</literal> variable:
ja: ルーター <literal>router1</literal> を作成し、その ID を <literal>ROUTER_ID</literal> 変数に保存します。

source: The <parameter>--tenant-id</parameter> parameter is not specified, so this router is assigned to the <literal>admin</literal> tenant.
ja: <parameter>--tenant-id</parameter> パラメーターが指定されていません。そのため、このルーターは <literal>admin</literal> プロジェクトに割り当てられます。

source: Add an interface to the <literal>router1</literal> router and attach it to the subnet from <literal>net1</literal>:
ja: インターフェースを <literal>router1</literal> ルーターに追加し、それを <literal>net1</literal> のサブネットに接続します。

source: You can repeat this step to add interfaces for networks that belong to other tenants.
ja: 他のテナントに属するネットワーク用のさらなるインターフェースを追加するために、これらの手順を繰り返すことができます。

source: Create the <literal>ext_net</literal> external network and store its ID in a the <literal>EXTERNAL_NETWORK_ID</literal> variable:
ja: 外部ネットワーク <literal>ext_net</literal> を作成し、その ID を <literal>EXTERNAL_NETWORK_ID</literal> 変数に保存します。

source: Create the subnet for floating IPs.
ja: Floating IP 用のサブネットを作成します。

source: The DHCP service is disabled for this subnet.
ja: DHCP サービスがこのサブネットに対して無効化されます。

source: Set the gateway for the router to the external network:
ja: ルーターのゲートウェイを外部ネットワークに設定します。

source: A user from <literal>tenant_A</literal> completes these steps, so the credentials in the environment variables are different than those in the previous procedure.
ja: <literal>tenant_A</literal> のユーザーがこれらの手順を完了します。そのため、環境変数のクレデンシャルは前の手順のものと異なります。

source: Allocate floating IP addresses
ja: Floating IP アドレスの確保

source: You can associate a floating IP address with a VM after it starts. Store the port ID that was allocated for the VM in the <literal>PORT_ID</literal> variable:
ja: 仮想マシンの起動後に Floating IP アドレスを割り当てられます。仮想マシン用に割り当てられたポートの ID を <literal>PORT_ID</literal> 変数に保存します。

source: Allocate a floating IP and store its ID in the <literal>FLOATING_ID</literal> variable:
ja: Floating IP を確保し、その ID を <literal>FLOATING_ID</literal> 変数に保存します。

source: Associate the floating IP with the port for the VM:
ja: Floating IP を仮想マシンのポートに割り当てます。

source: Show the floating IP:
ja: Floating IP を表示します。

source: Test the floating IP:
ja: Floating IP をテストします。

source: Use case: provider router with private networks
ja: ユースケース: プライベートネットワークを持つプロバイダールーター

source: This use case provides each tenant with one or more private networks that connect to the outside world through an OpenStack Networking router. When each tenant gets exactly one network, this architecture maps to the same logical topology as the VlanManager in Compute (although of course, Networking does not require VLANs). Using the Networking API, the tenant can only see a network for each private network assigned to that tenant. The router object in the API is created and owned by the cloud administrator.
ja: このユースケースは、OpenStack Networking ルーターを経由して外部に接続される 1 つ以上のプライベートを各プロジェクトに提供します。各プロジェクトがネットワークを 1 つだけ持つとき、このアーキテクチャーが Compute で VlanManager と同じ論理トポロジーに対応づけます (もちろん、Networking は VLAN を必要としません)。Networking API を使用して、プロジェクトはそのプロジェクトに割り当てられたそれぞれのプライベートネットワーク用のネットワークのみを参照できます。ルーターオブジェクトが API で作成され、クラウド管理者により所有されます。

source: This model supports assigning public addresses to VMs by using <glossterm baseform="floating IP">floating IPs</glossterm>; the router maps public addresses from the external network to fixed IPs on private networks. Hosts without floating IPs can still create outbound connections to the external network because the provider router performs SNAT to the router's external IP. The IP address of the physical router is used as the <literal>gateway_ip</literal> of the external network subnet, so the provider has a default router for Internet traffic.
ja: このモデルは <glossterm baseform="floating IP">Floating IP</glossterm> を使用して、仮想マシンにパブリック IP アドレスを割り当てることをサポートします。ルーターが外部ネットワークからのパブリック IP アドレスをプライベートネットワークにおける固定 IP に対応付けます。プロバイダールーターがルーターの外部 IP に SNAT を実行するため、Floating IP を持たないホストは外部ネットワークへの出力の接続を作成できます。物理ルーターの IP アドレスは外部ネットワークサブネットの <literal>gateway_ip</literal> として使用されます。そのため、プロバイダーはインターネット通信のためのデフォルトルーターを持ちます。

source: The router provides L3 connectivity among private networks. Tenants can reach instances for other tenants (unless you use additional filtering, such as, security groups). With a single router, tenant networks cannot use overlapping IPs. To resolve this issue, the administrator can create private networks on behalf of the tenants.
ja: ルーターがプライベートネットワーク間の L3 接続性を提供します。(セキュリティグループのような追加フィルタリングを使用していなければ) プロジェクトが他のプロジェクトのインスタンスに到達できます。1 つのルーターを持つ場合、プロジェクトのネットワークは重複した IP を使用できません。この問題を解決するために、管理者はプロジェクトを代表してプライベートネットワークを作成できます。

source: Configure Compute services
ja: Compute Service の設定

source: In OpenStack, certain user IDs are reserved and used to run specific OpenStack services and own specific OpenStack files. These users are set up according to the distribution packages. The following table gives an overview.
ja: OpenStack では、特定のユーザー ID が特定の OpenStack サービスを実行し、特定の OpenStack ファイルを所有するために、予約され、使用されます。これらのユーザーはディストリビューションのパッケージにより設定されます。以下の表はその概要です。

source: By default, the <literal>system-config-firewall</literal> automated firewall configuration tool is in place on RHEL. This graphical interface (and a curses-style interface with <literal>-tui</literal> on the end of the name) enables you to configure IP tables as a basic firewall. You should disable it when you work with Neutron unless you are familiar with the underlying network technologies, as, by default, it blocks various types of network traffic that are important to Neutron. To disable it, simple launch the program and clear the <guilabel>Enabled</guilabel> check box.
ja: <literal>system-config-firewall</literal> 自動ファイアウォール設定ツールが RHEL にデフォルトで入っています。このグラフィカルツール (および名前の最後に <literal>-tui</literal> を付けた端末スタイルのインターフェース) により、基本的なファイアウォールとして iptables を設定できます。基礎となるネットワーク技術に詳しくなければ、Neutron を利用しているときに、これを無効化すべきです。これは Neutron にとって重要であるさまざまな種類のネットワーク通信を遮断するためです。これを無効化するには、単にプログラムを起動し、<guilabel>有効化</guilabel>チェックボックスを解除します。

source: After you successfully set up OpenStack with Neutron, you can re-enable and configure the tool. However, during Neutron set up, disable the tool to make it easier to debug network issues.
ja: OpenStack を Neutron と一緒に正常にセットアップした後、ツールを再び有効化し、設定できます。しかしながら、Networking のセットアップ中は、ネットワークの問題をデバッグしやすくするためにツールを無効化します。

source: Before you configure individual nodes for Networking, you must create the required OpenStack components: user, service, database, and one or more endpoints. After you complete these steps on the controller node, follow the instructions in this guide to set up OpenStack Networking nodes.
ja: 個々のノードを Networking 用に設定する前に、必要となる OpenStack コンポーネント (ユーザー、サービス、データベース、1 つ以上のエンドポイント) を作成する必要があります。コントローラーノードでこれらの手順を完了した後、OpenStack Networking ノードをセットアップするために、このガイドにある説明に従います。

source: Connect to the MySQL database as the root user, create the <literal>neutron</literal> database, and grant the proper access to it:
ja: MySQL データベースに root ユーザーとして接続し、<literal>neutron</literal> データベースを作成し、適切なアクセス権限を与えます。

source: Create the required user, service, and endpoint so that Networking can interface with the Identity Service.
ja: Networking が Identity Service と通信できるよう、必要となるユーザー、サービス、エンドポイントを作成します。

source: Create a <literal>neutron</literal> user:
ja: <literal>neutron</literal> ユーザーを作成します。

source: Add the user role to the neutron user:
ja: ユーザーロールを neutron ユーザーに追加します。

source: Create the neutron service:
ja: neutron サービスを作成します。

source: Create a Networking endpoint:
ja: Networking エンドポイントを作成します。

source: Install and configure server component
ja: サーバーコンポーネントのインストールと設定

source: Install the server component of Networking and any dependencies.
ja: Networking および依存関係のあるサーバーコンポーネントをインストールします。

source: Configure Networking to connect to the database:
ja: Networking がデータベースに接続するよう設定します。

source: Configure Networking to use your MySQL database. Edit the <filename>/etc/neutron/neutron.conf</filename> file and add the following key under the <literal>[database]</literal> section. Replace <replaceable>NEUTRON_DBPASS</replaceable> with the password you chose for the Neutron database.
ja: Networking がお使いの MySQL データベースを使用するよう設定します。<filename>/etc/neutron/neutron.conf</filename> ファイルを編集し、以下のキーを <literal>[database]</literal> セクションに追加します。Neutron データベース用に選択したパスワードで <replaceable>NEUTRON_PASS</replaceable> を置き換えます。

source: Configure Networking to use <systemitem class="service">keystone</systemitem> as the Identity Service for authentication:
ja: Networking が認証用に Identity Service として <systemitem class="service">keystone</systemitem> を使用するよう設定します。

source: Set the <literal>auth_strategy</literal> configuration key to <literal>keystone</literal> in the <literal>DEFAULT</literal> section of the file:
ja: このファイルの <literal>DEFAULT</literal> セクションで <literal>auth_strategy</literal> 設定キーを <literal>keystone</literal> に設定します。

source: Configure Networking to use <systemitem class="service">keystone</systemitem> as the Identity Service for authentication.
ja: Networking が認証用に Identity Service として <systemitem class="service">keystone</systemitem> を使用するよう設定します。

source: Edit the <filename>/etc/neutron/neutron.conf</filename> file and add the file and add the following key under the <literal>[DEFAULT]</literal> section.
ja: <filename>/etc/neutron/neutron.conf</filename> ファイルを編集し、以下のキーを <literal>[DEFAULT]</literal> セクションに追加します。

source: Add the following keys under the <literal>[keystone_authtoken]</literal> section. Replace <replaceable>NEUTRON_PASS</replaceable> with the password you chose for the Neutron user in Keystone.
ja: 以下のキーを <literal>[keystone_authtoken]</literal> セクションに追加します。Keystone で Neutron ユーザー用に選択したパスワードで <replaceable>NEUTRON_PASS</replaceable> を置き換えます。

source: Configure Networking to use your message broker. Edit the <filename>/etc/neutron/neutron.conf</filename> file and add the following keys under the <literal>[DEFAULT]</literal> section.
ja: Networking がお使いのメッセージブローカーを使用するよう設定します。<filename>/etc/neutron/neutron.conf</filename> ファイルを編集し、以下のキーを <literal>[DEFAULT]</literal> セクションに追加します。

source: Replace <replaceable>RABBIT_PASS</replaceable> with the password you chose for RabbitMQ.
ja: <replaceable>RABBIT_PASS</replaceable> を RabbitMQ 用に選んだパスワードで置き換えます。

source: Install and configure Open vSwitch (OVS) plug-in
ja: Open vSwitch (OVS) プラグインのインストールと設定

source: Install the Open vSwitch plug-in:
ja: Open vSwitch プラグインをインストールします。

source: You must set some common configuration options no matter which networking technology you choose to use with Open vSwitch. You must configure Networking core to use <acronym>OVS</acronym>. Edit the <filename>/etc/neutron/neutron.conf</filename> file:
ja: どのネットワーク技術を Open vSwitch と一緒に使用するかによらず、いくつかの共通設定オプションを設定する必要があります。<acronym>OVS</acronym> を使用するために Networking コアを設定する必要があります。<filename>/etc/neutron/neutron.conf</filename> ファイルを編集します。

source: The dedicated controller node does not need to run Open vSwitch or the Open vSwitch agent.
ja: コントローラー専用ノードは Open vSwitch や Open vSwitch エージェントを実行する必要がありません。

source: Configure the <acronym>OVS</acronym> plug-in to use GRE tunneling. Edit the <filename>/etc/neutron/plugins/openvswitch/ovs_neutron_plugin.ini</filename> file:
ja: <acronym>OVS</acronym> プラグインに GRE トンネリングを使用するよう設定します。<filename>/etc/neutron/plugins/openvswitch/ovs_neutron_plugin.ini</filename> ファイルを編集します。

source: Configure Compute to use OpenStack Networking services. Configure the <filename>/etc/nova/nova.conf</filename> file as per instructions below:
ja: Compute が OpenStack Networking サービスを使用するよう設定します。以下のそれぞれの説明にあるとおり、<filename>/etc/nova/nova.conf</filename> ファイルを設定します。

source: Configure Compute to use OpenStack Networking services. Edit the <filename>/etc/nova/nova.conf</filename> file:
ja: Compute が OpenStack Networking サービスを使用するよう設定します。<filename>/etc/nova/nova.conf</filename> ファイルを設定します。

source: Regardless of which firewall driver you chose when you configured the network and compute nodes, set this driver as the No-Op firewall. This firewall is a <systemitem class="service">nova</systemitem> firewall, and because <systemitem class="service">neutron</systemitem> handles the Firewall, you must tell <systemitem class="service">nova</systemitem> not to use one.
ja: ネットワークノードとコンピュートノードを設定するときに、どのファイアウォールドライバーを選択しても、このドライバーを No-Op ファイアウォールとして設定します。このファイアウォールは <systemitem class="service">nova</systemitem> ファイアウォールです。<systemitem class="service">neutron</systemitem> がファイアウォールを取り扱うので、<systemitem class="service">nova</systemitem> にこれを使用しないよう通知する必要があります。

source: When Networking handles the firewall, the option <code>firewall_driver</code> should be set according to the specified plug-in. For example with <acronym>OVS</acronym>, edit the <filename>/etc/neutron/plugins/openvswitch/ovs_neutron_plugin.ini</filename> file:
ja: Networking がファイアウォールを取り扱うとき、<code>firewall_driver</code> オプションは指定したプラグインに合わせて設定されるべきです。例えば、<acronym>OVS</acronym> を用いる場合、<filename>/etc/neutron/plugins/openvswitch/ovs_neutron_plugin.ini</filename> ファイルを編集します。

source: If you do not want to use a firewall in Compute or Networking, set <code>firewall_driver=nova.virt.firewall.NoopFirewallDriver</code> in both config files, and comment out or remove <code>security_group_api=neutron</code> in the <filename>/etc/nova/nova.conf</filename> file, otherwise you may encounter <errortext>ERROR: The server has either erred or is incapable of performing the requested operation. (HTTP 500)</errortext> when issuing <placeholder-1/> commands.
ja: Compute や Networking でファイアウォールを使用したくない場合、両方の設定ファイルで <code>firewall_driver=nova.virt.firewall.NoopFirewallDriver</code> を設定し、<filename>/etc/nova/nova.conf</filename> ファイルの <code>security_group_api=neutron</code> をコメントアウトまたは削除します。そうしなければ、<placeholder-1/> コマンドを実行したときに、<errortext>ERROR: The server has either erred or is incapable of performing the requested operation. (HTTP 500)</errortext> が発生するかもしれません。

source: Restart the Compute and Networking services:
ja: Compute と Networking のサービスを再起動します。

source: To synchronize services across multiple machines, you must install <glossterm baseform="Network Time Protocol (NTP)">NTP</glossterm>. The examples in this guide configure the controller node as the reference server and any additional nodes to set their time from the controller node.
ja: 複数のマシンにわたりサービスを同期するために、<glossterm baseform="Network Time Protocol (NTP)">NTP</glossterm> をインストールする必要があります。このガイドの例は、コントローラーノードを参照サーバーとして設定し、他のすべてのノードはコントローラーノードから時刻を設定するよう設定します。

source: Configure the Image Service for Telemetry
ja: Telemetry 用 Image Service の設定
ru: Настройте службу Образов для Телеметрии

source: To retrieve image samples, you must configure the Image Service to send notifications to the bus.
ja: イメージのサンプルを取得するために、Image Service がバスに通知を送信するよう設定する必要があります。

source: Edit <filename>/etc/glance/glance-api.conf</filename> and modify the <literal>[DEFAULT]</literal> section:
ja: <filename>/etc/glance/glance-api.conf</filename> を編集し、<literal>[DEFAULT]</literal> セクションを変更します。

source: Two-node architecture with legacy networking
ja: レガシーなネットワークを持つ 2 ノードアーキテクチャー

source: Restart networking:
ja: Networking を再起動します。

source: Configure network node
ja: ネットワークノードの設定

source: The management network handles communication among nodes. The data network handles communication coming to and from VMs. The external NIC connects the network node, and optionally to the controller node, so your VMs can connect to the outside world.
ja: 管理ネットワークはノード間の通信を処理します。データネットワークは仮想マシンとの通信を処理します。外部 NIC は仮想マシンが外部と接続できるようネットワークノードを接続します。オプションとしてコントローラーノードに接続します。

source: After you successfully set up OpenStack Networking, you can re-enable and configure the tool. However, during Networking set up, disable the tool to make it easier to debug network issues.
ja: OpenStack Networking を正常にセットアップした後、ツールを再び有効化し、設定できます。しかしながら、Networking のセットアップ中は、ネットワークの問題をデバッグしやすくするためにツールを無効化します。

source: Install agents and configure common components
ja: エージェントのインストールおよび共通コンポーネントの設定

source: Install the Networking packages and any dependencies.
ja: Networking パッケージおよび依存関係のあるパッケージをインストールします。

source: Respond to prompts for <link linkend="debconf-dbconfig-common">database management</link>, <link linkend="debconf-keystone_authtoken"><literal>[keystone_authtoken]</literal> settings</link>, <link linkend="debconf-rabbitqm">RabbitMQ credentials</link> and <link linkend="debconf-api-endpoints">API endpoint</link> registration.
ja: <link linkend="debconf-dbconfig-common">データベース管理</link>、<link linkend="debconf-keystone_authtoken"><literal>[keystone_authtoken]</literal> 設定</link>、<link linkend="debconf-rabbitqm">RabbitMQ クレデンシャル</link>、<link linkend="debconf-api-endpoints">API エンドポイント</link>登録に関するプロンプトに答えます。

source: Configure Networking agents to start at boot time:
ja: Networking エージェントをブート時に起動するよう設定します。

source: Enable packet forwarding and disable packet destination filtering so that the network node can coordinate traffic for the VMs. Edit the <filename>/etc/sysctl.conf</filename> file, as follows:
ja: ネットワークノードが仮想マシンの通信を制御できるように、パケット転送を有効化し、パケット宛先フィルタリングを無効化します。<filename>/etc/sysctl.conf</filename> を以下のように編集します。

source: Use the <placeholder-1/> command to ensure the changes made to the <filename>/etc/sysctl.conf</filename> file take effect:
ja: 確実に <filename>/etc/sysctl.conf</filename> ファイルの変更を適用するために、<placeholder-1/> コマンドを使用します。

source: It is recommended that the networking service is restarted after changing values related to the networking configuration. This ensures that all modified values take effect immediately:
ja: Networking 関連の設定の値を変更した後、Networking Service を再起動することを推奨します。これにより、すべての変更した値がすぐに確実に適用されます。
