Repository: 25hours/openstack-manuals
Catalog: doc/install-guide/locale/*.po
Languages: ja, ru, vi_vn, zh_cn

source: Configure a compute node
ja: コンピュートノードの設定

source: After you configure the Compute service on the controller node, you must configure another system as a compute node. The compute node receives requests from the controller node and hosts virtual machine instances. You can run all services on a single node, but the examples in this guide use separate systems. This makes it easy to scale horizontally by adding additional Compute nodes following the instructions in this section.
ja: コントローラーノードで Compute サービスを設定した後、他のシステムをコンピュートノードとして設定する必要があります。コンピュートノードはコントローラーノードからリクエストを受け取り、仮想マシンインスタンスをホストします。単一ノードですべてのサービスを実行することもできます。しかし、このガイドの例では分離したシステムを使用します。これにより、このセクションにある説明に従って、追加のコンピュートノードを追加して、水平的にスケールさせることが容易になります。

source: The Compute service relies on a hypervisor to run virtual machine instances. OpenStack can use various hypervisors, but this guide uses KVM.
ja: Compute サービスは仮想マシンインスタンスを実行するためにハイパーバイザーに依存します。OpenStack はさまざまなハイパーバイザーを使用できますが、このガイドは KVM を使用します。

source: Configure the system. Use the instructions in <xref linkend="ch_basics"/>, but note the following differences from the controller node:
ja: システムを設定します。<xref linkend="ch_basics"/> にある方法を使用します。以下の項目はコントローラーノードと異なることに注意してください。

source: Use different IP addresses when you configure <filename>eth0</filename>. This guide uses <literal>192.168.0.11</literal> for the internal network. Do not configure <literal>eth1</literal> with a static IP address. The networking component of OpenStack assigns and configures an IP address.
ja: <filename>eth0</filename> を設定するとき、違う IP アドレスを使用します。このガイドは内部ネットワーク用に <literal>192.168.0.11</literal> を使用します。<literal>eth1</literal> を静的 IP アドレスで設定しないでください。OpenStack のネットワークコンポーネントが IP アドレスを割り当て、設定します。

source: Set the host name to <literal>compute1</literal>. To verify, use the <code>uname -n</code> parameter. Ensure that the IP addresses and host names for both nodes are listed in the <filename>/etc/hosts</filename> file on each system.
ja: ホスト名を <literal>compute1</literal> に設定します。確認するために、<code>uname -n</code> を使用します。両方のノードの IP アドレスとホスト名が各システムの <filename>/etc/hosts</filename> にあることを確認します。

source: Synchronize from the controller node. Follow the instructions in <xref linkend="basics-ntp"/>.
ja: コントローラーノードから同期します。<xref linkend="basics-ntp"/>にある手順に従ってください。

source: Install the MySQL client libraries. You do not need to install the MySQL database server or start the MySQL service.
ja: MySQL クライアントライブラリをインストールします。MySQL データベースサーバーをインストールする必要や MySQL サービスを起動する必要がありません。

source: Enable the OpenStack packages for the distribution that you are using. See <xref linkend="basics-packages"/>.
ja: 使用しているディストリビューションの OpenStack パッケージを有効化します。<xref linkend="basics-packages"/> を参照してください。

source: After you configure the operating system, install the appropriate packages for the Compute service.
ja: オペレーティングシステムの設定後、Compute サービス向けに適切なパッケージをインストールします。

source: When prompted to create a <literal>supermin</literal> appliance, respond <placeholder-1/>.
ja: <literal>supermin</literal> アプライアンスを作成するためのプロンプトが表示されたとき、<placeholder-1/> を答えます。

source: To use the meta-packages and install other components on your compute node, such as OVS Networking and Ceilometer agents, run this command:
ja: メタパッケージを使用して、OVS Networking や Ceilometer のエージェントのような他のコンポーネントをコンピュートノードにインストールするために、このコマンドを実行します。

source: The controller node has the <package>openstack-proxy-node</package> and <package>openstack-toaster</package> meta-packages that install <package>openstack-proxy-node</package> and <package>openstack-toaster</package> at the same time.
ja: コントローラーノードは同時に、<package>openstack-proxy-node</package> と <package>openstack-toaster</package> をインストールする、<package>openstack-proxy-node</package> メタパッケージと <package>openstack-toaster</package> メタパッケージを持ちます。

source: Respond to the prompts for <link linkend="debconf-dbconfig-common">database management</link>, <link linkend="debconf-keystone_authtoken"><literal>[keystone_authtoken]</literal> settings</link>, <link linkend="debconf-rabbitqm">RabbitMQ credentials</link>, and <link linkend="debconf-api-endpoints">API endpoint</link> registration.
ja: <link linkend="debconf-dbconfig-common">データベース管理</link>、<link linkend="debconf-keystone_authtoken"><literal>[keystone_authtoken]</literal> 設定</link>、<link linkend="debconf-rabbitqm">RabbitMQ クレデンシャル</link>、<link linkend="debconf-api-endpoints">API エンドポイント</link>登録に関するプロンプトに答えます。キャッシュタイプを選択する必要もあります。

source: For security reasons, the Linux kernel is not readable by normal users which restricts hypervisor services such as qemu and libguestfs. For details, see <link href="https://bugs.launchpad.net/ubuntu/+source/linux/+bug/759725">this bug</link>. To make the current kernel readable, run: <placeholder-1/> To also enable this override for all future kernel updates, create the file <filename>/etc/kernel/postinst.d/statoverride</filename> containing:<placeholder-2/> Remember to make the file executable: <placeholder-3/>
ja: セキュリティの理由から、Linux カーネルは通常のユーザーにより読み取りできません。これにより QEMU や libguestfs のようなハイパーバイザーサービスを制限します。詳細は<link href="https://bugs.launchpad.net/ubuntu/+source/linux/+bug/759725">このバグ</link>を参照してください。現在のカーネルを読み取り可能にするために、<placeholder-1/> を実行します。今後のすべてのカーネル更新でこの上書きを有効にするために、以下を含めた <filename>/etc/kernel/postinst.d/statoverride</filename> ファイルを作成します。<placeholder-2/> ファイルを実行可能にすることを覚えておきます。<placeholder-3/>

source: Edit the <filename>/etc/nova/nova.conf</filename> configuration file:
ja: <filename>/etc/nova/nova.conf</filename> 設定ファイルを編集します。

source: Edit the <filename>/etc/nova/nova.conf</filename> configuration file and add these lines to the appropriate sections:
ja: <filename>/etc/nova/nova.conf</filename> 設定ファイルを編集し、これらの行を適切なセクションに追加します。

source: Configure the Compute service to use the Qpid message broker by setting these configuration keys:
ja: これらの設定キーを設定することにより、Compute サービスが Qpid メッセージブローカーを使用するよう設定します。

source: Configure the Compute service to use the RabbitMQ message broker by setting these configuration keys:
ja: これらの設定キーを設定することにより、Compute サービスが RabbitMQ メッセージブローカーを使用するよう設定します。

source: Configure Compute to provide remote console access to instances.
ja: インスタンスへのリモートコンソールアクセスを提供するよう Compute を設定します。

source: Edit <filename>/etc/nova/nova.conf</filename> and add the following keys under the <literal>[DEFAULT]</literal> section:
ja: <filename>/etc/nova/nova.conf</filename> を編集し、以下のキーを <literal>[DEFAULT]</literal> セクションに追加します。

source: Specify the host that runs the Image Service.<phrase os="ubuntu;debian"> Edit <filename>/etc/nova/nova.conf</filename> file and add these lines to the <literal>[DEFAULT]</literal> section:</phrase>
ja: Image Service を実行するホストを指定します。<phrase os="ubuntu;debian"><filename>/etc/nova/nova.conf</filename> ファイルを編集し、これらの行を <literal>[DEFAULT]</literal> セクションに追加します。</phrase>

source: If you install Compute on a virtual machine for testing purposes, you must determine whether your hypervisor and/or CPU support nested hardware acceleration using the following command:
ja: Compute をテスト目的で仮想マシンにインストールする場合、ハイパーバイザーと CPU がネストハードウェア支援をサポートするかどうかを、以下のコマンドを使用して確認する必要があります。

source: If this command returns a value of <emphasis>one or greater</emphasis>, your hypervisor and/or CPU support nested hardware acceleration which requires no additional configuration.
ja: このコマンドが <emphasis>1 以上</emphasis>の値を返す場合、ハイパーバイザーと CPU がネストハードウェア支援をサポートし、追加の設定は必要ありません。

source: If this command returns a value of <emphasis>zero</emphasis>, your hypervisor and/or CPU do not support nested hardware acceleration and <literal>libvirt</literal> must use QEMU instead of KVM. Edit the <literal>[libvirt]</literal> section in the <filename>/etc/nova/nova-compute.conf</filename> file to modify this key:
ja: このコマンドが <emphasis>0</emphasis> を返したならば、ハイパーバイザーと CPU がネストハードウェア支援をサポートしません。<literal>libvirt</literal> は KVM の代わりに QEMU を使用する必要があります。この項目を変更するために <filename>/etc/nova/nova-compute.conf</filename> ファイルの <literal>[libvirt]</literal> セクションを編集します。

source: If this command returns a value of <emphasis>zero</emphasis>, your hypervisor and/or CPU do not support nested hardware acceleration and <literal>libvirt</literal> must use QEMU instead of KVM. Configure <literal>libvirt</literal> to use QEMU:
ja: このコマンドが <emphasis>0</emphasis> を返す場合、ハイパーバイザーと CPU がネストハードウェア支援をサポートしません。<literal>libvirt</literal> は KVM の代わりに QEMU を使用する必要があります。QEMU を使用するために <literal>libvirt</literal> を設定します。

source: Remove the SQLite database created by the packages:
ja: パッケージにより作成された SQLite データベースを削除します。

source: Install the Image Service
ja: Image Service のインストール

source: The OpenStack Image Service acts as a registry for virtual disk images. Users can add new images or take a snapshot of an image from an existing server for immediate storage. Use snapshots for back up and as templates to launch new servers. You can store registered images in Object Storage or in other locations. For example, you can store images in simple file systems or external web servers.
ja: OpenStack Image Service は仮想ディスクイメージの登録管理者として動作します。ユーザーは新しいイメージを追加できます。イメージのスナップショットを既存のサーバーの直接ストレージから取得できます。バックアップのため、または新しいサーバーを起動するためのテンプレートとしてスナップショットを使用します。登録済みイメージを Object Storage に保存できます。例えば、イメージをシンプルなファイルシステムや外部ウェブサーバーに保存できます。

source: This procedure assumes you set the appropriate environment variables to your credentials as described in <xref linkend="keystone-verify"/>.
ja: この手順は <xref linkend="keystone-verify"/> に記載されているとおり、適切な環境変数にクレデンシャルを設定していると仮定しています。

source: Install the Image Service on the controller node:
ja: コントローラーノードに Image Service をインストールします。

source: Respond to prompts for <link linkend="debconf-dbconfig-common">database management</link>, <link linkend="debconf-keystone_authtoken"><literal>[keystone_authtoken]</literal> settings</link>, <link linkend="debconf-rabbitqm">RabbitMQ credentials</link> and <link linkend="debconf-api-endpoints">API endpoint</link> registration. You must also select the caching type:
ja: <link linkend="debconf-dbconfig-common">データベース管理</link>、<link linkend="debconf-keystone_authtoken"><literal>[keystone_authtoken]</literal> 設定</link>、<link linkend="debconf-rabbitqm">RabbitMQ クレデンシャル</link>、<link linkend="debconf-api-endpoints">API エンドポイント</link>登録に関するプロンプトに答えます。キャッシュタイプを選択する必要もあります。

source: The Image Service stores information about images in a database. The examples in this guide use the MySQL database that is used by other OpenStack services.
ja: Image Service はイメージに関する情報をデータベースに保存します。このガイドの例は、他の OpenStack サービスにより使用されている MySQL データベースを使用します。

source: Configure the location of the database. The Image Service provides the <systemitem class="service">glance-api</systemitem> and <systemitem class="service">glance-registry</systemitem> services, each with its own configuration file. You must update both configuration files throughout this section. Replace <replaceable>GLANCE_DBPASS</replaceable> with your Image Service database password.
ja: データベースの位置を設定します。Image Service はそれぞれの設定ファイルを用いて <systemitem class="service">glance-api</systemitem> サービスと <systemitem class="service">glance-registry</systemitem> サービスを提供します。このセクションを通して両方の設定ファイルを更新する必要があります。<replaceable>GLANCE_DBPASS</replaceable> をお使いの Image Service データベースのパスワードで置き換えます。

source: Use the <placeholder-1/> command to create the Image Service database and tables and a <literal>glance</literal> database user:
ja: Image Service のデータベース、テーブル、<literal>glance</literal> データベースユーザーを作成するために <placeholder-1/> コマンドを使用します。

source: Use the password you created to log in as root and create a <literal>glance</literal> database user:
ja: root としてログインするために、作成したパスワードを使用します。<literal>glance</literal> データベースユーザーを作成します。

source: Create the database tables for the Image Service:
ja: Image Service 用のデータベーステーブルを作成します。

source: Configure the Image Service to use the Identity Service for authentication.
ja: Image Service が認証用に Identity Service を使用するよう設定します。

source: Run the following commands and replace <replaceable>GLANCE_PASS</replaceable> with the password you chose for the <literal>glance</literal> user in the Identity Service:
ja: 以下のコマンドを実行します。Identity Service で <literal>glance</literal> ユーザー用に選択したパスワードで <replaceable>GLANCE_PASS</replaceable> を置き換えます。

source: Start the <systemitem class="service">glance-api</systemitem> and <systemitem class="service">glance-registry</systemitem> services and configure them to start when the system boots:
ja: <systemitem class="service">glance-api</systemitem>、<systemitem class="service">glance-registry</systemitem> サービスを起動し、システムの起動時にそれらが起動するよう設定します。

source: The <package>dbconfig-common</package> package provides a standard Debian interface that enables you to configure Debian database parameters. It includes localized prompts for many languages and it supports the OpenStack database back ends: SQLite, MySQL, and PostgreSQL.
ja: <package>dbconfig-common</package> パッケージは、Debian のデータベースパラメーターを設定できる、標準的な Debian インターフェースを提供します。これは多くの言語に翻訳されたプロンプトを持ち、OpenStack のデータベースバックエンド SQLite、MySQL、PostgreSQL をサポートします。

source: By default, the <package>dbconfig-common</package> package configures the OpenStack services to use SQLite3. So if you use <package>debconf</package> in non-interactive mode and without pre-seeding, the OpenStack services that you install use SQLite3.
ja: <package>dbconfig-common</package> パッケージはデフォルトで、OpenStack サービスが SQLite3 を使用するよう設定します。そのため、<package>debconf</package> を非対話モードで事前シードせずに利用した場合、インストールした OpenStack サービスが SQLite3 を使用します。

source: The Identity Service is installed with MySQL as the database back end, <literal>keystonedb</literal> as database name, and the localhost socket file.
ja: Identity Service は、データベースバックエンドとして MySQL、データベース名として <literal>keystonedb</literal>、ローカルホストのソケットファイルと一緒にインストールされます。

source: The <package>cinder-common</package> package displays these screens:
ja: <package>cinder-common</package> パッケージはこれらの画面を表示します。

source: To access a MySQL server remotely, you must make it accessible as root from a remote server. To do so, run the <package>openstack-proxy-node</package> package command:
ja: MySQL サーバーにリモートアクセスするために、リモートサーバーから root としてアクセス可能にする必要があります。そうするために、<package>openstack-proxy-node</package> パッケージコマンドを実行します。

source: You must enable remote access before you install OpenStack services.
ja: OpenStack サービスをインストールする前にリモートアクセスを有効化する必要があります。

source: Install the Identity Service
ja: Identity Service のインストール

source: Install the OpenStack Identity Service on the controller node, together with <application>python-keystoneclient</application> (which is a dependency):
ja: OpenStack Identity Service と <application>python-keystoneclient</application> (依存関係) をコントローラーノードにインストールします。

source: Answer to the <systemitem class="library">debconf</systemitem> and <systemitem class="library">dbconfig-common</systemitem> questions for setting-up the database.
ja: データベースをセットアップするために <systemitem class="library">debconf</systemitem> と <systemitem class="library">dbconfig-common</systemitem> の質問に答えます。

source: The Identity Service uses a database to store information. Specify the location of the database in the configuration file. In this guide, we use a MySQL database on the controller node with the username <literal>keystone</literal>. Replace <literal><replaceable>KEYSTONE_DBPASS</replaceable></literal> with a suitable password for the database user.
ja: Identity Service は情報を保存するためにデータベースを使用します。設定ファイルでデータベースの場所を指定します。このガイドでは、コントローラーノードにユーザー名 <literal>keystone</literal> で MySQL データベースを使用します。<literal><replaceable>KEYSTONE_DBPASS</replaceable></literal> をデータベースのユーザーの適切なパスワードで置き換えます。

source: Edit <filename>/etc/keystone/keystone.conf</filename> and change the <literal>[database]</literal> section:
ja: <filename>/etc/keystone/keystone.conf</filename> を編集し、<literal>[database]</literal> セクションを変更します。

source: Use the <placeholder-1/> command to create the database and tables, as well as a database user called <literal>keystone</literal> to connect to the database. Replace <literal><replaceable>KEYSTONE_DBPASS</replaceable></literal> with the same password used in the previous step.
ja: データベースとテーブル、データベースに接続するための <literal>keystone</literal> というデータベースユーザーを作成するために、<placeholder-1/> コマンドを使用します。<literal><replaceable>KEYSTONE_DBPASS</replaceable></literal> を前の手順で使用したパスワードに置き換えます。

source: By default, the Ubuntu packages create a SQLite database. Delete the <filename>keystone.db</filename> file created in the <filename>/var/lib/keystone/</filename> directory so that it does not get used by mistake:
ja: Ubuntu パッケージはデフォルトで SQLite データベースを作成します。誤って使用されないように、<filename>/var/lib/keystone/</filename> ディレクトリに作成された <filename>keystone.db</filename> ファイルを削除します。

source: Use the password that you set previously to log in as root. Create a <literal>keystone</literal> database user:
ja: root としてログインするために、前に設定したパスワードを使用します。<literal>keystone</literal> データベースユーザーを作成します。

source: Create the database tables for the Identity Service:
ja: Image Service 用のデータベーステーブルを作成します。

source: Define an authorization token to use as a shared secret between the Identity Service and other OpenStack services. Respond to the <package>debconf</package> prompt with the value in the <code>admin_token</code> directive in the <filename>keystone.conf</filename> file. Use the <placeholder-1/> command to generate this password.
ja: Identity Service と他の OpenStack サービスの間で共有するシークレットとして使用する認可トークンを定義します。<package>debconf</package> プロンプトで <filename>keystone.conf</filename> ファイルの <code>admin_token</code> ディレクティブにある値を答えます。このパスワードを生成するために <placeholder-1/> コマンドを使用します。

source: Later, you can verify that the <filename>/etc/keystone/keystone.conf</filename> file contains the password you have set using <package>debconf</package>: <placeholder-1/>
ja: 後から、<filename>/etc/keystone/keystone.conf</filename> ファイルが <package>debconf</package> を使用して設定したパスワードを含んでいることを検証できます。 <placeholder-1/>

source: If you omit a password (for example by pressing Enter at the <package>debconf</package> prompt, or installing Keystone using the Debconf non-interactive mode) the package generates a random <literal>ADMIN_TOKEN</literal> value.
ja: パスワードを省略した場合 (例えば、<package>debconf</package> プロンプトに単に Enter を押した場合や debconf の非対話モードを使用して Keystone をインストールした場合)、パッケージがランダムな <literal>ADMIN_TOKEN</literal> 値を生成します。

source: Respond to the prompts to create an administrative tenant:
ja: 管理プロジェクトを作成するためにプロンプトに答えます。

source: If this is the first time you have installed the Identity Service, register the Identity Service in the service catalog:
ja: 初めて Identity Service をインストールする場合、サービスカタログに Identity Service を登録します。

source: Define an authorization token to use as a shared secret between the Identity Service and other OpenStack services. Use <placeholder-1/> to generate a random token and store it in the configuration file:
ja: Identity Service と他の OpenStack サービスの間で共有するシークレットとして使用する認可トークンを定義します。ランダムなトークンを生成し、設定ファイルに保存するために <placeholder-1/> コマンドを使用します。

source: For SUSE Linux Enterprise use instead as first command:
ja: SUSE Linux Enterprise の場合、最初のコマンドの代わりとして以下を使用します。

source: Edit <filename>/etc/keystone/keystone.conf</filename> and change the <literal>[DEFAULT]</literal> section, replacing ADMIN_TOKEN with the results of the command:
ja: <filename>/etc/keystone/keystone.conf</filename> を編集し、<literal>[DEFAULT]</literal> セクションを変更します。ADMIN_TOKEN をコマンドの結果で置き換えます。

source: By default, Keystone uses PKI tokens. Create the signing keys and certificates:
ja: Keystone はデフォルトで PKI トークンを使用します。書名付きキーと証明書を作成します。

source: Restart the Identity Service:
ja: Identity Service を再起動します。

source: Start the Identity Service and enable it to start when the system boots:
ja: Identity Service を起動し、システム起動時に起動するよう有効化します。

source: By default, the Identity Service stores expired tokens in the database indefinitely. While potentially useful for auditing in production environments, the accumulation of expired tokens will considerably increase database size and may decrease service performance, particularly in test environments with limited resources. We recommend configuring a periodic task using <systemitem class="service">cron</systemitem> to purge expired tokens hourly.
ja: Identity Service は標準で、期限切れトークンをデータベースに無期限に保存します。本番環境で監査のために有用であるかもしれませんが、期限切れトークンが蓄積すると、データベースの容量がかなり大きくなり、サービスの性能を劣化させるかもしれません。とくにリソースが限られたテスト環境で顕著かもしれません。期限切れトークンを 1 時間おきに削除するために、<systemitem class="service">cron</systemitem> を使用して定期タスクを設定することを推奨します。

source: Verify the installation
ja: インストールの検証

source: You can run these commands from the proxy server or any server that has access to the Identity Service.
ja: プロキシサーバー、または Identity Service にアクセスできるすべてのサーバーから、これらのコマンドを実行できます。

source: Make sure that your credentials are set up correctly in the <filename>openrc.sh</filename> file and source it:
ja: クレデンシャルが <filename>openrc.sh</filename> ファイルに正しくセットアップされていることを確認します。このファイルを以下のように読み込みます。

source: Run the following <placeholder-1/> command:
ja: 以下の <placeholder-1/> コマンドを実行します。

source: Run the following <placeholder-1/> commands to upload files to a container. Create the <filename>test.txt</filename> and <filename>test2.txt</filename> test files locally if needed.
ja: ファイルをコンテナーにアップロードするために、以下の <placeholder-1/> コマンドを実行します。必要に応じてローカルに <filename>test.txt</filename> と <filename>test2.txt</filename> テストファイルを作成します。

source: Run the following <placeholder-1/> command to download all files from the <literal>myfiles</literal> container:
ja: <literal>myfiles</literal> コンテナーからすべてのファイルをダウンロードするために、以下の <placeholder-1/> コマンドを実行します。

source: Install and configure the proxy node
ja: プロキシノードのインストールと設定

source: The proxy server takes each request and looks up locations for the account, container, or object and routes the requests correctly. The proxy server also handles API requests. You enable account management by configuring it in the <filename>/etc/swift/proxy-server.conf</filename> file.
ja: プロキシサーバーは各リクエストを受け取り、アカウント、コンテナー、オブジェクトの位置を検索し、リクエストを正しくルーティングします。プロキシサーバーは API リクエストも処理します。<filename>/etc/swift/proxy-server.conf</filename> ファイルでアカウント管理を設定することにより有効化できます。

source: Install swift-proxy service:
ja: swift-proxy サービスをインストールします。

source: Modify memcached to listen on the default interface on a local, non-public network. Edit this line in the <filename>/etc/memcached.conf</filename> file:
ja: memcached が標準のインターフェースでローカルの非パブリックなネットワークをリッスンするよう変更します。<filename>/etc/memcached.conf</filename> ファイルのこの行を編集します。

source: Change it to:
ja: これを次のように変更します。

source: Modify memcached to listen on the default interface on a local, non-public network. Edit the <filename>/etc/sysconfig/memcached</filename> file:
ja: memcached が標準のインターフェースでローカルの非パブリックなネットワークをリッスンするよう変更します。<filename>/etc/sysconfig/memcached</filename> ファイルを編集します。

source: Restart the memcached service:
ja: memcached サービスを再起動します。

source: Start the memcached service and configure it to start when the system boots:
ja: memcached サービスを起動し、システム起動時に起動するよう設定します。

source: <phrase os="ubuntu;debian">Create</phrase><phrase os="rhel;centos;fedora;opensuse;sles">Edit</phrase><filename>/etc/swift/proxy-server.conf</filename>:
ja: <filename>/etc/swift/proxy-server.conf</filename> を<phrase os="ubuntu;debian">作成</phrase><phrase os="rhel;centos;fedora;opensuse;sles">編集</phrase>します。

source: If you run multiple memcache servers, put the multiple IP:port listings in the [filter:cache] section of the <filename>/etc/swift/proxy-server.conf</filename> file:
ja: 複数の memcache サーバーを実行している場合、<filename>/etc/swift/proxy-server.conf</filename> ファイルの [filter:cache] セクションで複数の IP:port の一覧を置きます。

source: Only the proxy server uses memcache.
ja: プロキシサーバーのみが memcache を使用します。
