Repository: 25hours/openstack-manuals
Catalog: doc/install-guide/locale/*.po
Languages: ja, ru, vi_vn, zh_cn

source: Another way to disable the <systemitem class="library">debconf</systemitem> package is to prefix the <placeholder-1/> command with <literal>DEBIAN_FRONTEND=noninteractive</literal>, as follows:
ja: <systemitem class="library">debconf</systemitem> を無効化する別の方法は、以下のように <placeholder-1/> コマンドに <literal>DEBIAN_FRONTEND=noninteractive</literal> を付けることです。
vi_vn: Một cách khác để <systemitem class="library">debconf</systemitem> vô hiệu hóa gói đó là thêm <literal>DEBIAN_FRONTEND=noninteractive</literal> vào trước lệnh <placeholder-1/>, như sau:
zh_cn: 另外禁用<systemitem class="library">debconf</systemitem>包的方法是在命令<placeholder-1/>之前加上<literal>DEBIAN_FRONTEND=noninteractive</literal>，如下所示：

source: Any given Networking set up has at least one external network. Unlike the other networks, the external network is not merely a virtually defined network. Instead, it represents a view into a slice of the physical, external network accessible outside the OpenStack installation. IP addresses on the external network are accessible by anybody physically on the outside network. Because the external network merely represents a view into the outside network, DHCP is disabled on this network.
vi_vn: Bất kì thiết lập Networking nào cũng có ít nhất một hệ thống mạng ngoại vùng. Khác với các hệ thống mạng khác, mạng ngoài vùng không chỉ đơn giản là một mạng ảo. Thay vào đó, thể hiện cái nhìn về một phần của hệ thống mạng ngoại vùng vật lý truy cập được ở bên ngoài cài đặt OpenStack. Các địa chỉ IP trên hệ thống mạng ngoại vùng có thể truy cập trực tiếp được bởi bất kỳ ai trên hệ thống mạng bên ngoài. Bởi vì mạng ngoại vùng chỉ đơn giản thể hiện một cái nhìn vào hệ thống mạng bên ngoài, DHCP bị vô hiệu hóa trên hệ thống mạng này.
zh_cn: 任何给定的Networking设置至少有一个外部网络。不像其他的网络，外部网络不仅仅是一个虚拟定义的网络。相反,它代表了一种OpenStack安装之外的能从物理的，外部的网络访问的视图。外部网络上的IP地址能被任何物理接入外面网络的人所访问。因为外部网络仅仅代表了进入外面网络的一个视图，网络上的DHCP是关闭的。

source: Any roles that you create must map to roles specified in the <filename>policy.json</filename> file in the configuration file directory of each OpenStack service. The default policy for most services grants administrative access to the <literal>admin</literal> role. For more information, see the <link xlink:href="http://docs.openstack.org/openstack-ops/content/projects_users.html">Operations Guide - Managing Projects and Users</link>.
vi_vn: Bất kì vai trò nào mà bạn tạo ra cần được trỏ tới các vai trò chỉ định trong file <filename>policy.json</filename> trong thư mục cấu hình của từng dịch vụ OpenStack. Chính sách mặc định cho hầu hết các dịch vụ là cấp quyền truy nhập quản trị cho vai trò <literal>admin</literal>. Để biết thêm thông tin, xem tại <link xlink:href="http://docs.openstack.org/openstack-ops/content/projects_users.html">Hướng dẫn Vận hành - Quản lý các dự án và người sử dụng </link>.

source: Architecture
ja: アーキテクチャー
ru: Архитектура
vi_vn: Kiến trúc
zh_cn: 构架

source: As an example, here are screenshots from the <package>cinder-common</package> package:
ru: В качестве примера, вот снимки экрана для пакета <package>cinder-common</package>:
vi_vn: Đây là một ví dụ ảnh chụp màn hình từ gói <package>cinder-common</package>:
zh_cn: 例如，下图显示的是 <package>cinder-common</package> 包的截图：

source: As the <literal>admin</literal> user, list projects to verify that the <literal>admin</literal> user can execute CLI commands and that the Identity service contains the projects created by the configuration tool:
vi_vn: Với tư cách là người dùng <literal>admin</literal>, liệt kê ra các project để xác nhận rằng người dùng <literal>admin</literal> có thể thực hiện các câu lệnh CLI chỉ dành cho admin và Identity service có chứa các project được khởi tạo bởi công cụ cấu hình:

source: As the <literal>admin</literal> user, list projects to verify that the <literal>admin</literal> user can execute admin-only CLI commands and that the Identity service contains the projects that you created in <xref linkend="keystone-users"/>:
vi_vn: Với tư cách là người dùng <literal>admin</literal>, liệt kê ra các project để xác nhận rằng người dùng <literal>admin</literal> có thể thực hiện các câu lệnh CLI chỉ dành cho admin và Identity service có chứa các project bạn khởi tạo trong <xref linkend="keystone-users"/>:

source: As the <literal>admin</literal> user, list roles to verify that the Identity service contains the role created by the configuration tool:
vi_vn: Với tư cách là người dùng <literal>admin</literal>, liệt kê ra các vai trò để xác nhận rằng Identity service có chứa các vai trò được khởi tạo bởi công cụ cấu hình:

source: As the <literal>admin</literal> user, list roles to verify that the Identity service contains the role that you created in <xref linkend="keystone-users"/>:
vi_vn: Với tư cách là người dùng <literal>admin</literal>, liệt kê ra các vai trò để xác nhận rằng Identity service có chứa các vai trò mà bạn khởi tạo trong <xref linkend="keystone-users"/>:

source: As the <literal>admin</literal> user, list users to verify that the Identity service contains the users created by the configuration tool:
vi_vn: Với tư cách là người dùng <literal>admin</literal>, liệt kê ra các người dùng để xác nhận rằng Identity service có chứa các người dùng được khởi tạo bởi công cụ cấu hình:

source: As the <literal>admin</literal> user, list users to verify that the Identity service contains the users that you created in <xref linkend="keystone-users"/>:
vi_vn: Với tư cách là người dùng <literal>admin</literal>, liệt kê ra các người dùng để xác nhận rằng Identity service có chứa các người dùng mà bạn khởi tạo trong <xref linkend="keystone-users"/>:

source: As the <literal>admin</literal> user, request an authentication token from the Identity version 2.0 API:
vi_vn: Với tư cách là người dùng <literal>admin</literal>, yêu cầu một token xác thực từ Identity API phiên bản 2.0:

source: As the <literal>demo</literal> user, attempt to list users to verify that it cannot execute admin-only CLI commands:
vi_vn: Với tư cách là người dùng, thử liệt kê ra danh sách các người dùng để xác nhận rằng nó không thể thực hiện các câu lệnh CLI chỉ dành cho admin:

source: As the <literal>demo</literal> user, request an authentication token from the Identity version 3 API:
vi_vn: Với tư cách là người dùng <literal>demo</literal>, yêu cầu một token xác thực từ API Identity phiên bản 3:

source: Assigned during package installation
ja: パッケージインストール中の割り当て
vi_vn: Được gán trong quá trình cài đặt gói
zh_cn: 在包安装过程中分配

source: Associate the floating IP address with your instance:
ru: Привяжите внешний IP-адрес к вашему инстансу:
vi_vn: Gán địa chỉ IP động với instance của bạn:
zh_cn: 将浮动 IP 地址与您的实例关联：

source: Assuming you have created an image for the type of database you want, and have updated the datastore to use that image, you can now create a trove instance (Database service). To do this, use the trove <placeholder-1/> command.
vi_vn: Giả dụ rằng bạn đã khởi tạo một image cho dạng cơ sở dữ liệu bạn mong muốn và bạn đã cập nhật kho dữ liệu để sử dụng image đó, bây giờ bạn đã có thể khởi tạo một trove instance (dịch vụ Database). Để làm được điều này, sử dụng lệnh trove <placeholder-1/> .

source: Attach the <literal>demo-volume1</literal> volume to the <literal>demo-instance1</literal> instance:
ru: Подключите диск <literal>demo-volume1</literal> к инстансу <literal>demo-instance1</literal>:
vi_vn: Gắn ổ <literal>demo-volume1</literal> lưu trữ vào instance <literal>demo-instance1</literal>:
zh_cn: 附件卷 <literal>demo-volume1</literal> 给 <literal>demo-instance1</literal> 实例：

source: Attach the router to the <literal>demo</literal> tenant subnet:
ru: Подключите маршрутизатор к сети проекта <literal>demo</literal>:
vi_vn: Gắn router vào subnet của <literal>demo</literal> tenant:
zh_cn: 附加路由给 <literal>demo</literal> 租户子网：

source: Attach the router to the external network by setting it as the gateway:
ru: Подключите маршрутизатор к внешней сети, указав её в качестве шлюза:
vi_vn: Gắn router vào mạng ngoại vùng bằng cách đặt nó làm gateway:
zh_cn: 通过将路由设置为网关来将路由附加给外部网络：

source: Authenticate using <literal>admin</literal> or <literal>demo</literal> user credentials.
ru: Авторизуйтесь, используя данные пользователя <literal>admin</literal> или <literal>demo</literal>.
vi_vn: Chứng thực sử dụng thông tin xác thực của người dùng <literal>admin</literal> hoặc <literal>demo</literal>.
zh_cn: 使用 <literal>admin</literal> 或 <literal>demo</literal> 用户证书进行认证。

source: Back-end names are arbitrary. As an example, this guide uses the name of the driver as the name of the back end.
vi_vn: Tên các back-end thường hay thay đổi. Vì thế nên bài hướng dẫn này sử dụng tên của driver lam tên cho back end.

source: Basic environment
ru: Базовая среда
vi_vn: Môi trường cơ bản
zh_cn: 基本环境

source: Because most OpenStack services must access the Identity Service, you must configure the IP address of the <code>keystone</code> server to be able to access it. You must also configure the <code>admin_tenant_name</code>, <code>admin_user</code>, and <code>admin_password</code> options for each service to work.
ja: 多くの OpenStack サービスは Identity Service にアクセスする必要があるので、アクセスできるように <code>keystone</code> サーバーの IP アドレスを設定する必要があります。各サービスを動作させるために <code>admin_tenant_name</code>、<code>admin_user</code>、<code>admin_password</code> オプションも設定する必要があります。
ru: Поскольку большинство служб OpenStack должны иметь доступ до службы Идентификации, вм необходимо настроить IP-адрес сервера <code>keystone</code>, чтобы иметь к нему доступ. Вам так же необходимо настроить параметры <code>admin_tenant_name</code>, <code>admin_user</code> и <code>admin_password</code> для каждой службы.
vi_vn: Bởi vì phần lớn các dịch vụ OpenStack đều phải truy cập Dịch vụ Identity, bạn phải cấu hình địa chỉ IP của <code>keystone</code> server để có thể truy cập nó. Bạn cũng phải cấu hình các tùy chọn<code>admin_tenant_name</code>, <code>admin_user</code> và <code>admin_password</code> của mỗi dịch vụ để chúng có thể hoạt động.
zh_cn: 因为大多数OpenStack服务必须访问身份服务，你必须为 <code>keystone</code>服务器配置IP地址使得它可以被访问。你必须为每个服务配置<code>admin_tenant_name</code>，<code>admin_user</code>和<code>admin_password</code>，以确保他们正确运行。

source: Because the packages are maintained in Sid where the <code>Provides: python-argparse</code> directive causes an error, and the Debian OpenStack maintainer wants to maintain one version of the OpenStack packages, you must manually install the <package>python-argparse</package> on each OpenStack system that runs Debian Wheezy before you install the other OpenStack packages. Use the following command to install the package:
ja: パッケージは <code>Provides: python-argparse</code> ディレクティブがエラーとなる Sid でメンテナンスされていて、Debian OpenStack メンテナーは一つのバージョンの OpenStack パッケージをメンテナンスしたいので、Debian Wheezy を実行している OpenStack システムに他の OpenStack パッケージをインストールする前に、各システムに <package>python-argparse</package> を手動でインストールする必要があります。パッケージをインストールするために以下のコマンドを使用します。
vi_vn: Bởi vì các gói được duy trì bởi Sid nơi mà chỉ thị <code>Provides: python-argparse</code> gây ra một lỗi và trình duy trì Debian OpenStack muốn duy trì một phiên bản của các gói OpenStack, bạn phải tự tay cài đặt <package>python-argparse</package> trên từng hệ thống OpenStack có chạy Debian Wheezy trước khi bạn cài đặt các gói OpenStack khác. Sử dụng câu lệnh sau để cài đặt gói này:
zh_cn: 因为OpenStack包只在Sid中被维护，而<code>Provides: python-argparse</code>的缺少会导致错误，而Debian OpenStack的维护者只希望维护一个版本的OpenStack包，所以在安装OpenStack包之前，你必须在每个运行Debian Wheezy的OpenStack节点上手动安装<package>python-argparse</package>。使用下面命令安装这个包：

source: Because this configuration uses a SQL database server, you can remove the SQLite database file:
ru: Поскольку эта конфигурация использует сервер баз данных SQL, вы можете удалить файл базы данных SQLite:
vi_vn: Do cấu hình này sử dụng một máy chủ cơ sở dữ liệu SQL, bạn có thể xoá bỏ file cơ sở dữ liệu SQLite:
zh_cn: 而下面的配置将使用 SQL 数据库服务，可以删除该 SQLite 数据库文件：

source: Before launching your first instance, you must create the necessary virtual network infrastructure to which the instance will connect. This network typically provides Internet access <emphasis>from</emphasis> instances. You can enable Internet access <emphasis>to</emphasis> individual instances using a <glossterm>floating IP address</glossterm> and suitable <glossterm>security group</glossterm> rules. The <literal>admin</literal> tenant owns this network because it provides external network access for multiple tenants.
ru: Прежде чем запускать ваш первый инстанс, вам необходимо создать виртуальную сетевую инфраструктуру, к которой инстанс будет поключен. Обычно эта сеть предоставляет Интернет доступ <emphasis>из</emphasis> инстансов. Вы можете включить Интернет доступ<emphasis>до</emphasis> инстансов используя <glossterm>внешний IP-адрес</glossterm> и соответствующие правила <glossterm>группы безопасности</glossterm>. Проект <literal>admin</literal> владеет данной сетью, поскольку она предоставляет доступ во внешнюю сеть для множества проектов.
vi_vn: Trước khi chạy instance đầu tiên, bạn phải khởi tạo cơ sở hạ tầng hệ thống mạng ảo cần thiết để dựa vào đó instance sẽ kết nối vào. Hệ thống mạng này thường cung cấp truy cập Internet <emphasis>từ</emphasis> các instance. Bạn có thể cho phép truy cập Internet <emphasis>tới</emphasis> các instance riêng lẻ bằng cách sử dụng một <glossterm>địa chỉ IP động</glossterm> và các quy tắc <glossterm>nhóm bảo mật</glossterm> thích hợp. <literal>Admin</literal> tenant sở hữu hệ thống mạng này bởi vì nó cung cấp khả năng truy cập hệ thống mạng ngọai vùng cho các tenant.
zh_cn: 启动第一台实例之前，您必须创建必要的虚拟机基础设施以连接实例。该网络一般提供<emphasis>通过</emphasis>实例访问 Internet。您可以通过一个<glossterm>浮动 IP 地址</glossterm>和<glossterm>安全组</glossterm>规则启用 Internet 的访问<emphasis>到</emphasis>个别实例。<literal>admin</literal> 租户拥有这个网络，因为它为多个租户提供了外部网络的访问。

source: Before launching your first instance, you must create the necessary virtual network infrastructure to which the instances connect, including the <link linkend="neutron_initial-external-network">external network</link> and <link linkend="neutron_initial-tenant-network">tenant network</link>. See <xref linkend="neutron_figure-neutron-initial-networks"/>. After creating this infrastructure, we recommend that you <link linkend="neutron_initial-networks-verify">verify connectivity</link> and resolve any issues before proceeding further. <xref linkend="neutron_figure-neutron-initial-networks"/> provides a basic architectural overview of the components that Networking implements for the initial networks and shows how network traffic flows from the instance to the external network or Internet.
vi_vn: Trước khi chạy instance đầu tiên, bạn phải khởi tạo cơ sở hạ tầng hệ thống mạng ảo cần thiết để dựa vào đó các instance sẽ kết nối vào, bao gồm <link linkend="neutron_initial-external-network">hệ thống mạng ngoại vùng</link> và <link linkend="neutron_initial-tenant-network">mạng tenant</link>. Xem <xref linkend="neutron_figure-neutron-initial-networks"/>. Sau khi khởi tạo cơ sở hạ tầng này, chúng tôi khuyên bạn nên <link linkend="neutron_initial-networks-verify">kiểm tra kết nối</link> và xử lý bất kì vấn đề nảy sinh nào trước khi tiếp tục. <xref linkend="neutron_figure-neutron-initial-networks"/> cung cấp cái nhìn tổng quát về mô hình cơ bản của các thành phần mà Networking cài đặt lên cho các hệ thống mạng ban đầu và thể hiện các luồng lưu lượng mạng từ instance ra đến hệ thống mạng ngoại vùng hoặc Internet.

source: Before starting the Object Storage services, you must create the initial account, container, and object rings. The ring builder creates configuration files that each node uses to determine and deploy the storage architecture. For simplicity, this guide uses one region and zone with 2^10 (1024) maximum partitions, 3 replicas of each object, and 1 hour minimum time between moving a partition more than once. For Object Storage, a partition indicates a directory on a storage device rather than a conventional partition table. For more information, see the <link xlink:href="http://docs.openstack.org/developer/swift/deployment_guide.html">Deployment Guide</link>.
vi_vn: Trước khi chạy các dịch vụ Object Storage, bạn phải khởi tạo các account, container, và object ring ban đầu. Trình xây dựng ring khởi tạo các file cấu hình mà mỗi node sử dụng để quyết định và triển khai kiến trúc lưu trữ. Để cho đơn giản hơn, bài hướng dẫn này sử dụng một vùng và khu vực với tối đa 2^10 (1024) phân vùng, 3 bản sao của mỗi object và tối thiểu 1 giờ đồng hồ thời gian chờ giữa các thời gian chuyển khi chuyển một phân vùng nhiều hơn một lần. Đối với Object Storage, một phân vùng chỉ đến một thư mục trên thiết bị lưu trữ thay vì một bảng phân vùng thông thường. Để biết thêm thông tin, xem <link xlink:href="http://docs.openstack.org/developer/swift/deployment_guide.html">Hướng dẫn Triển khai</link>.

source: Before you begin
ja: 始める前に
ru: Перед началом
vi_vn: Trước khi bạn bắt đầu
zh_cn: 在你开始之前

source: Before you configure the OpenStack Identity service, you must create a database and an administration token.
ru: Прежде чем настроить службу Идентификации OpenStack, вам необходимо создать базу данных и административных токен.
vi_vn: Trước khi cấu hình dịch vụ OpenStack Identity, bạn phải tạo ra một cơ sở dữ liệu và token quản trị.
zh_cn: 在你配置 OpenStack 身份认证服务前，你必须创建一个数据库和管理员令牌。

source: Before you configure the OpenStack Networking (neutron) service, you must create a database, service credentials, and API endpoint.
vi_vn: Trước khi bạn cấu hình dịch vụ OpenStack Networking (neutron), bạn phải khởi tạo một cơ sở dữ liệu, các thông tin xác thực dịch vụ và API endpoint.

source: Before you install and configure OpenStack Networking, you must configure certain kernel networking parameters.
ru: Прежде чем устанавливать и настраивать Сеть OpenStack, вам необходимо настроить некоторые параметры сети в ядре.
vi_vn: Trước khi cài đặt và cấu hình OpenStack Networking, bạn phải cấu hình một vài thông số hệ thống mạng nhân nhất định.
zh_cn: 在安装和配置 OpenStack 网络之前，您必须配置某些内核网络参数。

source: Before you install and configure Orchestration, you must create a database, service credentials, and API endpoints.
vi_vn: Trước khi bạn cài đặt và cấu hình Orchestration, bạn phải khởi tạo một cơ sở dữ liệu, các thông tin xác thực dịch vụ và các API endpoint.
zh_cn: 在您安装和配置Orchestration之前，您必须创建数据库、服务证书和API端点。

source: Before you install and configure Telemetry, you must install <application>MongoDB</application>, create a MongoDB database, service credentials, and API endpoint.
vi_vn: Trước khi bạn cài đặt và cấu hình Telemtry, bạn phải cài đặt <application>MongoDB</application>, khởi tạo một cơ sở dữ liệu MongoDB, các thông tin xác thực dịch vụ và API endpoint.

source: Before you install and configure Telemetry, you must install <application>MongoDB</application>.
vi_vn: Trước khi bạn cài đặt và cấu hình Telemetry, bạn phải cài đặt <application>MongoDB</application>.
zh_cn: 安装和配置 Telemetry 之前，您必须先安装 <application>MongoDB</application>。

source: Before you install and configure the Block Storage service, you must create a database, service credentials, and API endpoint.
vi_vn: Trước khi cài đặt và cấu hình dịch vụ Block Storage, bạn cần phải tạo một cơ sở dữ liệu, các xác thực dịch vụ, và điểm cuối API.

source: Before you install and configure the Compute service, you must create a database, service credentials, and API endpoint.
vi_vn: Trước khi bạn cài đặt và cấu hình dịch vụ Compute, bạn phải khởi tạo cơ sở dữ liệu, các thông tin xác thực dịch vụ và API endpoint.

source: Before you install and configure the Image service, you must create a database, service credentials, and API endpoint.
vi_vn: Trước khi cài đặt và cấu hình dịch vụ Image, bạn cần phải tạo một cơ sở dữ liệu, các chứng thực dịch vụ và điểm cuối API.

source: Before you proceed, ensure that the controller node has at least several gigabytes of space available in this directory.
ru: Прежде чем продолжить, убедитесь, что на управляющем узле есть хотябы несколько гигабайт свободного места в этой директории.
vi_vn: Trước khi bạn bắt đầu, hãy chắc chắn rằng node điều khiển có ít nhất vài gb trống cho thư mục này.
zh_cn: 继续进行之前，确认控制节点的该目录有至少几千兆字节的可用空间。

source: By default in Debian, you can access the MySQL server from either localhost through the socket file or 127.0.0.1. To access it over the network, you must edit the <filename>/etc/mysql/my.cnf</filename> file, and the <literal>mysql.user</literal> table. To do so, Debian provides a helper script in the <package>openstack-deploy</package> package. To use it, install the package and run:
ru: По умолчанию в Debian, вы можете войти на сервер MySQL либо локально через файл сокета или 127.0.0.1. Для доступа по сети, вам необходимо отредактировать файл <filename>/etc/mysql/my.cnf</filename> и таблицу <literal>mysql.user</literal>. Чтобы это сделать, Debian предоставляет скрипт в пакете <package>openstack-deploy</package>. Чтобы его использовать, установите пакет и выполните:
vi_vn: Mặc định trong Debian bạn có thể truy cập vào server MySQL từ localhost thông qua file socket hoặc 127.0.0.1. Để truy cập vào thông qua mạng, bạn phải chỉnh file <filename>/etc/mysql/my.cnf</filename> và bảng <literal>mysql.user</literal>. Để làm được điều này, Debian cung cấp một đoạn script trợ giúp trong gói <package>openstack-deploy</package>. Để sử dụng nó hãy cài đặt gói phần mềm này và chạy:
zh_cn: 默认情况下，在 Debian 中，您可以从本地通过 socket 文件或 127.0.0.1 访问 MySQL 服务器。要想通过网络访问它，您必须修改 <filename>/etc/mysql/my.cnf</filename> 文件和 <literal>mysql.user</literal> 表。要完成上述操作，Debian 在 <package>openstack-deploy</package> 包中提供了一个帮助脚本。要使用这个脚本，请安装包并执行：

source: By default, <package>dbconfig-common</package> does not provide access to database servers over a network. If you want the <package>dbconfig-common</package> package to prompt for remote database servers that are accessed over a network and not through a UNIX socket file, reconfigure it, as follows:
ja: <package>dbconfig-common</package> はデフォルトで、ネットワーク経由でデータベースサーバーへのアクセスを提供しません。UNIX ソケットファイル経由ではなく、ネットワーク経由でアクセスさせるリモートデータベースサーバーに対して、<package>dbconfig-common</package> パッケージにプロンプトさせたい場合、以下のように再設定します。
ru: По умолчанию пакет <package>dbconfig-common</package> не предоставляет доступ до баз данных по сети. Если вы хотите, чтобы пакет <package>dbconfig-common</package> запрашивал удалённые сервера баз данных, которые доступны по сети, а не через сокет файл UNIX, перенастройте его следующим образом:
vi_vn: Mặc đinh, <package>dbconfig-common</package> không cung cấp quyền truy nhập tới các server cơ sở dữ liệu qua mạng. Nếu bạn muốn gói <package>dbconfig-common</package> hỏi đến các máy chủ cơ sở dữ liệu từ xa mà được truy cập qua một hệ thống mạng chứ không phải qua một file socket UNIX, cấu hình lại nó như sau:
zh_cn: 缺省的， <package>dbconfig-common</package>没有提供到网络数据库服务器的访问。如果你希望<package>dbconfig-common</package>包能够支持远程数据库服务器的配置，通过网络访问，而不是通过UNIX socket文件，重新配置它，如下所示：

source: By default, Compute uses an internal firewall service. Since Networking includes a firewall service, you must disable the Compute firewall service by using the <literal>nova.virt.firewall.NoopFirewallDriver</literal> firewall driver.
ru: По умолчанию, служба Вычислений использует внутреннюю службу фаервола. Поскольку служба Сети включает фаервол, вам необходимо отключить фаервол службы Вычислений, использовав драйвер фаервола<literal>nova.virt.firewall.NoopFirewallDriver</literal>.
vi_vn: Mặc định, Compute sử dụng một dịch vụ firewall nội vùng. Vì Networking đã bao gồm cả dịch vụ firewall, bạn phải vô hiệu hóa dịch vụ firewall của Compute bằng cách sử dụng <literal>nova.virt.firewall.NoopFirewallDriver</literal> firewall driver.
zh_cn: 默认情况下，Compute 使用内部的防火墙服务。由于 Networking 包含了一个防火墙服务，您必须使用 <literal>nova.virt.firewall.NoopFirewallDriver</literal> 防火墙驱动来禁用 Compute 的防火墙服务。
