Repository: 25hours/openstack-manuals
Catalog: doc/install-guide/locale/*.po
Languages: ja, ru, vi_vn, zh_cn

source: This guide describes how to deploy these services in a functional test environment and, by example, teaches you how to build a production environment. Realistically, you would use automation tools such as Ansible, Chef, and Puppet to deploy and manage a production environment.
ru: Это руководство описывает, как развернуть эти службы в работоспособную тестовую среду и, на примерах, научит вас, как создать среду для производства. В действительности, вам стоит использовать инструменты автоматизации, такие как Ansible, Chef, и Puppet для разворачивания и управления производственной средой.
vi_vn: Tài liệu này mô tả cách triển khai các dịch vụ này trong một môi trường thử nghiệm vận hành được và dạy bạn cách để xây dựng 1 môi trường thực tế thông qua các ví dụ. Trên thực tế, bạn sẽ sử dụng các công cụ tự động như Ansible, Chef và Puppet để triển khai và quản lý một môi trường thực tế.
zh_cn: 本指南描述如何在一个功能测试环境中部署这些服务，而且，举个例子来说，可以教会您如何构建一个生产环境。但实际上，您应该使用自动化工具，如 Ansible、Chef 和 Puppet 等来部署和管理生产环境。

source: This guide uses a service project that contains a unique user for each service that you add to your environment.
vi_vn: Hướng dẫn này sử dụng một dự án dịch vụ trong đó có một người dùng duy nhất cho mỗi dịch vụ mà bạn thêm vào môi trường của bạn.

source: This image must have the trove guest agent installed, and it must have the <filename>trove-guestagent.conf</filename> file configured to connect to your OpenStack environment. To correctly configure the <filename>trove-guestagent.conf</filename> file, follow these steps on the guest instance you are using to build your image:
vi_vn: Image này phải cài đặt agent khác của trove và phải có file <filename>trove-guestagent.conf</filename> được cấu hình để kết nối với môi trường OpenStack của bạn. Để cấu hình chính xác file <filename>trove-guestagent.conf</filename>, làm theo các bước sau trên instance khách mà bạn dùng để xây dựng image của mình:
zh_cn: 这个镜像必需安装了 trove guest agent，并且需要有 <filename>trove-guestagent.conf</filename> 配置文件的配置，连接到您的 OpenStack 环境中。要正确地配置 <filename>trove-guestagent.conf</filename> 文件，请在您要构建镜像的实例虚拟机上，根据下列步骤进行：

source: This information is stored in the configuration file for each service. For example:
ja: この情報は各サービスの設定ファイルに保存されます。例:
ru: Эта информация хранится в файле конфигурации для каждой службы. Например:
vi_vn: Thông tin này được lưu trữ trong file cấu hình của mỗi dịch vụ. Ví dụ:
zh_cn: 这些信息存储在每个服务的配置文件中。例如：

source: This network does not require a gateway because communication only occurs among network and compute nodes in your OpenStack environment.
ru: Эта сеть не требует шлюза, поскольку коммуникации происходят только среди сетевых и вычислительных узлов в вашей среде OpenStack.
vi_vn: Mạng này không yêu cầu phải có gateway vì việc giao tiếp chỉ xảy ra giữa các node tính toán và node mạng trong môi trường OpenStack của bạn.
zh_cn: 这个网络不需要网关，因为它只发生在您的 OpenStack 环境中的网络节点和计算节点之间的会话中。

source: This network requires a gateway to provide Internet access to all nodes for administrative purposes such as package installation, security updates, <glossterm>DNS</glossterm>, and <glossterm baseform="Network Time Protocol (NTP)">NTP</glossterm>.
ru: Этой сети требуется шлюз для предоставления доступа в Интернет всем узлам для административных задач, таких как установка пакетов, обновления безопасности, <glossterm>DNS</glossterm>и <glossterm baseform="Network Time Protocol (NTP)">NTP</glossterm>.
vi_vn: Mạng này yêu cầu phải có một gateway để cung cấp truy cập Internet cho tất cả các node với mục đích quản trị ví dụ như cài đặt các gói phần mềm, cập nhật bảo mật, <glossterm>DNS</glossterm>, và <glossterm baseform="Network Time Protocol (NTP)">NTP</glossterm>.
zh_cn: 这个网络需要一个网关以为所有节点提供内部的管理目的的访问，例如包的安装、安全更新、<glossterm>DNS</glossterm> 以及 <glossterm baseform="Network Time Protocol (NTP)">NTP</glossterm>。

source: This network requires a gateway to provide Internet access to instances in your OpenStack environment.
ru: Этой сети требуется шлюз для обеспечения доступа в Интернет инстансам в вашей среде OpenStack.
vi_vn: Hệ thống mạng này yêu cầu một gateway cung cấp truy cập Internet cho các máy ảo trong môi trường OpenStack của bạn.
zh_cn: 这个网络需要一个网关来提供在环境中内部实例的访问。

source: This network shares the same <glossterm>subnet</glossterm> associated with the physical network connected to the external <glossterm>interface</glossterm> on the compute node. You should specify an exclusive slice of this subnet to prevent interference with other devices on the external network.
ru: Эта сеть делить <glossterm>подсеть</glossterm> с физической сетью, подключенной к внешнему <glossterm>интерфейсу</glossterm> на вычислительном узле. Вам необходимо указать эксклюзивный фрагмент этой подсети для предотвращения помех с другими устройствами во внешней сети.
vi_vn: Hệ thống mạng này sử dụng chung <glossterm>subnet</glossterm> với hệ thống mạng vật lý liên quan được kết nối tới <glossterm>giao diện</glossterm> ngoại vùng trên node điều khiển. Bạn nên dành một dải riêng của subnet này để phòng tránh sự can thiệp với các thiết bị khác trên hệ thống mạng ngoại vùng.
zh_cn: 这个网络共享同一个计算节点上与外部网络接口连接的物理网络相关的<glossterm>子网</glossterm>。您应该指定一个单独的子网段，来阻止外部网络上其他设备的干扰。

source: This output should indicate four agents alive on the network node and one agent alive on the compute node.
vi_vn: Kết quả trả về phải xác định bốn agent còn hoạt động trên node mạng và một agent còn hoạt động trên node tính toán.

source: This output should indicate four service components enabled on the controller node and one service component enabled on the compute node.
vi_vn: Thông tin đầu ra nên thể hiện bốn thành tố dịch vụ mà đã được cho phép trên nút điều khiển và một thành tố dịch vụ được cho phép trên nút Compute.
zh_cn: 该输出应该显示四个服务组件在控制节点上启用，一个服务组件在计算节点上启用。

source: This procedure installs the Data processing service (sahara) on the controller node.
vi_vn: Thủ tục này sẽ cài đặt dịch vụ xử lý Data (sahara) trên node điều khiển.
zh_cn: 这个过程将在控制节点上安装数据处理服务 (sahara)。

source: This procedure installs the Database service on the controller node.
vi_vn: Quá trình này cài đặt dịch vụ Database trên node điều khiển.

source: This screen configures the IP addresses for the service. The configuration script automatically detects the IP address used by the interface that is connected to the default route (<code>/sbin/route</code> and <code>/sbin/ip</code>).
ja: この画面はサービスの IP アドレスを設定します。設定スクリプトは自動的に、デフォルトルートに接続されているインターフェースにより使用されている IP アドレスを検出します (<code>/sbin/route</code> と <code>/sbin/ip</code>)。
vi_vn: Màn hình này cấu hình địa chỉ IP cho dịch vụ. Script cấu hình tự động phát hiện địa chỉ IP được sử dụng bởi giao diện được kết nối tới đường đi mặc định (<code>/sbin/route</code> and <code>/sbin/ip</code>).
zh_cn: 下面截屏展示如何为服务配置IP地址。配置脚本自动发现连接到缺省路由 (<code>/sbin/route</code> and <code>/sbin/ip</code>)的接口使用的IP地址。

source: This screen configures the region name for the service. For example, <code>us-east-coast</code> or <code>europe-paris</code>.
ja: この画面はサービス用のリージョン名を設定します。例えば、<code>us-east-coast</code> や <code>europe-paris</code> です。
vi_vn: Màn hình này cấu hình tên vùng cho dịch vụ. Ví dụ như code>us-east-coast</code> hoặc <code>europe-paris</code>.
zh_cn: 该截屏配置服务的区域名。例如<code>us-east-coast</code>或者<code>europe-paris</code>。

source: This screen registers packages in the Identity Service catalog:
ja: この画面は Identity Service カタログにパッケージを登録します。
vi_vn: Màn hình này đăng ký các gói trong danh mục Dịch vụ Identity:
zh_cn: 下面截屏展示了在Identity服务目录中注册的包：

source: This section assumes proper installation, configuration, and operation of the Identity service as described in <xref linkend="keystone-install"/> and <xref linkend="keystone-verify"/> as well as setup of the <filename>admin-openrc.sh</filename> script as described in <xref linkend="keystone-client-environment-scripts"/>.
vi_vn: Phần này mặc định rằng dịch vụ Identity đã được cài đặt, cấu hình và vận hành hợp lý như mô tả trong phần <xref linkend="keystone-install"/> và <xref linkend="keystone-verify"/> cũng như việc thiết lập script <filename>admin-openrc.sh</filename> như mô tả trong phần <xref linkend="keystone-client-environment-scripts"/>.

source: This section assumes proper installation, configuration, and operation of the Identity service using the Apache HTTP server and Memcached as described in <xref linkend="keystone-install"/>.
vi_vn: Phần này thực hiện việc cài đặt, cấu hình và vận hành thích hợp của dịch vụ Identity bằng cách sử dụng Apache HTTP server và Memcached như được mô tả trong <xref linkend="keystone-install"/>.

source: This section assumes that you are following the instructions in this guide step-by-step to configure the first compute node. If you want to configure additional compute nodes, prepare them in a similar fashion to the first compute node in the <link linkend="architecture_example-architectures">example architectures </link> section using the same networking service as your existing environment. For either networking service, follow the <link linkend="basics-ntp-other-nodes">NTP configuration</link> and <link linkend="basics-packages">OpenStack packages</link> instructions. For OpenStack Networking (neutron), also follow the <link linkend="basics-networking-neutron">OpenStack Networking compute node</link> instructions. For legacy networking (nova-network), also follow the <link linkend="basics-networking-nova">legacy networking compute node</link> instructions. Each additional compute node requires unique IP addresses.
ru: Этот раздел подразумевает, что вы следовали инструкциям шаг-в-шаг при настройке первого вычислительного узла. Если вы хотите настроить дополнительные вычислительные узлы, подготовьте их тем же образом, что и первый вычислительный узел в разделе <link linkend="architecture_example-architectures">примеры архитектур</link> используя ту же служу сети, что и ваша существующая среда. Для обоих служб сети, следуйте инструкциям <link linkend="basics-ntp-other-nodes">настройка NTP</link> и <link linkend="basics-packages">пакеты OpenStack</link>. Для сети OpenStack (neutron), так же следуйте инструкциям <link linkend="basics-networking-neutron">вычислительного узла OpenStack Networking</link>. Для старой сети (nova-network), так же следуйте инструкциям <link linkend="basics-networking-nova">вычислительного узла старой сети</link>. Каждый дополнительный вычислительный узел требует уникального IP-адреса.
vi_vn: Phần này mặc định rằng bạn đang làm theo phần hướng dẫn trong bài này từng bước một để cấu hình node tính toán đầu tiên. Nếu bạn muốn cấu hình thêm các node tính toán, chuẩn bị chúng giống như node thứ nhất trong mục <link linkend="architecture_example-architectures">các kiến trúc mẫu </link> sử dụng các dịch vụ mạng giống như hệ thống mà bạn đang có. Đối với cả hai dịch vụ networking, làm theo phần hướng dẫn <link linkend="basics-ntp-other-nodes">cấu hình NTP</link> và <link linkend="basics-packages">Các gói OpenStack</link>. Ngoài ra, đối với OpenStack Networking (neutron), làm theo hướng dẫn ở phần <link linkend="basics-networking-neutron">node tính toán của OpenStack Networking</link>. Đối với legacy networking (nova-network), làm theo hướng dẫn ở phần <link linkend="basics-networking-nova">node tính toán của legacy networking</link>. Mỗi node tính toán bạn tạo thêm đều yêu cầu các địa chỉ IP riêng biệt.
zh_cn: 这个部分假设您是根据本指南中的指示一步一步配置的第一台计算节点。如果您像配置额外的计算节点，以与<link linkend="architecture_example-architectures">架构样例</link>部分类似的方式准备好计算节点，使用与您环境相同的网络服务。对于两者的网络服务，依据 <link linkend="basics-ntp-other-nodes">NTP 配置</link>和 <link linkend="basics-packages">OpenStack packages</link> 的指示进行。对于 OpenStack 网络 (neutron)，也可以依据 <link linkend="basics-networking-neutron">OpenStack Networking compute node</link> 的指示进行。对于传统网络 (nova-network)，也可以依据 <link linkend="basics-networking-nova">legacy networking compute node</link> 的指示进行。每个额外的计算节点都需要唯一的 IP 地址。

source: This section covers deployment of a simple <glossterm>flat network</glossterm> that provides IP addresses to your instances via <glossterm>DHCP</glossterm>. If your environment includes multiple compute nodes, the <glossterm>multi-host</glossterm> feature provides redundancy by spreading network functions across compute nodes.
ru: Этот раздел охватывает установку простой <glossterm>плоской сети</glossterm>, которая предоставляет IP-адреса вашим инстансам через <glossterm>DHCP</glossterm>. Если ваша среда включает множество вычислительных узлов, особенность <glossterm>multi-host</glossterm> предоставляет избыточность, распределяя сетевые функции между вычислительными узлами.
vi_vn: Phần này bao gồm việc triển khai một <glossterm> mạng flat </glossterm> đơn giản mà cùng cấp các địa chỉ IP cho các instance của bạn thông qua <glossterm> DHCP </glossterm>. Nếu môi trường của bạn gồm nhiều nút compute, đặc tính <glossterm>multi-host</glossterm> cung cấp tính dư thừa bởi bằng cách trải rộng các chức năng mạng qua các nút compute.
zh_cn: 这个部分覆盖了一个简单的<glossterm>扁平网络</glossterm>的部署，它通过 <glossterm>DHCP</glossterm> 为您的实例提供 IP 地址。如果您的环境包含多个计算节点，<glossterm>multi-host</glossterm> 的特性通过在计算节点上扩展网络功能提供冗余。

source: This section describes how to install and configure storage nodes for the Block Storage service. For simplicity, this configuration references one storage node with an empty local block storage device <literal>/dev/sdb</literal> that contains a suitable partition table with one partition <literal>/dev/sdb1</literal> occupying the entire device. The service provisions logical volumes on this device using the <glossterm>LVM</glossterm> driver and provides them to instances via <glossterm baseform="Internet Small Computer Systems Interface (iSCSI)">iSCSI</glossterm> transport. You can follow these instructions with minor modifications to horizontally scale your environment with additional storage nodes.
ru: Этот раздел описывает как установить и настроить узлы хранения для службы Блочного Хранилища. Для простоты, эта конфигурация ссылается на один узел хранения с пустым блочным устройством <literal>/dev/sdb</literal>, которое содержит подходящую таблицу разделов с одним разделом <literal>/dev/sdb1</literal> занимающим весь объём. Служба подготавливает логические диски на устройстве используя драйвер <glossterm>LVM</glossterm> и предоставляет их инстансам через транспорт <glossterm baseform="Internet Small Computer Systems Interface (iSCSI)">iSCSI</glossterm>. Вы можете следовать данным инструкциям с минимальными изменениями для горизонтального расширения вашей среды дополнительными узлами хранения.
vi_vn: Phần này hướng dẫn cách cài đặt và cấu hình các node lưu trữ cho dịch vụ Block Storage. Để cho đơn giản, phần cấu hình này sử dụng một node lưu trữ với một thiết bị block storage nội vùng trống <literal>/dev/sdb</literal> có chứa một bảng phân vùng thích hợp cùng với một phân vùng <literal>/dev/sdb1</literal> chiếm trọn cả thiết bị. Các ổ lưu trữ logic cung cấp dịch trên thiết bị này sử dụng <glossterm>LVM</glossterm> driver và cung cấp chúng cho các instance thông qua vận chuyển <glossterm baseform="Internet Small Computer Systems Interface (iSCSI)">iSCSI</glossterm>. Bạn có thể làm theo hướng dẫn với các chỉnh sửa nhỏ để nâng cấp môi trường của bạn theo chiều ngang với các node lưu trữ được thêm vào.
zh_cn: 这个部分将描述如何安装和配置存储节点，以使用块设备存储服务。简单来说，这个配置将一个存储节点关联到一个空的本地块存储设备 <literal>/dev/sdb</literal> 上，这个设备包含了一个合适的分区表，其中一个分区 <literal>/dev/sdb1</literal> 占用了整个设备。该服务使用 <glossterm>LVM</glossterm> 在这个设备上提供了逻辑卷，并通过 <glossterm baseform="Internet Small Computer Systems Interface (iSCSI)">iSCSI</glossterm> 传输将这些逻辑卷提供给实例使用。您可以根据这些小修改的指导，通过额外的存储节点来增加您环境的规模。

source: This section describes how to install and configure storage nodes that operate the account, container, and object services. For simplicity, this configuration references two storage nodes, each containing two empty local block storage devices. Each of the devices, <literal>/dev/sdb</literal> and <literal>/dev/sdc</literal>, must contain a suitable partition table with one partition occupying the entire device. Although the Object Storage service supports any file system with <glossterm>extended attributes (xattr)</glossterm>, testing and benchmarking indicate the best performance and reliability on <glossterm>XFS</glossterm>. For more information on horizontally scaling your environment, see the <link xlink:href="http://docs.openstack.org/developer/swift/deployment_guide.html">Deployment Guide</link>.
vi_vn: Phần này hướng dẫn cách cài đặt và cấu hình các node lưu trữ dùng để vận hành các dịch vụ tài khoản, container và object. Để đơn giản hơn, phần cấu hình này sử dụng hai node lưu trữ với mỗi node bao gồm 2 thiết bị lữu trữ khối trống. Mỗi một thiết bị, <literal>/dev/sdb</literal> và <literal>/dev/sdc</literal>,phải chứa một bảng phân vùng thích hợp với một phân vùng chiếm trọn thiết bị. Mặc dù Dịch vụ Object Storage hỗ trợ bất kì file hệ thống nào với các đặc tính mở rộng (xattr), quá trình thử nghiệm và benchmark đều chỉ ra rằng XFS có hiệu suất và độ tin cậy tốt nhất. Để biết thêm thông tin về khả năng mở rộng theo chiều ngang trên hệ thống của bạn, xem <link xlink:href="http://docs.openstack.org/developer/swift/deployment_guide.html">Hướng dẫn Triển khai</link>.

source: This section describes how to install and configure the Block Storage service, code-named cinder, on the controller node. This service requires at least one additional storage node that provides volumes to instances.
vi_vn: Trong phần này sẽ miêu tả cách để cài đặt và cấu hình dịch vụ Block Storage, tên mã cinder, trên controller node. Dịch vụ này yêu cầu có ít nhất một storage node thêm nữa và nó sẽ cung cấp dung lượng cho các instance.
zh_cn: 这个部分描述如何在控制节点上安装和配置块设备存储服务，即 cinder。这个服务需要至少一个额外的存储节点，以向实例提供卷。

source: This section describes how to install and configure the Compute service on a compute node. The service supports several <glossterm baseform="hypervisor">hypervisors</glossterm> to deploy <glossterm baseform="instance">instances</glossterm> or <glossterm baseform="virtual machine (VM)">VMs</glossterm>. For simplicity, this configuration uses the <glossterm baseform="Quick EMUlator (QEMU)">QEMU</glossterm> hypervisor with the <glossterm baseform="kernel-based VM (KVM)">KVM</glossterm> extension on compute nodes that support hardware acceleration for virtual machines. On legacy hardware, this configuration uses the generic QEMU hypervisor. You can follow these instructions with minor modifications to horizontally scale your environment with additional compute nodes.
ru: Эта секция описывает, как установить и настроить службу Вычислений на вычислительном узле. Служба поддерживает несколько <glossterm baseform="гипервизор">гипервизоров</glossterm> для установки <glossterm baseform="инстанс">инстансов</glossterm> или <glossterm baseform="виртуальная машина (ВМ)">ВМ</glossterm>. Для простоты, эта конфигурация использует гипервизор <glossterm baseform="Quick EMUlator (QEMU)">QEMU</glossterm> с расширением <glossterm baseform="kernel-based VM (KVM)">KVM</glossterm> на вычислительных узлах, которые поддерживают аппаратное ускорение для виртуальных машин. На устаревшем оборудовании, эта конфигурация использует обычный гипервизор QEMU. Вы можете следовать данным инструкциям с минимальными изменениями для горизонтального расширения вашей среды дополнительными вычислительными узлами.
vi_vn: Phần này sẽ chỉ cho bạn cách để cài đặt và cấu hình dịch vụ Compute trong một nút compute. Dịch vụ hỗ trợ một vài <glossterm baseform="hypervisor">hypervisors</glossterm> để triển khai <glossterm baseform="instance">instances</glossterm> hoặc <glossterm baseform="virtual machine (VM)">VMs</glossterm>. Để đơn giản hóa, việc cấu hình này sử dụng <glossterm baseform="Quick EMUlator (QEMU)">QEMU</glossterm> hypervisor với <glossterm baseform="kernel-based VM (KVM)">KVM</glossterm> mở rộng trên các nút compute mà hỗ trợ tăng tốc phần cứng cho các máy ảo. Trên các phần cứng có sẵn, việc cấu hình này sử dụng chung QEMU hypervisor. Bạn có thể làm theo các hướng dẫn sau với những thay đổi nhỏ để mở rộng horizon trong môi trường của bạn với các nút compute.
zh_cn: 这个部分描述如何在一个计算节点上安装和配置 Compute 服务。这个服务支持一些 <glossterm baseform="hypervisor">hypervisors</glossterm> 来部署<glossterm baseform="instance">实例</glossterm> 或 <glossterm baseform="virtual machine (VM)">虚拟机</glossterm>。简单来说，这个配置使用在计算节点上扩展 <glossterm baseform="kernel-based VM (KVM)">KVM</glossterm> 的 <glossterm baseform="Quick EMUlator (QEMU)">QEMU</glossterm> hypervisor，支持虚拟机的硬件加速。在旧的硬件上，这个配置使用通用的 QEMU hypervisor。您可以根据这些说明进行轻微的修改，以横向扩展环境的额外计算节点。

source: This section describes how to install and configure the Compute service, code-named nova, on the controller node.
ru: Этот раздел описывает, как установить и настроить службу Вычислений, названную nova, на управляющем узле.
vi_vn: Phần này hướng dẫn cách cài đặt và cấu hình dịch vụ Compute, tên mã là nova, trên node điều khiển.
zh_cn: 这个部分将描述如何在控制节点上安装和配置 Compute 服务，即 nova。

source: This section describes how to install and configure the Image service, code-named glance, on the controller node. For simplicity, this configuration stores images on the local file system.
vi_vn: Phần này hướng dẫn cách cài đặt và cấu hình dịch vụ Image, tên mã là glance, trên node điều khiển. Để cho đơn giản, phần cấu hình này lưu trữ các image trên hệ thống tập tin nội vùng.

source: This section describes how to install and configure the OpenStack Identity service, code-named keystone, on the controller node. For performance, this configuration deploys the Apache HTTP server to handle requests and Memcached to store tokens instead of a SQL database.
vi_vn: Phần này mô tả cách cài đặt và cấu hình dịch vụ OpenStack Identity, với tên mã keystone, trên controller node. Để hiệu năng được tốt, cấu hình này triển khai Apache HTTP server để xử lý các yêu cầu và Memcached để lưu trữ các token thay vì cơ sở dữ liệu SQL.

source: This section describes how to install and configure the Orchestration module, code-named heat, on the controller node.
vi_vn: Phần này hướng dẫn cách cài đặt và cấu hình module Orchestration, tên mã là heat, trên node điều khiển.
zh_cn: 这个部分将描述如何在控制节点上安装及配置 Orchestration 模块，即heat。

source: This section describes how to install and configure the Telemetry module, code-named ceilometer, on the controller node. The Telemetry module uses separate agents to collect measurements from each OpenStack service in your environment.
vi_vn: Phần này hướng dẫn cách cài đặt và cấu hình module Telemetry, tên mã là ceilometer, trên node điều khiển. Module Telemetry sử dụng các agent riêng biệt để thu thâp số liệu từ từng dịch vụ OpenStack trong môi trường của bạn.
zh_cn: 这个部分将描述如何在控制节点上安装和配置 Telemetry 模块，即 ceilometer。Telemetry 模块使用分离的代理来从您环境的 OpenStack 服务中收集评估。

source: This section describes how to install and configure the dashboard on the controller node.
ru: Этот раздел описывает как установить и настроить панель управления на управляющем узле.
vi_vn: Phần này hướng dẫn cách cài đặt và cấu hình dashboard trên node điều khiển.
zh_cn: 这个部分将描述如何在控制节点上安装和配置仪表板。
