Repository: 25hours/openstack-manuals
Catalog: doc/install-guide/locale/*.po
Languages: ja, ru, vi_vn, zh_cn

source: The network node primarily handles internal and external routing and <glossterm>DHCP</glossterm> services for virtual networks.
ru: Сетевой узел в первую очередь обрабатывает внутреннюю и внешнюю маршрутизацию и службы <glossterm>DHCP</glossterm> для виртуальных сетей.
vi_vn: Node mạng chủ yếu xử lý việc định tuyến nội và ngoại vùng và các dịch vụ <glossterm>DHCP</glossterm> cho các hệ thống mạng ảo.
zh_cn: 网络节点主要为虚拟网络处理内部和外部路由及 <glossterm>DHCP</glossterm> 服务。

source: The network node runs the Networking plug-in and several agents that provision tenant networks and provide switching, routing, <glossterm baseform="Network Address Translation (NAT)">NAT</glossterm>, and <glossterm>DHCP</glossterm> services. This node also handles external (Internet) connectivity for tenant virtual machine instances.
ru: Сетевой узел содержит Сетевые плагины и несколько агентов, которые обеспечивают сети проектов и предоставляют свичи, маршрутизаторы, <glossterm baseform="Network Address Translation (NAT)">NAT</glossterm> и <glossterm>DHCP</glossterm>. Этот узел так же занимается связью с внешней сетью (Интернет) для виртуальных машин проектов.
vi_vn: Node mạng chạy plug-in Networking và một vài agent cung cấp các hệ thống mạng tenant và cung cấp các dịch vụ chuyển mạch, định tuyến, <glossterm baseform="Network Address Translation (NAT)">NAT</glossterm> và <glossterm>DHCP</glossterm>. Node này cũng xử lý kết nối ngoại vùng (Internet) cho các instance máy ảo tenant.
zh_cn: 网络节点运行 Networking 插件和一些提供租户网络的代理，并提供 switching、routing、<glossterm baseform="Network Address Translation (NAT)">NAT</glossterm> 和 <glossterm>DHCP</glossterm> 服务。这个节点也处理租户虚拟机实例的外部 (Internet) 的连接。

source: The object server uses the object ring to maintain lists of object locations on local devices.
vi_vn: Object server sử dụng object ring để duy trì các danh sách địa chỉ của các object trên các thiết bị nội vùng.

source: The openSUSE distribution uses the concept of patterns to represent collections of packages. If you selected 'Minimal Server Selection (Text Mode)' during initial installation, you may be presented with a dependency conflict when you attempt to install the OpenStack packages. To avoid this, remove the minimal_base-conflicts package:
vi_vn: Triển khai openSUSE sử dụng khái niệm về kiểu mẫu để thể hiện nhóm các gói. Nếu bạn chọn 'Minimal Server Selection (Text Mode)' trong quá trình cài đặt ban đầu, bạn có thể sẽ gặp xung đột về tính phụ thuộc khi bạn cố gắn cài đặt các gói OpenStack. Để tránh điều này, xóa gói minimal_base-conflicts:

source: The optional Block Storage node contains the disks that the Block Storage service provisions for tenant virtual machine instances. You can run more than one of these nodes.
ru: Необязательный узел Блочного хранения содержит диски, которые служба Блочного хранения предоставляет виртуальным машинам проектов. Вы можете иметь более одного такого узла.
vi_vn: Node tùy chọn Block Storage chứa các đĩa mà dịch vụ Block Storage cung cấp cho các instance máy ảo tenant. Bạn có thể chạy nhiều hơn một node này.
zh_cn: 该可选的块存储节点包含磁盘，块存储服务会向租户虚拟机实例提供这些磁盘。您可以运行多个该节点。

source: The optional Object Storage nodes contain the disks that the Object Storage service uses for storing accounts, containers, and objects. You can run more than two of these nodes. However, the minimal architecture example requires two nodes.
ru: Необязательные узлы Хранилища Объектов содержат диски, которые служба Хранилища Объектов использует для хранения аккаунтов, контейнеров и объектов. Вы можете иметь более двух таких узлов. Однако, минимальные примерные архитектуры требуют двух узлов.
vi_vn: Các node tùy chọn Object Storage chứa các đĩa mà dịch vụ Object Storage sử dụng để lưu trữ tài khoản, container và object. Bạn có thể chạy nhiều hơn hai node dạng này. Tuy nhiên, ví dụ của kiến trúc tối thiếu này chỉ yêu cầu hai node.
zh_cn: 该可选的对象存储节点包含磁盘，对象存储服务使用这些磁盘来存储帐户、容器和对象。您可以运行多个该节点。但是在最小架构样例中需要两个节点。

source: The other directives concerning RabbitMQ will stay untouched.
ru: Остальные директивы связанные с RabbitMQ останутся нетронутыми.
vi_vn: Các chỉ thị khác liên quan tới RabbitMQ sẽ không bị đụng tới.

source: The packages already contain a cron job under <filename>/etc/cron.hourly/keystone</filename>, so it is not necessary to manually configure a periodic task that purges expired tokens.
vi_vn: Các gói phần mềm này đã bao gồm một cron job tại <filename>/etc/cron.hourly/keystone</filename>, cho nên bạn không cần thiết cấu hình bằng tay một tác vụ định kì để tiêu hủy các token hết hạn.

source: The packages are signed by GPG key 893A90DAD85F9316. You should verify the fingerprint of the imported GPG key before using it.
ru: Пакеты подписаны GPG ключом 893A90DAD85F9316. Вам необходимо проверить отпечаток импортированного GPG ключа, прежде чем использовать его.
vi_vn: Các gói được ký bởi khóa GPG 893A90DAD85F9316. Bạn nên kiểm tra vân tay của khóa GPG được nhập trước khi sử dụng nó.
zh_cn: 这些软件包都使用 GPG 密钥 893A90DAD85F9316 进行了签名，在安装之前可以先验证签名。

source: The packages are signed by GPG key <literal>562111AC05905EA8</literal>. You should verify the fingerprint of the imported GPG key before using it.
vi_vn: Các gói được ký bởi khóa GPG <literal>562111AC05905EA8</literal>. Bạn nên kiểm tra vân tay của khóa GPG được nhập trước khi sử dụng nó.

source: The packages can automatically create the service entity and API endpoint.
vi_vn: Các gói sẽ tự động tạo thực thể dịch vụ và điểm đầu cuối API.

source: The previous section used a combination of environment variables and command options to interact with the Identity service via the <placeholder-1/> client. To increase efficiency of client operations, OpenStack supports simple client environment scripts also known as OpenRC files. These scripts typically contain common options for all clients, but also support unique options. For more information, see the <link xlink:href="http://docs.openstack.org/user-guide/common/cli_set_environment_variables_using_openstack_rc.html"> OpenStack User Guide</link>.
vi_vn: Các phần trước sử dụng một sự kết hợp giữa các biến môi trường và các tùy chọn lệnh để tương tác với dịch vụ Identity thông qua client <placeholder-1/>. Để tăng hiệu quả của các tác vụ client, OpenStack hỗ trợ các script môi trường client đơn giản hay còn được gọi là các tập tin OpenRC. Các script này thường chứa các tùy chọn thường gặp của tất cả các client nhưng nó cũng đồng thời hỗ trợ các tùy chọn riêng biệt. Để biết thêm thông tin, xem <link xlink:href="http://docs.openstack.org/user-guide/common/cli_set_environment_variables_using_openstack_rc.html"> Hướng dẫn Người dùng OpenStack</link>.

source: The proxy service relies on an authentication and authorization mechanism such as the Identity service. However, unlike other services, it also offers an internal mechanism that allows it to operate without any other OpenStack services. However, for simplicity, this guide references the Identity service in <xref linkend="ch_keystone"/>. Before you configure the Object Storage service, you must create service credentials and an API endpoint.
vi_vn: Dịch vụ proxy dựa vào các cơ chế xác thực và ủy quyền như của dịch vụ Identity. Tuy nhiên, khác với các dịch vụ khác, nó cũng đưa ra một cơ chế nội bộ cho phép nó hoạt động mà không cần các dịch vụ OpenStack khác. Tuy nhiên, để đơn giản vấn đề, bài hướng dẫn này trỏ đến dịch vụ Identity trong <xref linkend="ch_keystone"/>. Trước khi bạn cấu hình dịch vụ Object Storage, bạn phải khởi tạo các thông tin xác thực dịch vụ và một API endpoint.

source: The rules described here are from the <link xlink:href="http://www.debian.org/doc/debian-policy/"><citetitle>Debian Policy Manual</citetitle></link>. If any rule described in this chapter is not respected, you have found a serious bug that must be fixed.
vi_vn: Các nguyên tắc được mô tả ở đây là từ <link xlink:href="http://www.debian.org/doc/debian-policy/"><citetitle>Bản hướng dẫn Chính sách Debian</citetitle></link>. Nếu bất kỳ nguyên tắc nào được mô tả trong chương này không được tuân theo, bạn đã tìm ra một lỗi nghiêm trọng và nó cần được sửa.

source: The server component listens on all IP addresses and the proxy component only listens on the management interface IP address of the compute node. The base URL indicates the location where you can use a web browser to access remote consoles of instances on this compute node.
ru: Серверный компонент слушает на всех IP-адресах, а прокси компонент слушает только на IP-адресе управляющего интерфейса вычислительного узла. Базовый URL указывает адрес на который вы можете зайти, используя веб браузер, чтобы получить доступ до удалённых консолей инстансов на вычислительном узле.
vi_vn: Thành phần của máy chủ lắng nghe trên tất cả các địa chỉ IP còn thành phần proxy chỉ nghe trên địa chỉ IP quản lý của node tính toán. URL gốc chỉ ra địa chỉ nơi mà bạn có thể sử dụng trình duyệt web để truy cập giao diện điều khiển từ xa của các instance trên node tính toán này.
zh_cn: 服务器组件监听所有的 IP 地址，而代理组件仅仅监听计算节点管理网络接口的 IP 地址。基本的 URL 指示您可以使用 web 浏览器访问位于该计算节点上实例的远程控制台的位置。

source: The status changes from <literal>BUILD</literal> to <literal>ACTIVE</literal> when your instance finishes the build process.
ru: Статус изменится с <literal>BUILD</literal> на <literal>ACTIVE</literal> когда инстанс закончит процесс создания.
vi_vn: Tình trạng thay đổi từ <literal>BUILD</literal> đến <literal>ACTIVE</literal> khi instance của bạn kết thúc quá trình xây dựng.
zh_cn: 当您的实例完成创建过程时，状态会从 <literal>BUILD</literal> 变为 <literal>ACTIVE</literal>。

source: The storage node runs many Object Storage services and the <placeholder-1/> command makes them easier to manage. You can ignore errors from services not running on the storage node.
vi_vn: Node lưu trữ chạy nhiều dịch vụ Object Storage và lệnh <placeholder-1/> giúp việc quản lý chúng dễ dàng hơn. Bạn có thể bỏ qua các lỗi từ các dịch vụ không chạy trên node lưu trữ.
zh_cn: 存储节点运行很多对象存储服务，而且 <placeholder-1/> 命令使他们易于管理。您可以忽视不在存储节点上运行的服务的错误。

source: The tenant network provides internal network access for instances. The architecture isolates this type of network from other tenants. The <literal>demo</literal> tenant owns this network because it only provides network access for instances within it.
ru: Сеть проекта обеспечивает доступ инстансов ко внутренней сети. Архитектура изолирует этот тип сети от других проектов. Проект <literal>demo</literal> владеет данной сетью, поскольку она предоставляет доступ только к инстансам внутри него.
vi_vn: Mạng tenant cung cấp quyền truy cập các mạng nội bộ cho các instance. Dạng kiến trúc này sẽ cô lập kiểu mạng này từ các tenant khác. Việc <literal>Giới thiệu</literal> một tenant sở hữu mạng này bởi vì nó chỉ cung cấp quyền truy cập mạng cho tất cả các instance nằm trong nó.
zh_cn: 租户网络为实例提供内部网络连接。架构确保这种网络在不同租户间分离。<literal>demo</literal> 租户拥有这个网络因为其仅仅为其内的实例提供网络连接。

source: The values of <literal>AUTH_TOKEN</literal>, <literal>KEYSTONE_ENDPOINT_IP</literal>, <literal>PKG_ENDPOINT_IP</literal> and <literal>REGION_NAME</literal> depend on the answer you will provide to the debconf prompts. But the values of <literal>SERVICE_NAME</literal>, <literal>SERVICE_TYPE</literal>, <literal>SERVICE_DESC</literal> and <literal>SERVICE_URL</literal> are already pre-wired in each package, so you don't have to remember them.
vi_vn: Các giá trị của <literal>AUTH_TOKEN</literal>, <literal>KEYSTONE_ENDPOINT_IP</literal>, <literal>PKG_ENDPOINT_IP</literal> và <literal>REGION_NAME</literal> dựa vào câu trả lời bạn cung cấp cho các yêu cầu debconf. Nhưng các giá trị <literal>SERVICE_NAME</literal>, <literal>SERVICE_TYPE</literal>, <literal>SERVICE_DESC</literal> và <literal>SERVICE_URL</literal> đều được định sẵn trong các gói vì vậy bạn không cần phải ghi nhớ chúng.

source: Then, <systemitem class="library">debconf</systemitem> does not prompt you.
ja: そして、<systemitem class="library">debconf</systemitem> がプロンプトを表示しなくなります。
ru: Тогда, <systemitem class="library">debconf</systemitem> не запрашивает ничего у вас.
vi_vn: Khi đó, <systemitem class="library">debconf</systemitem> sẽ không hiện lên nhắc bạn nữa.
zh_cn: 这样，<systemitem class="library">debconf</systemitem>就不会提示你了。

source: These debconf screens appear in: <systemitem class="service">ceilometer-common</systemitem>, <systemitem class="service">cinder-common</systemitem>, <systemitem class="service">glance-common</systemitem>, <systemitem class="service">heat-common</systemitem>, <systemitem class="service">neutron-common</systemitem> and <systemitem class="service">nova-common</systemitem>.
ja: これらの debconf 画面が次のもので表示されます。<systemitem class="service">ceilometer-common</systemitem>、<systemitem class="service">cinder-common</systemitem>、<systemitem class="service">glance-common</systemitem>、<systemitem class="service">heat-common</systemitem>、<systemitem class="service">neutron-common</systemitem>、<systemitem class="service">nova-common</systemitem>。
vi_vn: Các hình debconf xuất hiện trong: <systemitem class="service">ceilometer-common</systemitem>, <systemitem class="service">cinder-common</systemitem>, <systemitem class="service">glance-common</systemitem>, <systemitem class="service">heat-common</systemitem>, <systemitem class="service">neutron-common</systemitem> and <systemitem class="service">nova-common</systemitem>.
zh_cn: 这些debconf屏幕抓图展示了<systemitem class="service">ceilometer-common</systemitem>, <systemitem class="service">cinder-common</systemitem>, <systemitem class="service">glance-common</systemitem>, <systemitem class="service">heat-common</systemitem>, <systemitem class="service">neutron-common</systemitem>和<systemitem class="service">nova-common</systemitem>。

source: These screens appear when you re-configure the <package>dbconfig-common</package> package:
ja: これらの画面は <package>dbconfig-common</package> パッケージを再設定するときに表示されます。
ru: Эти экраны появляются, когда вы перенастраиваете пакет <package>dbconfig-common</package>:
vi_vn: Những màn hình này hiển thị khi bạn cấu hình lại gói <package>dbconfig-common</package>:
zh_cn: 下面截屏显示了当你重新配置 <package>dbconfig-common</package>包时的情况：

source: These steps reference example components created in previous chapters. You must adjust certain values such as IP addresses to match your environment.
ru: Эти шаги используют примеры компонент, созданных в предыдущих главах. Вам необходимо изменить некоторые значения, такие как IP-адреса, в соответствии с вашей средой.
vi_vn: Những bước này giúp bạn tham khảo về các thành phần ví dụ được tạo ra ở các chương trước. Bạn phải điều chỉnh các giá trị như địa chỉ IP sao cho phù hợp với môi trường làm việc.
zh_cn: 这些步骤关系到一些前面章节中所创建的组件，您必须调整某些值，如 IP 地址，以匹配您的环境配置。

source: This <literal>connection</literal> directive will be handled by the <package>dbconfig-common</package> package, which provides a standard Debian interface. It enables you to configure Debian database parameters. It includes localized prompts for many languages and it supports the following database backends: SQLite, MySQL, and PostgreSQL.
ru: Директива <literal>connection</literal> будет обработана пакетом <package>dbconfig-common</package>, который предоставляет стандартный интерфейс Debian. Он позволяет вам настраивать параметры базы данных в Debian. Он включает локализованные вопросы для множества языков и поддерживает базы данных: SQLite, MySQL и PostgreSQL.
vi_vn: Chỉ lệnh <literal>connection</literal> này sẽ được xử lý bởi gói <package>dbconfig-common</package>, gói này có cung cấp một giao diện Debian tiêu chuẩn. Nó cho phép bạn cấu hình các thông số cơ sở dữ liệu của Debian. Nó bao gồm các lời nhắc được địa phương hoá cho nhiều ngôn ngữ và nó hỗ trợ các backend cơ sở dữ liệu sau: SQLite, MySQL và PostgreSQL.
zh_cn: 这个 <literal>connection</literal> 指令将由 <package>dbconfig-common</package> 包处理，这个连接会提供一个标准的 Debian 接口，允许您配置 Debian 数据库的参数。它包括了多种语言的本地化提示，并支持以下数据库后台：SQLite、MySQL 和 PostgreSQL。

source: This calls the post-installation script for the <replaceable>PACKAGE-NAME</replaceable> package after the user responds to all prompts. If you cannot install a Debian package in a non-interactive way, you have found a release-critical bug in Debian. Report it to the Debian bug tracking system.
ja: これはユーザーがすべてのプロンプトに答えた後、<replaceable>PACKAGE-NAME</replaceable> パッケージ用のインストール後スクリプトを呼び出します。非対話的な方法で Debian パッケージをインストールできない場合、Debian で深刻なリリースのバグを見つけたことになります。Debian のバグ追跡システムに報告してください。
vi_vn: Điều này sẽ gọi đến script sau cài đặt của gói <replaceable>PACKAGE-NAME</replaceable> sau khi người dùng phản hồi tất cả các nhắc nhở. Nếu bạn không thể cài đặt một gói Debian theo một cách không tương tác, bạn đã tìm thấy một lỗi phát hành nghiêm trọng trong Debian. Thông báo lại nó cho hệ thống tìm kiếm lỗi của Debian.
zh_cn: 在用户回答所有提示问题后，<replaceable>PACKAGE-NAME</replaceable>包的安装后期脚本将被调用执行。如果你在非交互情况下碰到问题无法安装Debian包，这就是个release-critial的bug，你可以汇报到Debian bug跟踪系统中去。

source: This caveat applies to most OpenStack packages in Wheezy.
ja: この注意事項は Wheezy 上の多くの OpenStack パッケージに適用されます。
ru: Это предостережение касается большинства пакетов OpenStack в Wheezy.
vi_vn: Lưu ý này đúng với phần lớn các gói OpenStack trong Wheezy.
zh_cn: 这个警告对Wheezy的大多数OpenStack包都适用。

source: This chapter assumes that you already have a working OpenStack environment with at least the following components installed: Compute, Image service, Identity.
vi_vn: Chương này giả sử bạn đã từng làm quen với môi trường của OpenStack với ít nhất một trong các thành tố sau đã được cài đặt: Compute, dịch vụ Image, Identity.

source: This chapter explains how to configure each node in the <link linkend="architecture_example-architectures">example architectures</link> including the <link linkend="example-architecture-with-legacy-networking-hw"> two-node architecture with legacy networking</link> and <link linkend="example-architecture-with-neutron-networking-hw">three-node architecture with OpenStack Networking (neutron)</link>.
ru: Этот раздел объясняет как настроить каждый узел в <link linkend="architecture_example-architectures">примерах архитектур</link> включая <link linkend="example-architecture-with-legacy-networking-hw"> двух-узловую архитектуру со старой сетевой системой</link> и <link linkend="example-architecture-with-neutron-networking-hw">трёх-узловую архитектуру с сетью OpenStack (neutron)</link>.
vi_vn: Chương này hướng dẫn cách cấu hình từng node trong <link linkend="architecture_example-architectures">các kiến trúc mẫu</link> bao gồm <link linkend="example-architecture-with-legacy-networking-hw"> kiến trúc hai-node sử dụng legacy networking</link> và <link linkend="example-architecture-with-neutron-networking-hw">kiến trúc ba-node sử dụng OpenStack Networking (neutron)</link>.
zh_cn: 这个章节将解释如何在<link linkend="architecture_example-architectures">架构样例</link>中对每个节点进行配置，包括 <link linkend="example-architecture-with-legacy-networking-hw">使用传统网络的两个节点架构</link>和<link linkend="example-architecture-with-neutron-networking-hw">使用 OpenStack 网络 (neutron) 的三个节点架构</link>。

source: This chapter explains how to install and configure either OpenStack Networking (neutron), or the legacy <systemitem class="service">nova-network</systemitem> component. The <systemitem class="service">nova-network</systemitem> service enables you to deploy one network type per instance and is suitable for basic network functionality. OpenStack Networking enables you to deploy multiple network types per instance and includes <glossterm baseform="plug-in">plug-ins</glossterm> for a variety of products that support <glossterm>virtual networking</glossterm>.
vi_vn: Chương này giải thích cách cài đặt và cấu hình các thành phần OpenStack Networking (neutron) hoặc legacy <systemitem class="service">nova-network</systemitem>. Dịch vụ <systemitem class="service">nova-network</systemitem> cho phép bạn triển khai một dạng hệ thống mạng trên một instance và nó phù hợp cho các chức năng mạng cơ bản. OpenStack Networking cho phép bạn triển khai nhiều dạng hệ thống mạng trên một instance và bao gồm các <glossterm baseform="plug-in">plug-in</glossterm> cho nhiều sản phẩm khác nhau có hỗ trợ <glossterm>hệ thống mạng ảo</glossterm>.

source: This chapter explains how to use the Debian <systemitem class="library">debconf</systemitem> and <systemitem class="library">dbconfig-common</systemitem> packages to configure OpenStack services. These packages enable users to perform configuration tasks. When users install OpenStack packages, <package>debconf</package> prompts the user for responses, which seed the contents of configuration files associated with that package. After package installation, users can update the configuration of a package by using the <placeholder-1/> program.
ja: 本章は OpenStack サービスを設定するために Debian の <systemitem class="library">debconf</systemitem> と <systemitem class="library">dbconfig-common</systemitem> を使用する方法について説明します。これらのパッケージによりユーザーが設定作業を実行できます。ユーザーが OpenStack パッケージをインストールするとき、<package>debconf</package> がユーザーにプロンプトを表示します。これは、パッケージに関連づけられた設定ファイルの内容をシードします。パッケージのインストール後、ユーザーは <placeholder-1/> プログラムを使用することにより、パッケージの設定を更新できます。
vi_vn: Chương này giải thích cách sử dụng các gói Debian <systemitem class="library">debconf</systemitem> và <systemitem class="library">dbconfig-common</systemitem> để cấu hình các dịch vụ OpenStack. Các gói này cho phép người dùng thực hiện các tác vụ cấu hình. Khi người dùng cài đặt các gói OpenStack, <package>debconf</package> sẽ yêu cầu các phản hồi từ người dùng, giúp sắp xếp nội dung các file cấu hình liên kết với gói đó. Sau khi cài đặt, người dùng có thể cập nhật cấu hình của một gói bằng cách sử dụng chương trình <placeholder-1/>.
zh_cn: 本章解释了如何使用Debian的<systemitem class="library">debconf</systemitem>包和<systemitem class="library">dbconfig-common</systemitem>包来配置OpenStack服务。这些包允许用户执行配置的工作。当用户安装OpenStack包时，<package>debconf</package>会提示用户输入，这些用户输入会存放到与OpenStack包关联的配置文件中。当安装完成后，用户可以使用<placeholder-1/>程序更新这些配置信息。

source: This chapter is a work in progress. It may contain incorrect information, and will be updated frequently.
vi_vn: Chương này đang trong quá trình làm việc. Vì vậy có thể tồn tại một vài thông tin không chính xác, và sẽ được cập nhật thường xuyên.
zh_cn: 这个章节正在书写中。它可能包含一些错误的信息，并且会频繁地更新。

source: This chapter omits the backup manager because it depends on the Object Storage service.
vi_vn: Chương này bỏ qua phần quản lý sao lưu bởi phần đó còn phụ thuộc vào dịch vụ Object Storage.
zh_cn: 本章节省略了备份管理，因为它是基于对象存储服务的。

source: This command provides no output.
ru: Эта команда ничего не выводит.
vi_vn: Câu lệnh này không có kết quả trả về.
zh_cn: 这个命令执行后没有输出。

source: This command uses the password for the <literal>admin</literal> user.
vi_vn: Câu lệnh này sử dụng mật khẩu của người dùng <literal>admin</literal>.

source: This command uses the password for the <literal>demo</literal> user and API port 5000 which only allows regular (non-admin) access to the Identity service API.
vi_vn: Câu lệnh này sử dụng mật khẩu của người dùng <literal>demo</literal> và API port 5000 mà cho phép truy cập thường (không phải là admin) tới Identity service API.

source: This example deployment uses an Apache web server.
ru: Этот пример установки использует веб-сервер Apache.
vi_vn: Triển khai ví dụ này sử dụng Apache web server.
zh_cn: 这个部署示例使用的是 Apache Web 服务器。

source: This example shows you how to create a MySQL 5.5 database:
vi_vn: Ví dụ này cho bạn thấy cách tạo ra cơ sở dữ liệu MySQL 5.5:
zh_cn: 这个示例会向您展示如何创建 MySQL 5.5 数据库：

source: This example shows you how to create a MySQL datastore with version 5.5:
vi_vn: Ví dụ sau sẽ giúp bạn cách cài đặt một kho dữ liệu MySQL phiên bản 5.5:
zh_cn: 这个实例将向您展示如何创建一个 5.5 版本的 MySQL 数据存储：
