Repository: 25hours/openstack-manuals
Catalog: doc/install-guide/locale/*.po
Languages: ja, ru, vi_vn, zh_cn

source: Tunneling protocols such as GRE include additional packet headers that increase overhead and decrease space available for the payload or user data. Without knowledge of the virtual network infrastructure, instances attempt to send packets using the default Ethernet <glossterm>maximum transmission unit (MTU)</glossterm> of 1500 bytes. <glossterm>Internet protocol (IP)</glossterm> networks contain the <glossterm>path MTU discovery (PMTUD)</glossterm> mechanism to detect end-to-end MTU and adjust packet size accordingly. However, some operating systems and networks block or otherwise lack support for PMTUD causing performance degradation or connectivity failure.
ru: Туннелирующие протоколы, такие как GRE, включают дополнительные заголовки пакетов, которые увеличивают накладные расходы и уменьшают доступное пространство для полезных и пользовательских данных. Без знания об инфраструктуре виртуальной сети, инстансы пытаются посылать пакеты используя стандартные для Ethernet <glossterm>maximum transmission unit (MTU)</glossterm> в 1500 байт. Протокол <glossterm>Internet protocol (IP)</glossterm> содержит механизм <glossterm>path MTU discovery (PMTUD)</glossterm> для определения MTU между концами и соответствующего изменения размера пакета. Однако, некоторые операционные системы и сети блокируют или не имеют поддержки PMTUD, что приводит к падению производительности или проблемам со связью.
zh_cn: 类似于GRE的隧道协议包含有额外的数据包头，这些数据包头增加了开销，减少了有效内容或是用户数据的可用空间。在不了解虚拟网络架构的情况下，实例尝试用默认的以太网<glossterm> maximum transmission unit (MTU)</glossterm>1500字节来发送数据包。 <glossterm>Internet protocol (IP)</glossterm> 网络利用 <glossterm>path MTU discovery (PMTUD)</glossterm> 机制来探测和调整数据包的大小。但是有些操作系统或者是网络阻塞、缺乏对PMTUD的支持等原因会造成性能下降或是连接错误。

source: In the <literal>[DEFAULT]</literal> section, configure the metadata proxy shared secret:
ru: В секции <literal>[DEFAULT]</literal> настройте общий секрет для прокси метаданных:
zh_cn: 在 <literal>[DEFAULT]</literal> 部分，配置 metadata 代理共享 secret：

source: The OVS service provides the underlying virtual networking framework for instances. The integration bridge <literal>br-int</literal> handles internal instance network traffic within OVS. The external bridge <literal>br-ex</literal> handles external instance network traffic within OVS. The external bridge requires a port on the physical external network interface to provide instances with external network access. In essence, this port connects the virtual and physical external networks in your environment.
ru: Служба OVS предоставляет основную структуру виртуальной сети инстансам. Внутренний мост <literal>br-int</literal> обрабатывает внутренний траффик инстансов внутри OVS. Внешний мост <literal>br-ex</literal> обрабатывает внешний траффик инстансов внутри OVS. Внешнему мосту требуется порт на физическом внешнем сетевом интерфейсе, чтобы обеспечивать инстансы доступом во внешнюю сеть. По сути, этот порт соединяет виртуальную и физическую внешнюю сеть в вашей среде.
zh_cn: OVS 服务为实例提供了底层的虚拟网络框架。整合的桥接 <literal>br-int</literal> 处理内部实例网络在 OVS 中的传输。外部桥接 <literal>br-ex</literal> 处理外部实例网络在 OVS 中的传输。外部桥接需要一个在物理外部网络接口上的端口来为实例提供外部网络的访问。本质上，这个端口连接了您环境中虚拟的和物理的外部网络。

source: Add the external bridge:
ja: 外部ブリッジを追加します。
ru: Добавьте внешний мост:
zh_cn: 添加外部桥接：

source: Add a port to the external bridge that connects to the physical external network interface:
ru: Добавьте порт к внешнему мосту, который соединяется с физическим интерфейсом внешней сети:
zh_cn: 给一个连接到物理外部网络接口的外部桥接添加端口：

source: Depending on your network interface driver, you may need to disable <glossterm>generic receive offload (GRO)</glossterm> to achieve suitable throughput between your instances and the external network.
ru: В зависимости от драйвера вашей сетевой платы, вам может потребоваться отключить <glossterm>generic receive offload (GRO)</glossterm> для получения подходящей пропускной способности между вашими инстансами и внешней сетью.
zh_cn: 根据您的网络接口驱动，您可能需要禁用 <glossterm>generic receive offload (GRO)</glossterm> 来实现您实例和外部网络之间的合适吞吐量。

source: The Networking service initialization scripts expect the variable <literal>NEUTRON_PLUGIN_CONF</literal> in the <filename>/etc/sysconfig/neutron</filename> file to reference the ML2 plug-in configurarion file. Edit the <filename>/etc/sysconfig/neutron</filename> file and add the following:
zh_cn: Networking 服务的初始化脚本需要 <filename>/etc/sysconfig/neutron</filename> 文件中的 <literal>NEUTRON_PLUGIN_CONF</literal> 变量关联到 ML2 插件的配置文件。编辑 <filename>/etc/sysconfig/neutron</filename> 文件并添加以下内容：

source: Do not explicitly start the <systemitem class="service">openstack-neutron-ovs-cleanup</systemitem> service.
zh_cn: 请勿直接地启动 <systemitem class="service">openstack-neutron-ovs-cleanup</systemitem> 服务。

source: The previous section used a combination of environment variables and command options to interact with the Identity service via the <placeholder-1/> client. To increase efficiency of client operations, OpenStack supports simple client environment scripts also known as OpenRC files. These scripts typically contain common options for all clients, but also support unique options. For more information, see the <link href="http://docs.openstack.org/user-guide/content/cli_openrc.html">OpenStack User Guide</link>.
ru: В предыдущем разделе использовалась комбинация переменных среды и параметров команд для взаимодействия со службой Идентификации через клиент <placeholder-1/>. Для увеличения эффективности клиентских операций, OpenStack поддерживает простые скрипты клиенстких сред, так же известные как файлы OpenRC. Эти скрипты обычно содержат общие для всех клиентов параметры, но поддерживают и уникальные параметры. Подробнее смотрите в <link href="http://docs.openstack.org/user-guide/content/cli_openrc.html">Руководстве пользователя OpenStack</link>.
zh_cn: 前一部分使用了环境变量和命令行选项的组合来通过 <placeholder-1/> 客户端与身份认证服务进行交互。为了增加客户端操作的效率，OpenStack 支持简单的客户端环境脚本，即 OpenRC 文件。这个脚本一般包含所有客户端的常见选项，但也支持特殊的选项。要想了解更多信息，请阅读 <link href="http://docs.openstack.org/user-guide/content/cli_openrc.html">OpenStack User Guide</link>。

source: Create client environment scripts for the <literal>admin</literal> and <literal>demo</literal> tenants and users. Future portions of this guide reference these scripts to load appropriate credentials for client operations.
ru: Создайте скрипты сред для проектов и пользователей <literal>admin</literal> и <literal>demo</literal>. В дальнейшем данное руководство будет ссылаться на эти скрипты для загрузки соответствующх учётных данных для клиентских операций.
zh_cn: 为 <literal>admin</literal> 和 <literal>demo</literal> 租户及用户创建客户端环境脚本。本指南的接下来的部分会与这些脚本相关，用以加载合适的客户端操作的认证。

source: Identity ports
ru: Порты Идентификации
zh_cn: 认证端口

source: Note the two different ports used above. Port 35357 is used for administrative functions only. Port 5000 is for normal user functions and is the most commonly used.
ru: Обратите внимание на разные порты использованные выше. Порт 35357 используется только для административных функций. Порт 5000 для обычных пользовательских функций и используется чаще всего.
zh_cn: 注意上述使用的端口是不一样的。端口 35357 仅用于管理员功能。端口 5000 用于普通用户功能且是使用最多的。

source: To run clients as a certain tenant and user, you can simply load the associated client environment script prior to running them. For example, to load the location of the Identity service and <literal>admin</literal> tenant and user credentials:
ru: Для того, чтобы запускать клиенты как определённый арендатор и пользователь, вы можете просто загрузить соответствующий скрипт клиентской среды перед тем, как запустить клиент. Например, для загрузки расположения службы Идентификации и учётных данных арендатора и пользователя <literal>admin</literal>:
zh_cn: 使用特定租户和用户运行客户端，您可以在运行之前简单地加载相关客户端脚本。例如，加载身份认证服务的位置和 <literal>admin</literal> 租户及用户的凭证：

source: Legacy networking (nova-network)
ru: Старая сеть (nova-network)
zh_cn: 传统联网方式(nova-network)

source: This procedure installs the Database module on the controller node.
zh_cn: 这个过程将在控制节点上安装数据库模块。

source: This chapter assumes that you already have a working OpenStack environment with at least the following components installed: Compute, Image Service, Identity.
zh_cn: 本章节假设您已经拥有一个正在运行的 OpenStack 环境，至少安装了下列组件：Compute、镜像服务、身份认证服务。

source: To install the Database module on the controller:
zh_cn: 在控制节点上安装数据库模块：

source: Prepare OpenStack:
zh_cn: 准备 OpenStack：

source: Source the <filename>admin-openrc.sh</filename> file.
ru: Загрузите файл <filename>admin-openrc.sh</filename>.
zh_cn: Source <filename>admin-openrc.sh</filename> 文件。

source: Create a <literal>trove</literal> user that Compute uses to authenticate with the Identity service. Use the <literal>service</literal> tenant and give the user the <literal>admin</literal> role:
zh_cn: 创建一个 <literal>trove</literal> 用户，Compute 使用它通过身份认证服务进行认证。使用 <literal>service</literal> 租户并给用户分配 <literal>admin</literal> 角色：

source: Replace <replaceable>TROVE_PASS</replaceable> with a suitable password.
ru: Замените <replaceable>TROVE_PASS</replaceable> на подходящий пароль.
zh_cn: 将其中的 <replaceable>TROVE_PASS</replaceable> 替换为一个合适的密码。

source: All configuration files should be placed at <filename>/etc/trove</filename> directory. Edit the following configuration files, taking the below actions for each file:
zh_cn: 所有的配置文件应该放在 <filename>/etc/trove</filename> 目录下。编辑下列配置文件，为每个文件执行下列操作：

source: Edit the <literal>[DEFAULT]</literal> section of each file (except <filename>api-paste.ini</filename>) and set appropriate values for the OpenStack service URLs (can be handled by Keystone service catalog), logging and messaging configuration, and SQL connections:
zh_cn: 修改每个文件 (<filename>api-paste.ini</filename> 除外) 中的 <literal>[DEFAULT]</literal> 部分，并为 OpenStack 的服务 URLs (可由身份认证服务目录处理)、logging 和 messaging 配置和 SQL 连接设置合适的值：

source: Configure the Database module to use the RabbitMQ message broker by setting the following options in the <literal>[DEFAULT]</literal> configuration group of each file:
zh_cn: 配置数据库模块，通过设置下列每个文件的 <literal>[DEFAULT]</literal> 配置组中的选项来使用 RabbitMQ 的消息 broker：

source: active
zh_cn: 激活

source: You must register the Database module with the Identity service so that other OpenStack services can locate it. Register the service and specify the endpoint:
zh_cn: 您必需用身份认证服务注册数据库模块，这样，其他 OpenStack 服务才能找到它。注册服务并指定端点：

source: The OpenStack Block Storage service provides block storage devices to guest instances. The method in which the storage is provisioned and consumed is determined by the Block Storage driver, or drivers in the case of a multi-backend configuration. There are a variety of drivers that are available: NAS/SAN, NFS, iSCSI, Ceph, and more. The Block Storage API and scheduler services typically run on the controller nodes. Depending upon the drivers used, the volume service can run on controllers, compute nodes, or standalone storage nodes. For more information, see the <link href="http://docs.openstack.org/juno/config-reference/content/section_volume-drivers.html"><citetitle>Configuration Reference</citetitle></link>.
zh_cn: OpenStack 的块设备存储服务为虚拟机实例提供块设备存储设备。提供和消费存储的方法是由块存储驱动或配置了多后端的驱动所决定的。有各种各样的可用存储：NAS/SAN、NFS、iSCSI、Ceph 等。块设备存储 API 和调度服务一般运行在控制节点上。根据驱动程序的使用，卷服务可以运行在控制节点、计算节点或单个存储节点上。要了解更多信息，请阅读 <link href="http://docs.openstack.org/juno/config-reference/content/section_volume-drivers.html"><citetitle>Configuration Reference</citetitle></link>。

source: The rules described here are from the <link href="http://www.debian.org/doc/debian-policy/"><citetitle>Debian Policy Manual</citetitle></link>. If any rule described in this chapter is not respected, you have found a serious bug that must be fixed.
ja: ここに記載されたルールは <link href="http://www.debian.org/doc/debian-policy/"><citetitle>Debian Policy Manual</citetitle></link> からのものです。本章に記載された何らかのルールが関係しなければ、修正すべき深刻なバグを見つけましたことになります。
zh_cn: 这里描述的规则来自于<link href="http://www.debian.org/doc/debian-policy/"><citetitle>Debian Policy Manual</citetitle></link>。如果本章中描述的规则没有被实现，那么就是你发现了一个严重的需要更正的bug。

source: Generally, the <systemitem class="library">-common</systemitem> packages install the configuration files. For example, the <literal>glance-common</literal> package installs the <filename>glance-api.conf</filename> and <filename>glance-registry.conf</filename> files. So, for the Image Service, you must re-configure the <literal>glance-common</literal> package. The same applies for <literal>cinder-common</literal>, <literal>nova-common</literal>, and <literal>heat-common</literal> packages.
ja: 一般的に、<systemitem class="library">-common</systemitem> パッケージが設定ファイルをインストールします。例えば、<literal>glance-common</literal> パッケージが <filename>glance-api.conf</filename> と <filename>glance-registry.conf</filename> ファイルをインストールします。そのため、Image Service 用に <literal>glance-common</literal> パッケージを再設定する必要があります。同じことを <literal>cinder-common</literal>、<literal>nova-common</literal>、<literal>heat-common</literal> パッケージに適用します。
zh_cn: 通常，<systemitem class="library">-common</systemitem>包安装配置文件。例如，<literal>glance-common</literal>包将安装<filename>glance-api.conf</filename>和<filename>glance-registry.conf</filename>文件。所以，对镜像服务来说，你必须重新配置<literal>glance-common</literal>包。对<literal>cinder-common</literal>, <literal>nova-common</literal>, 和<literal>heat-common</literal>也同样处理。

source: The packages do not require pre-depends. If <systemitem class="library">dbconfig-common</systemitem> is already installed on the system, the user sees all prompts. However, you cannot define the order in which the <systemitem class="library">debconf</systemitem> screens appear. The user must make sense of it even if the prompts appear in an illogical order.
ja: パッケージは事前の依存関係を必要としません。<systemitem class="library">dbconfig-common</systemitem> がすでにシステムにインストールされていれば、すべてのプロンプトが表示されます。しかしながら、<systemitem class="library">debconf</systemitem> 画面が表示される順番を定義できません。プロンプトが非論理的な順番で表示されたときでさえ、ユーザーはその意味を理解する必要があります。
zh_cn: 这些包没有依赖包。如果<systemitem class="library">dbconfig-common</systemitem>已经在系统中安装，用户可以看到所有的提示信息。但是，你无法决定<systemitem class="library">debconf</systemitem>屏幕出现的顺序。用户必须了解提示信息可能是无序出现的。

source: The trunk version of this guide focuses on the future Kilo release and will not work for the current Juno release. If you want to install Juno, you must use the <link href="http://docs.openstack.org">Juno version</link> of this guide instead.
zh_cn: 本指南的主要致力于未来发布的 Kilo 版本，且会不适用于当前的 Juno 版本。如果您想安装 Juno 版本，您必须使用本指南的 <link href="http://docs.openstack.org">Juno 版本</link>。

source: Although most environments include Identity, Image Service, Compute, at least one networking service, and the dashboard, the Object Storage service can operate independently. If your use case only involves Object Storage, you can skip to <xref linkend="ch_swift"/> after configuring the appropriate nodes for it. However, the dashboard requires at least the Image Service and Compute.
ru: Хотя большинство сред включают службу Идентификации, Образов, Вычислений, как минимум одну сетевую службу и Панель управления, служба Хранилища Объектов может работать независимо. Если ваша задача требует только Хранилище Объектов, вы можете перейти к <xref linkend="ch_swift"/> после настройки подходящих узлов для него. Однако, Панель управления требует как минимум службы Образов и Вычислений.
zh_cn: 尽管大部分环境都包括身份认证服务、镜像服务、计算服务、至少一个网络服务以及仪表板，对象存储服务却是可以独立操作的。如果您使用的案例只涉及到对象存储，您可以在配置好合适的节点之后跳转到 <xref linkend="ch_swift"/>。但是，仪表板需要至少一个镜像服务和计算服务。

source: For more information, see the <link href="http://docs.openstack.org/admin-guide-cloud/content/ch_networking.html">Networking</link> chapter of the <citetitle>OpenStack Cloud Administrator Guide</citetitle>.
ru: Подробнее смотрите в главе <link href="http://docs.openstack.org/admin-guide-cloud/content/ch_networking.html">Сеть</link> <citetitle>Руководство администратора облака OpenStack</citetitle>.
zh_cn: 要了解更多相关信息，请阅读 <citetitle>OpenStack Cloud Administrator Guide</citetitle> 中的 <link href="http://docs.openstack.org/admin-guide-cloud/content/ch_networking.html">Networking</link> 章节。

source: Ensure the module will be loaded on every boot.
ru: Убедитесь, что модуль будет загружаться при загрузке системы.
zh_cn: 确保模块在每次启动时都会加载。

source: On openSUSE by adding <literal>nbd</literal> in the <filename>/etc/modules-load.d/nbd.conf</filename> file.
ru: На openSUSE добавив <literal>nbd</literal> в файл <filename>/etc/modules-load.d/nbd.conf</filename>.
zh_cn: 在 openSUSE 中，添加 <literal>nbd</literal> 到 <filename>/etc/modules-load.d/nbd.conf</filename> 文件中。

source: On SLES by adding or modifying the following line in the <filename>/etc/sysconfig/kernel</filename> file.
ru: На SLES добавив или изменив следующую строку в файле <filename>/etc/sysconfig/kernel</filename>.
zh_cn: 在 SLES 中，添加或修改 <filename>/etc/sysconfig/kernel</filename> 中的下列几行：

source: Add the Image Service
ru: Добавление службы Образов
zh_cn: 添加镜像服务

source: The OpenStack Image Service (glance) enables users to discover, register, and retrieve virtual machine images. It offers a <glossterm baseform="RESTful">REST</glossterm> API that enables you to query virtual machine image metadata and retrieve an actual image. You can store virtual machine images made available through the Image Service in a variety of locations, from simple file systems to object-storage systems like OpenStack Object Storage.
ru: Служба Образов OpenStack (glance) позволяет пользователям искать, регистрировать и получать образы виртуальных машин. Она предоставляет <glossterm baseform="RESTful">REST</glossterm> API, который позволяет запрашивать метаданные образа виртуальной машины и получать сам образ. Вы можете хранить образы виртуальных машин, доступных через службу Образов, в разных местах, от простой файловой системы до систем объектного хранилища, таких как Объектное Хранилище OpenStack.
zh_cn: OpenStack 的镜像服务 (glance) 允许用户发现、注册和恢复虚拟机镜像。它提供了一个 <glossterm baseform="RESTful">REST</glossterm> API，允许您查询虚拟机镜像的 metadata 并恢复一个实际的镜像。您可以存储虚拟机镜像通过不同位置的镜像服务使其可用，就像 OpenStack 对象存储那样从简单的文件系统到对象存储系统。

source: For simplicity, this guide describes configuring the Image Service to use the <literal>file</literal> back end, which uploads and stores in a directory on the controller node hosting the Image Service. By default, this directory is <filename>/var/lib/glance/images/</filename>.
ru: Для простоты, это руководство описывает конфигурацию службы Образов, которая использует <literal>файловый</literal> бэкэнд, который загружает и хранит образы в директории на управляющем узле, содержащем службу Образов. По-умолчанию, это директория <filename>/var/lib/glance/images/</filename>.
zh_cn: 简单来说，本指南描述了配置镜像服务以使用 <literal>file</literal> 后台，能够上传并存储在一个托管镜像服务的控制节点的目录中。默认情况下，这个目录是 <filename>/var/lib/glance/images/</filename>。

source: For information on requirements for other back ends, see <link href="http://docs.openstack.org/trunk/config-reference/content/ch_configuring-openstack-image-service.html"><citetitle>Configuration Reference</citetitle></link>.
ru: За информацией о требованиях для других бэкэндов обратитесь к<link href="http://docs.openstack.org/trunk/config-reference/content/ch_configuring-openstack-image-service.html"><citetitle>Справке по конфигурированию</citetitle></link>.
zh_cn: 要了解更多其他后端所需的信息，请阅读 <link href="http://docs.openstack.org/trunk/config-reference/content/ch_configuring-openstack-image-service.html"><citetitle>Configuration Reference</citetitle></link>。

source: For more information about system requirements, see the <link href="http://docs.openstack.org/ops/">OpenStack Operations Guide</link>.
ja: システム要件の詳細は <link href="http://docs.openstack.org/ops/">OpenStack 運用ガイド</link>を参照してください。
ru: Подробнее о системных требованиях читайте в <link href="http://docs.openstack.org/ops/">Руководстве по эксплуатации OpenStack</link>.
zh_cn: 要了解更多关于系统需求的信息，请阅读 <link href="http://docs.openstack.org/ops/">OpenStack 操作手册</link>。

source: OpenStack Ceilometer Daemons
ja: OpenStack Ceilometer デーモン
ru: Демоны OpenStack Ceilometer
zh_cn: OpenStack Ceilometer 守护进程

source: OpenStack Cinder Daemons
ja: OpenStack Cinder デーモン
ru: Демоны OpenStack Cinder
zh_cn: OpenStack Cinder 守护进程

source: OpenStack Glance Daemons
ja: OpenStack Glance デーモン
ru: Демоны OpenStack Glance
zh_cn: OpenStack Glance 守护进程

source: OpenStack Heat Daemons
ja: OpenStack Heat デーモン
ru: Демоны OpenStack Heat
zh_cn: OpenStack Heat 守护进程

source: OpenStack Keystone Daemons
ja: OpenStack Keystone デーモン
ru: Демоны Openstack Keystone
zh_cn: OpenStack Keystone 守护进程

source: OpenStack Neutron Daemons
ja: OpenStack Neutron デーモン
ru: Демоны OpenStack Daemons
zh_cn: OpenStack Neutron 守护进程

source: OpenStack Nova Daemons
ja: OpenStack Nova デーモン
ru: Демоны OpenStack Nova
zh_cn: OpenStack Nova 守护进程

source: OpenStack Swift Daemons
ja: OpenStack Swift デーモン
ru: Демоны OpenStack Swift
zh_cn: OpenStack Swift 守护进程

source: OpenStack Trove Daemons
zh_cn: OpenStack Trove 守护进程

source: Replace <replaceable>HEAT_PASS</replaceable> with a suitable password.
ru: Замените <replaceable>HEAT_PASS</replaceable> на подходящий пароль.
zh_cn: 将其中的 <replaceable>HEAT_PASS</replaceable> 替换为一个合适的密码。

source: Configure the Image Service
ja: Image Service の設定
zh_cn: 配置镜像服务

source: To retrieve image-oriented events and samples, configure the Image Service to send notifications to the message bus. Perform these steps on the controller node.
zh_cn: 为了获取 image-oriented 时间和样例，请配置镜像服务以发送消息给 message bus。在控制节点上执行这些步骤。

source: Restart the Image Service:
ru: Перезапустите сервисы службы Образов:
zh_cn: 重启镜像服务：

source: The following screens show an example Image Service configuration:
ja: 以下の画面は Image Service 設定の例を示します。
ru: Следующие изображения демонстрируют пример настройки службы Образов:
zh_cn: 下面屏幕抓图展示了镜像服务配置的一个例子：

source: OpenStack Installation Guide for <phrase os="rhel;centos;fedora">Red Hat Enterprise Linux 7, CentOS 7, and Fedora 20</phrase><phrase os="ubuntu">Ubuntu 14.04</phrase><phrase os="debian">Debian 7</phrase><phrase os="opensuse">openSUSE 13.1 and SUSE Linux Enterprise Server 11 SP3</phrase>
ru: Руководство по установке OpenStack для <phrase os="rhel;centos;fedora">Red Hat Enterprise Linux 7, CentOS 7, и Fedora 20</phrase><phrase os="ubuntu">Ubuntu 14.04</phrase><phrase os="debian">Debian 7</phrase><phrase os="opensuse">openSUSE 13.1 и SUSE Linux Enterprise Server 11 SP3</phrase>
zh_cn: <phrase os="rhel;centos;fedora">Red Hat Enterprise Linux 7, CentOS 7, and Fedora 20</phrase><phrase os="ubuntu">Ubuntu 14.04</phrase><phrase os="debian">Debian 7</phrase><phrase os="opensuse">openSUSE 13.1 and SUSE Linux Enterprise Server 11 SP3</phrase> 的 OpenStack 安装手册

source: OpenStack Foundation
zh_cn: OpenStack基金会

source: Added initial Debian support.
ja: Debian の初期サポートの追加。
ru: Добавлена начальная поддержка Debian.
zh_cn: 增加最初的Debian支持。

source: Havana release.
ja: Havana リリース。
ru: Выход Havana.
zh_cn: Havana发行版。

source: Add support for SUSE Linux Enterprise.
ja: SUSE Linux Enterprise のサポートの追加。
ru: Добавлена поддержка SUSE Linux Enterprise.
zh_cn: 增加SUSE 系统企业版支持

source: Complete reorganization for Havana.
ja: Havana 向け再構成の完了。
ru: Окончена реорганизация для Havana
zh_cn: 为Havana版本完成改编。

source: Build also for openSUSE.
ja: openSUSE 版の作成。
ru: Так же собрано для openSUSE.
zh_cn: 为openSUSE建造

source: Fixes to Object Storage verification steps. Fix bug <link href="https://bugs.launchpad.net/openstack-manuals/+bug/1207347">1207347</link>.
ja: Object Storage 検証手順の修正。バグ <link href="https://bugs.launchpad.net/openstack-manuals/+bug/1207347">1207347</link> の修正。
ru: Иcправлены шаги по проверке работы Object Storage. Исправлена ошибка <link href="https://bugs.launchpad.net/openstack-manuals/+bug/1207347">1207347</link>.
zh_cn: 对象存储验证步骤的改进。 更正错误<link href="https://bugs.launchpad.net/openstack-manuals/+bug/1207347">1207347</link>。
