Repository: 25hours/openstack-manuals
Catalog: doc/install-guide/locale/*.po
Languages: ja, ru, vi_vn, zh_cn

source: (Optional)
ru: (Дополнительно)
vi_vn: (Không bắt buộc)
zh_cn: (可选)

source: (Optional) To assist with troubleshooting, enable verbose logging in the <literal>[DEFAULT]</literal> section:
ru: (Дополнительно) Чтобы помочь с поиском нейсправностей, включите более детальное логирование в секции <literal>[DEFAULT]</literal>:
vi_vn: (Không bắt buộc) Để hỗ trợ xử lý sự cố, bật verbose logging trong mục <literal>[DEFAULT]</literal>:
zh_cn: (可选配置)可以在 <literal>[DEFAULT]</literal> 段中开启详细日志配置，为后期的故障排除提供帮助：

source: <package>python-keystoneclient</package> will automatically be installed as it is a dependency of the <package>keystone</package> package.
ru: <package>python-keystoneclient</package> будет автоматически установлен, поскольку от него зависит пакет <package>keystone</package>.
vi_vn: <package>python-keystoneclient</package> được tự động cài vì đây là gói phần mềm mà <package>keystone</package> phụ thuộc vào.
zh_cn: <package>python-keystoneclient</package> 会作为 <package>keystone</package> 包的依赖而被安装。

source: A flavor specifies a virtual resource allocation profile which includes processor, memory, and storage.
ru: Схема описывает выделение виртуальных ресурсов, которые включают процессор, память и хранилище.
vi_vn: Một flavor chỉ rõ một hồ sơ phân bổ nguồn lực ảo bao gồm bộ xử lý, bộ nhớ và kho lưu trữ.
zh_cn: 一个实例指定了虚拟机资源的大致分配，包括处理器、内存和存储。

source: A single disk partition on each node works for most basic installations. However, you should consider <glossterm>Logical Volume Manager (LVM)</glossterm> for installations with optional services such as Block Storage.
ru: Один дисковый раздел на каждом узле подходит для самых простых инсталляций. Однако, вам стоит рассматривать <glossterm>Logical Volume Manager (LVM)</glossterm> для инсталляций с дополнительными службами, такими как Блочное Хранилище.
vi_vn: Thường thì phân vùng một ổ đĩa duy nhất trên từng node là đủ để chạy hầu hết các cài đặt cơ bản. Tuy nhiên, bạn nên cân nhắc sử dụng <glossterm>Trình quản lý Ổ lưu trữ Logic (LVM)</glossterm> khi cài đặt các dịch vụ tùy chọn như Block Storage.

source: A virtual router passes network traffic between two or more virtual networks. Each router requires one or more <glossterm baseform="interface">interfaces</glossterm> and/or gateways that provide access to specific networks. In this case, you create a router and attach your tenant and external networks to it.
vi_vn: Một router ảo cho phép lưu thông giữa 2 hoặc nhiều mạng ảo. Mỗi router cần một hoặc nhiều <glossterm baseform="giao diện">giao diện</glossterm> và/hoặc gateway cung cấp để cung cấp truy cập vào các hệ thống mạng cụ thể. Trong trường hợp này, bạn sẽ tạo ra một router và kết nối hệ thống mạng tenant và ngoại vùng của bạn vào đó.

source: Ability to take periodic "snap shots" throughout the installation process and "roll back" to a working configuration in the event of a problem.
ru: Возможность создавать периодические "быстрые копии" во время процесса установки и "откатываться" на рабочую конфигурацию в случае проблем.
vi_vn: Khả năng "chụp lại" các trạng thái trong quá trình cài đặt và "đưa về" lại các trạng thái này khi hệ thống xảy ra sự cố.

source: Access the dashboard using a web browser: <uri os="ubuntu">http://controller/horizon</uri><uri os="debian">https://controller/</uri><uri os="rhel;centos;fedora">http://controller/dashboard</uri><uri os="sles;opensuse">http://controller</uri>.
ru: Зайдите на панель управления используя веб-обозреватель: <uri os="ubuntu">http://controller/horizon</uri><uri os="debian">https://controller/</uri><uri os="rhel;centos;fedora">http://controller/dashboard</uri><uri os="sles;opensuse">http://controller</uri>.
vi_vn: Truy cập vào dashboard sử dụng trình duyệt web: <uri os="ubuntu">http://controller/horizon</uri><uri os="debian">https://controller/</uri><uri os="rhel;centos;fedora">http://controller/dashboard</uri><uri os="sles;opensuse">http://controller</uri>.
zh_cn: 使用 web 浏览器访问仪表板: <uri os="ubuntu">http://controller/horizon</uri><uri os="debian">https://controller/</uri><uri os="rhel;centos;fedora">http://controller/dashboard</uri><uri os="sles;opensuse">http://controller</uri>。

source: Access your instance using SSH from the controller node or any host on the external network and use the <placeholder-1/> command to verify presence of the volume as the <literal>/dev/vdb</literal> block storage device:
ru: Войдите в свой инстанс по SSH с управляющего узла или любого хоста во внешней сети и исполните команду <placeholder-1/>, чтобы проверить наличие диска как блочного устройства <literal>/dev/vdb</literal>:
vi_vn: Truy cập và instance của bạn bằng cách sử dụng SSH từ node điều khiển hoặc bất kì máy vật lý nào trên hệ thống mạng ngoại vùng và sử dụng lệnh <placeholder-1/> để xác nhận sự hiện diện của ổ lưu trữ là thiết bị block storage <literal>/dev/vdb</literal>:
zh_cn: 使用 SSH 通过控制节点或任意主机的外部网络访问实例，并使用 <placeholder-1/> 命令来验证卷是否以 <literal>/dev/vdb</literal> 的块设备存储存在：

source: Access your instance using SSH from the controller node or any host on the external network:
ru: Войдите в ваш инстанс по SSH с управляющего узла или любого хоста во внешней сети:
vi_vn: Truy cập vào instance của bạn bằng cách sử dụng SSH từ node điều khiển hoặc bất kỳ máy vật lý nào trên hệ thống mạng ngoại vùng:
zh_cn: 通过控制节点或任意外部网络上的主机使用 SSH 访问您的实例：

source: Add Object Storage
ja: Object Storage の追加
ru: Добавление Объектного Хранилища
vi_vn: Thêm dịch vụ Object Storage
zh_cn: 添加对象存储

source: Add a <literal>[database]</literal> section, and configure database access:
ru: Добавьте секцию <literal>[database]</literal> и настройте доступ до базы данных:
vi_vn: Thêm vào mục <literal>[database]</literal> và cấu hình truy cập cơ sở dữ liệu:
zh_cn: 添加一个 <literal>[database]</literal> 的部分，并配置数据库的访问：

source: Add a networking component
ru: Добавление сетевых компонент
vi_vn: Thêm một thành phần networking
zh_cn: 添加网络组件

source: Add each storage node to the ring:
vi_vn: Thêm từng node lưu trữ vào ring:

source: Add rules to the <literal>default</literal> security group:
ja: <literal>default</literal> セキュリティグループにルールを追加します。
ru: Добавьте правила в группу безопасности <literal>default</literal>:
vi_vn: Thêm các luật cho nhóm bảo mật <literal>default</literal>:
zh_cn: 添加规则到 <literal>default</literal> 安全组中：

source: Add the <literal>ResellerAdmin</literal> role to the <literal>service</literal> tenant and <literal>ceilometer</literal> user:
vi_vn: Thêm role <literal>ResellerAdmin</literal> cho tenant <literal>service</literal> và user <literal>ceilometer</literal>:
zh_cn: 将 <literal>ResellerAdmin</literal> 角色添加到 <literal>service</literal> 租户并赋予给 <literal>ceilometer</literal> 用户：

source: Add the <literal>admin</literal> role to the <literal>admin</literal> project and user:
vi_vn: Thêm vai trò <literal>admin</literal> vào cho project và người dùng <literal>admin</literal>:

source: Add the <literal>admin</literal> role to the <literal>ceilometer</literal> user.
ru: Добавьте роль <literal>admin</literal> пользователю <literal>ceilometer</literal>:
vi_vn: Thêm vai trò <literal>admin</literal> vào trong người dùng <literal>ceilometer</literal>.
zh_cn: 为 <literal>ceilometer</literal> 用户添加 <literal>admin</literal> 角色。

source: Add the <literal>admin</literal> role to the <literal>cinder</literal> user:
ru: Добавьте роль <literal>admin</literal> пользователю <literal>cinder</literal>:
vi_vn: Cấp phát quyền <literal>admin</literal> cho tài khoản người dùng <literal>cinder</literal>:
zh_cn: 给 <literal>cinder</literal> 用户添加 <literal>admin</literal> 角色：

source: Add the <literal>admin</literal> role to the <literal>glance</literal> user and <literal>service</literal> project:
vi_vn: Thêm vai trò <literal>admin</literal> vào trong người dùng <literal>glance</literal> và project <literal>service</literal>:
zh_cn: 为 <literal>glance</literal> 用户和 <literal>service</literal> 项目添加 <literal>admin</literal> 角色：

source: Add the <literal>admin</literal> role to the <literal>heat</literal> user:
ru: Добавьте роль <literal>admin</literal> пользователю <literal>heat</literal>:
vi_vn: Thêm vai trò <literal>admin</literal> vào trong người dùng <literal>heat</literal>:
zh_cn: 为<literal>heat</literal>用户添加<literal>admin</literal>角色：

source: Add the <literal>admin</literal> role to the <literal>neutron</literal> user:
ru: Добавьте роль <literal>admin</literal> пользователю <literal>neutron</literal>:
vi_vn: Thêm vai trò <literal>admin</literal> vào trong người dùng <literal>neutron</literal>:
zh_cn: 为 <literal>neutron</literal> 用户添加 <literal>admin</literal> 角色：

source: Add the <literal>admin</literal> role to the <literal>nova</literal> user:
ru: Добавьте роль <literal>admin</literal> пользователю <literal>nova</literal>:
vi_vn: Thêm vai trò <literal>admin</literal> vào trong người dùng <literal>nova</literal>:
zh_cn: 为 <literal>nova</literal> 用户添加 <literal>admin</literal> 角色：

source: Add the <literal>admin</literal> role to the <literal>sahara</literal> user:
vi_vn: Thêm role <literal>admin</literal> vào người dùng <literal>sahara</literal>:

source: Add the <literal>admin</literal> role to the <literal>swift</literal> user:
ru: Добавьте роль <literal>admin</literal> пользователю <literal>swift</literal>:
vi_vn: Thêm vai trò <literal>admin</literal> vào trong người dùng <literal>swift</literal>:
zh_cn: 为<literal>swift</literal>用户添加<literal>admin</literal>角色：

source: Add the <literal>admin</literal> role to the <literal>trove</literal> user:
vi_vn: Thêm vai trò <literal>admin</literal> vào trong người dùng <literal>trove</literal>:

source: Add the <literal>heat_stack_owner</literal> role to the <literal>demo</literal> tenant and user:
ru: Добавьте роль <literal>heat_stack_owner</literal> проекту и пользователю <literal>demo</literal>:
vi_vn: Thêm vai trò <literal>heat_stack_owner</literal> vào trong tenant và người dùng <literal>demo</literal>:
zh_cn: 为 <literal>demo</literal> 租户和用户添加 <literal>heat_stack_owner</literal> 角色：

source: Add the <literal>openstack</literal> user:
vi_vn: Thêm người dùng <literal>openstack</literal>:
zh_cn: 添加<literal>openstack</literal>用户：

source: Add the <literal>swift</literal> system user to the <literal>ceilometer</literal> system group to permit access to the Telemetry configuration files by the Object Storage service:
vi_vn: Thêm người dùng hệ thống <literal>swift</literal> vào nhóm hệ thống <literal>ceilometer</literal> để cho phép truy nhập tới các file cấu hình Telemetry bởi dịch vụ Object Storage:
zh_cn: 添加 <literal>swift</literal> 的系统用户到 <literal>ceilometer</literal> 的系统组中，以允许通过对象存储服务访问 Telemetry 的配置文件：

source: Add the <literal>user</literal> role to the <literal>demo</literal> project and user:
vi_vn: Thêm role <literal>user</literal> cho dự án và người dùng <literal>demo</literal>:

source: Add the Block Storage service
ja: Block Storage Service の追加
ru: Добавление службы Блочного Хранилища
vi_vn: Thêm dịch vụ Block Storage
zh_cn: 添加块设备存储服务

source: Add the Compute service
ru: Добавление службы Вычилений
vi_vn: Thêm dịch vụ Compute
zh_cn: 添加 Compute 服务

source: Add the Data processing service
ru: Добавление службы Обработки Данных
vi_vn: Thêm dịch vụ xử lý Dữ liệu
zh_cn: 添加数据处理服务

source: Add the Database service
ru: Добавление службы Баз Данных
vi_vn: Thêm dịch vụ Database
zh_cn: 添加数据库服务

source: Add the Identity service
ru: Добавление службы Идентификации
vi_vn: Thêm dịch vụ Identity
zh_cn: 添加身份认证服务

source: Add the Image service
vi_vn: Thêm dịch vụ Image

source: Add the Orchestration module
ru: Добавление модуля Оркестровки
vi_vn: Thêm mô đun Orchestration
zh_cn: 添加 Orchestration 模块

source: Add the Telemetry module
ja: Telemetry モジュールの追加
ru: Добавление модуля Телеметрии
vi_vn: Thêm module Telemetry
zh_cn: 添加 Telemetry 模块

source: Add the dashboard
ja: Dashboard の追加
ru: Добавление Панели Управления
vi_vn: Thêm dashboard
zh_cn: 添加仪表盘（dashboard）

source: Add the following lines to <filename>trove-guestagent.conf</filename>:
vi_vn: Thêm các dòng sau vào thư mục <filename>trove-guestagent.conf</filename>:
zh_cn: 添加下列几行到 <filename>trove-guestagent.conf</filename> 文件中：

source: Add the public key to your OpenStack environment:
ru: Добавьте публичный ключ к вашей среде OpenStack:
vi_vn: Thêm khóa công khai cho môi trường OpenStack của bạn:
zh_cn: 添加公钥到您的 OpenStack 环境中：

source: Additional compute nodes should use 10.0.0.32, 10.0.0.33, and so on.
ru: Дополнительные вычислительные узлы должны использовать 10.0.0.32, 10.0.0.33, и так далее.
vi_vn: Các node tính toán thêm vào sau nên sử dụng các địa chỉ từ 10.0.0.32, 10.0.0.33 và tăng dần.
zh_cn: 另外的计算节点应使用 10.0.0.32、10.0.0.33 等等。

source: Additional compute nodes should use 10.0.1.32, 10.0.1.33, and so on.
ru: Дополнительные вычислительные узлы должны использовать 10.0.1.32, 10.0.1.33, и так далее.
vi_vn: Các node tính toán thêm vào sau nên sử dụng các địa chỉ từ 10.0.1.32, 10.0.1.33 và tăng dần.
zh_cn: 附加的计算节点需要使用10.0.1.32, 10.0.1.33等等。

source: Adjust ownership and permissions on this directory and the files in it:
vi_vn: Thay đổi chủ sở hữu và các quyền trên thư mục và các file trong nó:

source: After installing the operating system on each node for the architecture that you choose to deploy, you must configure the network interfaces. We recommend that you disable any automated network management tools and manually edit the appropriate configuration files for your distribution. For more information on how to configure networking on your distribution, see the <link os="ubuntu" xlink:href="https://help.ubuntu.com/lts/serverguide/network-configuration.html">documentation.</link><link os="debian" xlink:href="https://wiki.debian.org/NetworkConfiguration">documentation.</link><link os="rhel;centos;fedora" xlink:href="https://access.redhat.com/site/documentation/en-US/Red_Hat_Enterprise_Linux/6/html/Deployment_Guide/s1-networkscripts-interfaces.html">documentation.</link><link os="sles;opensuse" xlink:href="https://www.suse.com/documentation/sles-12/book_sle_admin/data/sec_basicnet_manconf.html">SLES 12</link><phrase os="sles;opensuse"> or </phrase><link os="sles;opensuse" xlink:href="http://activedoc.opensuse.org/book/opensuse-reference/chapter-13-basic-networking">openSUSE documentation.</link>
vi_vn: Sau khi cài đặt hệ điều hành trên từng node của kiến trúc mà bạn chọn để triển khai, bạn phải cấu hình các giao diện mạng. Chúng tôi khuyên bạn nên tắt tất cả các công cụ tự động quản lý mạng và chỉnh sửa bằng tay các file cấu hình phù hợp cho triển khai của bạn. Để biết thêm thông tin về cách cấu hình hệ thống mạng cho triển khai của bạn, xem <link os="ubuntu" xlink:href="https://help.ubuntu.com/lts/serverguide/network-configuration.html">tài liệu.</link><link os="debian" xlink:href="https://wiki.debian.org/NetworkConfiguration">tài liệu.</link><link os="rhel;centos;fedora" xlink:href="https://access.redhat.com/site/documentation/en-US/Red_Hat_Enterprise_Linux/6/html/Deployment_Guide/s1-networkscripts-interfaces.html">tài liệu.</link><link os="sles;opensuse" xlink:href="https://www.suse.com/documentation/sles-12/book_sle_admin/data/sec_basicnet_manconf.html">tài liệu SLES 12</link><phrase os="sles;opensuse"> hoặc </phrase><link os="sles;opensuse" xlink:href="http://activedoc.opensuse.org/book/opensuse-reference/chapter-13-basic-networking">openSUSE.</link>

source: After you create this file, run this command:
ja: このファイルを作成した後、このコマンドを実行します。
ru: После создания данного файла выполните следующую команду:
vi_vn: Sau khi bạn tạo file này, chạy câu lệnh:
zh_cn: 当创建这个文件后，运行下面命令：

source: After you install and configure the dashboard, you can complete the following tasks:
ru: После установки и настройки панели управления, вы можете выполнить следующие задачи:
vi_vn: Sau khi cài đặt và cấu hình dashboard bạn có thể thực hiện các tác vụ sau:
zh_cn: 安装和配置好仪表板后，您可以完成以下任务：

source: All Debian packages for API services, except the <package>heat-api</package> package, register the service in the Identity Service catalog. This feature is helpful because API endpoints are difficult to remember.
ja: すべての API サービス用の Debian パッケージは、<package>heat-api</package> パッケージを除き、Identity Service カタログにサービスを登録します。API エンドポイントは覚えにくいので、この機能は役に立ちます。
vi_vn: Tất cả các gói Debian dành cho các dịch vụ API, trừ gói <package>heat-api</package>, đều đăng ký dịch vụ trong danh mục Dịch vụ Identity. Tính năng này hữu ích bởi vì các API endpoint thường khó nhớ.
zh_cn: 所有的API服务的Debian包，除了<package>heat-api</package>包，都注册在Identity服务目录中。这很有帮助，因为API端点很难被记住。

source: All OpenStack packages are written in Python. All packages support version 2.7; porting to Python version 3 is ongoing. Note that Debian Wheezy uses Python 2.6 and 2.7, with Python 2.7 as the default interpreter; Sid has only Python 2.7. There is one packaging change between these two. In Python 2.6, you installed the <package>python-argparse</package> package separately. In Python 2.7, this package is installed by default. Unfortunately, in Python 2.7, this package does not include <code>Provides: python-argparse</code> directive.
vi_vn: Tất cả các gói OpenStack đều được viết bằng Python. Tất cả các gói đều hỗ trợ phiên bản 2.7; việc chuyển lên bản 3 đang được tiến hành. Lưu ý rằng Debian Wheezy sử dụng Python 2.6 và 2.7, với Python 2.7 là phần chuyển đổi chính; Sid chỉ có Python 2.7. Có một sự thay đổi trong việc đóng gói giữa hai phiên bản này. Trong Python 2.6, bạn cài gói <package>python-argparse</package> riêng lẻ. Trong Python 2.7, gói này được cài mặc định. Đáng tiếc rằng, trong Python 2.7, gói này không bao gồm chỉ thị <code>Provides: python-argparse</code>.
zh_cn: 所有的OpenStack包都是使用Python完成的。所有的包都支持2.7版本；针对Python 3 的移植正在进行。注意Debian Wheezy使用Python 2.6和2.7，默认解释器是Python 2.7；Sid仅有Python 2.7.在两个版本中间有一个包变化。在Python 2.6中，你需要单独安装<package>python-argparse</package>包。在Python 2.7中，这个包已经默认安装了。不幸的是，在Python 2.7中，这个包未包含 <code>Provides: python-argparse</code>指令。

source: All configuration files should be placed at the <filename>/etc/trove</filename> directory. Edit the following configuration files, taking the below actions for each file:
vi_vn: Tất cả các file cấu hình nên được đặt trong thư mục <filename>/etc/trove</filename>. Sửa các file cấu hình sau, thực hiện các công việc bên dưới đối với từng file:

source: All nodes require Internet access for administrative purposes such as package installation, security updates, <glossterm>DNS</glossterm>, and <glossterm baseform="Network Time Protocol (NTP)">NTP</glossterm>. In most cases, nodes should obtain Internet access through the management network interface. To highlight the importance of network separation, the example architectures use <link xlink:href="https://tools.ietf.org/html/rfc1918">private address space</link> for the management network and assume that network infrastructure provides Internet access via <glossterm baseform="Network Address Translation (NAT)">NAT</glossterm>. To illustrate the flexibility of <glossterm>IaaS</glossterm>, the example architectures use public IP address space for the external network and assume that network infrastructure provides direct Internet access to instances in your OpenStack environment. In environments with only one block of public IP address space, both the management and external networks must ultimately obtain Internet access using it. For simplicity, the diagrams in this guide only show Internet access for OpenStack services.
vi_vn: Tất cả các node điều yêu cầu truy cập Internet vì các mục đích quản trị như cài đặt gói, các cập nhật về bảo mật, <glossterm>DNS</glossterm>, và <glossterm baseform="Giao thức Thời Gian Mạng (NTP)">NTP</glossterm>. Trong phần lớn các trường hợp, các node nên có khả năng truy cập Internet thông qua giao diện mạng quản lý. Để làm nổi bật lên tầm quan trọng của việc chia tách các hệ thống mạng, các kiến trúc mẫu sử dụng <link xlink:href="https://tools.ietf.org/html/rfc1918">không gian địa chỉ riêng tư</link> cho hệ thống mạng quản lý và mặc định rằng cơ sở hạ tầng mạng cung cấp truy cập Internet thông qua <glossterm baseform="Network Address Translation (NAT)">NAT</glossterm>. Để thể hiện tính linh hoạt của <glossterm>IaaS</glossterm>, các kiến trúc mẫu sử dụng không gian địa chỉ IP public cho hệ thống mạng ngoại vùng và mặc định rằng cơ sở hạ tầng mạng cung cấp truy cập Internet trực tiếp tới các instance trong môi trường OpenStack của bạn. Trong các môi trường với chỉ một khối không gian địa chỉ IP public, cả hệ thống mạng quản lý và bên ngoài cuối cùng đều phải truy cập Internet sử dụng nó. Để cho đơn giản, các giản đồ trong bài hướng dẫn này chỉ thể hiện truy cập Internet cho các dịch vụ OpenStack.

source: Allow all hosts to access the dashboard:
ru: Разрешите всем хостам доступ до панели:
vi_vn: Cho phép tất cả các máy chủ vật lý truy cập vào dashboard:
zh_cn: 允许所有主机访问仪表板：

source: Also add this content to the <filename>/etc/hosts</filename> file on all other nodes in your environment.
vi_vn: Đồng thời thêm nội dung này vào file <filename>/etc/hosts</filename> trên tất cả các node khác trong môi trường của bạn.
zh_cn: 也要将这些内容添加到您环境中所有其他主机的 <filename>/etc/hosts</filename> 文件中。

source: Alternatively, if you do not want to install this package, run this script to enable remote root access:
ja: 代わりに、このパッケージをインストールしたくなければ、リモート root アクセスを有効化するために、このスクリプトを実行します。
ru: Если же вы не хотите устанавливать этот пакет, исполните следующий скрипт, чтобы включить удалённый root доступ:
vi_vn: Thay vì vậy nếu bạn không muốn cài đặt gói này, chạy đoạn script dưới đây để cho phép truy cập root từ xa:
zh_cn: 或者，如果你没有安装这个包，运行下面脚本，启用远程root访问：

source: Although most environments include Identity, Image service, Compute, at least one networking service, and the dashboard, the Object Storage service can operate independently. If your use case only involves Object Storage, you can skip to <xref linkend="ch_swift"/> after configuring the appropriate nodes for it. However, the dashboard requires at least the Image service and Compute.
vi_vn: Mặc dù phần lớn các moi trường bao gồm các dịch vụ Identity, Image, Compute, ít nhất một dich vụ networking và dashboard, thì dịch vụ Object Storage có thể thể hoạt động độc lập. Nếu use case của bạn chỉ bao gồm Object Storage, bạn có thể chuyển đến <xref linkend="ch_swift"/> sau khi cấu hình các node thích hợp cho nó. Tuy nhiên, dashboard vẫn yêu cầu ít nhất dịch vụ Image và Compute.

source: An instance is a VM that OpenStack provisions on a compute node. This guide shows you how to launch a minimal instance using the <glossterm>CirrOS</glossterm> image that you added to your environment in the <xref linkend="ch_glance"/> chapter. In these steps, you use the command-line interface (CLI) on your controller node or any system with the appropriate OpenStack client libraries. To use the dashboard, see the <link xlink:href="http://docs.openstack.org/user-guide/dashboard.html"><citetitle>OpenStack User Guide</citetitle></link>.
vi_vn: Một instance là một máy ảo mà OpenStack tạo ra trên một compute node. Hướng dẫn này sẽ chỉ cho bạn cách để khởi tạo một instance tối thiểu sử dụng Image <glossterm>CirrOS</glossterm> mà bạn đã thêm vào môi trường của bạn trong chương <xref linkend="ch_glance"/>. Trong những bước này, bạn sẽ sử dụng giao diện câu lệnh (CLI) trên controller node của bạn hoặc bất kì một hệ thống nào có tích hợp sẵn các thư viện OpenStack client phù hợp. Để sử dụng dashboard, xem tại <link xlink:href="http://docs.openstack.org/user-guide/dashboard.html"><citetitle>Hướng dẫn sử dụng OpenStack</citetitle></link>.
