Repository: 25hours/openstack-manuals
Catalog: doc/install-guide/locale/*.po
Languages: ja, ru, vi_vn, zh_cn

source: Create the account, container, and object rings. The builder command creates a builder file with a few parameters. The parameter with the value of 18 represents 2 ^ 18th, the value that the partition is sized to. Set this “partition power” value based on the total amount of storage you expect your entire ring to use. The value 3 represents the number of replicas of each object, with the last value being the number of hours to restrict moving a partition more than once.
ja: アカウント、コンテナー、オブジェクトリングを作成します。builder コマンドがいくつかのパラメーターを用いてビルダーファイルを作成します。18 という値を持つパラメーターは、パーティションの大きさが 2 の 18 乗となるを意味します。この “partition power” (パーティションのべき乗) の値は、リング全体が使用したいストレージの合計量に依存します。3 という値は各オブジェクトの複製数を表します。最後の値は一度ならずパーティションが移動することを制限する時間数です。

source: For every storage device on each node add entries to each ring:
ja: 各ノードですべてのストレージデバイスに対して、各リングに項目を追加します。

source: You must omit the optional <parameter>STORAGE_REPLICATION_NET_IP</parameter> parameter if you do not want to use dedicated network for replication.
ja: 複製のために専用のネットワークを使用したくなれば、オプションの <parameter>STORAGE_REPLICATION_NET_IP</parameter> パラメーターを省略する必要があります。

source: For example, if a storage node has a partition in Zone 1 on IP 10.0.0.1, the storage node has address 10.0.1.1 from replication network. The mount point of this partition is <filename>/srv/node/sdb1</filename>, and the path in <filename>/etc/rsyncd.conf</filename> is <filename>/srv/node/</filename>, the DEVICE would be sdb1 and the commands are:
ja: 例えば、ストレージノードが IP 10.0.0.1 でゾーン 1 にパーティションを持つならば、ストレージノードは複製ネットワークのアドレス 10.0.1.1 を持ちます。このパーティションのマウントポイントは <filename>/srv/node/sdb1</filename> です。<filename>/etc/rsyncd.conf</filename> のパスは <filename>/srv/node/</filename> です。DEVICE が sdb1 になり、コマンドは次のとおりです。

source: If you assume five zones with one node for each zone, start ZONE at 1. For each additional node, increment ZONE by 1.
ja: 各ゾーンに対して 1 つのノードを持つ 5 つのゾーンを仮定する場合、ZONE を 1 から始めます。それぞれの追加ノードに対して、ZONE を 1 増やします。

source: Verify the ring contents for each ring:
ja: 各リングのリングコンテンツを検証します。

source: Rebalance the rings:
ja: リングを再バランスします。

source: Rebalancing rings can take some time.
ja: リングの再バランスには少し時間がかかります。

source: Copy the <filename>account.ring.gz</filename>, <filename>container.ring.gz</filename>, and <filename>object.ring.gz</filename> files to each of the Proxy and Storage nodes in <filename>/etc/swift</filename>.
ja: <filename>account.ring.gz</filename>、<filename>container.ring.gz</filename>、<filename>object.ring.gz</filename> ファイルをそれぞれのプロキシノードとストレージノードの <filename>/etc/swift</filename> にコピーします。

source: Make sure the swift user owns all configuration files:
ja: swift ユーザーがすべての設定ファイルを所有していることを確認します。

source: Restart the Proxy service:
ja: プロキシサービスを再起動します。

source: Start the Proxy service and configure it to start when the system boots:
ja: プロキシサービスを起動し、システム起動時に起動するよう設定します。

source: Update the list of memcache servers in the <filename>/etc/swift/proxy-server.conf</filename> file for added proxy servers. If you run multiple memcache servers, use this pattern for the multiple IP:port listings in each proxy server configuration file:
ja: 追加のプロキシサーバーのために <filename>/etc/swift/proxy-server.conf</filename> ファイルにある memcache サーバーの一覧を更新します。複数の memcache サーバーを実行している場合、各プロキシサーバー設定ファイルで複数の IP:port の一覧に対してこのパターンを使用します。

source: Copy ring information to all nodes, including new proxy nodes. Also, ensure that the ring information gets to all storage nodes.
ja: 新しいプロキシノードを含め、すべてのノードにリング情報をコピーします。また、リング情報がすべてのストレージノードに到達していることを確認します。

source: After you sync all nodes, make sure that the admin has keys in <filename>/etc/swift</filename> and the ownership for the ring file is correct.
ja: すべてのノードを同期した後、管理者が <filename>/etc/swift</filename> にあるキーを持ち、リングファイルの所有者が正しいことを確認します。

source: Plan networking for Object Storage
ja: Object Storage 用ネットワークの計画

source: For both conserving network resources and ensuring that network administrators understand the needs for networks and public IP addresses for providing access to the APIs and storage network as necessary, this section offers recommendations and required minimum sizes. Throughput of at least 1000 Mbps is suggested.
ja: ネットワークリソースの節約のため、およびネットワーク管理者が必要に応じて API とストレージのネットワークへのアクセスを提供するためのネットワークとパブリック IP アドレスの必要性について確実に理解するために、このセクションは推奨量と必須の最小量を提供します。少なくとも 1000 Mbps のスループットが推奨されます。

source: A mandatory storage network. Not accessible from outside the cluster. All nodes connect to this network.
ja: 必須のストレージネットワーク。クラスターの外部からアクセスできません。すべてのノードがこのネットワークに接続されます。

source: This guide describes the following networks:<placeholder-1/>
ja: このガイドは以下のネットワークを記載します。 <placeholder-1/>

source: If you configure a replication network in the Ring, the Account, Container and Object servers listen on both the <literal>STORAGE_LOCAL_NET</literal> and <literal>STORAGE_REPLICATION_NET</literal> IP addresses. The rsync daemon only listens on the <literal>STORAGE_REPLICATION_NET</literal> IP address.
ja: リングで複製ネットワークを設定する場合、アカウントサーバー、コンテナーサーバー、オブジェクトサーバーが <literal>STORAGE_LOCAL_NET</literal> と <literal>STORAGE_REPLICATION_NET</literal> の IP アドレスをリッスンします。rsync デーモンは <literal>STORAGE_REPLICATION_NET</literal> IP アドレスのみをリッスンします。

source: Public Network (Publicly routable IP range)
ja: パブリックネットワーク (パブリックにルーティング可能な IP 範囲)

source: Provides public IP accessibility to the API endpoints within the cloud infrastructure.
ja: クラウドインフラストラクチャーの中で API エンドポイントにアクセス可能なパブリック IP を提供します。

source: Minimum size: one IP address for each proxy server.
ja: 最小量: 各プロキシサーバーに対して IP アドレス 1 つ。

source: Storage Network (RFC1918 IP Range, not publicly routable)
ja: ストレージネットワーク (RFC1918 IP 範囲、パブリックにルーティングできません)

source: Manages all inter-server communications within the Object Storage infrastructure.
ja: Object Storage インフラストラクチャーの中ですべてのサーバー間通信を管理します。

source: Minimum size: one IP address for each storage node and proxy server.
ja: 最小量: 各ストレージノードとプロキシサーバーに対して IP アドレス 1 つ。

source: Recommended size: as above, with room for expansion to the largest your cluster size. For example, 255 or CIDR /24.
ja: 推奨量: 上のとおり、クラスターの最大量に拡張するための余地を持ちます。例えば、255 や CIDR /24 です。

source: Replication Network (RFC1918 IP Range, not publicly routable)
ja: 複製ネットワーク (RFC1918 IP 範囲、パブリックにルーティングできません)

source: Manages replication-related communications among storage servers within the Object Storage infrastructure.
ja: Object Storage インフラストラクチャーの中でストレージサーバー間の複製関連の通信を管理します。

source: Recommended size: as for <literal>STORAGE_LOCAL_NET</literal>.
ja: 推奨量: <literal>STORAGE_LOCAL_NET</literal> に限ります。

source: To increase reliability and performance, you can add additional proxy servers.
ja: 信頼性とパフォーマンスを向上させるために、追加のプロキシノードを追加できます。

source: Install Object Storage
ja: Object Storage のインストール

source: Though you can install OpenStack Object Storage for development or testing purposes on one server, a multiple-server installation enables the high availability and redundancy you want in a production distributed object storage system.
ja: OpenStack Object Storage を開発もしくはテスト目的で一つのサーバーにインストールすることができますが、複数のサーバーにインストールすることで、本番環境の分散オブジェクトストレージシステムに期待する高可用性と冗長性を実現できます。

source: To perform a single-node installation for development purposes from source code, use the Swift All In One instructions (Ubuntu) or DevStack (multiple distros). See <link href="http://swift.openstack.org/development_saio.html">http://swift.openstack.org/development_saio.html</link> for manual instructions or <link href="http://devstack.org">http://devstack.org</link> for all-in-one including authentication with the Identity Service (keystone).
ja: 開発目的でソースコードから単一ノードのインストールを実行するために、 Swift All In One 手順 (Ubuntu) や DevStack (複数のディストリビューション) を使用します。手動インストールは <link href="http://swift.openstack.org/development_saio.html">http://swift.openstack.org/development_saio.html</link> を参照してください。Identity Service (keystone) を用いた認証を含む、オールインワンは <link href="http://devstack.org">http://devstack.org</link> を参照してください。

source: Have a copy of the operating system installation media available if you are installing on a new server.
ja: 新規サーバーにインストールしている場合、利用可能なオペレーティングシステムのインストールメディアを準備します。

source: These steps assume you have set up repositories for packages for your operating system as shown in <link linkend="basics-packages">OpenStack Packages</link>.
ja: これらの手順は <link linkend="basics-packages">OpenStack パッケージ</link>に示されている、お使いのオペレーティングシステム用のパッケージのリポジトリをセットアップしていることを仮定します。

source: This document demonstrates how to install a cluster by using the following types of nodes:
ja: このドキュメントは以下の種類のノードを使用したクラスターをインストールする方法を説明しています。

source: One proxy node which runs the swift-proxy-server processes. The proxy server proxies requests to the appropriate storage nodes.
ja: swift-proxy-server プロセスを実行する 1 台のプロキシノード。このプロキシサーバーは適切なストレージノードにリクエストを中継します。

source: Five storage nodes that run the swift-account-server, swift-container-server, and swift-object-server processes which control storage of the account databases, the container databases, as well as the actual stored objects.
ja: swift-account-server、swift-container-server、swift-object-server プロセスを実行する 5 台のストレージノード。これはアカウントデータベース、コンテナーデータベース、実際のオブジェクトの保存を制御します。

source: Fewer storage nodes can be used initially, but a minimum of five is recommended for a production cluster.
ja: 最初はより少ない台数のストレージノードを使用することができますが、本番環境のクラスターは少なくとも 5 台が推奨されます。

source: General installation steps
ja: 一般的なインストール手順

source: Create a <literal>swift</literal> user that the Object Storage Service can use to authenticate with the Identity Service. Choose a password and specify an email address for the <literal>swift</literal> user. Use the <literal>service</literal> tenant and give the user the <literal>admin</literal> role:
ja: Object Storage Service が Identity Service で認証するために使用する <literal>swift</literal> ユーザーを作成します。<literal>swift</literal> ユーザー用のパスワードと電子メールアドレスを選択します。<literal>service</literal> プロジェクトを使用し、ユーザーに <literal>admin</literal> ロールを与えます。

source: Create a service entry for the Object Storage Service:
ja: Object Storage Service のサービスエントリーを作成します。

source: Specify an API endpoint for the Object Storage Service by using the returned service ID. When you specify an endpoint, you provide URLs for the public API, internal API, and admin API. In this guide, the <literal>controller</literal> host name is used:
ja: 返されたサービス ID を使用することにより、Object Storage Service の API エンドポイントを指定します。エンドポイントを指定するとき、パブリック API、内部 API、管理 API の URL を指定します。このガイドでは、<literal>controller</literal> というホスト名を使用します。

source: Create the configuration directory on all nodes:
ja: すべてのノードに設定用ディレクトリを作成します。

source: Create <filename>/etc/swift/swift.conf</filename> on all nodes:
ja: すべてのノードで <filename>/etc/swift/swift.conf</filename> を作成します。

source: The suffix value in <filename>/etc/swift/swift.conf</filename> should be set to some random string of text to be used as a salt when hashing to determine mappings in the ring. This file must be the same on every node in the cluster!
ja: <filename>/etc/swift/swift.conf</filename> のサフィックス値は、リングでマッピングを決めるためのハッシュをするときに、ソルトとして使用するために何かランダムな文字列に設定すべきです。このファイルはクラスター上のすべてのノードで同じにする必要があります。

source: Next, set up your storage nodes and proxy node. This example uses the Identity Service for the common authentication piece.
ja: 次にストレージノードとプロキシノードをセットアップします。この例では、共通の認証部品として Identity Service を使用します。

source: Start services on the storage nodes
ja: ストレージノードでのサービスの起動

source: Now that the ring files are on each storage node, you can start the services. On each storage node, run the following command:
ja: これで、リングファイルが各ストレージノードに存在するので、サービスを起動できます。各ストレージノードで以下のコマンドを実行します。

source: To start all swift services at once, run the command:
ja: すべての Swift サービスを起動するために、次のコマンドを実行します。

source: To know more about <literal>swift-init</literal> command, run:
ja: <literal>swift-init</literal> コマンドについて詳しく知りたい場合、以下を実行します。

source: Install and configure storage nodes
ja: ストレージノードのインストールと設定

source: For each device on the node that you want to use for storage, set up the XFS volume (<literal>/dev/sdb</literal> is used as an example). Use a single partition per drive. For example, in a server with 12 disks you may use one or two disks for the operating system which should not be touched in this step. The other 10 or 11 disks should be partitioned with a single partition, then formatted in XFS.
ja: ストレージ用に使用したいノードで各デバイスに対して、XFS ボリュームをセットアップします (例として <literal>/dev/sdb</literal> が使用されます)。ドライブに単一のパーティションを使用します。例えば、12 本のディスクを持つサーバーで、この手順で触れませんが、オペレーティングシステム用に1〜2 本のディスクを使用するかもしれません。他の 10〜11 本のディスクは単一のパーティションを持ち、XFS でフォーマットされるべきです。

source: Create <filename>/etc/rsyncd.conf</filename>:
ja: <filename>/etc/rsyncd.conf</filename> を作成します。

source: Replace the content of <filename>/etc/rsyncd.conf</filename> with:
ja: <filename>/etc/rsyncd.conf</filename> の内容を以下で置き換えます。

source: (Optional) If you want to separate rsync and replication traffic to replication network, set <literal>STORAGE_REPLICATION_NET_IP</literal> instead of <literal>STORAGE_LOCAL_NET_IP</literal>:
ja: (オプション) rsync と複製の通信を複製ネットワークと分離したい場合、<literal>STORAGE_LOCAL_NET_IP</literal> の代わりに <literal>STORAGE_REPLICATION_NET_IP</literal> を設定します。

source: Edit the following line in <filename>/etc/default/rsync</filename>:
ja: <filename>/etc/default/rsync</filename> で以下の行を編集します。

source: Edit the following line in <filename>/etc/xinetd.d/rsync</filename>:
ja: <filename>/etc/xinetd.d/rsync</filename> で以下の行を編集します。

source: Start the <systemitem class="service">xinetd</systemitem> service:
ja: <systemitem class="service">xinetd</systemitem> サービスを起動します。

source: The rsync service requires no authentication, so run it on a local, private network.
ja: rsync サービスは認証を必要としないため、ローカルのプライベートネットワークで実行します。

source: Create the swift recon cache directory and set its permissions:
ja: swift recon キャッシュディレクトリを作成し、そのパーミッションを設定します。

source: <emphasis role="bold">Hardware</emphasis>: OpenStack Object Storage is designed to run on commodity hardware.
ja: <emphasis role="bold">ハードウェア</emphasis>: OpenStack Object Storage は一般的なハードウェアで実行するために設計されています。

source: When you install only the Object Storage and Identity Service, you cannot use the dashboard unless you also install Compute and the Image Service.
ja: Object Storage と Identity Service のみをインストールするとき、Compute と Image Service もインストールしなければ、ダッシュボードを使用できません。

source: Hardware recommendations
ja: ハードウェア推奨事項

source: Recommended Hardware
ja: 推奨ハードウェア

source: Object Storage object servers
ja: Object Storage オブジェクトサーバー

source: Processor: dual quad core
ja: プロセッサー: 4 コア 2 個

source: Memory: 8 or 12 GB RAM
ja: メモリ: 8 〜 12 GB RAM

source: Disk space: optimized for cost per GB
ja: ディスク容量: 容量単価に最適なもの

source: Network: one 1 GB Network Interface Card (NIC)
ja: ネットワーク: 1 GB NIC 1 個

source: The amount of disk space depends on how much you can fit into the rack efficiently. You want to optimize these for best cost per GB while still getting industry-standard failure rates. At Rackspace, our storage servers are currently running fairly generic 4U servers with 24 2T SATA drives and 8 cores of processing power. RAID on the storage drives is not required and not recommended. Swift's disk usage pattern is the worst case possible for RAID, and performance degrades very quickly using RAID 5 or 6.
ja: ディスクの合計容量はどのくらいラック効率良く収容できるかに依存します。エンタープライズ向けの一般的な故障率を達成しながら、GB 単価に最適なものにしたいです。Rackspace の場合、ストレージサーバーは現在、24 本の 2TB SATA ディスクと 8 コアのプロセッサーを持つごく一般的な 4U サーバーを実行しています。ストレージディスクの RAID は必要ではなく、推奨しません。Swift のディスク利用パターンは RAID に対して考えられる最悪のケースです。RAID 5 や 6 を使用すると、パフォーマンスが非常にすぐに劣化します。

source: As an example, Rackspace runs Cloud Files storage servers with 24 2T SATA drives and 8 cores of processing power. Most services support either a worker or concurrency value in the settings. This allows the services to make effective use of the cores available.
ja: 例として、Rackspace は 24 本の 2TB SATA ディスクと 8 コアのプロセッサーを持つ Cloud Files ストレージサーバーを稼働しています。多くのサービスは、設定でワーカーと多重度をサポートします。これにより、サービスが利用可能なコアを効率的に使用できます。

source: Object Storage container/account servers
ja: Object Storage コンテナー/アカウントサーバー

source: Optimized for IOPS due to tracking with SQLite databases.
ja: SQLite データベースと関わるため IOPS に最適化します。

source: Object Storage proxy server
ja: Object Storage プロキシサーバー

source: Network: one 1 GB Network Interface Card (NIC)
ja: ネットワーク: 1 GB NIC 1 個

source: Higher network throughput offers better performance for supporting many API requests.
ja: より高いネットワークスループットにより、多くの API リクエストをサポートするためのより良いパフォーマンスを提供します。

source: Optimize your proxy servers for best CPU performance. The Proxy Services are more CPU and network I/O intensive. If you are using 10 GB networking to the proxy, or are terminating SSL traffic at the proxy, greater CPU power is required.
ja: 最高の CPU パフォーマンスのためにプロキシサーバーを最適化します。プロキシサービスはより多くの CPU 処理とネットワーク I/O 集中が発生します。10 ギガネットワークをプロキシに使用している場合、または SSL 通信をプロキシで終了している場合、さらに多くの CPU パワーが必要になります。

source: <emphasis role="bold">Operating system</emphasis>: OpenStack Object Storage currently runs on Ubuntu, RHEL, CentOS, Fedora, openSUSE, or SLES.
ja: <emphasis role="bold">オペレーティングシステム</emphasis>: OpenStack Object Storage は現在 Ubuntu、RHEL、CentOS、Fedora、openSUSE、SLES で動作します。

source: <emphasis role="bold">Networking</emphasis>: 1 Gbps or 10 Gbps is suggested internally. For OpenStack Object Storage, an external network should connect the outside world to the proxy servers, and the storage network is intended to be isolated on a private network or multiple private networks.
ja: <emphasis role="bold">ネットワーク</emphasis>: 内部的に 1Gpbs か 10 Gbps が推奨されます。OpenStack Object Storage の場合には、外部ネットワークが外部とプロキシサーバーを接続すべきです。また、ストレージネットワークがプライベートネットワークで分離されていることを意図しています。

source: <emphasis role="bold">Database</emphasis>: For OpenStack Object Storage, a SQLite database is part of the OpenStack Object Storage container and account management process.
ja: <emphasis role="bold">データベース</emphasis>: OpenStack Object Storage の場合には、SQLite データベースが OpenStack Object Storage のコンテナーとアカウントの管理プロセスの一部です。

source: <emphasis role="bold">Permissions</emphasis>: You can install OpenStack Object Storage either as root or as a user with sudo permissions if you configure the sudoers file to enable all the permissions.
ja: <emphasis role="bold">権限</emphasis>: OpenStack Object Storage を root としてインストールできます。または、すべての権限を有効化するよう sudoers ファイルを設定する場合、sudo 権限を持つユーザーとしてインストールできます。

source: translator-credits
ja: Akihiro MOTOKI <amotoki@gmail.com>, 2013 thatsdone <masanori.itoh@gmail.com>, 2013 doki701 <tokidokidokidoki@gmail.com>, 2013 Tomoyuki KATO <tomo@dream.daynight.jp>, 2012-2014
ru: Ainur Shakirov <shakirov.aynur@cg.ru>, 2014 Aleksey Rusetskiy <fenuks@fenuks.ru>, 2015

source: Edit the <filename>/etc/mysql/my.cnf</filename> file and complete the following actions:
ru: Отредактируйте файл <filename>/etc/mysql/my.cnf</filename> следующим образом:

source: Add <literal>ResellerAdmin</literal> to the <literal>operator_roles</literal> parameter of that same file:
ru: Добавьте <literal>ResellerAdmin</literal> в параметр <literal>operator_roles</literal> того же файла:

source: To configure the Compute agent for Telemetry
ru: Для настройки агента Compute для Telemetry

source: Comment out the <literal>auth_host</literal>, <literal>auth_port</literal>, and <literal>auth_protocol</literal> keys, since they are replaced by the <literal>identity_uri</literal> and <literal>auth_uri</literal> keys.
ru: Закомментируйте ключи <literal>auth_host</literal>, <literal>auth_port</literal> и <literal>auth_protocol</literal>, поскольку они заменяются ключами <literal>identity_uri</literal> и <literal>auth_uri</literal>.

source: Restart the Telemetry service:
ru: Перезапустите службу Телеметрии:

source: Edit <filename>/etc/cinder/cinder.conf</filename> and add in the <literal>[DEFAULT]</literal> section on the controller and volume nodes:
ru: Отредактируйте файлы <filename>/etc/cinder/cinder.conf</filename> и добавьте в секцию <literal>[DEFAULT]</literal> на управляющем узле и узле дисков:

source: Restart the Block Storage services with their new settings.
ru: Перезапустите сервисы службы Блочного Хранения с новыми настройками.

source: On the controller node:
ru: На Управляющем узле:

source: On the storage node:
ru: На узле хранения:

source: If you want to collect OpenStack Block Storage notification on demand, you can use <placeholder-1/> from OpenStack Block Storage. For more information, <link href="http://docs.openstack.org/admin-guide-cloud/content/section_telemetry-cinder-audit-script.html"><citetitle>Block Storage audit script setup to get notifications</citetitle></link>.
ru: Если вы хотите собирать оповещения Блочного Хранилища OpenStack по требованию, вы можете использовать <placeholder-1/> с Блочного Хранилища OpenStack. Подробнее смотрите <link href="http://docs.openstack.org/admin-guide-cloud/content/section_telemetry-cinder-audit-script.html"><citetitle>скрипт настройки аудита Блочного Хранилища для получения оповещений</citetitle></link>.

source: This section describes how to verify operation of the Image Service using <link href="http://launchpad.net/cirros">CirrOS</link>, a small Linux image that helps you test your OpenStack deployment.
ru: Этот раздел описывает, как проверить работу сервиса Образов используя <link href="http://launchpad.net/cirros">CirrOS</link>, небольшой Linux-образ, который поможет вам протестировать установку OpenStack.

source: Create and change into a temporary local directory:
ru: Создайте временную локальную директорию и перейдите в неё:

source: Download the image to the temporary local directory:
ru: Скачайте образ во временную локальную директорию:

source: For information about the parameters for the <placeholder-1/> command, see <link href="http://docs.openstack.org/cli-reference/content/glanceclient_commands.html#glanceclient_subcommand_image-create">Image Service command-line client</link> in the <citetitle>OpenStack Command-Line Interface Reference</citetitle>.
ru: За информацией о параметрах команды <placeholder-1/> обратитесь к разделу <link href="http://docs.openstack.org/cli-reference/content/glanceclient_commands.html#glanceclient_subcommand_image-create">клиент коммандной строки службы Образов</link> в <citetitle>Справке по интерфейсу коммандной строки OpenStack</citetitle>.

source: Remove the temporary local directory:
ru: Удалите временную локальную директорию:

source: Lengthy output that includes a token value verifies operation for the <literal>admin</literal> tenant and user.
ru: Длинный вывод, который включает значение токена, подтвреждает работоспособность для проекта и пользователя <literal>admin</literal>.
