Repository: 25hours/openstack-manuals
Catalog: doc/install-guide/locale/*.po
Languages: ja, ru, vi_vn, zh_cn

source: Edit the <filename>/etc/default/rsync</filename> file and enable the <systemitem role="service">rsync</systemitem> service:
ru: Отредактируйте файл <filename>/etc/default/rsync</filename> и включите службу <systemitem role="service">rsync</systemitem>:
vi_vn: Chỉnh sửa thư mục <filename>/etc/default/rsync</filename> và bật dịch vụ <systemitem role="service">rsync</systemitem>:
zh_cn: 修改 <filename>/etc/default/rsync</filename> 文件并启用 <systemitem role="service">rsync</systemitem> 服务：

source: Edit the <filename>/etc/fstab</filename> file and add the following to it:
ru: Добавьте в файл <filename>/etc/fstab</filename> следующее:
vi_vn: Chỉnh sửa thư mục <filename>/etc/fstab</filename> và chèn thêm các thông tin sau:
zh_cn: 编辑 <filename>/etc/fstab</filename> 文件并添加下列内容：

source: Edit the <filename>/etc/glance/glance-api.conf</filename> and <filename>/etc/glance/glance-registry.conf</filename> files and complete the following actions:
vi_vn: Sửa file <filename>/etc/glance/glance-api.conf</filename> và <filename>/etc/glance/glance-registry.conf</filename> và hoàn thành các công việc sau:
zh_cn: 修改配置文件 <filename>/etc/glance/glance-api.conf</filename> 和 <filename>/etc/glance/glance-registry.conf</filename>，并完成以下操作：

source: Edit the <filename>/etc/glance/glance-api.conf</filename> file and complete the following actions:
ru: Отредактируйте файл <filename>/etc/glance/glance-api.conf</filename> следующим образом:
vi_vn: Sửa file <filename>/etc/glance/glance-api.conf</filename> và hoàn thành các công việc sau:
zh_cn: 修改配置文件 <filename>/etc/glance/glance-api.conf</filename> 并完成以下操作：

source: Edit the <filename>/etc/glance/glance-registry.conf</filename> file and complete the following actions:
ru: Отредактируйте файл <filename>/etc/glance/glance-registry.conf</filename> следующим образом:
vi_vn: Sửa file <filename>/etc/glance/glance-registry.conf</filename> và hoàn thành các công việc sau:
zh_cn: 修改配置文件 <filename>/etc/glance/glance-registry.conf</filename> 并完成以下操作：

source: Edit the <filename>/etc/heat/heat.conf</filename> file and complete the following actions:
ru: Отредактируйте файл <filename>/etc/heat/heat.conf</filename> следующим образом:
vi_vn: Sửa file <filename>/etc/heat/heat.conf</filename> và hoàn thành các công việc sau:
zh_cn: 修改配置文件 <filename>/etc/heat/heat.conf</filename> 并完成以下操作：

source: Edit the <filename>/etc/hosts</filename> file to contain the following:
ru: Отредактируйте файл <filename>/etc/hosts</filename>, чтобы он содержал следующее:
vi_vn: Sửa file <filename>/etc/hosts</filename> để chứa các phần sau:
zh_cn: 修改文件 <filename>/etc/hosts</filename> 并包含如下内容：

source: Edit the <filename>/etc/keystone/keystone.conf</filename> file and complete the following actions:
ru: Отредактируйте файл <filename>/etc/keystone/keystone.conf</filename> следующим образом:
vi_vn: Sửa file <filename>/etc/keystone/keystone.conf</filename> và thực hiện các thao tác sau:
zh_cn: 编辑 <filename>/etc/keystone/keystone.conf</filename> ，并完成下列操作：

source: Edit the <filename>/etc/mongodb.conf</filename> file and complete the following actions:
ru: Отредактируйте файл <filename>/etc/mongodb.conf</filename> следующим образом:
vi_vn: Sửa file <filename>/etc/mongodb.conf</filename> và hoàn thành các công việc sau:
zh_cn: 修改配置文件 <filename>/etc/mongodb.conf</filename> 并完成以下操作：

source: Edit the <filename>/etc/network/interfaces</filename> file to contain the following:
ru: Отредактируйте файл <filename>/etc/network/interfaces</filename>, чтобы он содержал следующее:
vi_vn: Sửa file <filename>/etc/network/interfaces</filename> để bao gồm phần sau:
zh_cn: 修改配置 <filename>/etc/network/interfaces</filename> 包含如下内容：

source: Edit the <filename>/etc/neutron/dhcp_agent.ini</filename> file and complete the following action:
ru: Отредактируйте файл <filename>/etc/neutron/dhcp_agent.ini</filename> следующим образом:
vi_vn: Sửa file <filename>/etc/neutron/dhcp_agent.ini</filename> và hoàn thành các công việc sau:
zh_cn: 修改配置文件 <filename>/etc/neutron/dhcp_agent.ini</filename> 并完成以下操作：

source: Edit the <filename>/etc/neutron/dhcp_agent.ini</filename> file and complete the following actions:
ru: Отредактируйте файл <filename>/etc/neutron/dhcp_agent.ini</filename> следующим образом:
vi_vn: Sửa file <filename>/etc/neutron/dhcp_agent.ini</filename> và hoàn thành các công việc sau:
zh_cn: 修改配置文件 <filename>/etc/neutron/dhcp_agent.ini</filename> 并完成以下操作：

source: Edit the <filename>/etc/neutron/l3_agent.ini</filename> file and complete the following actions:
ru: Отредактируйте файл <filename>/etc/neutron/l3_agent.ini</filename> следующим образом:
vi_vn: Sửa file <filename>/etc/neutron/l3_agent.ini</filename> và hoàn thành các công việc sau:
zh_cn: 修改配置文件 <filename>/etc/neutron/l3_agent.ini</filename> 并完成以下操作：

source: Edit the <filename>/etc/neutron/metadata_agent.ini</filename> file and complete the following actions:
ru: Отредактируйте файл <filename>/etc/neutron/metadata_agent.ini</filename> следующим образом:
vi_vn: Sửa file <filename>/etc/neutron/metadata_agent.ini</filename> và hoàn thành các công việc sau:
zh_cn: 修改配置文件 <filename>/etc/neutron/metadata_agent.ini</filename> 并完成以下操作：

source: Edit the <filename>/etc/neutron/neutron.conf</filename> file and complete the following actions:
ru: Отредактируйте файл <filename>/etc/neutron/neutron.conf</filename> следующим образом:
vi_vn: Sửa file <filename>/etc/neutron/neutron.conf</filename> và hoàn thành các công việc sau:
zh_cn: 修改配置文件 <filename>/etc/neutron/neutron.conf</filename> 并完成以下操作：

source: Edit the <filename>/etc/neutron/plugins/ml2/ml2_conf.ini</filename> file and complete the following actions:
ru: Отредактируйте файл <filename>/etc/neutron/plugins/ml2/ml2_conf.ini</filename> следующим образом:
vi_vn: Sửa file <filename>/etc/neutron/plugins/ml2/ml2_conf.ini</filename> và hoàn thành các công việc sau:
zh_cn: 修改配置文件 <filename>/etc/neutron/plugins/ml2/ml2_conf.ini</filename> 并完成以下操作：

source: Edit the <filename>/etc/nova/nova.conf</filename> file and complete the following actions:
ru: Отредактируйте файл <filename>/etc/nova/nova.conf</filename> следующим образом:
vi_vn: Sửa file <filename>/etc/nova/nova.conf</filename> và hoàn thành các công việc sau:
zh_cn: 修改配置文件 <filename>/etc/nova/nova.conf</filename> 并完成如下操作：

source: Edit the <filename>/etc/nova/nova.conf</filename> file and configure notifications in the <literal>[DEFAULT]</literal> section:
vi_vn: Sửa tập tin <filename>/etc/nova/nova.conf</filename> và cấu hình thông báo trong mục <literal>[DEFAULT]</literal>:
zh_cn: 修改配置文件 <filename>/etc/nova/nova.conf</filename> 并在 <literal>[DEFAULT]</literal> 部分配置消息机制：

source: Edit the <filename>/etc/nova/nova.conf</filename> file on the controller node and complete the following actions:
vi_vn: Sửa file <filename>/etc/nova/nova.conf</filename> trên node điều khiển và hoàn thành các công việc sau:
zh_cn: 修改控制节点上的配置文件 <filename>/etc/nova/nova.conf</filename>，并完成以下操作：

source: Edit the <filename>/etc/ntp.conf</filename> file and add, change, or remove the following keys as necessary for your environment:
ru: Отредактируйте файл <filename>/etc/ntp.conf</filename>, добавив, изменив или удалив по необходимости следующие ключи в соответствии с требованиями вашей среды:
vi_vn: Chỉnh sửa thư mục <filename>/etc/ntp.conf</filename> và thêm, thay đổi, hoặc xóa các khóa sau đây nếu như việc đó là cần thiết đối với môi trường của bạn:
zh_cn: 修改配置文件 <filename>/etc/ntp.conf</filename> 并根据您环境的需要添加、修改或删除以下关键字：

source: Edit the <filename>/etc/ntp.conf</filename> file:
ru: Отредактируйте файл <filename>/etc/ntp.conf</filename>:
vi_vn: Chỉnh sửa thư mục <filename>/etc/ntp.conf</filename>:
zh_cn: 修改配置文件 <filename>/etc/ntp.conf</filename>：

source: Edit the <filename>/etc/openstack-dashboard/local_settings.py</filename> file and complete the following actions:
ru: Отредактируйте файл <filename>/etc/openstack-dashboard/local_settings.py</filename> следующим образом:
vi_vn: Sửa file <filename>/etc/openstack-dashboard/local_settings.py</filename> và hoàn thành các công việc sau:
zh_cn: 修改配置文件 <filename>/etc/openstack-dashboard/local_settings.py</filename> 并完成以下操作：

source: Edit the <filename>/etc/openstack-dashboard/local_settings</filename> file and complete the following actions:
ru: Отредактируйте файл <filename>/etc/openstack-dashboard/local_settings</filename> следующим образом:
vi_vn: Sửa file <filename>/etc/openstack-dashboard/local_settings</filename> và hoàn thành các công việc sau:
zh_cn: 修改配置文件 <filename>/etc/openstack-dashboard/local_settings</filename> 并完成以下操作：

source: Edit the <filename>/etc/rsyncd.conf</filename> file and add the following to it:
ru: Отредактируйте файл <filename>/etc/rsyncd.conf</filename> и добавьте следующее:
vi_vn: Chỉnh sửa thư mục <filename>/etc/rsyncd.conf</filename> và chèn thêm nội dung sau:
zh_cn: 添加以下内容到<filename>/etc/rsyncd.conf</filename>文件中：

source: Edit the <filename>/etc/swift/account-server.conf</filename> file and complete the following actions:
ru: Отредактируйте файл <filename>/etc/swift/account-server.conf</filename> следующим образом:
vi_vn: Chỉnh sửa thư mục <systemitem class="service">rsyncd</systemitem> và hoàn thiện các thao tác sau:
zh_cn: 修改配置文件 <filename>/etc/swift/account-server.conf</filename> 并完成以下操作：

source: Edit the <filename>/etc/swift/container-server.conf</filename> file and complete the following actions:
ru: Отредактируйте файл <filename>/etc/swift/container-server.conf</filename> следующим образом:
vi_vn: Chỉnh sửa thư mục <filename>/etc/swift/container-server.conf</filename> và hoàn thiện các bước sau:
zh_cn: 修改配置文件 <filename>/etc/swift/container-server.conf</filename> 并完成以下操作：

source: Edit the <filename>/etc/swift/object-server.conf</filename> file and complete the following actions:
ru: Отредактируйте файл <filename>/etc/swift/object-server.conf</filename> следующим образом:
vi_vn: Chỉnh sửa thư mục <filename>/etc/swift/object-server.conf</filename> và hoàn thiện các bước sau:
zh_cn: 修改配置文件 <filename>/etc/swift/object-server.conf</filename> 并完成以下操作：

source: Edit the <filename>/etc/swift/proxy-server.conf</filename> file and complete the following actions:
ru: Отредактируйте файл <filename>/etc/swift/proxy-server.conf</filename> следующим образом:
vi_vn: Chỉnh sửa file <filename>/etc/swift/proxy-server.conf</filename> và hoàn tất các thao tác sau:
zh_cn: 修改配置文件 <filename>/etc/swift/proxy-server.conf</filename> 并完成以下步骤：

source: Edit the <filename>/etc/swift/swift.conf</filename> file and complete the following actions:
ru: Отредактируйте файл <filename>/etc/swift/swift.conf</filename> следующим образом:
vi_vn: Sửa file <filename>/etc/swift/swift.conf</filename> và hoàn thành các công việc sau:
zh_cn: 修改配置文件 <filename>/etc/swift/swift.conf</filename> 并完成以下操作：

source: Edit the <filename>/etc/sysconfig/apache2</filename> file and configure the <literal>APACHE_SERVERNAME</literal> option to reference the controller node:
vi_vn: Sửa file <filename>/etc/sysconfig/apache2</filename> và cấu hình để tùy chọn <literal>APACHE_SERVERNAME</literal> trỏ đến node điều khiển:

source: Edit the <filename>/etc/sysconfig/network-scripts/ifcfg-<replaceable>INTERFACE_NAME</replaceable></filename> file to contain the following:
ru: Отредактируйте файл <filename>/etc/sysconfig/network-scripts/ifcfg-<replaceable>INTERFACE_NAME</replaceable></filename>, чтобы он содержал следующее:
vi_vn: Sửa file <filename>/etc/sysconfig/network-scripts/ifcfg-<replaceable>INTERFACE_NAME</replaceable></filename> để bao gồm phần sau:
zh_cn: 修改配置文件 <filename>/etc/sysconfig/network-scripts/ifcfg-<replaceable>INTERFACE_NAME</replaceable></filename> 包含如下内容：

source: Edit the <filename>/etc/sysconfig/network/ifcfg-<replaceable>INTERFACE_NAME</replaceable></filename> file to contain the following:
ru: Отредактируйте файл <filename>/etc/sysconfig/network/ifcfg-<replaceable>INTERFACE_NAME</replaceable></filename>, чтобы он содержал следующее:
vi_vn: Sửa file <filename>/etc/sysconfig/network/ifcfg-<replaceable>INTERFACE_NAME</replaceable></filename> để bao gồm phần sau:
zh_cn: 修改配置文件 <filename>/etc/sysconfig/network/ifcfg-<replaceable>INTERFACE_NAME</replaceable></filename> 包含如下内容：

source: Edit the <filename>/etc/sysctl.conf</filename> file to contain the following parameters:
ru: Отредактируйте файл <filename>/etc/sysctl.conf</filename>, чтобы он содержал следующие параметры:
vi_vn: Sửa file <filename>/etc/sysctl.conf</filename> để chứa các thông số sau:
zh_cn: 修改配置文件 <filename>/etc/sysctl.conf</filename> 以将下列参数包含其中：

source: Edit the <filename>/srv/www/openstack-dashboard/openstack_dashboard/local/local_settings.py</filename> file and complete the following actions:
ru: Отредактируйте файл <filename>/srv/www/openstack-dashboard/openstack_dashboard/local/local_settings.py</filename> следующим образом:
vi_vn: Sửa file <filename>/srv/www/openstack-dashboard/openstack_dashboard/local/local_settings.py</filename> và hoàn thành các công việc sau:
zh_cn: 修改文件 <filename>/srv/www/openstack-dashboard/openstack_dashboard/local/local_settings.py</filename> 并完成以下操作：

source: Edit the <filename>admin-openrc.sh</filename> file and add the following content:
ru: Отредактируйте файл <filename>admin-openrc.sh</filename> и добавьте следующее:
vi_vn: Sửa file <filename>admin-openrc.sh</filename> và thêm vào nội dung sau:
zh_cn: 编辑 <filename>admin-openrc.sh</filename> 文件并添加下列内容：

source: Edit the <filename>demo-openrc.sh</filename> file and add the following content:
ru: Отредактируйте файл <filename>demo-openrc.sh</filename> и добавьте следующее:
vi_vn: Sửa file <filename>demo-openrc.sh</filename> và thêm vào nội dung sau:
zh_cn: 编辑 <filename>demo-openrc.sh</filename> 文件并添加下列内容：

source: Edit the <filename>trove-taskmanager.conf</filename> file so it includes the required settings to connect to the OpenStack Compute service as shown below:
vi_vn: Chỉnh sửa thư mục <filename>trove-taskmanager.conf</filename> sao cho chúng chứa các cấu hình bắt buộc để kết nối tới dịch vụ Compute của OpenStack như phía dưới:
zh_cn: 修改 <filename>trove-taskmanager.conf</filename> 文件，使其包含需要的设置，以连接到 OpenStack Compute 服务，如下文所示：

source: Edit the <filename>trove.conf</filename> file so it includes appropriate values for the default datastore and network label regex as shown below:
vi_vn: Sửa file <filename>trove.conf</filename> để nó bao gồm các giá trị thích hợp cho kho dữ liệu mặc định và regex của nhãn mạng như sau:

source: Edit the <literal>[DEFAULT]</literal> section of each file (except <filename>api-paste.ini</filename>) and set appropriate values for the OpenStack service URLs (can be handled by Keystone service catalog), logging and messaging configuration. Edit the <literal>[database]</literal> section in each file to add the SQL connections:
vi_vn: Sửa mục <literal>[DEFAULT]</literal> của mỗi file (trừ <filename>api-paste.ini</filename>) và đặt các giá trị thích hợp cho các URL của dịch vụ OpenStack (có thể được đảm nhận bởi danh mục dịch vụ của Keystone), các cấu hình truy cập và truyền tin. Sửa mục <literal>[database]</literal> trên mỗi file và thêm vào các kết nối SQL:

source: Edit the <literal>[libvirt]</literal> section in the <filename os="ubuntu;debian">/etc/nova/nova-compute.conf</filename><filename os="rhel;centos;fedora;sles;opensuse">/etc/nova/nova.conf</filename> file as follows:
ru: Отредактируйте секцию <literal>[libvirt]</literal> в файле <filename os="ubuntu;debian">/etc/nova/nova-compute.conf</filename><filename os="rhel;centos;fedora;sles;opensuse">/etc/nova/nova.conf</filename> следующим образом:
vi_vn: Sửa mục <literal>[libvirt]</literal> trong file filename os="ubuntu;debian">/etc/nova/nova-compute.conf</filename><filename os="rhel;centos;fedora;sles;opensuse">/etc/nova/nova.conf</filename> như sau:
zh_cn: 根据以下内容修改 <filename os="ubuntu;debian">/etc/nova/nova-compute.conf</filename><filename os="rhel;centos;fedora;sles;opensuse">/etc/nova/nova.conf</filename> 的 <literal>[libvirt]</literal> 部分：

source: Enable the DHCP MTU option (26) and configure it to 1454 bytes:
ru: Включите параметр DHCP MTU (26) и установите его в 1454 байта:
vi_vn: Bật tùy chọn DHCP MTU (26) và cấu hình nó lên 1454 bytes:
zh_cn: 启用 DHCP MTU 选项 (26) 并配置为 1454 字节：

source: Enable the Identity service virtual hosts:
vi_vn: Kích hoạt các máy ảo dịch vụ Identity:

source: Enable the Open Build Service repositories based on your openSUSE or SLES version:
ru: Подключите репозитории Open Build Service в соответствии с вашей версией openSUSE или SLES:
vi_vn: Cho phép các Open Build Service repository dựa trên phiên bản openSUSE hoặc SLES của bạn:
zh_cn: 基于您的 openSUSE 或 SLES 版本，启用 Open Build 服务仓库：

source: Enable the Open Build Service repositories for MongoDB based on your openSUSE or SLES version:
vi_vn: Bật các Open Build Service repository cho MongoDB dựa theo phiên bản openSUSE hoặc SLES của bạn:

source: Ensure proper ownership of the mount point directory structure:
vi_vn: Đảm bảo quyền sở hữu hợp pháp của cấu trúc thư mục mount point:

source: Ensure the kernel module <literal>nbd</literal> is loaded.
ru: Убедитесь, что модуль ядра <literal>nbd</literal> загружен.
vi_vn: Đảm bảo rằng module nhân <literal>nbd</literal> đã được tải.
zh_cn: 确保内核模块 <literal>nbd</literal> 已加载。

source: Ensure the module will be loaded on every boot by adding <literal>nbd</literal> in the <filename>/etc/modules-load.d/nbd.conf</filename> file.
vi_vn: Đảm bảo rằng module luôn được tải mỗi khi máy khởi động bằng các thêm <literal>nbd</literal> vào file <filename>/etc/modules-load.d/nbd.conf</filename>.

source: Example architectures
ja: サンプルアーキテクチャー
ru: Примеры архитектур
vi_vn: Các kiến trúc mẫu
zh_cn: 架构样例

source: Example for uploading rules for MySQL datastore:
vi_vn: Ví dụ về tải lên cái luật cho kho dữ liệu MySQL
zh_cn: MySQL 数据存储上传规则的例子：

source: Example using <literal>192.168.1.0/24</literal>:
ru: Пример с использованием <literal>192.168.1.0/24</literal>:
vi_vn: Ví dụ sử dụng <literal>192.168.1.0/24</literal>:
zh_cn: 样例使用了 <literal>192.168.1.0/24</literal>：

source: Exit the database access client.
ru: Закройте клиент баз данных.
vi_vn: Thoát phần mềm client truy cập cơ sở dữ liệu.
zh_cn: 退出数据库客户端。

source: External network
ja: 外部ネットワーク
ru: Внешняя сеть
vi_vn: Mạng ngoại vùng
zh_cn: 外部网络

source: External on 203.0.113.0/24 with gateway 203.0.113.1
ru: Внешняя на 203.0.113.0/24 со шлюзом 203.0.113.1
vi_vn: Dải mạng bên ngoài là 203.0.113.0/24 với gateway là 203.0.113.1
zh_cn: 外部通道使用 203.0.113.0/24 带有网关 203.0.113.1

source: Fedora does not require this package.
ru: Fedora не трубется этот пакет.
vi_vn: Fedora không yêu cầu cần gói này.
zh_cn: Fedora 不需要这个包。

source: Fedora does not require this repository.
ru: Fedora не требуется этот репозиторий.
vi_vn: Fedora không yêu cầu cần có repository này.
zh_cn: Fedora不需要这个仓库

source: Finalize installation
ja: インストールの完了
vi_vn: Kết thúc cài đặt
zh_cn: 完成安装

source: First, edit <placeholder-1/> option in the <literal>[database]</literal> section. The URL provided here should point to an empty database. For instance, connection string for MySQL database will be: <placeholder-2/>
vi_vn: Đầu tiên, sửa tùy chọn <placeholder-1/> trong mục <literal>[database]</literal>. URL được cung cấp tại đây nên chỉ đến một cơ sở dữ liệu trống. Ví dụ, chuỗi kết nối cho cơ sở dữ liệu MySQL sẽ là: <placeholder-2/>.

source: For OpenStack services, this guide uses <replaceable>SERVICE_PASS</replaceable> to reference service account passwords and <replaceable>SERVICE_DBPASS</replaceable> to reference database passwords.
ru: Для служб OpenStack, это руководство использует <replaceable>SERVICE_PASS</replaceable> для указания пароля служебного аккаунта и <replaceable>SERVICE_DBPASS</replaceable> для указания пароля базы данных.
vi_vn: Đối với các dịch vụ của OpenStack, bài hướng dẫn sử dụng <replaceable>SERVICE_PASS</replaceable> để nhắc đến các mật khẩu tài khoản của dịch vụ và <replaceable>SERVICE_DBPASS</replaceable> để nhắc đến các mật khẩu của cơ sở dữ liệu.
zh_cn: 对于 OpenStack 的服务，本指南使用 <replaceable>SERVICE_PASS</replaceable> 来关联服务帐户的密码，用 <replaceable>SERVICE_DBPASS</replaceable> 来关联数据库的密码。

source: For best performance, we recommend that your environment meets or exceeds the hardware requirements in <xref linkend="example-architecture-with-neutron-networking-hw"/> or <xref linkend="example-architecture-with-legacy-networking-hw"/>. However, OpenStack does not require a significant amount of resources and the following minimum requirements should support a proof-of-concept environment with core services and several <glossterm>CirrOS</glossterm> instances:
ru: Для лучшей производительности, мы рекомендуем, чтобы ваша среда удовлетворяла следующим аппаратным требованиям в <xref linkend="example-architecture-with-neutron-networking-hw"/> или <xref linkend="example-architecture-with-legacy-networking-hw"/>. Однако, OpenStack не требует значительных ресурсов и следующие минимальные требования должны поддерживать достаточную среду с основными сервисами и несколькими инстансами <glossterm>CirrOS</glossterm>:
vi_vn: Để đạt được hiệu suất cao nhất, chúng tôi mong môi trường của bạn đạt tới hoặc vượt hơn yêu cầu phần cứng trong <xref linkend="example-architecture-with-neutron-networking-hw"/> hoặc <xref linkend="example-architecture-with-legacy-networking-hw"/>. Tuy nhiên, OpenStack không yêu cầu quá nhiêu tài nguyên và yêu cầu tối thiểu dưới đây đủ để hỗ trợ một môi trường thử nghiệm bao gồm các dịch vụ chính và một vài <glossterm>CirrOS</glossterm> instance.

source: For details about browsers that support noVNC, see <link xlink:href="https://github.com/kanaka/noVNC/blob/master/README.md"> https://github.com/kanaka/noVNC/blob/master/README.md</link>, and <link xlink:href="https://github.com/kanaka/noVNC/wiki/Browser-support"> https://github.com/kanaka/noVNC/wiki/Browser-support</link>, respectively.
vi_vn: Để biết thêm chi tiết về các trình duyệt hỗ trợ noVNC, xem <link xlink:href="https://github.com/kanaka/noVNC/blob/master/README.md"> https://github.com/kanaka/noVNC/blob/master/README.md</link> và <link xlink:href="https://github.com/kanaka/noVNC/wiki/Browser-support">https://github.com/kanaka/noVNC/wiki/Browser-support</link>.

source: For every package that must connect to a Messaging Server, the Debian package enables you to configure the IP address for that server and the user name and password that is used to connect. The following example shows configuration with the <systemitem class="service">ceilometer-common</systemitem> package:
ja: メッセージングサーバーに接続する必要があるすべてのパッケージの場合には、Debian パッケージにより、そのサーバーの IP アドレス、接続するために使用されるユーザー名とパスワードを設定できます。以下の例は <systemitem class="service">ceilometer-common</systemitem> を用いた設定を示します。
vi_vn: Với mỗi gói cần được kết nối với Server Messaging, gói trong Debian cho phép bạn cấu hình địa chỉ IP cho mỗi server mà có tên người dùng và mật khẩu để kết nối tới server. Ví dụ sau sẽ giúp bạn các cấu hình một gói <systemitem class="service">ceilometer-common</systemitem>:
zh_cn: 对于必须要连接消息服务器的包，Debian中的包允许你配置该服务器的IP地址，连接所需的用户名和密码。如下例子展示了 <systemitem class="service">ceilometer-common</systemitem>这个包的配置：

source: For example, using <literal>203.0.113.0/24</literal> with floating IP address range <literal>203.0.113.101</literal> to <literal>203.0.113.200</literal>:
ru: Например, используя <literal>203.0.113.0/24</literal> со статичным диапазоном IP-адресов от <literal>203.0.113.101</literal> до <literal>203.0.113.200</literal>:
vi_vn: Ví dụ, sử dụng <literal>203.0.113.0/24</literal> với dải địa chỉ IP động từ <literal>203.0.113.101</literal> đến <literal>203.0.113.200</literal>:
zh_cn: 例如，使用 <literal>203.0.113.0/24</literal> 带有浮动IP地址 <literal>203.0.113.101</literal> 到 <literal>203.0.113.200</literal>：
