Repository: 25hours/openstack-manuals
Catalog: doc/install-guide/locale/*.po
Languages: ja, ru, vi_vn, zh_cn

source: The following table provides a list of services that require passwords and their associated references in the guide: <table rules="all"><caption>Passwords</caption><thead><tr><th>Password name</th><th>Description</th></tr></thead><tbody><tr><td>Database password (no variable used)</td><td>Root password for the database</td></tr><tr><td><literal><replaceable>RABBIT_PASS</replaceable></literal></td><td>Password of user guest of RabbitMQ</td></tr><tr><td><literal><replaceable>KEYSTONE_DBPASS</replaceable></literal></td><td>Database password of Identity service</td></tr><tr><td><literal><replaceable>DEMO_PASS</replaceable></literal></td><td>Password of user <literal>demo</literal></td></tr><tr><td><literal><replaceable>ADMIN_PASS</replaceable></literal></td><td>Password of user <literal>admin</literal></td></tr><tr><td><literal><replaceable>GLANCE_DBPASS</replaceable></literal></td><td>Database password for Image Service</td></tr><tr><td><literal><replaceable>GLANCE_PASS</replaceable></literal></td><td>Password of Image Service user <literal>glance</literal></td></tr><tr><td><literal><replaceable>NOVA_DBPASS</replaceable></literal></td><td>Database password for Compute service</td></tr><tr><td><literal><replaceable>NOVA_PASS</replaceable></literal></td><td>Password of Compute service user <literal>nova</literal></td></tr><tr><td><literal><replaceable>DASH_DBPASS</replaceable></literal></td><td>Database password for the dashboard</td></tr><tr><td><literal><replaceable>CINDER_DBPASS</replaceable></literal></td><td>Database password for the Block Storage service</td></tr><tr><td><literal><replaceable>CINDER_PASS</replaceable></literal></td><td>Password of Block Storage service user <literal>cinder</literal></td></tr><tr><td><literal><replaceable>NEUTRON_DBPASS</replaceable></literal></td><td>Database password for the Networking service</td></tr><tr><td><literal><replaceable>NEUTRON_PASS</replaceable></literal></td><td>Password of Networking service user <literal>neutron</literal></td></tr><tr><td><literal><replaceable>HEAT_DBPASS</replaceable></literal></td><td>Database password for the Orchestration service</td></tr><tr><td><literal><replaceable>HEAT_PASS</replaceable></literal></td><td>Password of Orchestration service user <literal>heat</literal></td></tr><tr><td><literal><replaceable>CEILOMETER_DBPASS</replaceable></literal></td><td>Database password for the Telemetry service</td></tr><tr><td><literal><replaceable>CEILOMETER_PASS</replaceable></literal></td><td>Password of Telemetry service user <literal>ceilometer</literal></td></tr><tr><td><literal><replaceable>TROVE_DBPASS</replaceable></literal></td><td>Database password of Database service</td></tr><tr><td><literal><replaceable>TROVE_PASS</replaceable></literal></td><td>Password of Database Service user <literal>trove</literal></td></tr></tbody></table>
ru: Данная таблица содержит список сервисов, которым требуются пароли, и их обозначений в данном руководстве: <table rules="all"><caption>Пароль</caption><thead><tr><th>Обозначение пароля</th><th>Описание</th></tr></thead><tbody><tr><td>Пароль к базе данных (без переменных)</td><td>Пароль root к базам данных</td></tr><tr><td><literal><replaceable>RABBIT_PASS</replaceable></literal></td><td>Пароль пользователя guest в RabbitMQ</td></tr><tr><td><literal><replaceable>KEYSTONE_DBPASS</replaceable></literal></td><td>Пароль к БД для службы Идентификации</td></tr><tr><td><literal><replaceable>DEMO_PASS</replaceable></literal></td><td>Пароль пользователя <literal>demo</literal></td></tr><tr><td><literal><replaceable>ADMIN_PASS</replaceable></literal></td><td>Пароль пользователя <literal>admin</literal></td></tr><tr><td><literal><replaceable>GLANCE_DBPASS</replaceable></literal></td><td>Пароль к БД для службы Образов</td></tr><tr><td><literal><replaceable>GLANCE_PASS</replaceable></literal></td><td>Пароль пользователя <literal>glance</literal> Службы образов</td></tr><tr><td><literal><replaceable>NOVA_DBPASS</replaceable></literal></td><td>Пароль к БД для сервиса Вычислений</td></tr><tr><td><literal><replaceable>NOVA_PASS</replaceable></literal></td><td>Пароль пользователя <literal>nova</literal> службы Вычислений</td></tr><tr><td><literal><replaceable>DASH_DBPASS</replaceable></literal></td><td>Пароль к БД для Панели</td></tr><tr><td><literal><replaceable>CINDER_DBPASS</replaceable></literal></td><td>Пароль к БД для службы Блочного хранения</td></tr><tr><td><literal><replaceable>CINDER_PASS</replaceable></literal></td><td>Пароль пользователя <literal>cinder</literal> службы Блочного хранения</td></tr><tr><td><literal><replaceable>NEUTRON_DBPASS</replaceable></literal></td><td>Пароль к БД службы Сетей</td></tr><tr><td><literal><replaceable>NEUTRON_PASS</replaceable></literal></td><td>Пароль пользователя <literal>neutron</literal> службы Сетей</td></tr><tr><td><literal><replaceable>HEAT_DBPASS</replaceable></literal></td><td>Пароль к БД для службы Оркестровки</td></tr><tr><td><literal><replaceable>HEAT_PASS</replaceable></literal></td><td>Пароль пользователя <literal>heat</literal> службы Оркестровки</td></tr><tr><td><literal><replaceable>CEILOMETER_DBPASS</replaceable></literal></td><td>Пароль к БД службы Телеметрии</td></tr><tr><td><literal><replaceable>CEILOMETER_PASS</replaceable></literal></td><td>Пароль пользователя <literal>ceilometer</literal> службы Телеметрии</td></tr><tr><td><literal><replaceable>TROVE_DBPASS</replaceable></literal></td><td>Пароль к БД службы Баз Данных</td></tr><tr><td><literal><replaceable>TROVE_PASS</replaceable></literal></td><td>Пароль пользователя <literal>trove</literal> службы Баз Данных</td></tr></tbody></table>

source: Replace <replaceable>NOVA_PASS</replaceable> with a suitable password.
ru: Замените <replaceable>NOVA_PASS</replaceable> на подходящий пароль.

source: Replace <replaceable>INTERFACE_NAME</replaceable> with the actual interface name for the external network. For example, <emphasis>eth1</emphasis> or <emphasis>ens224</emphasis>.
ru: Замените <replaceable>INTERFACE_NAME</replaceable> реальным именем интерфейса для внешней сети. Например, <emphasis>eth1</emphasis> или <emphasis>ens224</emphasis>.

source: This section describes how to verify operation of the Compute service.
ru: Этот раздел описывает, как проверить работу службы Вычислений.

source: This output should indicate four components enabled on the controller node one component enabled on the compute node.
ru: Этот вывод должен показать четыре включенных компонента на управляющем узле, один включенный компонент на вычислительном узле.

source: List images in the Image Service catalog to verify connectivity with the Identity service and Image Service:
ru: Получите список образов в каталоге службы Образов чтобы подтвердить связность службы Идентификации и службы Образов:

source: Replace <replaceable>GLANCE_PASS</replaceable> with a suitable password.
ru: Замените <replaceable>GLANCE_PASS</replaceable> на подходящий пароль.

source: Add the <literal>admin</literal> role to the <literal>glance</literal> user:
ru: Добавьте роль <literal>admin</literal> пользователю <literal>glance</literal>:

source: In the <literal>[ml2_type_flat]</literal> section, configure the external flat provider network:
ru: В секции <literal>[ml2_type_flat]</literal>, настройте внешнюю плоскую сеть провайдера:

source: In the <literal>[ovs]</literal> section, enable tunnels, configure the local tunnel endpoint, and map the external flat provider network to the <literal>br-ex</literal> external network bridge:
ru: В секции <literal>[ovs]</literal>, включите туннели, настройте точки доступа локальных туннелей и направьте внешнюю плоскую сеть провайдера на внешний сетевой мост <literal>br-ex</literal>:

source: Do not explictly start the <systemitem class="service">neutron-ovs-cleanup</systemitem> service.
ru: Не запускайте напрямую службу <systemitem class="service">neutron-ovs-cleanup</systemitem>.

source: Do not explictly start the <systemitem class="service">openstack-neutron-ovs-cleanup</systemitem> service.
ru: Не запускайте напрямую службу <systemitem class="service">openstack-neutron-ovs-cleanup</systemitem>.

source: The <placeholder-1/> call on openSUSE outputs a warning message when the service uses SysV Init scripts instead of native systemd files. This warning can be ignored.
ru: Вызов <placeholder-1/> на openSUSE выводит предупреждение, когда сервис использует SysV инит скрипты вместо родных файлов systemd. Это предупреждение можно игнорировать.

source: This chapter explains how to install and configure either OpenStack Networking (neutron) or the legacy <systemitem class="service">nova-network</systemitem> networking service. The <systemitem class="service">nova-network</systemitem> service enables you to deploy one network type per instance and is suitable for basic network functionality. OpenStack Networking enables you to deploy multiple network types per instance and includes <glossterm baseform="plug-in">plug-ins</glossterm> for a variety of products that support <glossterm>virtual networking</glossterm>.
ru: Эта глава объясняет как установить и настроить либо Сеть OpenStack (neutron), либо старую сетевую службу <systemitem class="service">nova-network</systemitem>. Служба <systemitem class="service">nova-network</systemitem> позволяет вам устанавливать один тип сети для каждого инстанса и подходит для базовой сетевой функциональности. Сеть OpenStack позволяет устанавливать множество типов сетей для каждого инстанса и включает <glossterm baseform="plug-in">плагины</glossterm> для ряда продуктов, которые поддерживают <glossterm>виртуальные сети</glossterm>.

source: To retrieve image samples, you must configure the Image Service to send notifications to the message broker. Edit the <filename>/etc/glance/glance-api.conf</filename> and <filename>/etc/glance/glance-registry.conf</filename> files and complete the following actions:
ru: Для получения образцов образов, вам необходимо настроить службу Образов на отправку оповещений в брокер сообщений. Измените файлы <filename>/etc/glance/glance-api.conf</filename> и <filename>/etc/glance/glance-registry.conf</filename> следующим образом:

source: Start documentation for Juno.
ru: Начало документирования для Juno.

source: Update for Icehouse, rework Networking setup to use ML2 as plugin, add new chapter for Database Service setup, improved basic configuration.
ru: Обновление для Icahouse, переделаны настройки Сети на использование ML2 как плагина, добавлена новая глава по настройке Службы Баз Данных, улучшена базовая конфигурация.

source: OpenStack uses a <glossterm>message broker</glossterm> to coordinate operations and status information among services. The message broker service typically runs on the controller node. OpenStack supports several message brokers including <application>RabbitMQ</application>, <application>Qpid</application>, and <application>ZeroMQ</application>. However, most distributions that package OpenStack support a particular message broker. This guide covers the RabbitMQ message broker which is supported by each distribution. If you prefer to implement a different message broker, consult the documentation associated with it.
ru: OpenStack использует <glossterm>брокер сообщенийr</glossterm> для координации операций и информации о статусе между службами. Служба брокера сообщений обычно запущена на управляющем узле. OpenStack поддерживает несколько брокеров сообщений, включая <application>RabbitMQ</application>, <application>Qpid</application> и <application>ZeroMQ</application>. Однако, большинство дистрибутивов поддерживающих OpenStack поддерживают определённый брокер сообщений. Это руководство использует брокер сообщений RabbitMQ, который поддерживается каждым дистрибутивом. Если вы предпочитаете использовать другой брокер сообщений, проконсультируйтесь с его документацией.

source: To install the <application>RabbitMQ</application> message broker service
ru: Для установки брокера сообщений <application>RabbitMQ</application>

source: To configure the message broker service
ru: Для настройки брокера сообщений

source: Start the message broker service and configure it to start when the system boots:
ru: Запустите сервис брокера сообщений и настройте его автоматический запуск при загрузке системы:

source: The message broker creates a default account that uses <literal>guest</literal> for the username and password. To simplify installation of your test environment, we recommend that you use this account, but change the password for it.
ru: Брокер сообщений создаёт стандартный аккаунт, который использует <literal>guest</literal> в качестве имени пользователя и пароля. Для упрощения установки вашей тестовой среды, мы рекомендуем использовать этот аккаунт, но изменить его пароль.

source: Run the following command:
ru: Исполните следующую команду:

source: You must configure the <literal>rabbit_password</literal> key in the configuration file for each OpenStack service that uses the message broker.
ru: Вам необходимо настроить ключ <literal>rabbit_password</literal> в конфигурционных файлов каждой службы OpenStack, которая использует брокер сообщений.

source: For production environments, you should create a unique account with a suitable password. For more information on securing the message broker, see the <link href="https://www.rabbitmq.com/man/rabbitmqctl.1.man.html">documentation</link>.
ru: Для производственных сред, вам стоит создать уникальный аккаунт с подходящим паролем. За дополнительной информацией о том, как обезопасить брокер сообщений, обратитесь к <link href="https://www.rabbitmq.com/man/rabbitmqctl.1.man.html">документации</link>.

source: If you decide to create a unique account with a suitable password for your test environment, you must configure the <literal>rabbit_userid</literal> and <literal>rabbit_password</literal> keys in the configuration file of each OpenStack service that uses the message broker.
ru: Если вы решите создать уникальный аккаунт с подходящим паролем для вашей тестовой среды, вам необходимо настроить ключи <literal>rabbit_userid</literal> и <literal>rabbit_password</literal> в файле конфигурации каждой службы OpenStack, которая использует этот брокер сообщений.

source: Congratulations, you are now ready to install OpenStack services!
ru: Поздравляем, теперь вы готовы к установке служб OpenStack!

source: OpenStack provides three API endpoint variations for each service: admin, internal, and public. In a production environment, the variants might reside on separate networks that service different types of users for security reasons. Also, OpenStack supports multiple regions for scalability. For simplicity, this configuration uses the management network for all endpoint variations and the <literal>regionOne</literal> region.
ru: OpenStack предоставляет три варианта точек доступа API для каждого сервиса: административный, внутренний и публичный. В рабочей среде, эти варианты могут располагаться в отдельных сетях, которые обслуживают разные типы пользователей, для обеспечения безопасности. Кроме того, OpenStack поддерживает множественные регионы для расширения. Для простоты, эта конфигурация использует управляющую сеть для всех вариантов точек доступа и регион <literal>regionOne</literal>.

source: Optionally, the controller node runs portions of Block Storage, Object Storage, Orchestration, Telemetry, Database, and Data Processing services. These components provide additional features for your environment.
ru: Дополнительно, управляющий узел содержит части служб Блочного хранения, Хранилища Объектов, Оркестровки, Телеметрии, Базы Данных и Обработки Данных. Эти компоненты предоставляют дополнительный функционал вашей среде.

source: Optionally, the compute node runs a Telemetry agent to collect metrics. Also, it can contain a third network interface on a separate storage network to improve performance of storage services.
ru: Дополнительно, вычислительный узел содержит агент Телеметрии для сбора метрик. Кроме того, он может содержать третий сетевой интерфейс в отдельной сети хранения для улучшения производительности служб хранения.

source: Optionally, the Block Storage node runs a Telemetry agent to collect metrics. Also, it can contain a second network interface on a separate storage network to improve performance of storage services.
ru: Дополнительно, узел Блочного хранения содержит агент Телеметрии для сбора метрик. Кроме того, он может содержать второй сетевой интерфейс в отдельной сети хранения для улучшения производительности служб хранения.

source: For more information on other modules that enable additional features, see the <link href="http://docs.openstack.org/developer/swift/deployment_guide.html">Deployment Guide</link>.
ru: За дополнительной информацией по другим модулям, которые включают дополнительные возможности, обратитесь к <link href="http://docs.openstack.org/developer/swift/deployment_guide.html">Руководству по установке</link>.

source: Container ring
ru: Кольцо контейнеров

source: Object ring
ru: Кольцо объектов
