Repository: 25hours/openstack-manuals
Catalog: doc/install-guide/locale/*.po
Languages: ja, ru, vi_vn, zh_cn

source: To ease the installation process, this guide only covers password security where applicable. You can create secure passwords manually, generate them using a tool such as <link href="http://sourceforge.net/projects/pwgen/">pwgen</link>, or by running the following command:
ru: Для упрощения процесса установки, это руководство затрагивает только пароли, где необходимо. Вы можете создать безопасные пароли вручную, сгенерировать их используя такие инструменты как <link href="http://sourceforge.net/projects/pwgen/">pwgen</link>, или исполнив следующую команду:
zh_cn: 为了减轻安装过程，本指南仅包含恰当地方的安全密码。你能手动创建安全密码，使用如 <link href="http://sourceforge.net/projects/pwgen/">pwgen</link> 的工具来生成他们，或运行如下命令：

source: The following table provides a list of services that require passwords and their associated references in the guide: <table rules="all"><caption>Passwords</caption><thead><tr><th>Password name</th><th>Description</th></tr></thead><tbody><tr><td>Database password (no variable used)</td><td>Root password for the database</td></tr><tr><td><literal><replaceable>RABBIT_PASS</replaceable></literal></td><td>Password of user guest of RabbitMQ</td></tr><tr><td><literal><replaceable>KEYSTONE_DBPASS</replaceable></literal></td><td>Database password of Identity service</td></tr><tr><td><literal><replaceable>DEMO_PASS</replaceable></literal></td><td>Password of user <literal>demo</literal></td></tr><tr><td><literal><replaceable>ADMIN_PASS</replaceable></literal></td><td>Password of user <literal>admin</literal></td></tr><tr><td><literal><replaceable>GLANCE_DBPASS</replaceable></literal></td><td>Database password for Image Service</td></tr><tr><td><literal><replaceable>GLANCE_PASS</replaceable></literal></td><td>Password of Image Service user <literal>glance</literal></td></tr><tr><td><literal><replaceable>NOVA_DBPASS</replaceable></literal></td><td>Database password for Compute service</td></tr><tr><td><literal><replaceable>NOVA_PASS</replaceable></literal></td><td>Password of Compute service user <literal>nova</literal></td></tr><tr><td><literal><replaceable>DASH_DBPASS</replaceable></literal></td><td>Database password for the dashboard</td></tr><tr><td><literal><replaceable>CINDER_DBPASS</replaceable></literal></td><td>Database password for the Block Storage service</td></tr><tr><td><literal><replaceable>CINDER_PASS</replaceable></literal></td><td>Password of Block Storage service user <literal>cinder</literal></td></tr><tr><td><literal><replaceable>NEUTRON_DBPASS</replaceable></literal></td><td>Database password for the Networking service</td></tr><tr><td><literal><replaceable>NEUTRON_PASS</replaceable></literal></td><td>Password of Networking service user <literal>neutron</literal></td></tr><tr><td><literal><replaceable>SWIFT_PASS</replaceable></literal></td><td>Password of Object Storage service user <literal>swift</literal></td></tr><tr><td><literal><replaceable>HEAT_DBPASS</replaceable></literal></td><td>Database password for the Orchestration service</td></tr><tr><td><literal><replaceable>HEAT_PASS</replaceable></literal></td><td>Password of Orchestration service user <literal>heat</literal></td></tr><tr><td><literal><replaceable>CEILOMETER_DBPASS</replaceable></literal></td><td>Database password for the Telemetry service</td></tr><tr><td><literal><replaceable>CEILOMETER_PASS</replaceable></literal></td><td>Password of Telemetry service user <literal>ceilometer</literal></td></tr><tr><td><literal><replaceable>TROVE_DBPASS</replaceable></literal></td><td>Database password of Database service</td></tr><tr><td><literal><replaceable>TROVE_PASS</replaceable></literal></td><td>Password of Database Service user <literal>trove</literal></td></tr></tbody></table>
zh_cn: 下列的表格列出了需要密码的服务以及它们在本指南中的关联：<table rules="all"><caption>密码</caption><thead><tr><th>密码名称</th><th>描述</th></tr></thead><tbody><tr><td>数据库密码 (没有使用的变量)</td><td>数据库的 Root 密码</td></tr><tr><td><literal><replaceable>RABBIT_PASS</replaceable></literal></td><td>RabbitMQ 的 guest 用户的密码</td></tr><tr><td><literal><replaceable>KEYSTONE_DBPASS</replaceable></literal></td><td>身份认证服务的数据库密码</td></tr><tr><td><literal><replaceable>DEMO_PASS</replaceable></literal></td><td><literal>demo</literal> 用户的密码</td></tr><tr><td><literal><replaceable>ADMIN_PASS</replaceable></literal></td><td><literal>admin</literal> 用户的密码</td></tr><tr><td><literal><replaceable>GLANCE_DBPASS</replaceable></literal></td><td>镜像服务的数据库密码</td></tr><tr><td><literal><replaceable>GLANCE_PASS</replaceable></literal></td><td>镜像服务的 <literal>glance</literal> 用户的密码</td></tr><tr><td><literal><replaceable>NOVA_DBPASS</replaceable></literal></td><td>计算服务的数据库密码</td></tr><tr><td><literal><replaceable>NOVA_PASS</replaceable></literal></td><td>计算服务的 <literal>nova</literal> 用户的密码</td></tr><tr><td><literal><replaceable>DASH_DBPASS</replaceable></literal></td><td>仪表板的数据库密码</td></tr><tr><td><literal><replaceable>CINDER_DBPASS</replaceable></literal></td><td>块设备存储服务的数据密码</td></tr><tr><td><literal><replaceable>CINDER_PASS</replaceable></literal></td><td>块设备存储服务的 <literal>cinder</literal> 用户的密码</td></tr><tr><td><literal><replaceable>NEUTRON_DBPASS</replaceable></literal></td><td>网络服务的数据库密码</td></tr><tr><td><literal><replaceable>NEUTRON_PASS</replaceable></literal></td><td>网络服务的 <literal>neutron</literal> 用户的密码</td></tr><tr><td><literal><replaceable>SWIFT_PASS</replaceable></literal></td><td>对象存储服务的 <literal>swift</literal> 用户的密码</td></tr><tr><td><literal><replaceable>HEAT_DBPASS</replaceable></literal></td><td>Orchestration 服务的数据库密码</td></tr><tr><td><literal><replaceable>HEAT_PASS</replaceable></literal></td><td>Orchestration 服务的 <literal>heat</literal> 用户的密码</td></tr><tr><td><literal><replaceable>CEILOMETER_DBPASS</replaceable></literal></td><td>Telemetry 服务的数据库密码</td></tr><tr><td><literal><replaceable>CEILOMETER_PASS</replaceable></literal></td><td>Telemetry 服务的 <literal>ceilometer</literal> 用户的密码</td></tr><tr><td><literal><replaceable>TROVE_DBPASS</replaceable></literal></td><td>数据库服务的数据库密码</td></tr><tr><td><literal><replaceable>TROVE_PASS</replaceable></literal></td><td>数据库服务的 <literal>trove</literal> 用户的密码</td></tr></tbody></table>

source: OpenStack and supporting services require administrative privileges during installation and operation. In some cases, services perform modifications to the host that can interfere with deployment automation tools such as Ansible, Chef, and Puppet. For example, some OpenStack services add a root wrapper to <literal>sudo</literal> that can interfere with security policies. See the <link href="http://docs.openstack.org/admin-guide-cloud/content/root-wrap-reference.html">Cloud Administrator Guide</link> for more information. Also, the Networking service assumes default values for kernel network parameters and modifies firewall rules. To avoid most issues during your initial installation, we recommend using a stock deployment of a supported distribution on your hosts. However, if you choose to automate deployment of your hosts, review the configuration and policies applied to them before proceeding further.
ru: OpenStack и вспомогательные службы требуют административных привилегий во время установки и работы. В некоторых случаях службы выполняют модификацию узла, что может мешать инструментам автоматической установки, таким как Ansible, Chef и Puppet. Например, некоторые службы OpenStack добавляют корневой обработчик к <literal>sudo</literal>, который может мешать политикам безопастности. Подробнее смотрите в <link href="http://docs.openstack.org/admin-guide-cloud/content/root-wrap-reference.html">Руководстве Администратора Облака</link>. Кроме того, служба Сети предполагает стандартные значения для ядерных параметров сети и модифицирует правила фаервола. Для избежания большей части проблем во время первоначальной установки мы рекомендуем использовать стандартную установку поддерживаемого дистрибутива на ваши хосты. Однако, если вы выберете автоматизацию установки ваших хостов, просмотрите конфигурацию и применяемые политики, прежде чем продолжить.
zh_cn: OpenStack 和支持的服务在安装和操作过程中需要管理员特权。在一些情况下，主机服务的修改可能会干扰自动化不暑工具，如 Ansible、Chef 和 Puppet。例如，一些 OpenStack 的服务添加一个 root 封装给 <literal>sudo</literal>，会干扰到安全策略。请阅读 <link href="http://docs.openstack.org/admin-guide-cloud/content/root-wrap-reference.html">Cloud Administrator Guide</link> 以获取更多信息。并且，Networking 服务会获取内核网络参数的默认值并修改防火墙规则。为了避免更多的问题在您的初始化安装中，我们建议在您的主机上使用一个支持分布的旧的部署。但是，如果您选择自动化部署，请在执行之前检查其配置和策略。

source: Only instances can access Block Storage volumes. However, the underlying operating system manages the devices associated with the volumes. By default, the LVM volume scanning tool scans the <literal>/dev</literal> directory for block storage devices that contain volumes. If tenants use LVM on their volumes, the scanning tool detects these volumes and attempts to cache them which can cause a variety of problems with both the underlying operating system and tenant volumes. You must reconfigure LVM to scan only the devices that contain the <literal>cinder-volume</literal> volume group. Edit the <filename>/etc/lvm/lvm.conf</filename> file and complete the following actions:
ru: Только виртуальным машинам предоставляется доступ до дисков Блочного Хранилища. Однако, операционная система хоста управляет устройствами связанными с этими дисками. По умолчанию, инструмент сканирования LVM сканирует директорию <literal>/dev</literal> на предмет блочных устройств содержащих диски. Если проекты используют LVM на своих дисках, инструмент обнаруживает эти диски и пытается закэшировать их, что может привести к разным проблемам как в операционной системе хоста, так и дисках проектов. Вам необходимо перенастроить LVM на сканирование только устройств, содержащих группу дисков <literal>cinder-volume</literal>. Отредактируйте файл <filename>/etc/lvm/lvm.conf</filename> следующим образом:
zh_cn: 只有实例能够访问块存储卷。但是，底层的操作系统管理这些设备，关联到卷上。默认情况下，LVM 卷的扫描工具会扫描包含卷的块存储设备的 <literal>/dev</literal> 目录。如果租户在卷上使用了 LVM，扫描工具会检查这些卷并尝试缓存它们，这会在底层系统和租户卷上产生各种各样的问题。您必需重新配置 LVM，仅仅扫描包含了 <literal>cinder-volume</literal> 卷组的设备。修改配置文件 <filename>/etc/lvm/lvm.conf</filename> 并完成以下操作：

source: Replace <replaceable>RABBIT_PASS</replaceable> with the password you chose for the <literal>guest</literal> account in RabbitMQ.
ru: Замените <replaceable>RABBIT_PASS</replaceable> на пароль, который вы выбрали для аккаунта <literal>guest</literal> в RabbitMQ.
zh_cn: 将<replaceable>RABBIT_PASS</replaceable>替换为RabbitMQ中<literal>guest</literal>用户的密码。

source: In the <literal>[DEFAULT]</literal> section, configure the location of the Image Service:
zh_cn: 在<literal>[DEFAULT]</literal>部分，配置镜像服务的位置：

source: In the <literal>[DEFAULT]</literal> section, configure Block Storage to use the <placeholder-1/> iSCSI service:
zh_cn: 在<literal>[DEFAULT]</literal>部分，配置块存储使用<placeholder-1/>iSCSI服务：

source: The Orchestration module uses templates to describe stacks. To learn about the template language, see <link href="http://docs.openstack.org/developer/heat/template_guide/index.html">the Template Guide</link> in the <link href="http://docs.openstack.org/developer/heat/">Heat developer documentation</link>.
zh_cn: Orchestration 模块使用模板来描述栈。要了解模板语言，请阅读 <link href="http://docs.openstack.org/developer/heat/">Heat 开发文档</link>中的 <link href="http://docs.openstack.org/developer/heat/template_guide/index.html">the Template Guide</link>。

source: Before you install and configure the Block Storage service, you must create a database, service credentials, and API endpoints.
zh_cn: 在您安装和配置块设备存储服务之前，您必须创建数据库、服务证书和 API 入口点。

source: Replace <replaceable>CINDER_PASS</replaceable> with a suitable password.
ru: Замените <replaceable>CINDER_PASS</replaceable> на подходящий пароль.
zh_cn: 将其中的 <replaceable>CINDER_PASS</replaceable> 替换为一个合适的密码。

source: Before launching your first instance, you must create the necessary virtual network infrastructure to which the instance will connect, including the <link linkend="neutron_initial-external-network">external network</link> and <link linkend="neutron_initial-tenant-network">tenant network</link>. See <xref linkend="neutron_figure-neutron-initial-networks"/>. After creating this infrastructure, we recommend that you <link linkend="neutron_initial-networks-verify">verify connectivity</link> and resolve any issues before proceeding further. <xref linkend="neutron_figure-neutron-initial-networks"/> provides a basic architectural overview of the components that Networking implements for the initial networks and shows how network traffic flows from the instance to the external network or Internet.
ru: Прежде чем запускать ваш первый инстанс, вам необходимо создать необходимую инфраструктуру виртуальной сети, с которой будет соединяться инстанс, включая <link linkend="neutron_initial-external-network">внешнюю сеть</link> и <link linkend="neutron_initial-tenant-network">сеть проекта</link>. Смотрите <xref linkend="neutron_figure-neutron-initial-networks"/>. После создания этой инфраструктуры мы рекомендуем вам <link linkend="neutron_initial-networks-verify">поверить связность</link> и разрешить все проблемы, прежде чем продолжать дальше. <xref linkend="neutron_figure-neutron-initial-networks"/> представляет обзор базовой архитектуры компонентов, который Сеть реализует для первоначальных сетей и показывает, как идёт сетевой траффик от инстанса к внешней сети или Интернет.
zh_cn: 启动您的第一台实例之前，您必须创建虚拟机要连接的必需的虚拟网络基础设施，包括<link linkend="neutron_initial-external-network">外部网络</link>和<link linkend="neutron_initial-tenant-network">租户网络</link>。创建好这些基础设施之后，我们建议您<link linkend="neutron_initial-networks-verify">验证连接</link>，并在继续执行之前解决出现的问题。<xref linkend="neutron_figure-neutron-initial-networks"/> 提供了一个组件的基本架构预览，网络实现了初始化网络，并展示了网络如何 从实例上流通到外部网络或内部网络中。

source: Like the external network, your tenant network also requires a subnet attached to it. You can specify any valid subnet because the architecture isolates tenant networks. By default, this subnet will use DHCP so your instances can obtain IP addresses.
ru: Как и внешняя сеть, ваша сеть проектов требует подключения к ней подсети. Вы можете указать любую действительную подсеть, поскольку архитектура изолирует сети проектов. По умолчанию эта подсеть будет использовать DHCP, чтобы ваши инстансы могли получить IP-адреса.
zh_cn: 类似于外部网络，您的租户网络也需要附加子网。你可以指定任意有效的子网，因为架构分离了租户网络。默认情况下，这个子网会使用 DHCP，因此您的实例可以获取到 IP 地址。

source: A virtual router passes network traffic between two or more virtual networks. Each router requires one or more <glossterm baseform="interface">interfaces</glossterm> and/or gateways that provide access to specific networks. In this case, you will create a router and attach your tenant and external networks to it.
ru: Виртуальный маршрутизатор передаёт траффик между двумя или более виртуальными сетями. Каждый маршрутизатор требует один или более <glossterm baseform="interface">интерфейсов</glossterm> и/или шлюзов, которые предоставляют доступ к конкретным сетям. В этом случае, вы создаёте маршрутизатор и подключаете к нему сеть проекта и внешнюю сеть.
zh_cn: 虚拟路由在两个或多个虚拟网络之间传递网络数据。每个路由需要一个或多个<glossterm baseform="interface">接口</glossterm>和/或提供到指定网络连接的网关。在如下部分，您将创建一个路由然后将您的租户网络和外部网络连接到其上。

source: Ping the tenant router gateway:
ja: プロジェクトのゲートウェイに ping します。
ru: Пропингуйте шлюз маршрутизатора проекта:
zh_cn: Ping 租户路由网关：

source: Before you install and configure the Compute service, you must create a database, service credentials, and API endpoints.
ru: Прежде чем установить и настроить сервис Вычислений, вам необходимо создать базу данных, сервисные учётные данные и точки доступа API.
zh_cn: 在您安装和配置 Compute 服务之前，您必须创建数据库、服务证书和 API 入口点。

source: Create the Compute service API endpoints:
ru: Создайте точки доступа API для службы Вычислений:
zh_cn: 创建计算服务的 API 入口点：

source: In the <literal>[glance]</literal> section, configure the location of the Image Service:
ru: В секции <literal>[glance]</literal> настройте расположение службы Образов:
zh_cn: 在 <literal>[glance]</literal> 部分，配置镜像服务的位置：

source: System requirements
ja: システム要件
ru: Системные требования
zh_cn: 系统需求

source: Before you install the OpenStack dashboard, you must meet the following system requirements:
ja: OpenStack Dashboard をインストールする前に、以下のシステム要件を満たしている必要があります。
ru: Перед установкой панели управления OpenStack удостоверьтесь в выполнении следующих системных требований:
zh_cn: 在你安装OpenStack 控制面板前，你必须符合下列系统需求：

source: OpenStack Compute installation. Enable the Identity Service for user and project management.
ja: OpenStack Compute のインストール。ユーザーとプロジェクトの管理用の Identity Service の有効化。
ru: Установка OpenStack Compute. Настройка службы Identity для управления пользователями и проектами.
zh_cn: 已安装OpenStack Compute。并且为用户和项目管理启用了身份识别服务。

source: Note the URLs of the Identity Service and Compute endpoints.
ja: Identity Service と Compute のエンドポイントの URL を記録します。
ru: Запомните URL точек доступа служб Identity и Compute.
zh_cn: 记录身份验证节点（Identity Endpoint）和Compute节点的URL。

source: Identity Service user with sudo privileges. Because Apache does not serve content from a root user, users must run the dashboard as an Identity Service user with sudo privileges.
ja: sudo 権限を持つ Identity Service のユーザー。Apache は root ユーザーのコンテンツを処理しないため、ユーザーは sudo 権限を持つ Identity Service のユーザーとしてダッシュボードを実行する必要があります。
ru: Пользователь службы Identity с правами sudo. Так как Apache отдаёт данные не из-под пользователя root, пользователи должны запускать панель управления из-под пользователя службы Identity с правами sudo.
zh_cn: 认证服务用户使用sudo权限。由于Apache并不支持来自root用户的内容，所以用户必须以带有sudo权限的认证服务用户的身份来运行管理界面。

source: Python 2.7. The Python version must support Django. The Python version should run on any system, including Mac OS X. Installation prerequisites might differ by platform.
ru: Python 2.7. Версия Python должна поддерживать Django. Версия Python должна запускаться на любой системе, включая Mac OS X. Требования для установки могут различаться в зависимости от платформы.
zh_cn: Python 2.7。Python的版本必须支持Django。Python的版本要能在任何系统上运行，包括Mac OS X。安装的先决条件可能依据各平台而有所不同。

source: Then, install and configure the dashboard on a node that can contact the Identity Service.
ja: そして、Identity Service と通信できるノードに Dashboard をインストールし、設定します。
ru: Затем установите и настройте панель управления в узле, который может взаимодействовать со службой Identity.
zh_cn: 然后，安装并配置Dashboard在能够与Identity Service通讯的节点上。

source: Provide users with the following information so that they can access the dashboard through a web browser on their local machine:
ja: ユーザーのローカルマシンからウェブブラウザー経由で Dashboard にアクセスできるよう、以下の情報をユーザーに提供します。
ru: Предоставьте пользователям нижеприведенную информацию для получения доступа к панели управления через браузер:
zh_cn: 提供给用户下列信息以便他们可以在他们本地的机器上通过浏览器访问dashboard：

source: The public IP address from which they can access the dashboard
ja: Dashboard にアクセスできるパブリック IP アドレス。
ru: Публичный IP-адрес, с которого они могут войти в панель управления
zh_cn: 公共IP地址，通过该IP地址，用户应当能够访问到dashboard。

source: The user name and password with which they can access the dashboard
ja: Dashboard にアクセスできるユーザー名とパスワード。
ru: Имя пользователя и пароль, с которыми они могут получить доступ к панели управления
zh_cn: 他们用来登录dashboard使用的用户名和密码

source: Your web browser, and that of your users, must support HTML5 and have cookies and JavaScript enabled.
ja: お使いのウェブブラウザーが HTML5 をサポートし、クッキーと JavaScript を有効化されている必要があります。
ru: Ваш веб-браузер должен поддерживать HTML5, принимать cookies и выполнять JavaScript.
zh_cn: 你以及你的用户的浏览器，必须支持HTML5并且启用了cookies和JavaScript。

source: For details about browsers that support noVNC, see <link href="https://github.com/kanaka/noVNC/blob/master/README.md">https://github.com/kanaka/noVNC/blob/master/README.md</link>, and <link href="https://github.com/kanaka/noVNC/wiki/Browser-support">https://github.com/kanaka/noVNC/wiki/Browser-support</link>, respectively.
ja: noVNC をサポートするブラウザーの詳細はそれぞれ <link href="https://github.com/kanaka/noVNC/blob/master/README.md">https://github.com/kanaka/noVNC/blob/master/README.md</link> と <link href="https://github.com/kanaka/noVNC/wiki/Browser-support">https://github.com/kanaka/noVNC/wiki/Browser-support</link> を参照してください。
ru: Для подробной информации о браузерах, поддерживающих режим noVNC, смотрите <link href="https://github.com/kanaka/noVNC/blob/master/README.md">https://github.com/kanaka/noVNC/blob/master/README.md</link> и <link href="https://github.com/kanaka/noVNC/wiki/Browser-support">https://github.com/kanaka/noVNC/wiki/Browser-support</link>.
zh_cn: 不支持noVNC的浏览器的详细信息，请看<link href="https://github.com/kanaka/noVNC/blob/master/README.md">https://github.com/kanaka/noVNC/blob/master/README.md</link>，和<link href="https://github.com/kanaka/noVNC/wiki/Browser-support">https://github.com/kanaka/noVNC/wiki/Browser-support</link>.

source: Your first instance uses the <literal>cirros-0.3.3-x86_64</literal> image.
ru: Ваш первый инстанс использует образ <literal>cirros-0.3.3-x86_64</literal>.
zh_cn: 您的第一台实例使用的是 <literal>cirros-0.3.3-x86_64</literal> 镜像。

source: The <literal>demo-volume1</literal> volume status should indicate <literal>in-use</literal> by the ID of the <literal>demo-instance1</literal> instance.
ru: Статус диска <literal>demo-volume1</literal> должен показывать <literal>in-use</literal> с ID инстанса <literal>demo-instance1</literal>.
zh_cn: 卷 <literal>demo-volume1</literal> 的状态应该显示被 ID 为 <literal>demo-instance1</literal> 的实例所 <literal>in-use</literal> 使用。

source: If your instance does not launch or seem to work as you expect, see the <link href="http://docs.openstack.org/ops"><citetitle>OpenStack Operations Guide</citetitle></link> for more information or use one of the <link linkend="app_community_support">many other options</link> to seek assistance. We want your environment to work!
ru: Если ваш инстанс не запускается или работает не так, как вы ожидали, смотрите <link href="http://docs.openstack.org/ops"><citetitle>Руководство по эксплуатации OpenStack</citetitle></link> или используйте один из <link linkend="app_community_support">доступных способов</link> обратиться за помощью. Нам нужно, чтобы ваша среда работала!
zh_cn: 如果您的实例没有启动或看起来没有像您想象的那样运作，请阅读 <link href="http://docs.openstack.org/ops"><citetitle>OpenStack Operations Guide</citetitle></link> 以获取更多信息，或使用<link linkend="app_community_support">众多其他选项</link>之一来寻求援助。我们希望您的环境能够正常运作！

source: Use the <glossterm baseform="Database Service">Database module</glossterm> to create cloud database resources. The integrated project name is <glossterm>trove</glossterm>.
zh_cn: 使用<glossterm baseform="Database Service">数据库模块</glossterm>来创建云数据库资源。该整合的项目名称为 <glossterm>trove</glossterm>。

source: Replace <replaceable>INTERFACE_NAME</replaceable> with the actual interface name for the external network. For example, <emphasis>eth1</emphasis> or <emphasis>ens224</emphasis>. You can also leave these two parameters undefined if you are serving multiple networks with individual bridges for each.
zh_cn: 将其中的 <replaceable>INTERFACE_NAME</replaceable> 替换为一个实际的外部网络的接口名称。例如 <emphasis>eth1</emphasis> 或 <emphasis>ens224</emphasis>。如果您是用单独的桥接服务多网络，您也可以不定义这两个参数。

source: List images in the Image Service catalog to verify connectivity with the Image Service:
zh_cn: 列出镜像服务目录中的镜像，以验证镜像服务的连通性：

source: This section describes how to install and configure the Image Service, code-named glance, on the controller node. For simplicity, this configuration stores images on the local file system.
ru: Этот раздел описывает как установить и настроить службу Образов, названную Glance, на управляющем узле. Для простоты, эта конфигурация хранит образы на локальной файловой системе.
zh_cn: 这个部分描述如何安装和配置镜像服务，即 glance，到控制节点上。简单来说，这个配置将镜像保存在本地文件系统中。
