Repository: 25hours/openstack-manuals
Catalog: doc/install-guide/locale/*.po
Languages: ja, ru, vi_vn, zh_cn

source: All OpenStack packages are written in Python. Wheezy uses Python 2.6 and 2.7, with Python 2.6 as the default interpreter; Sid has only Python 2.7. There is one packaging change between these two. In Python 2.6, you installed the <package>python-argparse</package> package separately. In Python 2.7, this package is installed by default. Unfortunately, in Python 2.7, this package does not include <code>Provides: python-argparse</code> directive.
ja: すべての OpenStack パッケージは Python で書かれています。Wheezy は Python 2.6 と 2.7 を使用します。Python 2.6 がデフォルトのインタプリターです。Sid は Python 2.7 のみあります。この二つの間で一つのパッケージの違いがあります。Python 2.6 では <package>python-argparse</package> パッケージをそれぞれインストールします。Python 2.7 では、このパッケージがデフォルトでインストールされません。残念ながら Python 2.7 では、このパッケージは <code>Provides: python-argparse</code> ディレクティブを含みません。

source: Verify the Image Service installation
ja: Image Service のインストールの検証

source: To test the Image Service installation, download at least one virtual machine image that is known to work with OpenStack. For example, CirrOS is a small test image that is often used for testing OpenStack deployments (<link href="http://download.cirros-cloud.net/">CirrOS downloads</link>). This walk through uses the 64-bit CirrOS QCOW2 image.
ja: Image Service のインストールをテストするために、OpenStack で動作することが知られている仮想マシンイメージを何かしらダウンロードします。例えば、CirrOS (<link href="http://download.cirros-cloud.net/">CirrOS ダウンロード</link>) は OpenStack 環境をテストするためによく使用される小さなテストイメージです。ここでは 64 ビット CirrOS QCOW2 イメージを使用します。

source: Download the image into a dedicated directory using <placeholder-1/> or <placeholder-2/>:
ja: <placeholder-1/> や <placeholder-2/> を使用して、イメージを専用のディレクトリにダウンロードします。

source: Upload the image to the Image Service:
ja: イメージを Image Service にアップロードします。
ru: Загрузите образ в службу Образов:

source: Where:
ja: 各項目:

source: Arbitrary label. The name by which users refer to the image.
ja: 任意のラベル。ユーザーがイメージを参照する名前。

source: Specifies the format of the image file. Valid formats include <literal>qcow2</literal>, <literal>raw</literal>, <literal>vhd</literal>, <literal>vmdk</literal>, <literal>vdi</literal>, <literal>iso</literal>, <literal>aki</literal>, <literal>ari</literal>, and <literal>ami</literal>.
ja: イメージファイルの形式を指定します。有効な形式は <literal>qcow2</literal>, <literal>raw</literal>, <literal>vhd</literal>, <literal>vmdk</literal>, <literal>vdi</literal>, <literal>iso</literal>, <literal>aki</literal>, <literal>ari</literal>, <literal>ami</literal> です。

source: You can verify the format using the <placeholder-1/> command: <placeholder-2/>
ja: <placeholder-1/> コマンドを使用して形式を確認できます。 <placeholder-2/>

source: Specifies the container format. Valid formats include: <literal>bare</literal>, <literal>ovf</literal>, <literal>aki</literal>, <literal>ari</literal> and <literal>ami</literal>.
ja: コンテナーの形式を指定します。有効な形式は <literal>bare</literal>, <literal>ovf</literal>, <literal>aki</literal>, <literal>ari</literal>, <literal>ami</literal> です。

source: Specify <literal>bare</literal> to indicate that the image file is not in a file format that contains metadata about the virtual machine. Although this field is currently required, it is not actually used by any of the OpenStack services and has no effect on system behavior. Because the value is not used anywhere, it is safe to always specify <literal>bare</literal> as the container format.
ja: 仮想マシンに関するメタデータを含むイメージファイルがファイル形式ではないことを示すために <literal>bare</literal> を指定します。この項目が現在必須となっていますが、実際はすべての OpenStack により使用されるわけではなく、システム動作に影響を与えません。この値がどこでも使用されないため、常に <literal>bare</literal> をコンテナー形式として指定すると安全です。

source: true - All users can view and use the image.
ja: true - すべてのユーザーがイメージを表示および使用できます。

source: false - Only administrators can view and use the image.
ja: false - 管理者のみがイメージを表示および使用できます。

source: Specifies image access: <placeholder-1/>
ja: イメージのアクセス権を指定します。 <placeholder-1/>

source: Specifies the name of your downloaded image file.
ja: ダウンロードしたイメージファイルの名前を指定します。

source: For example:
ja: 例:

source: Because the returned image ID is generated dynamically, your deployment generates a different ID than the one shown in this example.
ja: 返されたイメージ ID は動的に変更されるため、導入環境によりこの例で示されているものと異なる ID が生成されます。
ru: Поскольку возвращаемый ID образа генерируется динамически, ваша среда сгенерирует ID, отличный от приведённого в этом примере.

source: Confirm that the image was uploaded and display its attributes:
ja: イメージがアップロードされたことを確認し、その属性を表示します。

source: Alternatively, the upload to the Image Service can be done without having to use local disk space to store the file, by use of the <parameter>--copy-from</parameter> parameter.
ja: 代わりに、Image Service にアップロードしたものは、<parameter>--copy-from</parameter> パラメーターを使用することにより、ファイルを保存するためのローカルディスク領域を使用する必要なく実行できます。

source: Install and configure the OpenStack clients
ja: OpenStack クライアントのインストールと設定

source: The debconf system helps users configure the <code>auth_host</code>, <code>admin_tenant_name</code>, <code>admin_user</code> and <code>admin_password</code> options.
ja: debconf システムはユーザーが <code>auth_host</code>、<code>admin_tenant_name</code>、<code>admin_user</code>、<code>admin_password</code> オプションを設定する支援をします。

source: The OpenStack Object Storage services work together to provide object storage and retrieval through a REST API. For this example architecture, you must have already installed the Identity Service, also known as Keystone.
ja: OpenStack Object Storage Service はオブジェクトストレージと REST API 経由の取得を提供するために一緒に動作します。このアーキテクチャー例は、Keystone として知られる Identity Service がすでにインストールされている必要があります。

source: Neutron concepts
ja: Neutron の概念

source: Like Nova Networking, Neutron manages software-defined networking for your OpenStack installation. However, unlike Nova Networking, you can configure Neutron for advanced virtual network topologies, such as per-tenant private networks and more.
ja: Nova Networking のように、Neutron は OpenStack インストール環境の SDN を管理します。しかしながら、Nova Networking と異なり、テナントごとのプライベートネットワークなど、より高度な仮想ネットワークトポロジー向けに Neutron を設定できます。

source: Neutron has the following object abstractions: networks, subnets, and routers. Each has functionality that mimics its physical counterpart: networks contain subnets, and routers route traffic between different subnet and networks.
ja: Neutron はネットワーク、サブネット、ルーターのオブジェクトの抽象化を実現します。それぞれ、対応する物理的なものの機能を模倣します。ネットワークがサブネットを含みます。ルーターがサブネットやネットワーク間の通信を中継します。

source: Any given Neutron set up has at least one external network. This network, unlike the other networks, is not merely a virtually defined network. Instead, it represents the view into a slice of the external network that is accessible outside the OpenStack installation. IP addresses on the Neutron external network are accessible by anybody physically on the outside network. Because this network merely represents a slice of the outside network, DHCP is disabled on this network.
ja: すべての Neutron 環境は少なくとも 1 つの外部ネットワークを持ちます。このネットワークは、他のネットワークと異なり、ほとんど仮想的に定義されたネットワークではありません。これは OpenStack インストール環境の外部からアクセス可能な外部ネットワークの一部のビューであることを意味します。Neutron 外部ネットワークの IP アドレスは外部ネットワークにある何らかの物理的なものによりアクセスできます。このネットワークがほとんど外部ネットワークの一部を表すため、DHCP はこのネットワークで無効化されます。

source: In addition to external networks, any Neutron set up has one or more internal networks. These software-defined networks connect directly to the VMs. Only the VMs on any given internal network, or those on subnets connected through interfaces to a similar router, can access VMs connected to that network directly.
ja: 外部ネットワークに加えて、あらゆる Neutron のセットアップ環境は 1 つ以上の内部ネットワークを持ちます。これらの SDN は仮想マシンに直接接続します。あらゆる指定された内部ネットワークにある仮想マシン、またはインターフェース経由で同様のルーターに接続されたサブネットにある仮想マシンのみが、そのネットワークに接続された仮想マシンに直接アクセスできます。

source: Additionally, you can allocate IP addresses on external networks to ports on the internal network. Whenever something is connected to a subnet, that connection is called a port. You can associate external network IP addresses with ports to VMs. This way, entities on the outside network can access VMs.
ja: さらに、内部ネットワークにたどり着くために外部ネットワークに IP アドレスを割り当てることができます。何かがサブネットに接続されたとき必ず、その接続がポートと呼ばれます。外部ネットワークの IP アドレスを仮想マシンのポートに関連づけられます。このように、外部ネットワークのものが仮想マシンにアクセスできます。

source: Neutron also supports <emphasis role="italic">security groups</emphasis>. Security groups enable administrators to define firewall rules in groups. A VM can belong to one or more security groups, and Neutron applies the rules in those security groups to block or unblock ports, port ranges, or traffic types for that VM.
ja: Neutron は <emphasis role="italic">セキュリティグループ</emphasis> もサポートします。セキュリティグループにより、管理者がグループでファイアウォールルールを定義できます。仮想マシンは 1 つ以上のセキュリティグループに属します。Neutron が、ポート、ポート範囲、または通信種別をブロックするかブロックしないかのために、これらのセキュリティグループにあるルールを仮想マシンに対して適用します。

source: Each plug-in that Neutron uses has its own concepts. While not vital to operating Neutron, understanding these concepts can help you set up Neutron. All Neutron installations use a core plug-in and a security group plug-in (or just the No-Op security group plug-in). Additionally, Firewall-as-a-service (FWaaS) and Load-balancing-as-a-service (LBaaS) plug-ins are available.
ja: Neutron が使用する各プラグインはそれぞれ独自の概念を持ちます。Neutron を稼働されるために必須ではありませんが、これらの概念を理解することにより、Neutron をセットアップする役に立つでしょう。すべての Neutron インストール環境は、コアプラグインとセキュリティグループプラグイン (またはただの No-Op セキュリティグループプラグイン) を使用します。さらに、Firewall-as-a-service (FWaaS) と Load-balancing-as-a-service (LBaaS) プラグインが利用可能です。

source: Open vSwitch concepts
ja: Open vSwitch の概念

source: The Open vSwitch plug-in is one of the most popular core plug-ins. Open vSwitch configurations consists of bridges and ports. Ports represent connections to other things, such as physical interfaces and patch cables. Packets from any given port on a bridge are shared with all other ports on that bridge. Bridges can be connected through Open vSwitch virtual patch cables or through Linux virtual Ethernet cables (<literal>veth</literal>). Additionally, bridges appear as network interfaces to Linux, so you can assign IP addresses to them.
ja: Open vSwitch プラグインは最も人気のあるコアプラグインの一つです。Open vSwitch の設定はブリッジとポートから構成されます。ポートは物理インターフェースやパッチケーブルのような他のものへの接続を意味します。ブリッジのあらゆるポートからのパケットは、そのブリッジにあるすべての他のポートと共有されます。ブリッジは Open vSwitch 仮想パッチケーブルまたは Linux 仮想イーサネットケーブル (<literal>veth</literal>) から接続されます。また、ブリッジは Linux にネットワークインターフェースとして認識されるため、それらに IP アドレスを割り当てることができます。

source: In Neutron, the integration bridge, called <literal>br-int</literal>, connects directly to the VMs and associated services. The external bridge, called <literal>br-ex</literal>, connects to the external network. Finally, the VLAN configuration of the Open vSwitch plug-in uses bridges associated with each physical network.
ja: Neutron では、<literal>br-int</literal> という統合ブリッジが仮想マシンおよび関連するサービスを直接接続します。<literal>br-ex</literal> という外部ブリッジが外部ネットワークに接続します。最後に、Open vSwitch プラグインの VLAN 設定が各物理ネットワークと関連づけられたブリッジを使用します。

source: In addition to defining bridges, Open vSwitch has OpenFlow, which enables you to define networking flow rules. Certain configurations use these rules to transfer packets between VLANs.
ja: ブリッジの定義に加えて、Open vSwitch は OpenFlow に対応しています。これにより、ネットワークのフロールールを定義できるようになります。特定の設定が VLAN 間のパケットを転送するために、これらのルールを使用します。

source: Finally, some configurations of Open vSwitch use network namespaces that enable Linux to group adapters into unique namespaces that are not visible to other namespaces, which allows the same network node to manage multiple Neutron routers.
ja: 最後に、Open vSwitch のいくつかの設定はネットワーク名前空間を使用します。この名前空間により、Linux が他の名前空間に認識されない一意な名前空間の中にアダプターをグループ化できます。これで、同じネットワークノードが複数の Neutron ルーターを管理できるようになります。

source: With Open vSwitch, you can use two different technologies to create the virtual networks: GRE or VLANs.
ja: Open vSwitch を用いると、仮想ネットワークを作成するために、2 つの異なる技術 GRE と VLAN を使用できます。

source: Generic Routing Encapsulation (GRE) is the technology used in many VPNs. It wraps IP packets to create entirely new packets with different routing information. When the new packet reaches its destination, it is unwrapped, and the underlying packet is routed. To use GRE with Open vSwitch, Neutron creates GRE tunnels. These tunnels are ports on a bridge and enable bridges on different systems to act as though they were one bridge, which allows the compute and network nodes to act as one for the purposes of routing.
ja: Generic Routing Encapsulation (GRE) は多くの VLAN で使用される技術です。異なるルーティング情報を用いて新しいパケット全体を作成するために IP パケットをラップできます。新しいパケットがその宛て先に到達したとき、ラップが外され、元のパケットが中継されます。Open vSwitch を用いて GRE を使用するために、Neutron が GRE トンネルを作成します。これらのトンネルはブリッジにポートを作成し、異なるシステムにあるブリッジが 1 つのブリッジのように動作できるようにします。これにより、コンピュートノードとネットワークノードがルーティング目的に 1 つのものとして動作できます。

source: Virtual LANs (VLANs), on the other hand, use a special modification to the Ethernet header. They add a 4-byte VLAN tag that ranges from 1 to 4094 (the 0 tag is special, and the 4095 tag, made of all ones, is equivalent to an untagged packet). Special NICs, switches, and routers know how to interpret the VLAN tags, as does Open vSwitch. Packets tagged for one VLAN are only shared with other devices configured to be on that VLAN, even though all devices are on the same physical network.
ja: 一方、Virtual LAN (VLAN) はイーサネットヘッダーに対する特別な変更を使用します。1 から 4096 までの範囲で 4 バイトの VLAN タグを追加します (タグ 0 は特別です。すべてのものからなるタグ 4095 はタグなしパケットにあたります)。特別な NIC、スイッチ、ルーターは Open vSwitch が実行するように、VLAN タグを解釈する方法について理解しています。1 つの VLAN にタグ付けされたパケットは、すべてのデバイスが同じ物理ネットワークにあるときさえ、その VLAN 上に設定された他のデバイスのみと共有されます。

source: The most common security group driver used with Open vSwitch is the Hybrid IPTables/Open vSwitch plug-in. It uses a combination for IPTables and OpenFlow rules. Use the IPTables tool to create firewalls and set up NATs on Linux. This tool uses a complex rule system and chains of rules to accommodate the complex rules required by Neutron security groups.
ja: Open vSwitch とともに使用される最も一般的なセキュリティグループはハイブリッド iptables/Open vSwitch プラグインです。これは iptables ルールと OpenFlow ルールの組み合わせを使用します。Linux でファイアウォールを作成し、NAT をセットアップするために iptables ツールを使用します。このツールは、Neutron セキュリティグループにより必要となる複雑なルールを実現するために、複雑なルールシステムとルールのチェインを使用します。

source: Install the Telemetry module
ja: Telemetry モジュールのインストール

source: Telemetry provides an API service that provides a collector and a range of disparate agents. Before you can install these agents on nodes such as the compute node, you must use this procedure to install the core components on the controller node.
ja: Telemetry は情報収集機能とさまざまな種類のエージェントを提供する API サービスです。コンピュートノードのようなノードにこれらのエージェントをインストールする前に、コントローラーノードにコアコンポーネントをインストールするために、この手順を使用する必要があります。

source: Install the Telemetry service on the controller node:
ja: コントローラーノードに Telemetry Service をインストールします。

source: Respond to the prompts for <link linkend="debconf-keystone_authtoken"><literal>[keystone_authtoken]</literal> settings</link>, <link linkend="debconf-rabbitqm">RabbitMQ credentials</link> and <link linkend="debconf-api-endpoints">API endpoint</link> registration.
ja: <link linkend="debconf-keystone_authtoken"><literal>[keystone_authtoken]</literal> 設定</link>、<link linkend="debconf-rabbitqm">RabbitMQ クレデンシャル</link>、<link linkend="debconf-api-endpoints">API エンドポイント</link>の登録に関するプロンプトに答えます。

source: The Telemetry service uses a database to store information. Specify the location of the database in the configuration file. The examples use a MongoDB database on the controller node:
ja: Telemetry Service は情報を保存するためにデータベースを使用します。設定ファイルでデータベースの場所を指定します。この例はコントローラーノードで MongoDB データベースを使用します。

source: By default MongoDB is configured to create several 1 GB files in the <filename>/var/lib/mongodb/journal/</filename> directory to support database journaling.
ja: MongoDB はデフォルトで、データベースのジャーナリングをサポートするために、<filename>/var/lib/mongodb/journal/</filename> ディレクトリにいくつかの 1GB のファイルを作成するよう設定されます。

source: If you need to minimize the space allocated to support database journaling then set the <option>smallfiles</option> configuration key to <literal>true</literal> in the <filename>/etc/mongodb.conf</filename> configuration file. This configuration reduces the size of each journaling file to 512 MB.
ja: データベースのジャーナリングをサポートするために割り当てられる領域を最小化する必要がある場合、<filename>/etc/mongodb.conf</filename> 設定ファイルにある <option>smallfiles</option> 設定キーを <literal>true</literal> に設定します。この設定により、各ジャーナルファイルの容量が 512MB に減ります。

source: As the files are created the first time the MongoDB service starts you must stop the service and remove the files for this change to take effect:
ja: MongoDB サービスを初めて起動するときに、このファイルが作成されるので、この変更を反映するためにサービスを停止して、このファイルを削除する必要があります。

source: For more information on the <option>smallfiles</option> configuration key refer to the MongoDB documentation at <link href="http://docs.mongodb.org/manual/reference/configuration-options/#smallfiles"/>.
ja: <option>smallfiles</option> 設定キーの詳細は MongoDB のドキュメント <link href="http://docs.mongodb.org/manual/reference/configuration-options/#smallfiles"/> を参照してください。

source: For instructions detailing the steps to disable database journaling entirely refer to <link href="http://docs.mongodb.org/manual/tutorial/manage-journaling/"/>.
ja: データベースのジャーナリング自体を無効化する手順の詳細は <link href="http://docs.mongodb.org/manual/tutorial/manage-journaling/"/> を参照してください。

source: Configure MongoDB to make it listen on the controller public IP address. Edit the <filename>/etc/mongodb.conf</filename> file and modify the <literal>bind_ip</literal> key:
ja: コントローラーのパブリック IP アドレスをリッスンするよう MongoDB を設定します。<filename>/etc/mongodb.conf</filename> ファイルを編集し、<literal>bind_ip</literal> キーを変更します。

source: Restart the MongoDB service to apply the configuration change:
ja: 設定の変更を適用するために MongoDB のサービスを再起動します。

source: Start the MongoDB server and configure it to start when the system boots:
ja: MongoDB サーバーを起動し、システム起動時に起動するよう設定します。

source: Create the database and a <literal>ceilometer</literal> database user:
ja: データベースと <literal>ceilometer</literal> データベースユーザーを作成します。

source: Configure the Telemetry service to use the database:
ja: Telemetry Service がデータベースを使用するよう設定します。

source: Edit the <filename>/etc/ceilometer/ceilometer.conf</filename> file and change the <literal>[database]</literal> section:
ja: <filename>/etc/ceilometer/ceilometer.conf</filename> ファイルを編集し、<literal>[database]</literal> セクションを変更します。

source: For SUSE Linux Enterprise, run the following command:
ja: SUSE Linux Enterprise の場合、以下のコマンドを実行します。

source: Configure the RabbitMQ access:
ja: RabbitMQ のアクセス権を設定します。

source: Edit the <filename>/etc/ceilometer/ceilometer.conf</filename> file and update the <literal>[DEFAULT]</literal> section:
ja: <filename>/etc/ceilometer/ceilometer.conf</filename> ファイルを編集し、<literal>[DEFAULT]</literal> セクションを更新します。

source: Configure collector dispatcher:
ja: コレクターディスパッチャーを設定します。

source: Configure the log directory.
ja: ログディレクトリを設定します。

source: Create a <literal>ceilometer</literal> user that the Telemetry service uses to authenticate with the Identity Service. Use the <literal>service</literal> tenant and give the user the <literal>admin</literal> role:
ja: Telemetry Service が Identity Service で認証するために使用する <literal>ceilometer</literal> ユーザーを作成します。<literal>service</literal> プロジェクトを使用し、ユーザーに <literal>admin</literal> ロールを与えます。

source: Add the credentials to the configuration files for the Telemetry service:
ja: クレデンシャルを Telemetry Service の設定ファイルに追加します。

source: Edit the <filename>/etc/ceilometer/ceilometer.conf</filename> file and change the <literal>[keystone_authtoken]</literal> section:
ja: <filename>/etc/ceilometer/ceilometer.conf</filename> ファイルを編集し、<literal>[keystone_authtoken]</literal> セクションを変更します。

source: Also set the <literal>[service_credentials]</literal> section:
ja: <literal>[service_credentials]</literal> セクションも設定します。

source: Register the Telemetry service with the Identity Service so that other OpenStack services can locate it. Use the <placeholder-1/> command to register the service and specify the endpoint:
ja: 他の OpenStack サービスから使用できるように、Telemetry Service を Identity Service に登録します。サービスを登録し、エンドポイントを指定するために、<placeholder-1/> コマンドを使用します。

source: Restart the services with their new settings:
ja: 新しい設定を用いてサービスを再起動します。

source: Start the <systemitem class="service">openstack-ceilometer-api</systemitem>, <systemitem class="service" os="opensuse;sles">openstack-ceilometer-agent-central</systemitem><systemitem class="service" os="rhel;fedora;centos">openstack-ceilometer-central</systemitem>, <systemitem class="service">openstack-ceilometer-collector</systemitem>, <systemitem class="service" os="opensuse;sles">openstack-ceilometer-alarm-evaluator</systemitem>, and <systemitem class="service" os="opensuse;sles">openstack-ceilometer-alarm-notifier</systemitem> services and configure them to start when the system boots:
ja: <systemitem class="service">openstack-ceilometer-api</systemitem>、<systemitem class="service" os="opensuse;sles">openstack-ceilometer-agent-central</systemitem><systemitem class="service" os="rhel;fedora;centos">openstack-ceilometer-central</systemitem>、<systemitem class="service">openstack-ceilometer-collector</systemitem>、<systemitem class="service" os="opensuse;sles">openstack-ceilometer-alarm-evaluator</systemitem>、<systemitem class="service" os="opensuse;sles">openstack-ceilometer-alarm-notifier</systemitem> サービスを起動し、システムの起動時にそれらが起動するよう設定します。

source: To test the Telemetry installation, download an image from the Image Service, and use the <placeholder-1/> command to display usage statistics.
ja: Telemetry のインストールをテストするために、イメージを Image Service からダウンロードします。そして、使用量の統計情報を表示するために <placeholder-1/> コマンドを使用します。

source: Use the <literal>ceilometer meter-list</literal> command to test the access to Telemetry:
ja: Telemetry へのアクセスをテストするために <literal>ceilometer meter-list</literal> コマンドを使用します。

source: Call the <literal>ceilometer meter-list</literal> command again to validate that the download has been detected and stored by the Telemetry:
ja: このダウンロードが Telemetry により検知され、保存されていることを検証するために <literal>ceilometer meter-list</literal> コマンドを呼び出します。

source: You can now get usage statistics for the various meters:
ja: さまざまなメーターの使用量の統計情報を取得できるようになりました。

source: Under the <literal>[DEFAULT]</literal> section:
ja: <literal>[DEFAULT]</literal> セクションの下:

source: Edit the <filename>/etc/nova/nova.conf</filename> file:
ja: <filename>/etc/nova/nova.conf</filename> ファイルを編集します。

source: Add the following keys under the <literal>[DEFAULT]</literal> section:
ja: 以下のキーを <literal>[DEFAULT]</literal> セクションに追加します。

source: Install Compute controller services
ja: Compute コントローラーサービスのインストール

source: Compute is a collection of services that enable you to launch virtual machine instances. You can configure these services to run on separate nodes or the same node. In this guide, most services run on the controller node and the service that launches virtual machines runs on a dedicated compute node. This section shows you how to install and configure these services on the controller node.
ja: Compute は仮想マシンインスタンスを起動できるようにするためのサービス群です。これらのサービスを別々のノードで実行することも同じノードで実行することも設定できます。このガイドでは、多くのサービスはコントローラーノードで実行し、仮想マシンを起動するサービスはコンピュート専用ノードで実行します。このセクションは、コントローラーノードにこれらのサービスをインストールし、設定する方法を示します。

source: Install the Compute packages necessary for the controller node.
ja: コントローラーノードに必要な Compute のパッケージをインストールします。

source: Respond to the prompts for <link linkend="debconf-dbconfig-common">database management</link>, <link linkend="debconf-keystone_authtoken"><literal>[keystone_authtoken]</literal> settings</link>, <link linkend="debconf-rabbitqm">RabbitMQ credentials</link>, and <link linkend="debconf-api-endpoints">API endpoint</link> registration. The <placeholder-1/> command runs automatically.
ja: <link linkend="debconf-dbconfig-common">データベース管理</link>、<link linkend="debconf-keystone_authtoken"><literal>[keystone_authtoken]</literal> 設定</link>、<link linkend="debconf-rabbitqm">RabbitMQ クレデンシャル</link>、<link linkend="debconf-api-endpoints">API エンドポイント</link>登録に関するプロンプトに答えます。<placeholder-1/> コマンドが自動的に実行されます。
