Repository: 25hours/openstack-manuals
Catalog: doc/install-guide/locale/*.po
Languages: ja, ru, vi_vn, zh_cn

source: For example, using an exclusive slice of <literal>203.0.113.0/24</literal> with IP address range <literal>203.0.113.24</literal> to <literal>203.0.113.31</literal>:
vi_vn: Ví dụ, sử dụng một phần của <literal>203.0.113.0/24</literal> với dải địa chỉ IP từ <literal>203.0.113.24</literal> đến <literal>203.0.113.31</literal>:

source: For information about disk and container formats for images, see <link xlink:href="http://docs.openstack.org/image-guide/content/image-formats.html">Disk and container formats for images</link> in the <citetitle>OpenStack Virtual Machine Image Guide</citetitle>.
vi_vn: Để biết thêm thông tin về các định dạng đĩa và container cho các image, xem <link xlink:href="http://docs.openstack.org/image-guide/content/image-formats.html">Các định dạng đĩa và container cho image</link> trong <citetitle>Hướng dẫn về Image Máy ảo OpenStack</citetitle>.

source: For information about the <placeholder-1/> parameters, see <link xlink:href="http://docs.openstack.org/cli-reference/content/glanceclient_commands.html#glanceclient_subcommand_image-create">Image service command-line client</link> in the <citetitle>OpenStack Command-Line Interface Reference</citetitle>.
vi_vn: Để biết thêm thông tin về các tham số <placeholder-1/>, xem <link xlink:href="http://docs.openstack.org/cli-reference/content/glanceclient_commands.html#glanceclient_subcommand_image-create">client dòng lệnh của dịch vụ Image</link> trong <citetitle>Tham chiếu Giao diện dòng lệnh của OpenStack</citetitle>.

source: For information on requirements for other back ends, see <link xlink:href="http://docs.openstack.org/trunk/config-reference/content/ch_configuring-openstack-image-service.html"><citetitle>Configuration Reference</citetitle></link>.
vi_vn: Để biết thêm thông tin về yêu cầu cho các back end khác, xem <link xlink:href="http://docs.openstack.org/trunk/config-reference/content/ch_configuring-openstack-image-service.html"><citetitle>Cấu hình Tham khảo</citetitle></link>.

source: For more information about how to download and build images, see <link xlink:href="http://docs.openstack.org/image-guide/content/index.html"><citetitle>OpenStack Virtual Machine Image Guide</citetitle></link>. For information about how to manage images, see the <link xlink:href="http://docs.openstack.org/user-guide/index.html"><citetitle>OpenStack User Guide</citetitle></link>.
vi_vn: Để biết thêm thông tin về cách tải xuống và tạo ra các image, xem tại <link xlink:href="http://docs.openstack.org/image-guide/content/index.html"><citetitle>Hướng dẫn về image máy ảo OpenStack</citetitle></link>. Để biết thêm thông tin về cách quản lý các image, xem tại <link xlink:href="http://docs.openstack.org/user-guide/index.html"><citetitle>Hướng dẫn sử dụng OpenStack</citetitle></link>.

source: For more information about how to manage volumes, see the <link xlink:href="http://docs.openstack.org/user-guide/index.html"><citetitle>OpenStack User Guide</citetitle></link>.
vi_vn: Để biết thêm chi tiết về cách quản lý các ổ lưu trữ, xem <link xlink:href="http://docs.openstack.org/user-guide/index.html"><citetitle>Hướng dẫn Người dùng OpenStack</citetitle></link>.

source: For more information about system requirements, see the <link xlink:href="http://docs.openstack.org/ops/">OpenStack Operations Guide</link>.
vi_vn: Để biết thêm thông tin về các yêu cầu của hệ thống, xem <link xlink:href="http://docs.openstack.org/ops/">Hướng dẫn Vận hành OpenStack</link>.

source: For more information on other modules that enable additional features, see the <link xlink:href="http://docs.openstack.org/developer/swift/deployment_guide.html">Deployment Guide</link>.
vi_vn: Để biết thêm thông tin về các mô đun khác mà cho phép chèn thêm các tính năng, xem tại <link xlink:href="http://docs.openstack.org/developer/swift/deployment_guide.html">Hướng dẫn triển khai</link>.

source: For more information, see the <link xlink:href="http://docs.openstack.org/admin-guide-cloud/content/ch_networking.html">Networking</link> chapter of the <citetitle>OpenStack Cloud Administrator Guide</citetitle>.
vi_vn: Để biết thêm thông tin, xem chương <link xlink:href="http://docs.openstack.org/admin-guide-cloud/content/ch_networking.html">Networking</link> của tài liệu <citetitle>Hướng dẫn Quản trị viên OpenStack Cloud</citetitle>.

source: For more information, see the <link xlink:href="https://bugzilla.redhat.com/show_bug.cgi?id=1150678">bug report</link>.
vi_vn: Để biết thêm thông tin, xem <link xlink:href="https://bugzilla.redhat.com/show_bug.cgi?id=1150678">bản báo lỗi</link>.

source: For more information, see the <link xlink:href="https://www.suse.com/documentation/sles-12/book_sle_admin/data/sec_nm_activate.html">SLES </link> or the <link xlink:href="http://activedoc.opensuse.org/book/opensuse-reference/chapter-13-basic-networking#sec.basicnet.yast.netcard.global"> openSUSE documentation</link>.
vi_vn: Để biết thêm thông tin, xem <link xlink:href="https://www.suse.com/documentation/sles-12/book_sle_admin/data/sec_nm_activate.html"> tài liệu SLES </link> hoặc <link xlink:href="http://activedoc.opensuse.org/book/opensuse-reference/chapter-13-basic-networking#sec.basicnet.yast.netcard.global"> openSUSE </link>.

source: For security reasons, disable the temporary authentication token mechanism:
vi_vn: Vì các lý do bảo mật, tắt tạm thời cơ chế token xác thực tạm thời:

source: For security reasons, do not use the temporary authentication token for longer than necessary to initialize the Identity service.
vi_vn: Vì các lý do bảo mật, không sử dụng các token xác thực tạm thời lâu hơn cần thiết để khởi tạo dịch vụ Identity.

source: For simplicity, this guide describes configuring the Image service to use the <literal>file</literal> back end, which uploads and stores in a directory on the controller node hosting the Image service. By default, this directory is <filename>/var/lib/glance/images/</filename>.
vi_vn: Để cho đơn giản, bài hướng dẫn này mô tả quá trình cấu hình dịch vụ Image để sử dụng back end của <literal>file</literal>, giúp tải lên và lưu trữ trong một thư mục trên node điều khiển có cài dịch vụ Image. Mặc định, đường dẫn của thư mục này là <filename>/var/lib/glance/images/</filename>.

source: For simplicity, this guide implicitly uses the <literal>default</literal> domain.
vi_vn: Để đơn giản hóa, hướng dẫn này ám chỉ sử dụng miền <literal>mặc định</literal>.

source: For the <literal>restrict</literal> keys, you essentially remove the <literal>nopeer</literal> and <literal>noquery</literal> options.
ru: Для ключей <literal>restrict</literal> вы, по существу, удаляете только параметры <literal>nopeer</literal> и <literal>noquery</literal>.
vi_vn: Để <literal>hạn chế</literal> các khóa, bạn cần phải loại bỏ các lựa chọn <literal>không ngang hàng</literal> và <literal>không truy vấn</literal>.
zh_cn: 对于 <literal>restrict</literal> 关键字，您基本上需要删除 <literal>nopeer</literal> 和 <literal>noquery</literal> 选项。

source: For the outside network to access VMs, and vice versa, routers between the networks are needed. Each router has one gateway that is connected to a network and many interfaces that are connected to subnets. Like a physical router, subnets can access machines on other subnets that are connected to the same router, and machines can access the outside network through the gateway for the router.
ja: 外部ネットワークが仮想マシンにアクセスするため、またその逆のため、ネットワーク間のルーターが必要になります。各ルーターはネットワークに接続された 1 つのゲートウェイとサブネットに接続された多くのインターフェースを持ちます。物理ルーターのように、同じルーターに接続された他のサブネットにあるマシンにサブネットがアクセスできます。また、マシンはルーターに対するゲートウェイ経由で外部ネットワークにアクセスできます。
vi_vn: Để hệ thống mạng bên ngoài truy cập vào các máy ảo và ngược lại, cần phải có các router giữa các hệ thống mạng. Mỗi router có một gateway kết nối với một hệ thống mạng và nhiều giao diện kết nối đến các subnet. Cũng giống như một router vật lý, các subnet có thể truy cập vào các máy trên các subnet khác được kết nối vào cùng một router, và các máy có thể truy cập ra hệ thống mạng bên ngoài thông qua gateway của router.
zh_cn: 如果外网需要访问虚拟机，或者相反，网络中的路由器就是必须要使用的。每个路由器配有一个网关，可以连接到网络和接口，这些接口又连接着子网。如同实体路由器一样，子网中的机器可以访问连接到同一个路由器的子网中的其它机器，机器可以通过该路由器的网关访问外网。

source: Format the <literal>/dev/sdb1</literal> and <literal>/dev/sdc1</literal> partitions as XFS:
vi_vn: Xét định dạng các phân vùng <literal>/dev/sdb1</literal> và <literal>/dev/sdb1</literal> thành XFS:

source: From a host on the external network, ping the tenant router gateway:
vi_vn: Từ một máy vật lý trên hệ thống mạng ngoại vùng, ping đến gateway của tenant router:

source: From the <emphasis>compute</emphasis> node, <placeholder-1/> a site on the Internet:
ru: С <emphasis>управляющего</emphasis> узла сделайте <placeholder-1/> сайта в интернете:
vi_vn: Từ node <emphasis>tính toán</emphasis>, <placeholder-1/> đến một trang trên Internet:
zh_cn: 从 <emphasis>计算</emphasis> 节点， <placeholder-1/> 互联网上的一个站点：

source: From the <emphasis>compute</emphasis> node, <placeholder-1/> the management interface on the <emphasis>controller</emphasis> node:
ru: С <emphasis>вычислительного</emphasis> узла сделайте <placeholder-1/> управляющего интерфейса на <emphasis>управляющем</emphasis> узле:
vi_vn: Từ node <emphasis>tinhas toán</emphasis>, <placeholder-1/> đến giao diện quản lý trên node <emphasis>điều khiển</emphasis>:
zh_cn: 从 <emphasis>计算</emphasis> 节点， <placeholder-1/> 管理接口位于<emphasis>控制</emphasis> 节点：

source: From the <emphasis>controller</emphasis> node, <placeholder-1/> a site on the Internet:
ru: С <emphasis>управляющего</emphasis> узла сделайте <placeholder-1/> сайта в интернете.
vi_vn: Từ node <emphasis>điều khiển</emphasis>, <placeholder-1/> một trang trên Internet:
zh_cn: 从 <emphasis>控制</emphasis> 节点， <placeholder-1/> 互联网上的一个站点：

source: From the <emphasis>controller</emphasis> node, <placeholder-1/> the management interface on the <emphasis>compute</emphasis> node:
ru: С <emphasis>управляющего</emphasis> узла сделайте <placeholder-1/> управляющего интерфейса на <emphasis>вычислительном</emphasis> узле:
vi_vn: Từ node <emphasis>điều khiển</emphasis>, <placeholder-1/> đến giao diện quản lý trên node <emphasis>tính toán</emphasis>:
zh_cn: 从 <emphasis>控制</emphasis> 节点， <placeholder-1/> 管理接口位于<emphasis>计算</emphasis> 节点：

source: From the <emphasis>controller</emphasis> node, <placeholder-1/> the management interface on the <emphasis>network</emphasis> node:
ru: С <emphasis>управляющего</emphasis> узла сделайте <placeholder-1/> управляющего интерфейса на <emphasis>сетевом</emphasis> узле:
vi_vn: Từ node <emphasis>điều khiển</emphasis>, <placeholder-1/> đến giao diện quản lý trên node <emphasis>mạng</emphasis>:
zh_cn: 从 <emphasis>控制</emphasis> 节点， <placeholder-1/> 管理接口位于<emphasis>网络</emphasis> 节点：

source: From the <emphasis>network</emphasis> node, <placeholder-1/> a site on the Internet:
ru: С <emphasis>сетевого</emphasis> узла сделайте <placeholder-1/> сайта в интернете:
vi_vn: Từ node <emphasis>mạng</emphasis>, <placeholder-1/> đến một trang trên Internet:
zh_cn: 从 <emphasis>网络</emphasis> 节点， <placeholder-1/> 互联网上的一个站点：

source: From the <emphasis>network</emphasis> node, <placeholder-1/> the instance tunnels interface on the <emphasis>compute</emphasis> node:
ru: С <emphasis>сетевого</emphasis> узла сделайте <placeholder-1/> интерфейса туннелей на <emphasis>вычислительном</emphasis> узле:
vi_vn: Từ <emphasis>network</emphasis> node, <placeholder-1/> các giao diện đường hầm của instance trên <emphasis>compute</emphasis> node:
zh_cn: 从 <emphasis>网络</emphasis> 节点， <placeholder-1/> 实例通道接口位于<emphasis>计算</emphasis> 节点：

source: From the <emphasis>network</emphasis> node, <placeholder-1/> the management interface on the <emphasis>controller</emphasis> node:
ru: С <emphasis>сетевого</emphasis> узла сделайте <placeholder-1/> управляющего интерфейса на <emphasis>управляющем</emphasis> узле:
vi_vn: Từ node <emphasis>mạng</emphasis>, <placeholder-1/> đến giao diện quản lý trên node <emphasis>điều khiển</emphasis>:
zh_cn: 从 <emphasis>网络</emphasis> 节点， <placeholder-1/> 管理接口位于<emphasis>控制</emphasis> 节点：

source: Generally, the <systemitem class="library">-common</systemitem> packages install the configuration files. For example, the <literal>glance-common</literal> package installs the <filename>glance-api.conf</filename> and <filename>glance-registry.conf</filename> files. So, for the Image service, you must re-configure the <literal>glance-common</literal> package. The same applies for <literal>cinder-common</literal>, <literal>nova-common</literal>, and <literal>heat-common</literal> packages.
vi_vn: Thường thì các gói <systemitem class="library">-common</systemitem> cài đặt các file cấu hình. Ví dụ, gói <literal>glance-common</literal> cài đặt các file <filename>glance-api.conf</filename> và <filename>glance-registry.conf</filename>. Vì vậy, đối với dịch vụ Image, bạn phải cấu hình lại gói. Điều này cũng đúng với các gói <literal>cinder-common</literal>, <literal>nova-common</literal> và <literal>heat-common</literal> .

source: Generally, this section looks like this:
ja: 一般的に、このセクションはこのようになります。
ru: Обычно этот раздел выглядит так:
vi_vn: Thường thì mục này trông giống như sau:
zh_cn: 通常来说，本章如下所示：

source: Generate a key pair:
ja: キーペアを生成します。
ru: Сгенерируйте пару ключей:
vi_vn: Tạo một cặp khóa:
zh_cn: 生成密钥对：

source: Generate a random value to use as the administration token during initial configuration:
ru: Создайте случайную строку для использования в качестве административного токена для первоначальной настройки:
vi_vn: Tạo ra một giá trị ngẫu nhiên để sử dụng như một token quản trị trong quá trình khởi tạo cấu hình:
zh_cn: 生成一个随机值在初始的配置中作为管理员的令牌。

source: Generate a random value to use as the telemetry secret:
vi_vn: Sinh ra một giá trị ngẫu nhiên để sử dụng làm bí mật telemetry:
zh_cn: 生成一个随机值，作为 telemetry 的 secret：

source: Generate and add a key pair:
vi_vn: Sinh ra và thêm vào một cặp khóa:

source: Grant proper access to the <literal>cinder</literal> database:
ru: Предоставьте надлежащие права доступа до базы <literal>cinder</literal>:
vi_vn: Cấp quyền truy nhập thích hợp tới cơ sở dữ liệu <literal>cinder</literal>:
zh_cn: 为 <literal>cinder</literal> 数据库赋予适当的权限：

source: Grant proper access to the <literal>glance</literal> database:
ru: Предоставьте надлежащие права доступа до базы <literal>glance</literal>:
vi_vn: Cấp quyền truy nhập thích hợp tới cơ sở dữ liệu <literal>glance</literal>:
zh_cn: 给 <literal>glance</literal> 数据库授予合适的访问权限：

source: Grant proper access to the <literal>heat</literal> database:
ru: Предоставьте надлежащие права доступа до базы <literal>heat</literal>:
vi_vn: Cấp quyền truy cập thích hợp cho cơ sở dữ liệu <literal>heat</literal>:
zh_cn: 为 <literal>heat</literal> 数据库赋予合适的访问权限：

source: Grant proper access to the <literal>keystone</literal> database:
ru: Предоставьте надлежащие права доступа до базы <literal>keystone</literal>:
vi_vn: Cấp quyền truy cập thích hợp tới cơ sở dữ liệu <literal>keystone</literal>:
zh_cn: 为 <literal>keystone</literal> 数据库赋予恰当的访问权限：

source: Grant proper access to the <literal>neutron</literal> database:
ru: Предоставьте надлежащие права доступа до базы <literal>neutron</literal>:
vi_vn: Cấp quyền truy cập thích hợp cho cơ sở dữ liệu <literal>neutron</literal>:
zh_cn: 为 <literal>neutron</literal> 数据库赋予合适的访问权限：

source: Grant proper access to the <literal>nova</literal> database:
ru: Предоставьте надлежащие права доступа до базы <literal>nova</literal>:
vi_vn: Cấp quyền truy cập thích hợp cho cơ sở dữ liệu <literal>nova</literal>:
zh_cn: 为 <literal>nova</literal> 数据库赋予合适的访问权限：

source: Grant proper access to the <literal>sahara</literal> database:
vi_vn: Cấp quyền truy cập thích hợp tới cơ sở dữ liệu <literal>sahara</literal>:
zh_cn: 为 <literal>sahara</literal> 数据库赋予适当的权限：

source: Horizon enables you to customize the brand of the dashboard.
ru: Horizon позволяет вам настроить оформление панели.
vi_vn: Horizon cho phép bạn tùy chỉnh nhãn hiệu của dashboard.
zh_cn: Horizon 允许您自定义仪表板的商标。

source: Horizon provides a set of core classes and reusable templates and tools.
ru: Horizon предоставляет набор основных классов и настраиваемых шаблонов и инструментов.
vi_vn: Horizon cung cấp một bộ các lớp chính, các bản mẫu và công cụ có khả năng tái sử dụng.
zh_cn: Horizon 提供了一套内核类和可重复使用的模板及工具。

source: However, VMs will reduce performance of your instances, particularly if your hypervisor and/or processor lacks support for hardware acceleration of nested VMs.
ru: Однако, ВМ уменьшают производительность ваших инстансов OpenStack, особенно если ваш гипервизор и/или процессор не поддерживают аппаратное ускорение вложенных ВМ.
vi_vn: Tuy nhiên các máy ảo sẽ làm giảm thiểu hiệu suất các instance của bạn, đặc biệt nếu hypervisor và bộ xử lý của bạn thiếu khả năng hỗ trợ cho việc tăng tốc phần cứng khi các máy ảo liên kết với nhau.
zh_cn: 但是，虚拟机会降低您实例的性能，特别是如果您的 hypervisor 和/或 进程缺少硬件加速的嵌套虚拟机支持时。

source: IP address: 10.0.0.11
ru: IP-адрес: 10.0.0.11
vi_vn: địa chỉ IP: 10.0.0.11
zh_cn: IP 地址: 10.0.0.11

source: IP address: 10.0.0.21
ja: IP アドレス: 10.0.0.21
ru: IP-адрес: 10.0.0.21
vi_vn: địa chỉ IP: 10.0.0.21
zh_cn: IP地址: 10.0.0.21

source: IP address: 10.0.0.31
ru: IP-адрес: 10.0.0.31
vi_vn: Địa chỉ IP: 10.0.0.31
zh_cn: IP 地址：10.0.0.31

source: IP address: 10.0.0.41
ru: IP-адрес: 10.0.0.41
vi_vn: Địa chỉ IP: 10.0.0.41
zh_cn: IP地址: 10.0.0.41

source: IP address: 10.0.0.51
ru: IP-адрес: 10.0.0.51
vi_vn: Địa chỉ IP: 10.0.0.51
zh_cn: IP 地址：10.0.0.51

source: IP address: 10.0.0.52
ru: IP-адрес: 10.0.0.52
vi_vn: Địa chỉ IP: 10.0.0.52
zh_cn: IP 地址：10.0.0.52

source: IP address: 10.0.1.21
ja: IP アドレス: 10.0.1.21
ru: IP-адрес: 10.0.1.21
vi_vn: Địa chỉ IP: 10.0.1.21
zh_cn: IP地址: 10.0.1.21

source: IP address: 10.0.1.31
ja: IP アドレス: 10.0.1.31
ru: IP-адрес: 10.0.1.31
vi_vn: Địa chỉ IP: 10.0.1.31
zh_cn: IP地址: 10.0.1.31

source: Ideally, you can prevent these problems by enabling <glossterm baseform="jumbo frame">jumbo frames</glossterm> on the physical network that contains your tenant virtual networks. Jumbo frames support MTUs up to approximately 9000 bytes which negates the impact of GRE overhead on virtual networks. However, many network devices lack support for jumbo frames and OpenStack administrators often lack control over network infrastructure. Given the latter complications, you can also prevent MTU problems by reducing the instance MTU to account for GRE overhead. Determining the proper MTU value often takes experimentation, but 1454 bytes works in most environments. You can configure the DHCP server that assigns IP addresses to your instances to also adjust the MTU.
ru: В идеале, вы можете предотвратить эти проблемы включив <glossterm baseform="jumbo frame">jumbo frames</glossterm> в физической сети, которая содержит виртуальные сети проектов. Jumbo frames поддерживают MTU до приблизительно 9000 байт, что сводит на нет накладные расходы GRE в виртуальных сетях. Однако, многие сетевые устройства не поддерживают jumbo frames и администраторы OpenStack зачастую не имеют контроля над сетевой инфраструктурой. Учитывая упомянутые сложности, вы можете предотвратить проблемы с MTU уменьшив MTU инстансов с учётом затрат на GRE. Вычисление правильного значения MTU часто требует экспериментирования, но значение в 1454 байт работает в большинстве случаев. Вы можете настроить DHCP сервер, который назначает IP-адресы вашим инстансам так же назначать MTU.
vi_vn: Lý tưởng nhất thì bạn có thể ngăn chặn các vấn đề này bằng cách cho phép các <glossterm baseform="jumbo frame">jumbo frame</glossterm> trên hệ thống mạng vật lý mà chứa hệ thống mạng ảo tenant của bạn. Các jumbo frame hỗ trợ các MTU lên đến xấp xỉ 9000 bytes qua đó giảm bớt ảnh hưởng của quá tải GRE trên các mạng ảo. Tuy nhiên, nhiều thiết bị mạng thiếu sự hỗ trợ dành cho các jumbo frame và các quản trị viên OpenStack thường thiếu khả năng kiểm soát đối vớicơ sở hạ tầng mạng. Vì lý do ở sau, bạn cũng có thể ngăn chặn các vấn đề liên quan tới MTU bằng cách giảm instance MTU để tính đến việc quá tải GRE. Quyết định giá trị MTU phù hợp phải thông qua nhiều thử nghiệm, nhưng 1454 byte phù hợp với phần lớn các môi trường. Bạn có thể cấu hình cho DHCP server có nhiệm vụ gán địa chỉ IP cho các instance của bạn tự điều chỉnh thích hợp MTU.
zh_cn: 理想情况下，你可以通过在包含有租户虚拟网络的物理网络上开启<glossterm baseform="jumbo frame">jumbo frames</glossterm>来避免这些问题。巨型帧(Jumbo frames)支持最大接近9000字节的MTU，它抵消了虚拟网络上GRE开销的影响。但是，很多网络设备缺乏对于巨型帧的支持，Openstack的管理员也经常缺乏对网络架构的控制。考虑到后续的复杂性，也可以选择降低带来GRE开销的实例的MTU大小来避免MTU的问题。确定恰当的MTU值通常需要实验，但是大多数环境下1454字节都可以工作。你可以配置给实例分配IP地址的DHCP服务器来同时调整MTU。

source: If the status does not indicate <literal>available</literal>, check the logs in the <filename>/var/log/cinder</filename> directory on the controller and volume nodes for more information.
vi_vn: Nếu trạng thái không hiện là <literal>available</literal>, kiểm tra các bản ghi trong thư mục <filename>/var/log/cinder</filename> trên các node điều khiển và node ổ lưu trữ để biết thêm thông tin.
zh_cn: 如果状态没有显示为 <literal>available</literal>，请检查控制节点和卷节点中 <filename>/var/log/cinder</filename> 目录下的日志，获取更多的信息。

source: If the upgrade process includes a new kernel, reboot your system to activate it.
ru: Если обновление включает новое ядро, перезагрузите систему, чтобы задействовать его.
vi_vn: Nếu quá trình nâng cấp bao gồm một nhân mới, khởi động lại hệ thống của bạn để kích hoạt nó.
zh_cn: 如果更新了一个新内核，重启系统来使用新内核。

source: If the web browser to access remote consoles resides on a host that cannot resolve the <replaceable>controller</replaceable> hostname, you must replace <replaceable>controller</replaceable> with the management interface IP address of the controller node.
ru: Если веб браузер, которым вы хотите подключиться к удалённым консолям, находится на хосте, который не может распознать имя <replaceable>controller</replaceable>, вам необходимо заменить <replaceable>controller</replaceable> на IP-адрес управляющего интерфейса управляющего узла.
vi_vn: Nếu trình duyệt web dùng để truy cập các giao diện điều khiển từ xa nằm trên một máy vật lý không thể phân giải được tên máy <replaceable>controller</replaceable>, bạn phải thay <replaceable>controller</replaceable> bằng địa chỉ IP của giao diện quản lý của node điều khiển.
zh_cn: 如果 web 浏览器访问位于一台无法解析 <replaceable>controller</replaceable> 主机名的主机上的控制台，您必须将 <replaceable>controller</replaceable> 替换为控制节点管理网络接口的 IP 地址。

source: If this command returns a value of <emphasis>one or greater</emphasis>, your compute node supports hardware acceleration which typically requires no additional configuration.
ru: Если эта команда вернула значение <emphasis>единица или больше</emphasis>, то ваш вычислительный узел поддерживает аппаратное ускорение, что обычно не требует дополнительной настройки.
vi_vn: Nếu câu lệnh này trả về kết quả <emphasis>one or greater</emphasis>, node tính toán của bạn có hỗ trợ tăng tốc phần cứng mà không phải cấu hình gì thêm.
zh_cn: 如果这个命令返回 <emphasis>1 或更大</emphasis> 的值，说明您的计算节点支持硬件加速，一般不需要进行额外的配置。

source: If this command returns a value of <emphasis>zero</emphasis>, your compute node does not support hardware acceleration and you must configure <literal>libvirt</literal> to use QEMU instead of KVM.
ru: Если эта команда вернула значение <emphasis>ноль</emphasis>, то ваш вычислительный узел не поддерживает аппаратное ускорение и вым необходимо настроить <literal>libvirt</literal> на использование QEMU вместо KVM.
vi_vn: Nếu câu lệnh này trả về kết quả <emphasis>zero</emphasis>, node tính toán của bạn không hỗ trợ tăng tốc phần cứng và bạn phải cấu hình <literal>libvirt</literal> để sử dụng QEMU thay vì KVM.
zh_cn: 如果这个命令返回的是 <emphasis>0</emphasis>，说明您的计算节点不支持硬件加速，您必须设置 <literal>libvirt</literal> 使用 QEMU 而不能使用 KVM。
