Repository: 25hours/openstack-manuals
Catalog: doc/install-guide/locale/*.po
Languages: ja, ru, vi_vn, zh_cn

source: If you are building your OpenStack nodes as virtual machines, you must configure the hypervisor to permit promiscuous mode on the external network.
ru: Если вы строите свои узлы OpenStack на виртуальных машинах, вам необходимо настроить гипервизор на разрешение смешанного режима для внешней сети.
vi_vn: Nếu bạn đang xây dựng các node OpenStack của mình là các máy ảo, bạn phải cấu hình hypervisor để cho phép chế độ hỗn tạp trên hệ thống mạng ngoại vùng.
zh_cn: 如果您在虚拟机上配置您的OpenStack节点，您必须配置管理程序以允许外部网络上的混杂模式。

source: If you are familiar with these packages and pre-seeding, you can proceed to <xref linkend="ch_keystone"/>.
ja: これらのパッケージと事前シードに慣れている場合、<xref linkend="ch_keystone"/> に進むことができます。
vi_vn: Nếu bạn đã quen thuộc với các gói này và việc sắp xếp trước, bạn có thể tiếp tục đến <xref linkend="ch_keystone"/>.
zh_cn: 如果你熟悉这些包和预置输入，你可以直接阅读下一章 <xref linkend="ch_keystone"/>。

source: If you change the journaling configuration, stop the MongoDB service, remove the initial journal files, and start the service:
vi_vn: Nếu bạn thay đổi cấu hình ghi chép nhật ký, dừng dịch vụ MongoDB, xóa các file nhật ký gốc và khởi động dịch vụ:

source: If you choose to install on VMs, make sure your hypervisor permits <glossterm>promiscuous mode</glossterm> and disables MAC address filtering on the <glossterm>external network</glossterm>.
ru: Если вы решите устанавливаться на ВМ, убедитесь, что ваш гипервизор позволяет <glossterm>смешанный режим</glossterm> и отключена фильтрация MAC адресов на <glossterm>внешней сети</glossterm>.
vi_vn: Nếu bạn chọn cài đặt trên các máy ảo, hãy đảm bảo rằng hypervisor của bạn cho phép chạy <glossterm>chế độ hỗn tạp</glossterm> và vô hiệu hóa tính năng lọc địa chỉ MAC trên <glossterm>hệ thống mạng ngoại vùng</glossterm>.
zh_cn: 如果您选择安装在虚拟机上，请确认您的 hypervisor 允许 <glossterm>promiscuous 模式</glossterm>并禁用 MAC 地址在<glossterm>外部网络</glossterm>上的过滤。

source: If you configure a package with <systemitem class="library">debconf</systemitem> incorrectly, you can re-configure it, as follows:
ja: <systemitem class="library">debconf</systemitem> を用いて誤って設定した場合、以下のように再設定できます。
vi_vn: Nếu bạn cấu hình không chính xác một gói với <systemitem class="library">debconf</systemitem>, bạn có thể cấu hình lại nó như sau:
zh_cn: 如果你使用<systemitem class="library">debconf</systemitem>配置包但是配置错了，你可以重新配置，如下所示：

source: If you decide to not use <placeholder-1/>, then you will have to create the database and manage its access rights yourself, and run the following by hand.
ru: Если вы решите не использовать <placeholder-1/>, тогда вам потребуется создать базу данных и настроить права доступа до неё самостоятельно и выполнить следующие команды вручную.
vi_vn: Nếu bạn quyết định không sử dụng <placeholder-1/>, bạn sẽ phải tạo cơ sở dữ liệu và tự quản lí quyền truy cập cho nó và chạy lệnh sau đây bằng tay.
zh_cn: 如果您决定使用 <placeholder-1/>，那么您将必须创建数据库并自行管理它的访问权限，然后手动执行以下命令。

source: If you intend to use non-raw image types such as QCOW2 and VMDK, install the QEMU support package:
vi_vn: Nếu bạn định sử dụng các image không phải dạng thô như QCOW2 và VMDK, cài đặt gói bổ trợ QEMU:

source: If you use the Data processing service with a MySQL or MariaDB database, you must configure the maximum number of allowed packets for storing big job binaries in the service internal database.
vi_vn: Nếu bạn sử dụng dịch vụ xử lý Data với cơ sở dữ liệu MySQL hoặc MariaDB, bạn cần phải cấu hình số lượng tối đa các gói tin được phép cho lưu trữ các mã nhị phân của các job lớn trong cơ sở dữ liệu nội bộ dịch vụ.
zh_cn: 如果您使用 MySQL 或 MariaDB 数据库的数据处理服务，您必须配置允许将大的作业文件保存到服务的内部数据库的最大的包的数目。

source: If you want to do backup and restore, you also need Object Storage.
vi_vn: Block Storage dùng để sao lưu và phục hồi
zh_cn: 如果想进行备份和恢复，您还需要对象存储。

source: If you want to provision datastores on block-storage volumes, you also need Block Storage.
vi_vn: Block Storage cũng được dùng trong trường hợp cung cấp kho dữ liệu trong các block storage.
zh_cn: 如果想在块存储卷上提供数据存储，您还需要块设备存储。

source: If your environment includes the Block Storage service, you can attach a volume to the instance.
ru: Если ваша среда включает службу Блочного Хранилища, вы можете подключить диск к инстансу.
vi_vn: Nếu hệ thống của bạn bao gồm dịch vụ Block Storage, bạn có thể gắn một ổ lưu trữ vào instance.
zh_cn: 如果您的环境包含块设备存储服务，您可以附加一个卷给实例。

source: If your host does not contain the public/private key pair created in an earlier step, SSH prompts for the default password associated with the <literal>cirros</literal> user.
ru: Если на вашем хосте нет пары открытого/закрытого ключа, созданной на прошлом шаге, SSH запросит стандартный пароль, ассоциированный с пользователем <literal>cirros</literal>.
vi_vn: Nếu máy vật lý của bạn không chứa cặp khóa public/private được tạo ở bước trước đó, SSH sẽ hỏi đến mật khẩu mặc định liên kết với người dùng <literal>cirros</literal>.
zh_cn: 如果您的主机在之前的步骤中没有包含所创建的公钥或私钥对，SSH 会提示使用 <literal>cirros</literal> 用户相关的密码。

source: If your instance does not launch or seem to work as you expect, see the <link xlink:href="http://docs.openstack.org/ops"><citetitle>OpenStack Operations Guide</citetitle></link> for more information or use one of the <link linkend="app_community_support">many other options</link> to seek assistance. We want your environment to work!
vi_vn: Nếu instance của bạn không chạy được hoặc hoạt động như mong muốn, xem <link xlink:href="http://docs.openstack.org/ops"><citetitle>Hướng dẫn Vận hành OpenStack</citetitle></link> để biết thêm thông tin hoặc sử dụng một trong <link linkend="app_community_support">nhiều lựa chọn khác</link> để tìm kiếm sự hỗ trợ. Chúng tôi mong muốn môi trường của bạn hoạt động!

source: If your storage nodes use LVM on the operating system disk, you must also add the associated device to the filter. For example, if the <literal>/dev/sda</literal> device contains the operating system:
ru: Если ваши узлы хранения используют LVM на диске с операционной системой, вам так же необходимо добавить соответствующее устройство в фильтр. Например, если устройство <literal>/dev/sda</literal> содержит операционную систему:
vi_vn: Nếu các node lưu trữ của bạn sử dụng LVM trên đĩa hệ thống, bạn phải thêm thiết bị liên quan vào bộ lọc. Ví dụ, nếu thiết bị <literal>/dev/sda</literal> chứa hệ điều hành:
zh_cn: 如果您的存储节点在操作系统磁盘上使用了 LVM，您还必需添加相关的设备到过滤器中。例如，如果 <literal>/dev/sda</literal> 设备包含在操作系统中：

source: If your system uses a different device name, adjust these steps accordingly.
ru: Если ваша система использует другое имя устройства, измените шаги соответственно.
vi_vn: Nếu hệ thống của bạn sử dụng một thiết bị có tên khác, điều chỉnh các bước sau sao cho phù hợp.
zh_cn: 如果您的系统使用了一个不同的设备名称，请对这些步骤进行相应的调整。

source: If your web browser runs on a host that cannot resolve the <replaceable>controller</replaceable> host name, you can replace <replaceable>controller</replaceable> with the IP address of the management interface on your controller node.
ru: Если ваш веб браузер находится на хосте, который не может определить <replaceable>controller</replaceable> по имени, вы можете заменить <replaceable>controller</replaceable> на IP-адрес управляющего сети на вашем управляющем узле.
vi_vn: Nếu trình duyệt web của bạn chạy trên một máy vật lý không phân giải được tên máy <replaceable>controller</replaceable>, bạn có thể thay thế <replaceable>controller</replaceable> bằng địa chỉ IP của mạng quản lý trên node điều khiển của bạn.
zh_cn: 如果您的 web 浏览器运行在一台没有解析 <replaceable>controller</replaceable> 主机名的主机上，您可以将 <replaceable>controller</replaceable> 替换为控制节点管理网络的 IP 地址。

source: Implement the changes:
ja: 変更を実装します。
ru: Примените изменения:
vi_vn: Thực hiện các thay đổi:
zh_cn: 使修改生效：

source: In Debian, the Keystone package offers automatic registration of Keystone in the service catalogue. This is equivalent of running the below commands:
ru: В Debian, пакет Keystone предлагает автоматическую регистрацию службы Keystone в службе каталогов. Это эквивалентно исполнению следующих команд:
vi_vn: Trong Debian, gói Keystone cho phép tự động đăng ký Keystone trong catalogue dịch vụ. Điều này đồng nghĩa với việc chạy các câu lệnh sau:
zh_cn: 在 Debian 系统中，Keystone 的包可以提供自动注册 Keystone 到服务目录中。这等效于执行以下命令：

source: In Kilo, the keystone project deprecates Eventlet in favor of a WSGI server. This guide uses the Apache HTTP server with <literal>mod_wsgi</literal> to serve keystone requests on ports 5000 and 35357. By default, the <systemitem class="service">keystone</systemitem> service still listens on ports 5000 and 35357. Therefore, this guide disables the <systemitem class="service">keystone</systemitem> service.
vi_vn: Trong Kilo, dự án keystone từ bỏ Eventlet và thay vào đó sử dụng WSGI server. Hướng dẫn này sử dụng Apache HTTP server với <literal>mod_wsgi</literal> để phục vụ các yêu cầu tới keystone trên các cổng 5000 và 35357. Mặc định, dịch vụ <systemitem class="service">keystone</systemitem> vẫn lắng nghe trên cổng 5000 và 35357. Chính vì thế hướng dẫn này vô hiệu hóa dịch vụ <systemitem class="service">keystone</systemitem>.

source: In addition to external networks, any Networking set up has one or more internal networks. These software-defined networks connect directly to the VMs. Only the VMs on any given internal network, or those on subnets connected through interfaces to a similar router, can access VMs connected to that network directly.
vi_vn: Ngoài các hệ thống mạng ngoại vùng, bất kì thiết lập Networking nào cũng có một hoặc nhiều hệ thống mạng nội vùng. Các mạng được định nghĩa bởi phần mềm này kết nối trực tiếp vào các máy ảo. Chỉ các máy ảo trên bất kì hệ thống mạng nội vùng nào, hoặc các máy ảo trên các subnet được kết nối thông qua các giao diện đến một router tương tự, có thể truy cập các máy ảo được kết nối trực tiếp vào hệ thống mạng đó.
zh_cn: 外部网络之外，任何 Networking 设置拥有一个或多个内部网络。这些软件定义的网络直接连接到虚拟机。仅仅在给定网络上的虚拟机，或那些在通过接口连接到相近路由的子网上的虚拟机，能直接访问连接到那个网络上的虚拟机。

source: In each client environment script, configure the Block Storage client to use API version 2.0:
vi_vn: Trong mỗi script môi trường client, cấu hình để Block Storage client sử dụng API phiên bản 2.0:

source: In each client environment script, configure the Image service client to use API version 2.0:
vi_vn: Trong mỗi kịch bản môi trường client, cấu hình client dịch vụ Image để sử dụng API phiên bản 2.0:

source: In the <literal>[DEFAULT]</literal> and <literal>[keystone_authtoken]</literal> sections, configure Identity service access:
ru: В секциях <literal>[DEFAULT]</literal> и <literal>[keystone_authtoken]</literal> настройте доступ до службы идентификации:
vi_vn: Trong mục <literal>[DEFAULT]</literal> và <literal>[keystone_authtoken]</literal>, cấu hình truy cập dịch vụ Identity:
zh_cn: 在 <literal>[DEFAULT]</literal> 和 <literal>[keystone_authtoken]</literal> 部分，配置身份认证服务的访问：

source: In the <literal>[DEFAULT]</literal> and <literal>[nova]</literal> sections, configure Networking to notify Compute of network topology changes:
vi_vn: Trong mục <literal>[DEFAULT]</literal> và <literal>[nova]</literal>, cấu hình Networking để thông báo đến khi có các thay đổi trong mô hình mạng:

source: In the <literal>[DEFAULT]</literal> and <literal>[oslo_messaging_rabbit]</literal> sections, configure <application>RabbitMQ</application> message queue access:
vi_vn: Trong các phần <literal>[MẶC ĐỊNH]</literal> và <literal>[oslo_messaging_rabbit]</literal>, cấu hình truy cập dịch vụ hàng đợi thông điệp <application>RabbitMQ</application>:
zh_cn: 在 <literal>[DEFAULT]</literal> 和 <literal>[oslo_messaging_rabbit]</literal> 部分，配置 <application>RabbitMQ</application> 消息队列的访问：

source: In the <literal>[DEFAULT]</literal> section, configure access parameters:
ru: В секции <literal>[DEFAULT]</literal> настройте параметры доступа:
vi_vn: Trong mục <literal>[DEFAULT]</literal>, cấu hình các thông số truy cập:
zh_cn: 在 <literal>[DEFAULT]</literal> 部分，配置访问参数：

source: In the <literal>[DEFAULT]</literal> section, configure information about the heat Identity service domain:
vi_vn: Trong mục <literal>[DEFAULT]</literal> section, cấu hình thông tin về miền heat của dịch vụ Identity:

source: In the <literal>[DEFAULT]</literal> section, configure notifications and RabbitMQ message broker access:
ru: С секции <literal>[DEFAULT]</literal> настройте оповещения и доступ до брокера сообщений RabbitMQ:
vi_vn: Trong mục <literal>[DEFAULT]</literal>, cấu hình thông báo và truy cập kênh truyền tin RabbitMQ:
zh_cn: 在 <literal>[DEFAULT]</literal> 部分，配置消息和 RabbitMQ 代理的访问：

source: In the <literal>[DEFAULT]</literal> section, configure notifications:
vi_vn: Trong phần <literal>[DEFAULT]</literal>, cấu hình các thông báo:
zh_cn: 在 <literal>[DEFAULT]</literal> 部分，配置提醒：

source: In the <literal>[DEFAULT]</literal> section, configure the <glossterm baseform="API">APIs</glossterm> and drivers:
ru: В секции <literal>[DEFAULT]</literal>, настройте <glossterm baseform="API">API</glossterm> и драйвера:
vi_vn: Trong mục <literal>[DEFAULT]</literal>, cấu hình <glossterm baseform="API">các API</glossterm> và driver:
zh_cn: 在 <literal>[DEFAULT]</literal> 部分，配置 <glossterm baseform="API">APIs</glossterm> 和 drivers：

source: In the <literal>[DEFAULT]</literal> section, configure the <literal>my_ip</literal> option to use the management interface IP address of the controller node:
ru: В секции <literal>[DEFAULT]</literal> настройте параметр <literal>my_ip</literal> на использование IP-адреса интерфейса управляющей сети на управляющем узле:
vi_vn: Trong phần <literal>[MẶC ĐỊNH]</literal>, cấu hình lựa chọn <literal>my_ip</literal> để sử dụng giao diện quản lý địa chỉ IP của nút điều khiển:
zh_cn: 在 <literal>[DEFAULT]</literal> 部分，配置 <literal>my_ip</literal> 选项以使用控制节点上的管理网络接口的 IP 地址：

source: In the <literal>[DEFAULT]</literal> section, configure the <literal>my_ip</literal> option:
ru: В секции <literal>[DEFAULT]</literal> настройте параметр <literal>my_ip</literal>:
vi_vn: Trong mục <literal>[DEFAULT]</literal>, cấu hình tùy chọn <literal>my_ip</literal>:
zh_cn: 在 <literal>[DEFAULT]</literal> 部分，设置 <literal>my_ip</literal> 选项：

source: In the <literal>[DEFAULT]</literal> section, configure the <literal>noop</literal> notification driver to disable notifications because they only pertain to the optional Telemetry service:
ru: В секции <literal>[DEFAULT]</literal> настройте драйвер оповещений <literal>noop</literal>, чтобы отключить оповещения, поскольку они относятся только к необязательной службе Телеметрии:
vi_vn: Trong mục <literal>[DEFAULT]</literal> cấu hình driver thông báo <literal>noop</literal> để vô hiệu hóa các thông báo bởi vì chúng thuộc về dịch vụ Telemetry service:
zh_cn: 在 <literal>[DEFAULT]</literal> 部分，配置 <literal>noop</literal> 消息驱动以禁用消息，因为它们只与可选的 Telemetry 服务有关：

source: In the <literal>[DEFAULT]</literal> section, configure the VNC proxy to use the management interface IP address of the controller node:
ru: В секции <literal>[DEFAULT]</literal> настройте VNC-прокси на использование IP-адреса интерфейса управляющей сети управляющего узла:
vi_vn: Trong mục <literal>[DEFAULT]</literal>, cấu hình để VNC proxy sử dụng địa chỉ IP của giao diện mạng quản lý của node điều khiển:
zh_cn: 在 <literal>[DEFAULT]</literal> 部分，配置 VNC 代理以使用控制节点的管理网络接口的 IP 地址。

source: In the <literal>[DEFAULT]</literal> section, configure the bind port, user, and configuration directory:
vi_vn: Trong mục <literal>[DEFAULT]</literal>, cấu hình port để gán, người dùng và thư mục cấu hình:
zh_cn: 在 <literal>[DEFAULT]</literal> 部分，配置绑定端口，用户，和配置目录：

source: In the <literal>[DEFAULT]</literal> section, configure the interface and DHCP drivers and enable deletion of defunct DHCP namespaces:
vi_vn: Trong mục <literal>[DEFAULT]</literal>, cấu hình các driver giao diện và DHCP và cho phép xóa các DHCP namespace không còn khả dụng:

source: In the <literal>[DEFAULT]</literal> section, configure the location of the Image service:
vi_vn: Trong mục <literal>[DEFAULT]</literal>, cấu hình địa chỉ của Image service:

source: In the <literal>[DEFAULT]</literal> section, configure the metadata and wait condition URLs:
vi_vn: Trong phần <literal>[MẶC ĐỊNH]</literal>, cấu hình metadata và đợi URLs điều kiện:
zh_cn: 在 <literal>[DEFAULT]</literal> 部分，配置 metadata 和等待环境 URLs：

source: In the <literal>[DEFAULT]</literal> section, configure the metadata host:
ru: В секции <literal>[DEFAULT]</literal> настройте узел метаданных:
vi_vn: Trong mục <literal>[DEFAULT]</literal>, cấu hình máy chủ metadata:
zh_cn: 在 <literal>[DEFAULT]</literal> 部分，配置 metadata 主机：

source: In the <literal>[DEFAULT]</literal> section, configure the network and security group APIs:
ru: В секции <literal>[DEFAULT]</literal> настройте API сети и групп безопасности:
vi_vn: Trong mục <literal>[DEFAULT]</literal>, cấu hình hệ thống mạng và các API nhóm bảo mật:
zh_cn: 在 <literal>[DEFAULT]</literal> 部分，配置网络和安全组的 API：

source: In the <literal>[DEFAULT]</literal> section, configure the network parameters:
ru: В секции <literal>[DEFAULT]</literal> настройте параметры сети:
vi_vn: Trong phần <literal>[MẶC ĐỊNH]</literal>, cáu hình các tham số của mạng:
zh_cn: 在 <literal>[DEFAULT]</literal> 部分，设置网络参数：

source: In the <literal>[DEFAULT]</literal> section, define the value of the initial administration token:
ru: В секции <literal>[DEFAULT]</literal>, задайте значение начального административного токена:
vi_vn: Trong phần <literal>[DEFAULT]</literal>, định nghĩa giá trị của token quản trị ban đầu:
zh_cn: 在 <literal>[DEFAULT]</literal> 段中，对管理员令牌进行配置。

source: In the <literal>[DEFAULT]</literal> section, enable and configure remote console access:
ru: В секции <literal>[DEFAULT]</literal> включите и настройте доступ до удалённых консолей:
vi_vn: Trong phần <literal>[DEFAULT]</literal>, cho quyền và cấu hình truy nhập điều khiển từ xa:
zh_cn: 在 <literal>[DEFAULT]</literal> 部分，启用并配置远程控制台的访问：

source: In the <literal>[DEFAULT]</literal> section, enable the <glossterm>dnsmasq</glossterm> configuration file:
ru: В секции <literal>[DEFAULT]</literal> включите файл настройки <glossterm>dnsmasq</glossterm>:
vi_vn: Trong mục <literal>[DEFAULT]</literal>, bật file cấu hình <glossterm>dnsmasq</glossterm>:
zh_cn: 在 <literal>[DEFAULT]</literal> 部分，启用 <glossterm>dnsmasq</glossterm> 配置文件：

source: In the <literal>[DEFAULT]</literal> section, enable the LVM back end:
vi_vn: Trong mục <literal>[DEFAULT]</literal>, bật LVM back end:

source: In the <literal>[DEFAULT]</literal> section, enable the Modular Layer 2 (ML2) plug-in, router service, and overlapping IP addresses:
ru: В секции <literal>[DEFAULT]</literal>, включить плагин Modular Layer 2 (ML2), службу маршрутизации и перекрывающиеся IP адреса:
vi_vn: Trong mục <literal>[DEFAULT]</literal>, cho phép plug-in Modular Layer 2 (ML2), dịch vụ định tuyến và các địa chỉ IP trùng nhau:
zh_cn: 在 <literal>[DEFAULT]</literal> 部分，启用 Modular Layer 2 (ML2) 插件、router 服务和 overlapping IP 地址：

source: In the <literal>[app:proxy-server]</literal> section, enable automatic account creation:
vi_vn: Trong mục <literal>[app:proxy-server]</literal>, cho phép khởi tạo tài khoản tự động:

source: In the <literal>[database]</literal> section, comment out any <literal>connection</literal> options because compute nodes do not directly access the database.
ru: В секции <literal>[database]</literal>, закомментируйте все параметры <literal>connection</literal>, поскольку вычислительные узлы не соединяются с базой данных напрямую.
vi_vn: Trong mục <literal>[database]</literal>, đưa vào phần chú thích tất cả các tùy chọn <literal>connection</literal> bởi vì các node tính toán không truy cập trực tiếp vào cơ sở dữ liệu.
zh_cn: 在 <literal>[database]</literal> 部分，注释所有 <literal>connection</literal> 选项，因为计算节点不会直接访问数据库。

source: In the <literal>[database]</literal> section, comment out any <literal>connection</literal> options because network nodes do not directly access the database.
ru: В секции <literal>[database]</literal>, закомментируйте все параметры <literal>connection</literal>, поскольку сетевые узлы не соединяются с базой данных напрямую.
vi_vn: Trong mục <literal>[database]</literal>, đưa vào phần chú thích tất cả các tùy chọn <literal>connection</literal> vì node mạng không truy cập trực tiếp vào cơ sở dữ liệu.
zh_cn: 在 <literal>[database]</literal> 部分，注释所有 <literal>connection</literal> 选项，因为网络节点不会直接访问数据库。

source: In the <literal>[database]</literal> section, configure database access:
ru: В секции <literal>[database]</literal>, настройте доступ до базы данных:
vi_vn: Trong phần <literal>[database]</literal>, cấu hình truy cập cơ sở dữ liệu:
zh_cn: 在 <literal>[database]</literal> 段，配置数据库访问相关参数：

source: In the <literal>[ec2authtoken]</literal> section, configure Identity service access:
vi_vn: Trong mục <literal>[ec2authtoken]</literal>, cấu hình truy cập dịch vụ Identity:
zh_cn: 在 <literal>[ec2authtoken]</literal> 部分，配置身份认证服务的访问：

source: In the <literal>[filter:authtoken]</literal> section, configure Identity service access:
vi_vn: Trong mục <literal>[filter:authtoken]</literal>, cấu hình truy cập dịch vụ Identity:
zh_cn: 在 <literal>[filter:authtoken]</literal> 部分，配置身份认证服务的访问：

source: In the <literal>[filter:cache]</literal> section, configure the <application>memcached</application> location:
vi_vn: Trong mục <literal>[filter:cache]</literal> section, cấu hình địa chỉ <application>memcached</application>:
zh_cn: 在 <literal>[filter:cache]</literal> 部分，配置<application>memcached</application> 的位置：

source: In the <literal>[filter:ceilometer]</literal> section, configure notifications:
vi_vn: Trong phần <literal>[filter:ceilometer]</literal>, cấu hình các thông báo:
zh_cn: 在 <literal>[filter:ceilometer]</literal> 部分，配置提醒：

source: In the <literal>[filter:keystoneauth]</literal> section, add the <literal>ResellerAdmin</literal> role:
vi_vn: Trong phần <literal>[filter:keystoneauth]</literal>, thêm role <literal>ResellerAdmin</literal>:
zh_cn: 在 <literal>[filter:keystoneauth]</literal> 部分，添加 <literal>ResellerAdmin</literal> 角色：

source: In the <literal>[filter:keystoneauth]</literal> section, configure the operator roles:
vi_vn: Trong mục <literal>[filter:keystoneauth]</literal>, cấu hình các vai trò người vận hành:
zh_cn: 在 <literal>[filter:keystoneauth]</literal> 部分，配置操作者角色：

source: In the <literal>[glance]</literal> section, configure the location of the Image service:
vi_vn: Trong mục <literal>[glance]</literal>, cấu hình địa chỉ của dịch vụ Image:

source: In the <literal>[glance_store]</literal> section, configure the local file system store and location of image files:
ru: В секции <literal>[glance_store]</literal> настройте хранилище на локальной файловой системе и расположение файлов образов:
vi_vn: Trong mục <literal>[glance_store]</literal>, cấu hình kho lưu trữ hệ thống tập tin nội bộ và địa chỉ của các file image:
zh_cn: 在 <literal>[glance_store]</literal> 部分，设置本地文件系统的存储和镜像文件的位置：

source: In the <literal>[keystone_authtoken]</literal> and <literal>[ec2authtoken]</literal> sections, configure Identity service access:
vi_vn: Trong mục <literal>[keystone_authtoken]</literal> và <literal>[ec2authtoken]</literal>, cấu hình truy cập dịch vụ Identity:
zh_cn: 在 <literal>[keystone_authtoken]</literal> 和 <literal>[ec2authtoken]</literal> 部分中，配置身份认证服务的访问：

source: In the <literal>[keystone_authtoken]</literal> and <literal>[paste_deploy]</literal> sections, configure Identity service access:
ru: В секциях <literal>[keystone_authtoken]</literal> и <literal>[paste_deploy]</literal> настройте доступ до службы Идентификации:
vi_vn: Trong mục <literal>[keystone_authtoken]</literal> và <literal>[paste_deploy]</literal>, cấu hình truy cập dịch vụ Identity:
zh_cn: 在 <literal>[keystone_authtoken]</literal> 和 <literal>[paste_deploy]</literal> 部分，配置身份认证服务的访问：
