Repository: 25hours/openstack-manuals
Catalog: doc/install-guide/locale/*.po
Languages: ja, ru, vi_vn, zh_cn

source: Replace <replaceable>MANAGEMENT_INTERFACE_IP_ADDRESS</replaceable> with the IP address of the management network interface on your compute node, typically 10.0.0.31 for the first node in the <link linkend="architecture_example-architectures">example architecture</link>.
ru: Замените <replaceable>MANAGEMENT_INTERFACE_IP_ADDRESS</replaceable> на IP-адрес интерфейса управляющей сети на вашем вычислительном узле, обычно 10.0.0.31 для первого узла в <link linkend="architecture_example-architectures">примере архитектур</link>.
vi_vn: Thay thế <replaceable>MANAGEMENT_INTERFACE_IP_ADDRESS</replaceable> với một địa chỉ IP trong của lý cạc mạng của nút compute, thường thì 10.0.0.31 sẽ dành cho nút đầu tiên trong <link linkend="architecture_example-architectures">ví dụ kiến trúc</link>.
zh_cn: 将其中的 <replaceable>MANAGEMENT_INTERFACE_IP_ADDRESS</replaceable> 替换为计算节点上的管理网络接口的 IP 地址，典型的例子是<link linkend="architecture_example-architectures">架构样例</link>中第一台节点的 10.0.0.31 地址。

source: Replace <replaceable>MANAGEMENT_INTERFACE_IP_ADDRESS</replaceable> with the IP address of the management network interface on your storage node, typically 10.0.0.41 for the first node in the <link linkend="architecture_example-architectures">example architecture</link>.
ru: Замените <replaceable>MANAGEMENT_INTERFACE_IP_ADDRESS</replaceable> на IP-адрес интерфейса управляющей сети вашего узла хранения, как правило 10.0.0.41 для первого узла в <link linkend="architecture_example-architectures">примерной архитектуре</link>.
vi_vn: Thay <replaceable>MANAGEMENT_INTERFACE_IP_ADDRESS</replaceable> bằng địa chỉ IP của giao diện mạng quản lý trên node storage của bạn, thường là 10.0.0.41 cho node đầu tiên trong <link linkend="architecture_example-architectures">kiến trúc mẫu</link>.
zh_cn: 将其中的 <replaceable>MANAGEMENT_INTERFACE_IP_ADDRESS</replaceable> 替换为您存储节点的管理网络接口的 IP 地址，正如<link linkend="architecture_example-architectures">样例架构</link>中的第一个节点的 10.0.0.41 地址。

source: Replace <replaceable>MANAGEMENT_INTERFACE_IP_ADDRESS</replaceable> with the IP address of the management network on the storage node.
vi_vn: Thay thế <replaceable>GIAO_DIỆN_QUẢN_LÝ_ĐỊA_CHỈ_IP</replaceable> với địa chỉ IP của mạng quản lý trên nút lưu trữ.
zh_cn: 将其中的 <replaceable>MANAGEMENT_INTERFACE_IP_ADDRESS</replaceable> 替换为存储节点上的管理网络接口的 IP 地址。

source: Replace <replaceable>METADATA_SECRET</replaceable> with a suitable secret for the metadata proxy.
ru: Замените <replaceable>METADATA_SECRET</replaceable> подходящим секретом для прокси метаданных:
vi_vn: Thay <replaceable>METADATA_SECRET</replaceable> bằng một bí mật thích hợp cho metadata proxy.
zh_cn: 将其中的 <replaceable>METADATA_SECRET</replaceable> 替换为一个合适的 metadata 代理的 secret。

source: Replace <replaceable>METADATA_SECRET</replaceable> with the secret you chose for the metadata proxy.
ru: Замените <replaceable>METADATA_SECRET</replaceable> на секрет, который вы выбрали для прокси метаданных.
vi_vn: Thay <replaceable>METADATA_SECRET</replaceable> bằng bí mật bạn đã chọn cho metadata proxy.
zh_cn: 将其中的 <replaceable>METADATA_SECRET</replaceable> 替换为您为 metadata 代理所设置的 secret。

source: Replace <replaceable>NETWORK_CIDR</replaceable> with the subnet associated with the physical network.
ru: Замените <replaceable>NETWORK_CIDR</replaceable> на подсеть, ассоциированную с физической сетью.
vi_vn: Thay <replaceable>NETWORK_CIDR</replaceable> bằng subnet của hệ thống mạng vật lý.
zh_cn: 将其中的 <replaceable>NETWORK_CIDR</replaceable> 替换为与物理网络相关的子网。

source: Replace <replaceable>NEUTRON_DBPASS</replaceable> with a suitable password.
ru: Замените <replaceable>NEUTRON_DBPASS</replaceable> на подходящий пароль.
vi_vn: Thay <replaceable>NEUTRON_DBPASS</replaceable> bằng một mật khẩu thích hợp.
zh_cn: 将其中的 <replaceable>NEUTRON_DBPASS</replaceable> 替换为一个合适的密码。

source: Replace <replaceable>NEUTRON_DBPASS</replaceable> with the password you chose for the database.
ru: Замените <replaceable>NEUTRON_DBPASS</replaceable> на пароль, который вы выбрали для базы данных.
vi_vn: Thay <replaceable>NEUTRON_DBPASS</replaceable> bằng mật khẩu bạn đã chọn cho cơ sở dữ liệu.
zh_cn: 将其中的 <replaceable>NEUTRON_DBPASS</replaceable> 替换为您为数据库所设置的密码。

source: Replace <replaceable>NEUTRON_PASS</replaceable> with the password you chose for the <literal>neutron</literal> user in the Identity service.
ru: Замените <replaceable>NEUTRON_PASS</replaceable> на пароль, который вы выбрали для пользователя <literal>neutron</literal> в службе Идентификации.
vi_vn: Thay <replaceable>NEUTRON_PASS</replaceable> bằng mật khẩu đã chọn cho người dùng <literal>neutron</literal> trong Identity service.
zh_cn: 将其中的 <replaceable>NEUTRON_PASS</replaceable> 替换为您在身份认证服务中为 <literal>neutron</literal> 用户所设置的密码。

source: Replace <replaceable>NEUTRON_PASS</replaceable> with the password you chose or the <literal>neutron</literal> user in the Identity service.
ru: Замените <replaceable>NEUTRON_PASS</replaceable> на пароль, который вы выбрали для пользователя <literal>neutron</literal> в службе Идентификации.
vi_vn: Thay <replaceable>NEUTRON_PASS</replaceable> bằng mật khẩu bạn đã chọn cho người dùng <literal>neutron</literal> trong dịch vụ Identity.
zh_cn: 将其中的 <replaceable>NEUTRON_PASS</replaceable> 替换为您在身份认证服务中为 <literal>neutron</literal> 用户所设置的密码。

source: Replace <replaceable>NOVA_DBPASS</replaceable> with a suitable password.
ru: Замените <replaceable>NOVA_DBPASS</replaceable> на подходящий пароль.
vi_vn: Thay <replaceable>NOVA_DBPASS</replaceable> bằng một mật khẩu thích hợp.
zh_cn: 将其中的 <replaceable>NOVA_DBPASS</replaceable> 替换为一个合适的密码。

source: Replace <replaceable>NOVA_DBPASS</replaceable> with the password you chose for the Compute database.
ru: Замените <replaceable>NOVA_DBPASS</replaceable> на пароль, который вы выбрали для базы данных службы Вычислений.
vi_vn: Thay <replaceable>NOVA_DBPASS</replaceable> bằng mật khẩu bạn đã chọn cho cơ sở dữ liệu Compute.
zh_cn: 将其中的 <replaceable>NOVA_DBPASS</replaceable> 替换为您之前为 Compute 数据设置的密码。

source: Replace <replaceable>NOVA_PASS</replaceable> with the password you chose for the <literal>nova</literal> user in the Identity service.
ru: Замените <replaceable>NOVA_PASS</replaceable> на пароль, который вы выбрали для пользователя <literal>nova</literal> в службе Идентификации.
vi_vn: Thay <replaceable>NOVA_PASS</replaceable> bằng mật khẩu bạn đã chọn cho người dùng <literal>nova</literal> trong Identity service.
zh_cn: 将其中的 <replaceable>NOVA_PASS</replaceable> 替换为您之前在身份认证服务中为 <literal>nova</literal> 用户设置的密码。

source: Replace <replaceable>NTP_SERVER</replaceable> with the hostname or IP address of a suitable more accurate (lower stratum) NTP server. The configuration supports multiple <literal>server</literal> keys.
ru: Замените <replaceable>NTP_SERVER</replaceable> на доменное имя или IP-адрес подходящего, более точного (нижнего уровня) NTP сервера. Конфигурация поддерживает множественные ключи <literal>server</literal>.
vi_vn: Thay đổi <replaceable>NTP_SERVER</replaceable> với một hostname hoặc một địa chỉ IP phù hợp, chính xác hơn với server NTP (tầng thấp). Việc cấu hình được hỗ trợ bởi nhiều khóa <literal>server</literal>.
zh_cn: 将其中的 <replaceable>NTP_SERVER</replaceable> 替换为主机名或一个更准确的 (lower stratum) NTP 服务器的 IP 地址。这个配置支持多个 <literal>server</literal> 关键字。

source: Replace <replaceable>RABBIT_PASS</replaceable> with a suitable password.
ru: Замените <replaceable>RABBIT_PASS</replaceable> на подходящий пароль.
vi_vn: Thay <replaceable>RABBIT_PASS</replaceable> bằng một mật khẩu thích hợp.
zh_cn: 将其中的 <replaceable>RABBIT_PASS</replaceable> 替换为一个合适的密码。

source: Replace <replaceable>RABBIT_PASS</replaceable> with the password you chose for the <literal>openstack</literal> account in <application>RabbitMQ</application>.
vi_vn: Thay thế <replaceable>RABBIT_PASS</replaceable> bằng mật khẩu bạn đã chọn cho tài khoản <literal>openstack</literal> trong <application>RabbitMQ</application>.
zh_cn: 将其中的 <replaceable>RABBIT_PASS</replaceable> 替换为您在 <application>RabbitMQ</application> 中为 <literal>openstack</literal> 帐户设置的密码。

source: Replace <replaceable>SAHARA_DBPASS</replaceable> with a suitable password.
vi_vn: Thay thế <replaceable>SAHARA_DBPASS</replaceable> bằng một mật khẩu phù hợp.
zh_cn: 将其中的 <replaceable>SAHARA_DBPASS</replaceable> 替换为您设置的一个合适的密码。

source: Replace <replaceable>STORAGE_NODE_MANAGEMENT_INTERFACE_IP_ADDRESS</replaceable> with the IP address of the management network on the storage node. Replace <replaceable>DEVICE_NAME</replaceable> with a storage device name on the same storage node. For example, using the first storage node in <xref linkend="swift-install-storage-node"/> with the <literal>/dev/sdb1</literal> storage device and weight of 100:
vi_vn: Thay <replaceable>STORAGE_NODE_MANAGEMENT_INTERFACE_IP_ADDRESS</replaceable> bằng địa chỉ IP của mạng quản lý trên node lưu trữ. Thay <replaceable>DEVICE_NAME</replaceable> bằng tên của thiết bị lưu trữ trên node lưu trữ. Ví dụ, sử dụng node lưu trữ đầu tiên trong phần <xref linkend="swift-install-storage-node"/> có thiết bị lưu trữ là /dev/sdb1 và weight 100:

source: Replace <replaceable>SWIFT_PASS</replaceable> with the password you chose for the <literal>swift</literal> user in the Identity service.
ru: Замените <replaceable>SWIFT_PASS</replaceable> на пароль, который вы выбрали для пользователя <literal>swift</literal> в службе Идентификации.
vi_vn: Thay <replaceable>SWIFT_PASS</replaceable> bằng mật khẩu bạn đã chọn cho người dùng <literal>swift</literal> trong dịch vụ Identity.
zh_cn: 将 <replaceable>SWIFT_PASS</replaceable> 替换为在身份认证服务中为 <literal>swift</literal> 用户配置的密码。

source: Replace <replaceable>TELEMETRY_SECRET</replaceable> with the telemetry secret that you generated in a previous step.
vi_vn: Thay <replaceable>TELEMETRY_SECRET</replaceable> bằng bí mật telemetry bạn đã sinh ra ở bước trước đó.
zh_cn: 将其中的 <replaceable>TELEMETRY_SECRET</replaceable> 替换为您在上述步骤中生成的 telemetry secret。

source: Replace <replaceable>TELEMETRY_SECRET</replaceable> with the telemetry secret you chose for the Telemetry module.
vi_vn: Thay <replaceable>TELEMETRY_SECRET</replaceable> bằng mã mật telemetry mà bạn đã chọn cho module Telemetry.
zh_cn: 将其中的 <replaceable>TELEMETRY_SECRET</replaceable> 替换为您为 Telemetry 模块设置的 telemetry secret。

source: Replace <replaceable>TENANT_NETWORK_CIDR</replaceable> with the subnet you want to associate with the tenant network and <replaceable>TENANT_NETWORK_GATEWAY</replaceable> with the gateway you want to associate with it, typically the ".1" IP address.
ru: Замените <replaceable>TENANT_NETWORK_CIDR</replaceable> на подсеть, которую вы хотите ассоциировать с сетью проекта и <replaceable>TENANT_NETWORK_GATEWAY</replaceable> на шлюз, который вы хотите ассоциировать с ней, как правило ".1" IP-адрес.
vi_vn: Thay thế <replaceable>TENANT_NETWORK_CIDR</replaceable> với một mặt nạ mạng mà bạn muốn sao cho phù hợp với mạng tenant và <replaceable>TENANT_NETWORK_GATEWAY</replaceable> với một gateway mà bạn muốn, thường địa chỉ IP sẽ là ".1"
zh_cn: 将其中的 <replaceable>TENANT_NETWORK_CIDR</replaceable> 替换为您想关联到租户网络的子网并替换 <replaceable>TENANT_NETWORK_GATEWAY</replaceable> 为您想关联的子网的网关，一般是 ".1" IP 地址。

source: Replace <replaceable>TIME_ZONE</replaceable> with an appropriate time zone identifier. For more information, see the <link xlink:href="http://en.wikipedia.org/wiki/List_of_tz_database_time_zones">list of time zones</link>.
vi_vn: Thay thế <replaceable>TIME_ZONE</replaceable> bằng một múi giời phù hợp. Để biết thêm thông tin, xem <link xlink:href="http://en.wikipedia.org/wiki/List_of_tz_database_time_zones">danh sách múi giờ</link>.

source: Request an authentication token:
vi_vn: Yêu cầu một token xác thực:

source: Reserved user IDs
ja: 予約済みユーザー ID
ru: Резервные ID пользователей.
vi_vn: Các ID người dùng được để dành riêng

source: Respond to prompts for <link linkend="debconf-dbconfig-common">database management</link>, <link linkend="debconf-keystone_authtoken">Identity service credentials</link>, <link linkend="debconf-api-endpoints">service endpoint registration</link>, and <link linkend="debconf-rabbitmq">message broker credentials</link>.
ru: Ответьте на вопросы об <link linkend="debconf-dbconfig-common">управлении базами данных</link>, <link linkend="debconf-keystone_authtoken">учётных данных службы Идентификации</link>, <link linkend="debconf-api-endpoints">регистрации точек доступа</link> и <link linkend="debconf-rabbitmq">учётных данных брокера сообщений</link>.
vi_vn: Phản hồi các lời nhắc đối với <link linkend="debconf-dbconfig-common">việc quản lý cơ sở dữ liệu</link>, <link linkend="debconf-keystone_authtoken">thông tin xác thực dịch vụ Identity</link>, <link linkend="debconf-api-endpoints">việc đăng ký các endpoint dịch vụ</link>, và <link linkend="debconf-rabbitmq">thông tin xác thực môi giới thông điệp</link>.
zh_cn: 回答 <link linkend="debconf-dbconfig-common">数据库管理</link>、<link linkend="debconf-keystone_authtoken">身份认证服务证书</link>、<link linkend="debconf-api-endpoints">服务端点注册</link>和<link linkend="debconf-rabbitmq">消息代理证书</link> 相关的提示。

source: Respond to prompts for <link linkend="debconf-dbconfig-common">database management</link>, <link linkend="debconf-keystone_authtoken">Identity service credentials</link>, <link linkend="debconf-api-endpoints">service endpoint registration</link>, and <link linkend="debconf-rabbitmq">message queue credentials</link>.
vi_vn: Phản hồi các lời nhắc đối với <link linkend="debconf-dbconfig-common">việc quản lý cơ sở dữ liệu</link>, <link linkend="debconf-keystone_authtoken">thông tin xác thực dịch vụ Identity</link>, <link linkend="debconf-api-endpoints">việc đăng ký các endpoint dịch vụ</link>, và <link linkend="debconf-rabbitmq">thông tin xác thực hàng đợi tin</link>.

source: Respond to prompts for <xref linkend="debconf-dbconfig-common"/>, which will fill the below database access directive.
ru: Ответьте на вопросы <xref linkend="debconf-dbconfig-common"/>, чтобы заполнить директиву доступа к базе данных.
vi_vn: Phản hồi các lời nhắc cho <xref linkend="debconf-dbconfig-common"/>, việc này sẽ điền chỉ lệnh truy cập cơ sở dữ liệu phía dưới.
zh_cn: 回答 <xref linkend="debconf-dbconfig-common"/> 的提示，即填写以下数据库访问的指令。

source: Respond to prompts for the volume group to associate with the Block Storage service. The script scans for volume groups and attempts to use the first one. If your system only contains the <literal>cinder-volumes</literal> volume group, the script should automatically choose it.
vi_vn: Phản hồi các nhắc nhở đối với nhóm ổ lưu trữ để nó liên kết với dịch vụ Block Storage. Script quét để tìm các nhóm ổ lưu trữ và thử sử dụng cái đầu tiên. Nếu hệ thống của bạn chỉ chứa nhóm ổ lưu trữ <literal>cinder-volumes</literal>, script sẽ tự động chọn nó.
zh_cn: 回应卷组的提示，以关联到块设备存储服务。脚本会扫描卷组并尝试使用第一个卷组。如果您的系统仅仅包含了 <literal>cinder-volumes</literal> 卷组，脚本将自动地将其选择。

source: Respond to prompts for web server configuration.
ru: Ответьте на запросы для настройки веб сервера.
vi_vn: Phản hồi các nhắc nhở đối với việc cấu hình web server.
zh_cn: 回应 web 服务器配置的提示。

source: Respond to the prompts for <link linkend="debconf-dbconfig-common">database management</link> and <link linkend="debconf-keystone_authtoken"><literal>[keystone_authtoken]</literal> settings</link>, and <link linkend="debconf-api-endpoints">API endpoint</link> registration. The <placeholder-1/> command runs automatically.
vi_vn: Phản hồi các nhắc nhở đối với <link linkend="debconf-dbconfig-common">việc quản lý cơ sở dữ liệu</link>, <link linkend="debconf-keystone_authtoken">các tùy chỉnh<literal>[keystone_authtoken]</literal></link>, và việc đăng ký <link linkend="debconf-api-endpoints">API endpoint</link> registration. Lệnh <placeholder-1/> được chạy tự động.

source: Respond to the prompts for <link linkend="debconf-dbconfig-common">database management</link>, <link linkend="debconf-keystone_authtoken">Identity service credentials</link>, <link linkend="debconf-api-endpoints">service endpoint registration</link>, and <link linkend="debconf-rabbitmq">message broker credentials.</link>.
ru: Ответьте на вопросы об <link linkend="debconf-dbconfig-common">управлении базой данных</link>, <link linkend="debconf-keystone_authtoken">учётных данных службы Идентификации</link>, <link linkend="debconf-api-endpoints">регистрации служебных точек доступа</link> и <link linkend="debconf-rabbitmq">учётных данных брокера сообщений.</link>.
vi_vn: Phản hồi các nhắc nhở đối với <link linkend="debconf-dbconfig-common">việc quản lý cơ sở dữ liệu</link>, <link linkend="debconf-keystone_authtoken">thông tin xác thực dịch vụ Identity</link>, <link linkend="debconf-api-endpoints">việc đăng ký các endpoint dịch vụ</link>, và <link linkend="debconf-rabbitmq">thông tin xác thực kênh truyền tin</link>.
zh_cn: 回答 <link linkend="debconf-dbconfig-common">数据库管理</link>、<link linkend="debconf-keystone_authtoken">身份认证服务证书</link>、<link linkend="debconf-api-endpoints">服务端点注册</link>和<link linkend="debconf-rabbitmq">消息代理证书</link> 相关的提示。

source: Respond to the prompts for <link linkend="debconf-dbconfig-common">database management</link>, <link linkend="debconf-keystone_authtoken">Identity service credentials</link>, <link linkend="debconf-api-endpoints">service endpoint registration</link>, and <link linkend="debconf-rabbitmq">message broker credentials</link>.
vi_vn: Phản hồi các nhắc nhở đối với <link linkend="debconf-dbconfig-common">việc quản lý cơ sở dữ liệu</link>, <link linkend="debconf-keystone_authtoken">thông tin xác thực dịch vụ Identity</link>, <link linkend="debconf-api-endpoints">việc đăng ký các endpoint dịch vụ</link>, và <link linkend="debconf-rabbitmq">thông tin xác thực kênh truyền tin</link>.
zh_cn: 根据 <link linkend="debconf-dbconfig-common">数据库管理</link>、<link linkend="debconf-keystone_authtoken">身份认证服务证书</link>、<link linkend="debconf-api-endpoints">服务端点注册</link>、<link linkend="debconf-rabbitmq">消息代理证书</link> 等提示填写相应的配置信息。

source: Respond to the prompts for <link linkend="debconf-dbconfig-common">database management</link>, <link linkend="debconf-keystone_authtoken">Identity service credentials</link>, <link linkend="debconf-api-endpoints">service endpoint registration</link>, and <link linkend="debconf-rabbitmq">message queue credentials.</link>.
vi_vn: Phản hồi các lời nhắc đối với <link linkend="debconf-dbconfig-common">việc quản lý cơ sở dữ liệu</link>, <link linkend="debconf-keystone_authtoken">thông tin xác thực dịch vụ Identity</link>, <link linkend="debconf-api-endpoints">việc đăng ký các endpoint dịch vụ</link>, và <link linkend="debconf-rabbitmq">thông tin xác thực hàng đợi tin</link>.

source: Restart the Apache HTTP server:
vi_vn: Khởi động lại server Apache HTTP:

source: Restart the Block Storage services on the controller node:
vi_vn: Khởi động lại các dịch vụ của Block Storage trên node điều khiển:
zh_cn: 重启控制节点上的块设备存储服务：

source: Restart the Block Storage services on the storage nodes:
vi_vn: Khởi động lại các dịch vụ của Block Storage trên các node lưu trữ:
zh_cn: 重启存储节点上的块设备存储服务：

source: Restart the Block Storage services:
ru: Перезапустите сервисы Блочного Хранения:
vi_vn: Khởi động lại các dịch vụ của Block Storage:
zh_cn: 重启块设备存储服务：

source: Restart the Block Storage volume service including its dependencies:
ru: Перезапустите сервис дисков Блочного Хранения, включая его зависимости:
vi_vn: Khởi động lại dịch vụ ổ lưu trữ Block Storage bao gồm các thành phần phụ thuộc của nó:
zh_cn: 重启块存储卷服务及其依赖的服务：

source: Restart the Compute service:
ja: Compute Service を再起動します。
ru: Перезаупстите службу Compute:
vi_vn: Khởi động lại dịch vụ Compute:
zh_cn: 重启计算服务：

source: Restart the Compute services:
ja: Compute のサービスを再起動します。
ru: Перезапустите службу Вычислений:
vi_vn: Khởi động lại các dịch vụ Compute:
zh_cn: 重启 Compute 服务：

source: Restart the Database services:
ru: Перезапустите сервисы службы Баз Данных:
vi_vn: Khởi động lại các dịch vụ Database:
zh_cn: 重启数据库服务：

source: Restart the Image service services:
vi_vn: Khởi động lại các dịch vụ của dịch vụ Image:

source: Restart the Image service:
vi_vn: Khởi động lại dịch vụ Image:

source: Restart the MongoDB service:
ru: Перезапустите службу MongoDB:
vi_vn: Khởi động lại dịch vụ MongoDB:
zh_cn: 启动MongoDB服务：

source: Restart the NTP service:
ru: Перезапустите сервис NTP:
vi_vn: khởi động lại dịch vụ NTP:
zh_cn: 重启 NTP 服务：

source: Restart the Networking service:
ja: Networking のサービスを再起動します。
ru: Перезапустите службу Networking:
vi_vn: Khởi động lại dịch vụ Networking:
zh_cn: 重启 Networking 服务：

source: Restart the Networking services:
ja: Networking サービスを再起動します。
ru: Перезапустите службы Сети:
vi_vn: Khởi động lại các dịch vụ Networking:
zh_cn: 重启 Networking 服务：

source: Restart the OVS service:
ja: OVS サービスを再起動します。
ru: Перезапустите службу OVS:
vi_vn: Khởi động lại dịch vụ OVS:
zh_cn: 重启 OVS 服务：

source: Restart the Object Storage proxy service:
vi_vn: Khởi động lại dịch vụ Object Storage proxy:
zh_cn: 重启对象存储的代理服务：

source: Restart the Open vSwitch (OVS) agent:
ja: Open vSwitch (OVS) エージェントを再起動します。
ru: Перезапустите агент Open vSwitch (OVS):
vi_vn: Khởi động lại Open vSwitch (OVS) agent:
zh_cn: 重启 Open vSwitch (OVS) 代理：

source: Restart the Orchestration services:
ru: Перезапустите сервисы Оркестровки:
vi_vn: Khởi động lại các dịch vụ Orchestration:
zh_cn: 重启Orchestration服务：

source: Restart the Telemetry services:
ru: Перезапустите слервисы службы Телеметрии:
vi_vn: Khởi động lại các dịch vụ Telemetry:
zh_cn: 重启Telemetry服务：

source: Restart the agent:
vi_vn: Khởi động lại agent:
zh_cn: 重启代理：

source: Restart the database service:
ru: Перезапустите сервис баз данных:
vi_vn: Khởi động lại dịch vụ cơ sở dữ liệu:
zh_cn: 重启数据库服务：

source: Restart the services:
ja: サービスを再起動します。
ru: Перезапустите сервисы:
vi_vn: Khởi động các dịch vụ:
zh_cn: 重启服务：

source: Retrieve the sahara clusters list:
vi_vn: Thu hồi danh sách các cluster của sahara:
zh_cn: 获取 sahara 集群列表：

source: Retrieve the trove instances list:
vi_vn: Lấy ra danh sách các instance trove:

source: Retrieve usage statistics from the <literal>image.download</literal> meter:
vi_vn: Thu về các thống kê mức độ sử dụng từ thước đo <literal>image.download</literal>:
zh_cn: 从 <literal>image.download</literal> meter 中获取使用统计数据：

source: Run the following command to install the packages:
ru: Исполните следующую команду для установки пакетов:
vi_vn: Chạy câu lệnh dưới đây để cài đặt các gói phần mềm:
zh_cn: 运行以下命令来安装包。

source: Run the following commands to install the packages:
vi_vn: Chạy các lệnh sau để cài đặt các gói:
zh_cn: 运行以下命令安装软件包：

source: Run this command on <emphasis>all other</emphasis> nodes:
ru: Исполните эту команду на <emphasis>всех остальных</emphasis> узлах:
vi_vn: Chạy câu lệnh sau với <emphasis>tất cả </emphasis> các nút còn lại:
zh_cn: 在<emphasis>所有</emphasis>节点上执行这个命令：

source: Run this command on the <emphasis>controller</emphasis> node:
ru: Исполните эту команду на <emphasis>управляющем</emphasis> узле:
vi_vn: Chạy câu lệnh sau trên nút <emphasis>controller</emphasis>:
zh_cn: 在<emphasis>控制</emphasis>节点上执行这个命令：

source: SQL database
vi_vn: cơ sở dữ liệu SQL
zh_cn: SQL数据库

source: SUSE does not use a separate ML2 plug-in package.
ru: SUSE не использует отдельный пакет для плагина ML2.
vi_vn: SUSE không sử dụng một gói ML2 plug-in riêng lẻ.
zh_cn: SUSE 不使用单独的 ML2 插件包。

source: Secure the database service including choosing a suitable password for the root account:
ru: Защитите сервис баз данных, включая задание подходящего пароля для пользователя root:
vi_vn: Bảo mật dịch vụ cơ sở dữ liệu bao gồm việc chọn một mật khẩu phù hợp cho tài khoản root:
zh_cn: 对数据库进行安全加固（包括为数据库用户 root 设置适当的密码）：

source: Secure the database service:
ru: Защитите сервис баз данных:
vi_vn: Bảo mật cho dịch vụ cơ sở dữ liệu:
zh_cn: 对数据库进行安全加固：

source: Security
ru: Безопасность
vi_vn: Bảo mật
zh_cn: 安全
