Repository: 25hours/openstack-manuals
Catalog: doc/install-guide/locale/*.po
Languages: ja, ru, vi_vn, zh_cn

source: You should see output similar to this:
vi_vn: Bạn sẽ thấy kết quả trả về tương tự như sau:
zh_cn: 您应该看到类似如下的输出：

source: Your OpenStack environment now includes Block Storage. You can <link linkend="launch-instance">launch an instance</link> or add more services to your environment in the following chapters.
ru: Ваша среда OpenStack теперь включает Блочное Хранилище. Вы можете <link linkend="launch-instance">запустить инстанс</link> или добавить ещё службы к вашей среде в последующих разделах руководства.
vi_vn: Môi trường OpenStack của bạn bây giờ có thêm cả Block Storage. Bạn có thể <link linkend="launch-instance"> chạy thử một instance</link> hoặc thêm các dịch vụ cho môi trường của bạn trong các chương sau.
zh_cn: 您的OpenStack环境现在已经包含块存储。您可以 <link linkend="launch-instance">新建实例</link>或参考接下来的章节来添加更多的服务到您的环境中去。

source: Your OpenStack environment now includes Object Storage. You can <link linkend="launch-instance">launch an instance</link> or add more services to your environment in the following chapters.
ru: Ваша среда OpenStack теперь включает Хранилище Объектов. Вы можете <link linkend="launch-instance">запустить инстанс</link> или добавить ещё службы к вашей среде в последующих разделах руководства.
vi_vn: Môi trường OpenStack của bạn bây giờ đã bao gồm Object Storage. Bạn có thể <link linkend="launch-instance">chạy một instance</link> hoặc thêm các dịch vụ khác vào môi trường của bạn ở các chương sau.
zh_cn: 您的OpenStack环境现在已经包含对象存储。您可以 <link linkend="launch-instance">新建实例</link>或参考接下来的章节来添加更多的服务到您的环境中去。

source: Your OpenStack environment now includes Orchestration. You can <link linkend="launch-instance">launch an instance</link> or add more services to your environment in the following chapters.
ru: Ваша среда OpenStack теперь включает Оркестровку. Вы можете <link linkend="launch-instance">запустить инстанс</link> или добавить ещё службы к вашей среде в последующих разделах руководства.
vi_vn: Môi trường OpenStack của bạn bây giờ bao gồm cả Orchestration. Bạn có thể <link linkend="launch-instance">chạy thử một instance</link> hoặc chèn thêm các dịch vụ vào môi trường của bạn trong các chương sắp tới.
zh_cn: 您的 OpenStack 环境现在已经包含了 Orchestration。您可以<link linkend="launch-instance">启动实例</link>或根据以下章节添加更多的服务到您的环境中。

source: Your OpenStack environment now includes Telemetry. You can <link linkend="launch-instance">launch an instance</link> or add more services to your environment in the previous chapters.
ru: Ваша среда OpenStack теперь включает Телеметрию. Вы можете <link linkend="launch-instance">запустить инстанс</link> или добавить ещё службы к вашей среде в предыдущих разделах руководства.
vi_vn: Môi trường OpenStack của bạn bây giờ đã bao gồm dịch vụ Telemetry. Bạn có thể <link linkend="launch-instance">chạy một instance</link> hoặc thêm các dịch vụ khác trong các chương trước vào môi trường của bạn.
zh_cn: 您的 OpenStack 环境现在已经包含了 Telemetry。您可以<link linkend="launch-instance">创建实例</link>或如前面章节所示添加更多的服务到您的环境中。

source: Your OpenStack environment now includes the core components necessary to launch a basic instance. You can <link linkend="launch-instance">launch an instance</link> or add more OpenStack services to your environment.
ru: Ваша среда OpenStack теперь содержит основные компоненты, необходимы для запуска базовой простой машины. Вы можете <link linkend="launch-instance">запустить инстанс</link> или добавить ещё службы OpenStack к вашей среде.
vi_vn: Môi trường OpenStack của bạn bây giờ đã bao gồm các thành phần chính cần thiết để chạy một instance cơ bản. Bạn có thể <link linkend="launch-instance">chạy một instance</link> hoặc thêm các dịch vụ OpenStack khác vào môi trường của bạn.
zh_cn: 您的 OpenStack 环境已经包含了启动一台基本实例所需的内核组件。您可以<link linkend="launch-instance">启动一台实例</link>或添加更多的 OpenStack 服务到您的环境中。

source: Your OpenStack environment now includes the dashboard. You can <link linkend="launch-instance">launch an instance</link> or add more services to your environment in the following chapters.
ru: Ваша среда OpenStack теперь включает панель управления. Вы можете <link linkend="launch-instance">запустить инстанс</link> или добавить ещё службы к вашей среде в последующих разделах руководства.
vi_vn: Hệ thống OpenStack của bạn bây giời đã có dashboard. Bạn có thể <link linkend="launch-instance">chạy một instance</link> hoặc thêm các dịch vụ khác ở các chương sau.
zh_cn: 现在您的 OpenStack 环境已经包含了仪表板。您可以 <link linkend="launch-instance">创建实例</link> 或根据下面的章节添加更多的服务到您的环境中。

source: Your distribution does not enable a restrictive <glossterm>firewall</glossterm> by default. For more information about securing your environment, refer to the <link xlink:href="http://docs.openstack.org/sec/">OpenStack Security Guide</link>.
vi_vn: Triển khai của bạn không mặc định bật một <glossterm>firewall</glossterm> với nhiều hạn chế. Để biết thêm thông tin về cách bảo mật môi trường của bạn, xem <link xlink:href="http://docs.openstack.org/sec/">Hướng dẫn Bảo mật OpenStack</link>.

source: Your distribution enables a restrictive <glossterm>firewall</glossterm> by default. During the installation process, certain steps will fail unless you alter or disable the firewall. For more information about securing your environment, refer to the <link xlink:href="http://docs.openstack.org/sec/">OpenStack Security Guide</link>.
vi_vn: Triển khai của bạn mặc định bật một <glossterm>firewall</glossterm> có nhiều hạn chế. Trong quá trình cài đặt, một vài bước sẽ không thành công trừ khi bạn chỉnh sửa hoặc vô hiệu hóa firewall. Để biết thêm thông tin về cách bảo mật môi trường của bạn, xem <link xlink:href="http://docs.openstack.org/sec/">Hướng dẫn Bảo mật OpenStack</link>.

source: Your first instance uses the <literal>cirros-0.3.4-x86_64</literal> image.
vi_vn: Instance đầu tiên của bạn sử dụng image <literal>cirros-0.3.4-x86_64</literal>.

source: Your first instance uses the <literal>default</literal> security group. By default, this security group implements a firewall that blocks remote access to instances. If you would like to permit remote access to your instance, launch it and then <link linkend="launch-instance-neutron-remoteaccess"> configure remote access</link>.
ru: Ваш первый инстанс использую группу безопасности <literal>default</literal>. По умолчанию, эта группа безопасности создаёт межсетевой экран, блокирующий удалённый доступ к инстансам. Если вы хотите разрешить удалённый доступ к вашему инстансу, запустите его и потом <link linkend="launch-instance-neutron-remoteaccess">настройте удалённый доступ</link>.
vi_vn: Instance đầu tiên của bạn sử dụng nhóm bảo mật <literal>mặc định</literal>. Mặc định, nhóm bảo mật này cài một tường lửa chặn các truy cập từ xa đến các instance. Bạn phải chạy nó lên và <link linkend="launch-instance-neutron-remoteaccess"> cấu hình truy cập từ xa</link>. nếu bạn muốn cho phép việc truy cập từ xa.
zh_cn: 您的第一台实例将使用 <literal>default</literal> 安全组。默认情况下，这个安全组生成了阻塞远程访问实例的防火墙规则。如果您想允许远程访问实例，启动它然后<link linkend="launch-instance-neutron-remoteaccess">配置远程访问</link>。

source: Your first instance uses the <literal>default</literal> security group. By default, this security group implements a firewall that blocks remote access to instances. If you would like to permit remote access to your instance, launch it and then <link linkend="launch-instance-nova-remoteaccess"> configure remote access</link>.
ru: Ваш первый инстанс использую группу безопасности <literal>default</literal>. По умолчанию, эта группа безопасности создаёт межсетевой экран, блокирующий удалённый доступ к инстансам. Если вы хотите разрешить удалённый доступ к вашему инстансу, запустите его и потом <link linkend="launch-instance-nova-remoteaccess">настройте удалённый доступ</link>.
vi_vn: Instance đầu tiên của bạn sử dụng nhóm bảo mật <literal>default</literal>. Mặc định, nhóm bảo mật này thực thi tường lửa để chặn các truy nhập từ xa tới các instance. Nếu bạn muốn có cho phép truy nhập từ xa tới instance của bạn, chạy nó và sau đó <link linkend="launch-instance-nova-remoteaccess"> cấu hình truy nhập từ xa </link>.
zh_cn: 您的第一台实例使用的是 <literal>default</literal> 安全组。默认情况下，这个安全组实现了一个防火墙，会阻塞远程对实例的访问。如果您想要授权远程访问实例，启动它然后<link linkend="launch-instance-nova-remoteaccess"> 配置远程访问</link>。

source: Your first instance uses the <literal>demo-net</literal> tenant network. However, you must reference this network using the ID instead of the name.
ru: Ваш первый инстанс использует сеть <literal>demo-net</literal> проекта. Однако, вам необходимо указать эту сеть по ID вместо имени.
vi_vn: Instance đầu tiên của bạn sử dụng mạng <literal>demo-net</literal> tenant. Tuy nhiên, bạn cần tham chiếu mạng này bằng các sử dụng ID thay vì sử dụng tên.
zh_cn: 您的第一台实例使用的是 <literal>demo-net</literal> 租户网络。但是，您必须引用网络的 ID 而不是网络名称。

source: Your first instance uses the <literal>m1.tiny</literal> flavor.
ru: Ваш первый инстанс использует схему <literal>m1.tiny</literal>.
vi_vn: Instance đầu tiên của bạn sử dụng flavor <literal>m1.tiny</literal> .
zh_cn: 您的第一台实例使用的是 <literal>m1.tiny</literal> 类型。

source: datastore_manager
vi_vn: người_quản_lý_kho_dữ_liệu

source: datastore_name
vi_vn: tên_kho_dữ_liệu

source: datastore_version
vi_vn: phiên_bản_kho_dữ_liệu

source: debconf concepts
ja: debconf の概念
ru: концепция debconf
vi_vn: các khái niệm debconf
zh_cn: debconf概念

source: guest
vi_vn: khách
zh_cn: 客户机

source: name
ru: имя
vi_vn: tên
zh_cn: 名称

source: network
vi_vn: mạng
zh_cn: 网络

source: openSUSE and SUSE Linux Enterprise Server
ru: openSUSE и SUSE Linux Enterprise Server
vi_vn: openSUSE và SUSE Linux Enterprise Server
zh_cn: openSUSE 和 SUSE Linux Enterprise Server

source: packages
vi_vn: các gói
zh_cn: 软件包

source: swift
vi_vn: nhanh chóng

source: version_name
vi_vn: tên_phiên_bản

source: This section describes how to install and configure the OpenStack Identity service on the controller node.
ru: Этот раздел описывает, как установить и настроить службу Идентификации OpenStack на Управляющем узле.
zh_cn: 这一章描述了怎样在控制结点安装和配置Openstack身份认证服务

source: controller
zh_cn: 控制器

source: In the <literal>[token]</literal> section, configure the UUID token provider and SQL driver:
ru: В секции <literal>[token]</literal>, настройте провайдер UUID токенов и драйвер SQL:
zh_cn: 在<literal> [token] </literal>部分，设置 UUID 令牌的提供者和 SQL 驱动。

source: Create generic certificates and keys and restrict access to the associated files:
ru: Создайте общие сертификаты и ключи и ограничьте доступ к соответствующим файлам:
zh_cn: 生成通用的证书和私钥文件，并修改这些文件的访问权限：

source: Restart the Identity service:
ru: Перезапустите службу Идентификации:
zh_cn: 重启身份认证服务：

source: Start the Identity service and configure it to start when the system boots:
ru: Запустите службу Идентификации и настройте её автоматический запуск при загрузке системы:
zh_cn: 启动身份认证服务，并将该服务配为系统启动时自动启动：

source: By default, the Identity service stores expired tokens in the database indefinitely. The accumulation of expired tokens considerably increases the database size and might degrade service performance, particularly in environments with limited resources.
ru: По умолчанию, служба Идентификации хранит истёкшие токены в базе данных бесконечно. Накопление истёкших токенов заметно увеличивает размер базы данных и может снизить производительность сервера, в особенности в средах с ограниченными ресурсами.
zh_cn: 身份认证服务默认的情况会永久保存已经过期的身份凭证。过期凭证的累积会增加数据库的体积甚至减低整个服务的性能，特别是在那些资源紧缺的环境中。

source: The Keystone package already contains a cron job under <filename>/etc/cron.hourly/keystone</filename>, so it is not necessary to manually configure a periodic task that purges expired tokens hourly. You can however have a look at (and eventually customize) the already configured script.
ru: Пакет Keystone уже содержит задачу cron в <filename>/etc/cron.hourly/keystone</filename>, так что нет необходимости вручную настраивать периодическую задачу, которая очищает истёкшие токены каждый час. Вы можете, однако, посмотреть (и даже изменить) уже готовый скрипт.
zh_cn: Keystone 的包在 <filename>/etc/cron.hourly/keystone</filename> 下已经包含了一个 cron 任务，所以不需要手动配置一个周期任务来每小时清除过期的令牌。但您也可以阅读（并自定义）这个已经写好的配置脚本。

source: The Keystone package already contains a cron job under <filename>/etc/cron.hourly/openstack-keystone</filename>, so it is not necessary to manually configure a periodic task that purges expired tokens hourly. You can however have a look at (and eventually customize) the already configured script.
ru: Пакет Keystone уже содержит задачу cron в <filename>/etc/cron.hourly/openstack-keystone</filename>, так что нет необходимости вручную настраивать периодическую задачу, которая очищает истёкшие токены каждый час. Вы можете, однако, посмотреть (и даже изменить) уже готовый скрипт.
zh_cn: Keystone 的包在 <filename>/etc/cron.hourly/keystone</filename> 下已经包含了一个 cron 任务，所以不需要手动配置一个周期任务来每小时清除过期的令牌。但您也可以阅读(并自定义)这个已经写好的配置脚本。

source: We recommend that you use <systemitem class="service">cron</systemitem> to configure a periodic task that purges expired tokens hourly:
ru: Мы рекомендуем использовать <systemitem class="service">cron</systemitem> для создания периодической задачи, которая будет очищать истёкшие токены каждый час:
zh_cn: 建议使用 <systemitem class="service">cron</systemitem> 配置计划任务每个小时定时清理过期的身份凭证：

source: Most OpenStack services use an SQL database to store information. The database typically runs on the controller node. The procedures in this guide use <application>MariaDB</application> or <application>MySQL</application> depending on the distribution. OpenStack services also support other SQL databases including <link href="http://www.postgresql.org/">PostgreSQL</link>.
ru: Большинство сервисов OpenStack используют SQL базу данных для хранения информации. База данных, как правило, работает на Управляющем узле. Процедуры в данном руководстве используют <application>MariaDB</application> или <application>MySQL</application> в зависимости от дистрибутива. Сервисы OpenStack так же поддерживают использование других SQL баз данных, включая <link href="http://www.postgresql.org/">PostgreSQL</link>.
zh_cn: 大部分 OpenStack 服务都使用 SQL 数据来存储信息。数据库一般运行在控制节点服务器上。本指南中提供的过程示例根据不同的发布版本使用 <application>MariaDB</application> 或 <application>MySQL</application>。OpenStack 服务也支持其他的 SQL 数据库，例如 <link href="http://www.postgresql.org/">PostgreSQL</link>。

source: Edit the <filename>/etc/my.cnf</filename> file and complete the following actions:
ru: Отредактируйте файл <filename>/etc/my.cnf</filename> следующим образом:
zh_cn: 编辑 <filename>/etc/my.cnf</filename> 并完成下列操作：

source: An instance is a VM that OpenStack provisions on a compute node. This guide shows you how to launch a minimal instance using the <glossterm>CirrOS</glossterm> image that you added to your environment in the <xref linkend="ch_glance"/> chapter. In these steps, you use the command-line interface (CLI) on your controller node or any system with the appropriate OpenStack client libraries. To use the dashboard, see the <link href="http://docs.openstack.org/user-guide/content/ch_dashboard.html"><citetitle>OpenStack User Guide</citetitle></link>.
ru: Инстанс это ВМ, который OpenStack располагает на вычислительном узле. Это руководство показывает вам, как запустить минимальный инстанс используя образ <glossterm>CirrOS</glossterm>, который вы добавили в свою среду в главе <xref linkend="ch_glance"/>. На этом шаге вы используете интерфейс командной строки (CLI) на вашем управляющем узле или любой системе с подходящими клиентскими библиотеками OpenStack. Для использования панели управления, смотрите <link href="http://docs.openstack.org/user-guide/content/ch_dashboard.html"><citetitle>Руководство пользователя OpenStack</citetitle></link>.
zh_cn: 一个实例就是一台由 OpenStack 提供的运行在计算节点上的虚拟机。本指南将向您展示如何使用 <glossterm>CirrOS</glossterm> 镜像启动一个最小的实例，这个镜像就是您在 <xref linkend="ch_glance"/> 章节中添加到环境中的镜像。在这些步骤中，您可以在控制节点或任意一个有合适的 OpenStack 客户端 libraries 的系统上使用命令行接口 (CLI)。如使用仪表板，请阅读 <link href="http://docs.openstack.org/user-guide/content/ch_dashboard.html"><citetitle>OpenStack 用户手册</citetitle></link>。

source: Launch an instance using <link linkend="launch-instance-neutron">OpenStack Networking (neutron) </link> or <link linkend="launch-instance-nova">legacy networking (nova-network) </link>. For more information, see the <link href="http://docs.openstack.org/user-guide/content/cli_launch_instances.html"><citetitle>OpenStack User Guide</citetitle></link>.
ru: Запустите инстанс используя <link linkend="launch-instance-neutron">Сеть OpenStack (neutron)</link> или <link linkend="launch-instance-nova">старую сеть (nova-network)</link>. Подробнее читайте в <link href="http://docs.openstack.org/user-guide/content/cli_launch_instances.html"><citetitle>Руководстве пользователя OpenStack</citetitle></link>.
zh_cn: 使用 <link linkend="launch-instance-neutron">OpenStack 网络 (neutron) </link> 或 <link linkend="launch-instance-nova">传统网络 (nova-network) </link> 启动一台虚拟机。要了解更多信息，请阅读 <link href="http://docs.openstack.org/user-guide/content/cli_launch_instances.html"><citetitle>OpenStack 用户手册</citetitle></link>。

source: Replace <replaceable>RABBIT_PASS</replaceable> with the password you chose for the <literal>guest</literal> account in <application>RabbitMQ</application>.
ru: Замените <replaceable>RABBIT_PASS</replaceable> на пароль, который вы выбрали для аккаунта <literal>guest</literal> в <application>RabbitMQ</application>.
zh_cn: 将 <replaceable>RABBIT_PASS</replaceable> 替换为 <application>RabbitMQ</application> 服务中 <literal>guest</literal> 用户的密码。

source: Create tenants, users, and roles
ru: Создайте проекты, пользователей и роли
zh_cn: 创建租户、用户和角色

source: After you install the Identity service, create <glossterm baseform="tenant">tenants</glossterm> (projects), <glossterm baseform="user">users</glossterm>, and <glossterm baseform="role">roles</glossterm> for your environment. You must use the temporary administration token that you created in <xref linkend="keystone-install"/> and manually configure the location (endpoint) of the Identity service before you run <placeholder-1/> commands.
ru: После установки службы Идентификации создайте <glossterm baseform="tenant">тенантов</glossterm> (проекты), <glossterm baseform="user">пользователей</glossterm> и <glossterm baseform="role">роли</glossterm> для вашей среды. Вы должны использовать временный административный токен, который вы создали в <xref linkend="keystone-install"/>, и вручную настроить расположение (точку доступа) службы Идентификации, прежде чем исполнять команды <placeholder-1/>.
zh_cn: 安装了身份认证服务后，为您的环境创建 <glossterm baseform="tenant">tenants</glossterm> (项目)、<glossterm baseform="tenant">users</glossterm> 和 <glossterm baseform="tenant">roles</glossterm>。在您执行 <placeholder-1/> 命令之前，必须使用您<xref linkend="keystone-install"/>中创建的临时的管理员令牌并手动配置身份认证服务的位置（入口点）。

source: You can pass the value of the administration token to the <placeholder-1/> command with the <parameter>--os-token</parameter> option or set the temporary <envar>OS_SERVICE_TOKEN</envar> environment variable. Similarly, you can pass the location of the Identity service to the <placeholder-2/> command with the <parameter>--os-endpoint</parameter> option or set the temporary <envar>OS_SERVICE_ENDPOINT</envar> environment variable. This guide uses environment variables to reduce command length.
ru: Вы можете передать значение административного токена в команду <placeholder-1/> через опцию <parameter>--os-token</parameter> или временно выставить переменную среды <envar>OS_SERVICE_TOKEN</envar>. Также вы можете передать расположение службы Идентификации в команду <placeholder-2/> через опцию <parameter>--os-endpoint</parameter> или временно выставить переменную среды <envar>OS_SERVICE_ENDPOINT</envar>. Данное руководство использует переменные среды в целях уменьшения длины команд.
zh_cn: 您可以使用 <parameter>--os-token</parameter> 参数将管理员令牌传递给 <placeholder-1/> 命令，或设置临时的 <envar>OS_SERVICE_TOKEN</envar> 环境变量。类似的，您也可以使用 <parameter>--os-endpoint</parameter> 选项将身份认证服务的位置传递给 <placeholder-2/> 命令，或设置临时的 <envar>OS_SERVICE_ENDPOINT</envar> 环境变量。本指南使用环境变量以缩短命令行的长度。

source: For more information, see the <link href="http://docs.openstack.org/openstack-ops/content/projects_users.html">Operations Guide - Managing Project and Users</link>.
ru: Подробнее смотрите в <link href="http://docs.openstack.org/openstack-ops/content/projects_users.html">Руководстве по эксплуатации - Управление проектами и пользователями</link>.
zh_cn: 要获得更多信息，请阅读<link href="http://docs.openstack.org/openstack-ops/content/projects_users.html">Operations Guide - Managing Project and Users</link>。

source: In Debian, the admin tenant, user and roles can be created automatically when installing the Keystone package. You must manually create the demo tenant and user however.
ru: В Debian проект, пользователь и роли admin могут быть созданы автоматически при установке пакета Keystone. Однако, вам необходимо вручную создать проект и пользователя demo.
zh_cn: 在 Debian 系统中，当安装 Keystone 的包时，admin 租户、用户和角色会被自动创建。但您必须手动创建 demo 租户和用户。

source: Configure the administration token:
ru: Настройте административный токен:
zh_cn: 配置管理员令牌：

source: Replace <replaceable>ADMIN_TOKEN</replaceable> with the administration token that you generated in <xref linkend="keystone-install"/>. For example:
ru: Замените <replaceable>ADMIN_TOKEN</replaceable> административным токеном, который вы сгенерировали в <xref linkend="keystone-install"/>. Например:
zh_cn: 将其中的 <replaceable>ADMIN_TOKEN</replaceable> 替换为您在 <xref linkend="keystone-install"/> 中生成的管理员令牌。例如：

source: Configure the endpoint:
ru: Настройте точку доступа:
zh_cn: 配置入口点：

source: Create an administrative tenant, user, and role for administrative operations in your environment:
ru: Создайте административный проект, пользователя и роль для административных операций в вашей среде:
zh_cn: 创建管理员租户、用户和角色以在您的环境中执行管理员操作：

source: Create the <literal>admin</literal> tenant:
ja: <literal>admin</literal> プロジェクトを作成します。
ru: Создайте проект <literal>admin</literal>:
zh_cn: 创建 <literal>admin</literal> 租户：

source: OpenStack generates IDs dynamically, so you will see different values from the example command output.
ru: OpenStack создаёт ID динамически, поэтому значения, которые вы увидите, будут отличаться от приведённых в примере вывода команды.
zh_cn: OpenStack 是动态生成 ID 的，因此您看到的输出会与示例中的命令行输出不相同。

source: Replace <replaceable>ADMIN_PASS</replaceable> with a suitable password and <replaceable>EMAIL_ADDRESS</replaceable> with a suitable e-mail address.
ru: Замените <replaceable>ADMIN_PASS</replaceable> на подходящий пароль и <replaceable>EMAIL_ADDRESS</replaceable> на подходящий адрес электронной почты.
zh_cn: 将其中的 <replaceable>ADMIN_PASS</replaceable> 替换为您要设置的一个合适的密码，其中的 <replaceable>EMAIL_ADDRESS</replaceable> 替换为合适的 e-mail 地址。

source: Add the <literal>admin</literal> role to the <literal>admin</literal> tenant and user:
ru: Добавьте роль <literal>admin</literal> проекту и пользователю <literal>admin</literal>:
zh_cn: 将 <literal>admin</literal> 角色赋予给 <literal>admin</literal> 租户和用户：
