Repository: 25hours/openstack-manuals
Catalog: doc/install-guide/locale/*.po
Languages: ja, ru, vi_vn, zh_cn

source: This section describes how to install and configure the proxy service that handles requests for the account, container, and object services operating on the storage nodes. For simplicity, this guide installs and configures the proxy service on the controller node. However, you can run the proxy service on any node with network connectivity to the storage nodes. Additionally, you can install and configure the proxy service on multiple nodes to increase performance and redundancy. For more information, see the <link xlink:href="http://docs.openstack.org/developer/swift/deployment_guide.html">Deployment Guide</link>.
vi_vn: Phần này hướng dẫn cách cài đặt và cấu hình dịch vụ proxy, một dịch vụ xử lý các yêu cầu của các dịch vụ tài khoản, container và object hoạt động trên các node lưu trữ. Để cho đơn giản, bài hướng dẫn này cài đặt và cấu hình dịch vụ proxy trên node điều khiển. Tuy nhiên bạn có thể chạy dịch vụ proxy trên bất kì node nào có kết nối mạng đến các node lưu trữ. Thêm vào đó, bạn có thể cài đặt và cấu hình dịch vụ trên nhiều node để cải thiện hiệu năng và tính dư thừa. Để biết thêm thông tin xem <link xlink:href="http://docs.openstack.org/developer/swift/deployment_guide.html">Hướng dẫn Triển khai</link>.

source: This section describes how to verify operation of the Block Storage service by creating a volume.
vi_vn: Phần này hướng dẫn cách kiểm tra hoạt động của dịch vụ Block Storage bằng cách khởi tạo một ổ lưu trữ.
zh_cn: 这个部分描述如何通过创建一个卷来验证块设备存储服务操作。

source: This section describes how to verify operation of the Object Storage service.
vi_vn: Phần này hướng dẫn cách kiểm tra hoạt động của dịch vụ Object Storage.
zh_cn: 这个部分将描述如何验证对象存储服务的操作。

source: This section describes how to verify operation of the Orchestration module (heat).
vi_vn: Phần này hướng dẫn cách kiểm tra hoạt động của module Orchestration (heat).
zh_cn: 这个不分将描述如何验证 Orchestration 模块 (heat) 的操作。

source: This section describes how to verify operation of the Telemetry module.
vi_vn: Phần này hướng dẫn cách kiểm tra hoạt động của module Telemetry.
zh_cn: 这个部分将描述如何验证 Telemetry 模块的操作。

source: This section describes how to verify operation of the dashboard.
ru: Этот раздел описывает, как проверить работу панели управления.
vi_vn: Phần này mô tả cách xác minh hoạt động của dashboard.
zh_cn: 这个部分将描述如何进行仪表板的验证操作。

source: This will configure the below directives (example from <filename>nova.conf</filename>):
ru: Это настроит следующие директивы (пример из <filename>nova.conf</filename>):
vi_vn: Nó sẽ cấu hình các chỉ thị dưới đây (ví dụ từ <filename>nova.conf</filename>):
zh_cn: 这将配置好下列指令 (例如 <filename>nova.conf</filename>)：

source: Three-node architecture with OpenStack Networking (neutron) and optional nodes for Block Storage and Object Storage services.
ru: Трёх-узловая архитектура на основе сети OpenStack (neutron) и дополнительных узлов для Блочной и Объектной службы хранения.
vi_vn: Kiến trúc ba-node sử dụng OpenStack Networking (neutron) và các node phụ dành cho các dịch vụ Block Storage và Object Storage.
zh_cn: 包含 OpenStack 网络 (neutron) 的三个节点架构以及可选的块存储和对象存储服务节点：

source: To access your instance remotely
ru: Для доступа к вашему инстансу удалённо:
vi_vn: Truy nhập từ xa instance của bạn
zh_cn: 远程访问实例

source: To access your instance using a virtual console
ru: Для доступа к инстансу используя виртуальную консоль:
vi_vn: Để truy nhập instance của bạn sử dụng một bảng điều khiển ảo.
zh_cn: 使用虚拟机控制台访问您的实例

source: To attach a Block Storage volume to your instance
ru: Для подключения диска Блочного Хранилища к вашему инстансу
vi_vn: Để gắn một ổ lưu trữ Block Storage vào instance của bạn
zh_cn: 附加一个块设备存储的卷到您的实例上

source: To configure Compute to use Networking
ru: Для настройки службы Вычислений на использование службы Сети
vi_vn: Cấu hình Compute để sử dụng Networking
zh_cn: 配置 Compute 以使用 Networking

source: To configure legacy networking
ru: Для настройки старой сети
vi_vn: Cấu hình một mạng thường
zh_cn: 配置传统网络

source: To configure name resolution:
ru: Для настройки определения имён:
vi_vn: Cấu hình phân giải tên:
zh_cn: 设置名称解析：

source: To configure networking:
ru: Для настройки сети:
vi_vn: Để cấu hình mạng kết nối:
zh_cn: 配置网络：

source: To configure notifications
vi_vn: Để cấu hình các thông báo
zh_cn: 配置提醒

source: To configure prerequisites
ru: Для настройки зависимостей
vi_vn: Để cấu hình những điều kiện tiên quyết
zh_cn: 配置前的准备

source: To configure the Apache HTTP server
vi_vn: Để cài đặt server Apache HTTP

source: To configure the DHCP agent
ru: Для настройки агента DHCP
vi_vn: Để cấu hình DHCP agent
zh_cn: 配置 DHCP 代理

source: To configure the Layer-3 (L3) agent
ru: Для настройки агента Layer-3 (L3)
vi_vn: Để cấu hình Layer-3 (L3) agent
zh_cn: 配置 Layer-3 (L3) 代理

source: To configure the Modular Layer 2 (ML2) plug-in
ru: Для настройки плагина Modular Layer 2 (ML2)
vi_vn: Để cấu hình plug-in Modular Layer 2 (ML2)
zh_cn: 配置 Modular Layer 2 (ML2) 插件

source: To configure the NTP service
ru: Для настройки службы NTP
vi_vn: Cấu hình dịch vụ NTP
zh_cn: 配置 NTP 服务

source: To configure the Networking common components
ru: Для настройки общих компонентов службы Сети
vi_vn: Để cấu hình các thành phần thông thường của Networking
zh_cn: 配置网络的通用组件

source: To configure the Networking server component
ru: Для настройки серверных компонент службы Сети
vi_vn: Cấu hình các thành phần của Networking server
zh_cn: 配置网络服务器的组件

source: To configure the Open vSwitch (OVS) service
ru: Для настройки службы Open vSwitch (OVS)
vi_vn: Để cấu hình dịch vụ Open vSwitch (OVS)
zh_cn: 配置 Open vSwitch (OVS) 服务

source: To configure the dashboard
ru: Для настройки панели управления
vi_vn: Để cấu hình dashboard.
zh_cn: 配置仪表板

source: To configure the message queue service
vi_vn: Cấu hình dịch vụ hàng đợi message
zh_cn: 配置消息队列服务

source: To configure the metadata agent
ru: Для настройки агента метаданных
vi_vn: Để cấu hình metadata agent
zh_cn: 配置 metadata 代理

source: To create a router on the tenant network and attach the external and tenant networks to it
ru: Для создания маршрутизатора в сети проекта и подключения внешней сети и сети проектов к нему
vi_vn: Để khởi tạo một router trên mạng tenant và gắn các hệ thống mạng ngoại vùng và tenant vào nó.
zh_cn: 在租户网络上创建路由并将外部网络和租户网络附加给它

source: To create a subnet on the external network
ru: Для создания подсети на внешней сети
vi_vn: Khởi tạo subnet cho mạng ngoại vùng
zh_cn: 在外部网络上创建子网

source: To create a subnet on the tenant network
ru: Для создания сети в сети проекта
vi_vn: Để khởi tạo một subnet trên hệ thống mạng tenant
zh_cn: 在租户网络上创建子网

source: To create tenants, users, and roles
ru: Для создания проектов, пользователей и ролей
vi_vn: Để tạo các tenant, user và role
zh_cn: 创建租户、用户和角色

source: To create the Identity service credentials, complete these steps:
vi_vn: Để khởi tạo các thông tin xác thực dịch vụ Identity, hoàn thành các bước sau:
zh_cn: 要创建身份认证服务的凭证，完成这些步骤：

source: To create the database, complete these steps:
ru: Для создания базы данных, выполните следующие шаги:
vi_vn: Để tạo ra cơ sở dữ liệu, hoàn thành những bước sau:
zh_cn: 完成下面的步骤以创建数据库：

source: To create the external network
ru: Для создания внешней сети
vi_vn: Để khởi tạo mạng ngoại vùng
zh_cn: 创建外部网络

source: To create the network
ru: Для создания сети
vi_vn: Để khởi tạo hệ thống mạng
zh_cn: 创建网络

source: To create the ring
vi_vn: Để khởi tạo ring

source: To create the scripts
ru: Для создания скриптов
vi_vn: Để khởi tạo các script
zh_cn: 创建脚本

source: To create the service credentials, complete these steps:
ru: Для создания служебных учётных данных, выполните следующие шаги:
vi_vn: Để tạo chứng thực của dịch vụ, hoàn tất các bước sau:
zh_cn: 创建服务证书，完成如下步骤：

source: To create the service entity and API endpoint
vi_vn: Để khởi tạo thực thể dịch vụ và API endpoint

source: To create the tenant network
ru: Для создания сети проекта
vi_vn: Khởi tạo mạng tenant
zh_cn: 创建租户网络

source: To disable Network Manager
ru: Для отключения сетевого менеджера
vi_vn: Để vô hiệu hóa Trình quản lý Hệ thống mạng
zh_cn: 禁用 Network Manager

source: To enable the OpenStack repository
ru: Для подключения репозитория OpenStack
vi_vn: Để cho phép OpenStack repository
zh_cn: 启用 OpenStack 仓库

source: To finalize installation
ru: Для завершения установки
vi_vn: Để kết thúc quá trình cài đặt
zh_cn: 完成安装

source: To finalize the installation
ru: Для завершения установки
vi_vn: Để kết thúc cài đặt
zh_cn: 完成安装

source: To generate a key pair
ru: Для генерации пары ключей
vi_vn: Tạo một cặp khóa
zh_cn: 生成一个密钥对

source: To install and configure Block Storage controller components
vi_vn: Cài đặt và cấu hình các thành tố trong bảng điều kiển Block Storage
zh_cn: 安装并配置块设备存储服务在控制节点服务器上的组件

source: To install and configure Compute controller components
ru: Для установки и настройки компонентов контроллера вычислений
vi_vn: Để cài đặt và cấu hình các thành phần của trình điều khiển Compute
zh_cn: 安装和配置 Compute 的计算节点组件

source: To install and configure the Compute controller components
ru: Для установки и настройки компонентов контроллера вычислений
vi_vn: Để cài đặt và cấu hình các thành phần của trình điều khiển Compute
zh_cn: 安装和配置 Compute 的控制节点组件

source: To install and configure the Compute hypervisor components
ru: Для установки и настройки компонентов гипервизора вычислений:
vi_vn: Để cài đặt và cấu hình các thành tố trong Compute hypervisor
zh_cn: 安装和配置 Compute hypervisor 组件

source: To install and configure the Identity service components
vi_vn: Để cài đặt và cấu hình các thành phần của dịch vụ Identity

source: To install and configure the Image service components
vi_vn: Để cài đặt và cấu hình các thành phần của dịch vụ Identity

source: To install and configure the Networking components
ru: Для установки и настройки Сетевых компонент
vi_vn: Để cài đặt và cấu hình các thành phần Networking
zh_cn: 安装和配置网络组件

source: To install and configure the Orchestration components
vi_vn: Để cài đặt và cấu hình các thành phần của Orchestration
zh_cn: 安装和配置Orchestration组件

source: To install and configure the Telemetry module components
vi_vn: Để cài đặt và cấu hình các thành phần của module Telemetry
zh_cn: 安装和配置Telemetry模块组件

source: To install and configure the agent
vi_vn: Để cài đặt và cấu hình agent
zh_cn: 安装和配置代理

source: To install and configure the components
ru: Для установки и настройки компонентов
vi_vn: Để cài đặt và cấu hình các thành phần
zh_cn: 安装和配置组件

source: To install and configure the controller node components
vi_vn: Để cài đặt và cấu hình các thành phần của node điều khiển
zh_cn: 安装并配置controller节点组件

source: To install and configure the database server
ru: Для установки и настройки сервера баз данных
vi_vn: Để cài đặt và cấu hình server cơ sở dữ liệu
zh_cn: 安装并配置数据库服务

source: To install legacy networking components
ru: Для установки компонентов старой сети
vi_vn: Cài đặt các thành tố của một mạng thường
zh_cn: 安装传统网络的组件

source: To install the Data processing service on the controller:
vi_vn: Để cài đặt dịch vụ xử lý Data trên node điều khiển:
zh_cn: 在控制节点上安装数据处理服务：

source: To install the Database service on the controller:
vi_vn: Để cài đặt dịch vụ Database trên bảng điều khiển:

source: To install the NTP service
ru: Для установки службы NTP
vi_vn: Cài đặt dịch vụ NTP
zh_cn: 安装 NTP 服务

source: To install the Networking components
ru: Для установки компонент Сети
vi_vn: Để cài đặt các thành phần của Networking
zh_cn: 安装网络组件

source: To install the dashboard components
ru: Для установки компонентов приборной панели
vi_vn: Để cài đặt các thành phần của dashboard.
zh_cn: 安装仪表板组件

source: To install the message queue service
vi_vn: Cài đặt dịch vụ hàng đợi message
zh_cn: 安装消息队列服务

source: To launch an instance
ru: Для запуска инстанса
vi_vn: Chạy một instance
zh_cn: 启动一台实例

source: To launch an instance, you must at least specify the flavor, image name, network, security group, key, and instance name.
ru: Для запуска инстанса, вам необходимо как минимум выбрать схему, имя образа, сеть, группу безопасности, ключ и имя инстанса.
vi_vn: Để chạy một instance, bạn phải định rõ ít nhất một trong các việc sau: flavor, tên image, network, security group, key và tên instance.
zh_cn: 启动一台实例，您必须至少指定一个类型、镜像名称、网络、安全组、密钥和实例名称。

source: To load client environment scripts
ru: Для загрузки скриптов клиентских сред
vi_vn: Để tải các script môi trường client
zh_cn: 加载客户端环境脚本

source: To minimize clutter and provide more resources for OpenStack, we recommend a minimal installation of your Linux distribution. Also, we strongly recommend that you install a 64-bit version of your distribution on at least the compute node. If you install a 32-bit version of your distribution on the compute node, attempting to start an instance using a 64-bit image will fail.
ru: Для уменьшения беспорядка и предоставления больших ресурсов OpenStack, мы рекомендуем минимальную остановку вашего дистрибутива Linux. Кроме того, вы настоятельно рекомендуем устанавливать 64-битныую версию вашего дистрибутива как минимум на вычислительный узел. Если вы установите 32-битную версию вашего дистрибутива на вычислительный узел, вы не сможете запускать инстансы 64-битных образов.
vi_vn: Để giảm thiểu tối đa sự phân mảnh nhằm mục đích dành nhiều tài nguyên hơn cho OpenStack, chúng tôi khuyên bạn nên cài bản minimal cho hệ thống Linux. Hơn nữa, chúng tôi cũng đề nghị bạn sử dụng phiên bản 64 bit cho hệ thống hoặc ít nhất là trên node tính toán. Nếu bạn cài đặt bản 32 bit trên node tính toán, bạn sẽ không thể khởi động một instance sử dụng image bản 64-bit.
zh_cn: 为了降低混乱和为OpenStack提供更多资源。我们建议进行你选用的Linux分发版的最小化安装。并且，我们强烈建议你至少要在计算节点上安装所选用Linux分发版的64位版本。如果你在计算节点上安装了所选用Linux分发版的32位版本，尝试使用64位镜像启动实例将会失败。

source: To opt out of using the <systemitem class="library">debconf</systemitem> package, run the <placeholder-1/> command and select non-interactive mode:
ja: <systemitem class="library">debconf</systemitem> パッケージを使用することを止めるために、<placeholder-1/> コマンドを実行し、非対話モードを選択します。
vi_vn: Để bỏ việc sử dụng gói <systemitem class="library">debconf</systemitem>, chạy lệnh <placeholder-1/> và chọn chế độ không tương tác:
zh_cn: 要退出使用 <systemitem class="library">debconf</systemitem>包，需要运行命令<placeholder-1/>，并且选择一个非交互模式：

source: To retrieve image-oriented events and samples, configure the Image service to send notifications to the message bus. Perform these steps on the controller node.
vi_vn: Để khôi phục các sự kiện và mẫu của image theo định hướng, cấu hình dịch vụ Image để gửi các thông báo tới thông điệp hệ thống message bus. Thực hiện theo các bước sau trên controller node.

source: To retrieve storage-oriented events and samples, configure the Object Storage service to send notifications to the message bus.
vi_vn: Để lấy được các sự kiện và mẫu liên quan tới hệ thống lưu trữ, cấu hình dịch vụ Object Storage để gửi các thông báo tới bus tin nhắn.
zh_cn: 为了检索到存储方面的事件与采样，配置对象存储服务以便发送通知到消息总线。

source: To retrieve volume-oriented events and samples, you must configure the Block Storage service to send notifications to the message bus. Perform these steps on the controller and storage nodes.
vi_vn: Để lấy được các sự kiện và trích mẫu liên quan tới dung lượng lưu trữ, bạn phải cấu hình dịch vụ Block Storage để gửi các thông báo đến kênh truyền thông điệp. Thực hiện các bước sau trên node điều khiển và các node lưu trữ.
zh_cn: 为了检索到卷方面的事件与采样，您必须配置块存储服务以便发送通知到消息总线。在控制与存储节点上执行这些步骤。

source: To run clients as a specific project and user, you can simply load the associated client environment script prior to running them. For example:
vi_vn: Để chạy các client như là một project hoặc người dùng cụ thể, bạn có thể đơn giản tải scipt môi trường client liên quan trước khi chạy chúng. Ví dụ:

source: To temporarily disable GRO on the external network interface while testing your environment:
ru: Для временного отключения GRO на внешнем сетевом интерфейсе на время тестирования вашей среды:
vi_vn: Để tạm thời vô hiệu hóa GRO trên hệ thống mạng ngoại vùng trong khi thử nghiệm môi trường của bạn:
zh_cn: 测试环境时，在外部网络接口上暂时地禁用 GRO：

source: To use the Debian Wheezy backports archive for Juno
ru: Чтобы использовать архив перенесённых пакетов для Juno под Debian Wheezy
vi_vn: Để sử dụng kho lưu trữ Debian Wheezy backports cho Juno

source: To use the VNC client with the dashboard, the browser must support HTML5 Canvas and HTML5 WebSockets.
ja: Dashboard で VNC クライアントを使用する場合、ブラウザーが HTML5 Canvas と HTML5 WebSockets をサポートする必要があります。
ru: Для работы VNC в панели управления ваш браузер должен поддерживать HTML5 Canvas и HTML5 WebSockets.
vi_vn: Để sử dụng VNC client với dashboard, trình duyệt cần hỗ trộ HTML5 Canvas và HTML5 WebSockets.
zh_cn: 为了通过dashboard使用VNC客户端，浏览器必须支持HTML5 Canvas和HTML5 WebSockets。

source: To verify network connectivity
ru: Для проверки связности сети
vi_vn: Kiểm tra kết nối mạng
zh_cn: 验证网络的连通性

source: To verify that the Database service is installed and configured correctly, try executing a trove command:
vi_vn: Để xác nhận dịch vụ Database đã được cài đặt và cấu hình chính xác, thử thực hiện một lệnh trove:

source: To verify the Data processing service (sahara) is installed and configured correctly, try requesting the clusters list using the sahara client.
vi_vn: Để xác nhận rằng dịch vụ xử lý Dữ liệu (sahara) đã được cài đặt và cấu hình chính xác, thử yêu cầu danh sách các cluster bằng cách sử dụng sahara client.
zh_cn: 验证数据处理服务 (sahara) 已经安装并配置正确，可以尝试使用 sahara 客户端请求集群列表。

source: Two-node architecture with legacy networking (nova-network) and optional nodes for Block Storage and Object Storage services.
ru: Двух-узловая архитектура на основе старой сети (nova-network) и дополнительных узлов для Блочной и Объектной службы хранения.
vi_vn: Kiến trúc hai-node sử dụng legacy networking (nova-network) và các node phụ cho các dịch vụ Block Storage và Object Storage,
zh_cn: 使用传统网络 (nova-network) 的两个节点架构以及运行块存储和对象存储服务的可选节点。

source: Ubuntu installs the <package>openstack-dashboard-ubuntu-theme</package> package as a dependency. Some users reported issues with this theme in previous releases. If you encounter issues, remove this package to restore the original OpenStack theme.
ru: Ubuntu устанавливает пакет <package>openstack-dashboard-ubuntu-theme</package> как зависимость. Некоторые пользователи сообщали о проблемах с этой темой в предыдущих выпусках. Если вы столкнётесь с проблемами, удалите этот пакет, чтобы восстановить оригинальную тему OpenStack.
vi_vn: Ubuntu cài đặt gói <package>openstack-dashboard-ubuntu-theme</package> là một gói phụ thuộc. Một vài người dùng đã báo rằng họ gặp vấn đề với chủ đề này trong các phiên bản trước đây. Nếu bạn gặp các vấn đề, xóa gói này để khôi phục lại chủ đề gốc của OpenStack.
zh_cn: Ubuntu 安装 <package>openstack-dashboard-ubuntu-theme</package> 包作为依赖。在前一个版本中，一些用户报告了该主题相关的一些问题。如果您遇到了这些问题，请移除这个包，恢复到原本的 OpenStack 主题。

source: Unless you have a unique set up for your network, press <keycap>ENTER</keycap>.
ja: お使いのネットワーク用に一意なセットアップをする必要がなければ、<keycap>ENTER</keycap> を押します。
ru: Если у вас нет уникально настроенной сети, нажмите <keycap>ENTER</keycap>.
vi_vn: Trừ khi bạn có một hệ thống mạng được thiết lập đặc biệt, bấm <keycap>ENTER</keycap>.
zh_cn: 除非你的网络是特殊安装的，否则只需要按<keycap>ENTER</keycap>。

source: Unless you intend to use the exact configuration provided in this example architecture, you must modify the networks in this procedure to match your environment. Also, each node must resolve the other nodes by name in addition to IP address. For example, the <replaceable>controller</replaceable> name must resolve to <literal>10.0.0.11</literal>, the IP address of the management interface on the controller node.
ru: Если вы не собираетесь воссоздавать в точности приведённую в этом примере архитектуру, вам необходимо поменять сети в этой процедуре в соответствии с вашей средой. Кроме того, каждый узел должен определять другие узлы по имени в дополнение к IP-адресу. Например, имя <replaceable>controller</replaceable> должно определяться как <literal>10.0.0.11</literal>, IP-адрес интерфейса управляющей сети на управляющем узле.
vi_vn: Trừ khi bạn định cấu hình y hệt kiến trúc mẫu này, bạn phải tinh chỉnh các hệ thống mạng trong quá trình này sao cho phù hợp với môi trường của mình. Hơn nữa các node phải phân giải được nhau bằng tên bên cạnh địa chỉ IP. Ví dụ, <replaceable>controller</replaceable> phải được phân giải về địa chỉ 10.0.0.11, địa chỉ IP của giao diện quản lý trên node điều khiển.
zh_cn: 除非您打算使用该架构样例中提供的准确配置，否则您必须在本过程中修改网络以匹配您的环境。并且，每个节点除了 IP 地址之外，还必须能够解析其他节点的名称。例如，<replaceable>controller</replaceable> 这个名称必须解析为 <literal>10.0.0.11</literal>，即控制节点上的管理网络接口的 IP 地址。

source: Unlike other <package>debconf</package> prompts, you cannot pre-seed the responses for the <package>dbconfig-common</package> prompts by using <placeholder-1/>. Instead, you must create a file in <filename>/etc/dbconfig-common</filename>. For example, you might create a keystone configuration file for <package>dbconfig-common</package> that is located in <filename>/etc/dbconfig-common/keystone.conf</filename>, as follows:
ja: 他の <package>debconf</package> プロンプトと異なり、<placeholder-1/> を使用して <package>dbconfig-common</package> プロンプトに対する応答を事前シードできません。代わりに、<filename>/etc/dbconfig-common</filename> にファイルを作成する必要があります。例えば以下のように、<filename>/etc/dbconfig-common/keystone.conf</filename> にある <package>dbconfig-common</package> 用の Keystone 設定を作成することができます。
ru: В отличие от других запросов <package>debconf</package>, вы не можете преднастроить ответы на запросы <package>dbconfig-common</package> используя <placeholder-1/>. Вместо этого, вы можете создать файл конфигурации keystone для <package>dbconfig-common</package>, который расположен в <filename>/etc/dbconfig-common/keystone.conf</filename>, следующим образом:
vi_vn: Khác với các lời nhắc của các <package>debconf</package> khác, bạn không thể sắp đặt trước các phản hồi cho các lời nhắc của <package>dbconfig-common</package> bằng cách sử dụng <placeholder-1/>. Thay vào đó, bạn phải khởi tạo một file trong <filename>/etc/dbconfig-common</filename>. Ví dụ, bạn có thể khởi tạo một file cấu hình keystone cho <package>dbconfig-common</package> được đặt tại <filename>/etc/dbconfig-common/keystone.conf</filename>, như sau:
zh_cn: 与其它<package>debconf</package>的提示性输入不同，你不能使用<placeholder-1/>为<package>dbconfig-common</package>预置输入。反而，你必须在<filename>/etc/dbconfig-common</filename>中创建一个文件。例如，你可以为<package>dbconfig-common</package>创建keystone配置文件，放在<filename>/etc/dbconfig-common/keystone.conf</filename>处，如下所示：

source: Unset the temporary <envar>OS_TOKEN</envar> and <envar>OS_URL</envar> environment variables:
vi_vn: Hủy giá trị các biến môi trường tạm thời <envar>OS_TOKEN</envar> và <envar>OS_URL</envar>:

source: Update the datastore and version to use the specific image with the <placeholder-1/> command.
vi_vn: Cập nhật kho dữ liệu và phiên bản để sử dụng các image cụ thể với câu lệnh <placeholder-1/> .
zh_cn: 更新数据存储和版本，以通过 <placeholder-1/> 命令使用特定的镜像。

source: Update the package database, upgrade your system, and reboot for all changes to take effect:
ja: パッケージデータベースを更新し、システムをアップグレードします。すべての変更を反映するために再起動します。
ru: Обновите базу данных пакетов, обновите систему и перезагрузите её для принятия всех изменений:
vi_vn: Cập nhật cơ sở dữ liệu của gói, nâng cấp hệ thống của bạn và khởi động lại để tất cả các thay đổi có tác dụng:
zh_cn: 更新包数据库，升级您的系统，然后重启以便所有的修改生效：

source: Update the repository database and install the key:
ja: リポジトリデータベースを更新し、キーをインストールします。
ru: Обновите базу данных репозитория и установите ключ:
vi_vn: Câp nhật cơ sở dữ liệu repository và cài đặt khóa:
zh_cn: 更新仓库数据库并安装 key：

source: Upgrade the packages on your system:
ru: Обновите пакеты в своей системе:
vi_vn: Nâng cấp các gói cho hệ thống của bạn:
zh_cn: 更新系统中的这些软件包：

source: Upload a test file:
vi_vn: Tải lên file thử nghiệm:
zh_cn: 上传一个测试文件：
