Repository: 25hours/openstack-manuals
Catalog: doc/install-guide/locale/*.po
Languages: ja, ru, vi_vn, zh_cn

source: Adds creation of cinder user and addition to the service tenant. Fix bug <link href="https://bugs.launchpad.net/openstack-manuals/+bug/1205057">1205057</link>.
ja: cinder ユーザーの作成と service プロジェクトへの追加。バグ <link href="https://bugs.launchpad.net/openstack-manuals/+bug/1205057">1205057</link> の修正。
ru: Добавляет создание пользователя cinder и дополнение к тенанту сервиса. Фиксирует баг <link href="https://bugs.launchpad.net/openstack-manuals/+bug/1205057">1205057</link>.
zh_cn: 添加创建cinder用户和服务租户的更多功能。 更正错误<link href="https://bugs.launchpad.net/openstack-manuals/+bug/1205057">1205057</link>.

source: Updated the book title for consistency.
ja: 一貫性のために文書名の更新。
ru: Обновлен заголовок книги.
zh_cn: 为了统一更新了书的标题。

source: Updated cover and fixed small errors in appendix.
ja: 表紙の更新と付録の小さなミスの修正。
ru: Обновлена обложка и исправлены небольшие ошибки в приложении.
zh_cn: 更新了封面并修正了附录中的一些小错误。

source: Add the upstream repository key:
zh_cn: 添加上行源密钥：

source: Add the upstream repository:
zh_cn: 添加上行源：

source: Update the package database:
zh_cn: 更新软件包数据库：

source: Before you install and configure Telemetry, you must install <application>MongoDB</application>, create a MongoDB database, service credentials, and API endpoints.
zh_cn: 安装和配置 Telemetry 之前，您必须先安装 <application>MongoDB</application>，创建一个 MongoDB 数据库、服务证书和 API 端点。

source: Replace <replaceable>CEILOMETER_PASS</replaceable> with a suitable password.
ru: Замените <replaceable>CEILOMETER_PASS</replaceable> на подходящий пароль.
zh_cn: 将其中的 <replaceable>CEILOMETER_PASS</replaceable> 替换为一个合适的密码。

source: Create the Telemetry module API endpoints:
zh_cn: 创建Telemetry模块API端点：

source: Replace <replaceable>CEILOMETER_PASS</replaceable> with the password you chose for the <literal>celiometer</literal> user in the Identity service.
ru: Замените <replaceable>CEILOMETER_PASS</replaceable> на пароль, который вы выбрали для пользователя <literal>celiometer</literal> в службе Идентификации.
zh_cn: 将其中的 <replaceable>CEILOMETER_PASS</replaceable> 替换为您在身份认证服务中为 <literal>celiometer</literal> 用户设置的密码。

source: In the <literal>[collector]</literal> section, configure the dispatcher:
zh_cn: 在 <literal>[collector]</literal> 部分，设置调度者：

source: After you create tenants, users, and roles, you must create the <glossterm>service</glossterm> entity and <glossterm baseform="API endpoint">API endpoints</glossterm> for the Identity service.
ru: После того, как вы создали тенантов, пользователей и роли, вам необходимо создать объект <glossterm>service</glossterm> и <glossterm baseform="API endpoint">точки доступа API</glossterm> для сервиса Identity.
zh_cn: 创建好租户、用户和角色后，您必须为身份认证服务创建 <glossterm>service</glossterm> 实体和 <glossterm baseform="API endpoint">API 端点</glossterm>。

source: Set the <envar>OS_SERVICE_TOKEN</envar> and <envar>OS_SERVICE_ENDPOINT</envar> environment variables, as described in <xref linkend="keystone-users"/>.
ru: Задайте переменные среды <envar>OS_SERVICE_TOKEN</envar> и <envar>OS_SERVICE_ENDPOINT</envar>, как описано в <xref linkend="keystone-users"/>.
zh_cn: 如 <xref linkend="keystone-users"/> 中所描述的内容，设置 <envar>OS_SERVICE_TOKEN</envar> 和 <envar>OS_SERVICE_ENDPOINT</envar> 环境变量。

source: To create the service entity and API endpoints
ru: Для создания объекта для сервиса и точек доступа API
zh_cn: 创建服务实体和 API 端点

source: The Identity service manages a catalog of services in your OpenStack environment. Services use this catalog to locate other services in your environment.
ru: Сервис Identity управляет каталогом сервисов в вашем окружении OpenStack. Сервисы используют этот каталог, чтобы найти другие сервисы в вашем окружении.
zh_cn: 身份认证服务管理了一个关于您 OpenStack 环境中的服务的目录。服务使用这个目录来查找您环境中的其他服务。

source: Create the Identity service API endpoints:
ru: Создайте точки доступа API для сервиса Identity:
zh_cn: 创建身份认证服务的 API 端点：

source: This command references the ID of the service that you created in the previous step.
ru: Эта команда использует ID службы, который вы создали на предыдущем шаге.
zh_cn: 这个命令需要关联您在前一个步骤中所创建的服务的 ID。

source: Each service that you add to your OpenStack environment requires adding information such as API endpoints to the Identity service. The sections of this guide that cover service installation include steps to add the appropriate information to the Identity service.
ru: Каждый сервис добавленный вами в ваше окружение OpenStack требует добавления информации, такой как точки доступа API, в сервис Identity. Разделы этого руководства, затрагивающие установку сервисов, включают шаги по добавлению соответствующей информации в сервис Identity.
zh_cn: 每一个您添加到 OpenStack 环境中的服务需要添加一些信息，如 API 端点，到身份认证服务中。本指南涵盖服务安装的部分包括一些步骤，以添加合适的信息到身份认证服务中。

source: The <glossterm baseform="cloud controller node">controller node</glossterm> runs the Identity service, Image Service, management portion of Compute, and the dashboard. It also includes supporting services such as a SQL database, <glossterm>message queue</glossterm>, and <glossterm>Network Time Protocol (NTP)</glossterm>.
ru: <glossterm baseform="cloud controller node">Управляющий узел</glossterm> предоставляет службы Идентификации, Образов, управляющую часть Вычислительной службы и Панель управления. Он так же включает вспомогательные службы, такие как SQL СУБД, <glossterm>очередь сообщений</glossterm> и <glossterm>Протокол сетевого времени (NTP)</glossterm>.
zh_cn: <glossterm baseform="cloud controller node">控制节点服务器</glossterm>运行身份认证服务、镜像服务，管理部分计算和网络服务，运行网络插件以及仪表板。它还包括一些支持服务，例如 SQL 数据库、<glossterm>消息队列</glossterm>和<glossterm>网络时间协议 (NTP)</glossterm>.

source: To verify that the Database service is installed and configured correctly, try executing a Trove command:
zh_cn: 验证数据库服务是否安装并正确配置，可以尝试执行 Trove 命令：

source: Retrieve the Trove instances list:
zh_cn: 获取 Trove 实例列表：

source: Assuming you have created an image for the type of database you want, and have updated the datastore to use that image, you can now create a Trove instance (database). To do this, use the trove <placeholder-1/> command.
zh_cn: 假设您已经创建了一个您要使用的数据库类型的镜像，并已经更新数据存储以使用该镜像，您现在可以创建一个 Trove 实例 (数据库) 了。要实现创建，请使用 trove 的 <placeholder-1/> 命令。

source: PASSWORD
zh_cn: 密码

source: This section describes how to install and configure storage nodes that operate the account, container, and object services. For simplicity, this configuration references two storage nodes, each containing two empty local block storage devices. Each of the devices, <literal>/dev/sdb</literal> and <literal>/dev/sdc</literal>, must contain a suitable partition table with one partition occupying the entire device. Although the Object Storage service supports any file system with <glossterm>extended attributes (xattr)</glossterm>, testing and benchmarking indicate the best performance and reliability on <glossterm>XFS</glossterm>. For more information on horizontally scaling your environment, see the <link href="http://docs.openstack.org/developer/swift/deployment_guide.html">Deployment Guide</link>.
zh_cn: 这个部分将描述如何安装和配置存储节点，这些节点运行着帐户、容器和对象存储服务。简单来说，这个配置关系到两个存储节点，每个节点都包含了本地块存储设备。每个设备，<literal>/dev/sdb</literal> 和 <literal>/dev/sdc</literal>，必须包含一个合适的分区表，每个分区都占用整个设备。虽然对象存储服务支持任何含有<glossterm>扩展属性 (xattr)</glossterm> 的文件系统，测试和标准测试显示性能最好和最可靠的是在 <glossterm>XFS</glossterm> 上。要想了解更多关于水平缩放您环境的信息，请阅读 <link href="http://docs.openstack.org/developer/swift/deployment_guide.html">Deployment Guide</link>。

source: Edit the <filename>/etc/xinetd.d/rsync</filename> file and enable the <systemitem role="service">rsync</systemitem> service:
ru: Отредактируйте файл <filename>/etc//rsync</filename> и включите службу <systemitem role="service">rsync</systemitem>:
zh_cn: 修改 <filename>/etc/xinetd.d/rsync</filename> 文件并启用 <systemitem role="service">rsync</systemitem> 服务：

source: Start the <systemitem class="service">xinetd</systemitem> service and configure it to start when the system boots:
ja: <systemitem class="service">xinetd</systemitem> サービスを起動し、システム起動時に起動するよう設定します。
ru: Запустите сервис <systemitem class="service">xinetd</systemitem> и настройте его автоматический запуск при загрузке системы:
zh_cn: 启动 <systemitem class="service">xinetd</systemitem> 服务并将其配置为随系统启动：

source: Obtain the accounting, container, and object service configuration files from the Object Storage source repository:
zh_cn: 从对象存储资源仓库中获取帐户、容器和对象服务的配置文件：

source: This process can take a while.
ru: Этот процесс может занять некоторое время.
zh_cn: 这个过程会花费一些时间。

source: FILE
zh_cn: 文件

source: The proxy service relies on an authentication and authorization mechanism such as the Identity service. However, unlike other services, it also offers an internal mechanism that allows it to operate without any other OpenStack services. However, for simplicity, this guide references the Identity service in <xref linkend="ch_keystone"/>. Before you configure the Object Storage service, you must create service credentials and API endpoints.
zh_cn: 代理服务依赖于例如认证服务所提供的认证和授权机制。但是，与其他服务不同的是，它也提供一个内部的机制可以在没有任何其它OpenStack服务的情况下工作。但为了简单起见，本指南在 <xref linkend="ch_keystone"/>引用认证服务的说明。在配置对象存储服务之间，你必须生成服务凭证和API端点。

source: The Object Storage service does not use a SQL database on the controller node.
zh_cn: 对象存储服务在控制节点上不使用 SQL 数据库。

source: Replace <replaceable>SWIFT_PASS</replaceable> with a suitable password.
ru: Замените <replaceable>SWIFT_PASS</replaceable> на подходящий пароль.
zh_cn: 将其中的 <replaceable>SWIFT_PASS</replaceable> 替换为一个合适的密码。

source: Create the Object Storage service API endpoints:
zh_cn: 创建对象存储服务的 API 端点：

source: In the <literal>[app:proxy-server]</literal> section, enable account management:
zh_cn: 在 <literal>[app:proxy-server]</literal> 部分中，启动账户管理：

source: You might need to uncomment this section.
ru: Вам может потребоваться раскомментировать эту секцию.
zh_cn: 你可能需要反注释这部分.

source: Define users, tenants, and roles
ja: ユーザー、プロジェクト、ロールの定義

source: After you install the Identity Service, set up <glossterm baseform="user">users</glossterm>, <glossterm baseform="tenant">tenants</glossterm>, and <glossterm baseform="role">roles</glossterm> to authenticate against. These are used to allow access to services and <glossterm baseform="endpoint">endpoints</glossterm>, described in the next section.
ja: Identity Service をインストールした後、認証する<glossterm baseform="user">ユーザー</glossterm>、<glossterm baseform="tenant">プロジェクト</glossterm>、<glossterm baseform="role">ロール</glossterm>をセットアップします。これらは次のセクションに記述されるサービスと<glossterm baseform="endpoint">エンドポイント</glossterm>へのアクセスを許可するために使用されます。

source: Typically, you would indicate a user and password to authenticate with the Identity Service. At this point, however, you have not created any users, so you have to use the authorization token created in an earlier step, see <xref linkend="keystone-install"/> for further details. You can pass this with the <option>--os-token</option> option to the <placeholder-1/> command or set the <envar>OS_SERVICE_TOKEN</envar> environment variable. Set <envar>OS_SERVICE_TOKEN</envar>, as well as <envar>OS_SERVICE_ENDPOINT</envar> to specify where the Identity Service is running. Replace <placeholder-2/> with your authorization token.
ja: 一般的に Identity Service で認証するためにユーザーとパスワードを必要とします。しかしながら今のところ、何もユーザーを作成していないため、前の手順で作成した認可トークンを使用する必要があります。詳細は<xref linkend="keystone-install"/>を参照してください。<option>--os-token</option> オプションを用いてこれを <placeholder-1/> コマンドに渡すことができます。または、<envar>OS_SERVICE_TOKEN</envar> 環境変数を設定します。Identity Service が動作している場所を指定するために <envar>OS_SERVICE_TOKEN</envar> だけでなく <envar>OS_SERVICE_ENDPOINT</envar> を設定します。<placeholder-2/> をお使いの認可トークンで置き換えます。

source: Create an administrative user
ja: 管理ユーザーの作成

source: Follow these steps to create an administrative user, role, and tenant. You will use this account for administrative interaction with the OpenStack cloud.
ja: 管理ユーザー、ロール、プロジェクトを作成するために、以下の手順を実行します。OpenStack クラウドの管理操作のために、このアカウントを使用します。

source: By default, the Identity Service creates a special <literal>_member_</literal> role. The OpenStack dashboard automatically grants access to users with this role. You will give the <literal>admin</literal> user access to this role in addition to the <literal>admin</literal> role.
ja: Identity Service は標準で特別な <literal>_member_</literal> ロールを作成します。OpenStack ダッシュボードは自動的にこのロールを持つユーザーにアクセス権を与えます。<literal>admin</literal> ユーザーのアクセス権に、このロールに加えて <literal>admin</literal> ロールを与えます。

source: Any role that you create must map to roles specified in the <filename>policy.json</filename> file included with each OpenStack service. The default policy file for most services grants administrative access to the <literal>admin</literal> role.
ja: 作成するすべてのロールは、各 OpenStack サービスに含まれる <filename>policy.json</filename> ファイルで指定されたロールにマップすべきです。多くのサービス用の標準ポリシーファイルは、管理アクセスを <literal>admin</literal> ロールに許可します。

source: Replace <replaceable>ADMIN_PASS</replaceable> with a secure password and replace <replaceable>ADMIN_EMAIL</replaceable> with an email address to associate with the account.
ja: <replaceable>ADMIN_PASS</replaceable> を安全なパスワードに置き換え、<replaceable>ADMIN_EMAIL</replaceable> をこのアカウントに関連付ける電子メールアドレスに置き換えます。

source: You must now link the <literal>admin</literal> user, <literal>admin</literal> role, and <literal>admin</literal> tenant together using the <option>user-role-add</option> option:
ja: ここで <option>user-role-add</option> オプションを使用して、<literal>admin</literal> ユーザー、<literal>admin</literal> ロール、<literal>admin</literal> プロジェクトをリンクする必要があります。

source: Link the <literal>admin</literal> user, <literal>_member_</literal> role, and <literal>admin</literal> tenant:
ja: <literal>admin</literal> ユーザー、<literal>_member_</literal> ロール、<literal>admin</literal> プロジェクトをリンクします。

source: Create a normal user
ja: 一般ユーザーの作成

source: Follow these steps to create a normal user and tenant, and link them to the special <literal>_member_</literal> role. You will use this account for daily non-administrative interaction with the OpenStack cloud. You can also repeat this procedure to create additional cloud users with different usernames and passwords. Skip the tenant creation step when creating these users.
ja: 一般ユーザーとプロジェクトを作成し、それらと特別な <literal>_member_</literal> ロールをリンクするために、以下の手順を実行します。OpenStack クラウドの日々の非管理操作のために、このアカウントを使用します。別のユーザー名とパスワードを持つユーザーを作成するために、この手順を繰り返すことができます。これらのユーザーを作成するときに、プロジェクトを作成する手順を省略します。

source: Replace <replaceable>DEMO_PASS</replaceable> with a secure password and replace <replaceable>DEMO_EMAIL</replaceable> with an email address to associate with the account.
ja: <replaceable>DEMO_PASS</replaceable> を安全なパスワードに置き換え、<replaceable>DEMO_EMAIL</replaceable> をこのアカウントに関連付ける電子メールアドレスに置き換えます。

source: Do not repeat this step when adding additional users.
ja: 別のユーザーを追加するときに、この手順を繰り返さないでください。

source: Link the <literal>demo</literal> user, <literal>_member_</literal> role, and <literal>demo</literal> tenant:
ja: <literal>demo</literal> ユーザー、<literal>_member_</literal> ロール、<literal>demo</literal> プロジェクトをリンクします。

source: Create a <literal>service</literal> tenant
ja: <literal>service</literal> プロジェクトの作成

source: OpenStack services also require a username, tenant, and role to access other OpenStack services. In a basic installation, OpenStack services typically share a single tenant named <literal>service</literal>.
ja: OpenStack のサービスは、他の OpenStack のサービスにアクセスするために、ユーザー名、プロジェクト、ロールを必要とします。基本的なインストールでは、OpenStack のサービスは一般的に同じ <literal>service</literal> という名前のプロジェクトを共有します。

source: You will create additional usernames and roles under this tenant as you install and configure each service.
ja: 各サービスをインストールし、設定するので、このプロジェクトの下に追加のユーザー名とロールを作成します。

source: Passwords
ja: パスワード

source: Database
ja: データベース
ru: База данных

source: Controller setup
ja: コントローラーのセットアップ

source: <phrase os="sles">For SUSE Linux Enterprise Server: </phrase> On the controller node, install the MySQL client and server packages, and the Python library.
ja: <phrase os="sles">SUSE Linux Enterprise Server の場合: </phrase> コントローラーノードに MySQL クライアントとサーバーパッケージ、Python ライブラリをインストールします。

source: For openSUSE: On the controller node, install the MariaDB client and database server packages, and the MySQL Python library.
ja: openSUSE の場合: コントローラーノードに MariaDB クライアントとデータベースサーバーパッケージ、MySQL Python ライブラリをインストールします。

source: When you install the server package, you are prompted for the root password for the database. Choose a strong password and remember it.
ja: サーバーパッケージをインストールするとき、データベースの root パスワードを入力するよう求められます。強いパスワードを選択し、それを覚えておきます。

source: The MySQL configuration requires some changes to work with OpenStack.
ja: OpenStack を扱うために、いくつかの MySQL の設定変更が必要になります。

source: Edit the <filename>/etc/mysql/my.cnf</filename> file:
ja: <filename>/etc/mysql/my.cnf</filename> ファイルを編集します。

source: Edit the <filename>/etc/my.cnf</filename> file:
ja: <filename>/etc/my.cnf</filename> ファイルを編集します。

source: Under the <literal>[mysqld]</literal> section, set the <literal>bind-address</literal> key to the management IP address of the controller node to enable access by other nodes via the management network:
ja: 管理ネットワーク経由で他のノードからアクセスできるようにするために、<literal>[mysqld]</literal> セクションの下で、<literal>bind-address</literal> キーにコントローラーノードの管理 IP アドレスを設定します。

source: Restart the MySQL service to apply the changes:
ja: 変更を適用するために MySQL サービスを再起動します。

source: Finally, you should set a root password for your <phrase os="rhel;fedora;centos">MySQL</phrase><phrase os="opensuse;sles">MariaDB or MySQL</phrase> database. The OpenStack programs that set up databases and tables prompt you for this password if it is set.
ja: 最後に <phrase os="rhel;fedora;centos">MySQL</phrase><phrase os="opensuse;sles">MariaDB または MySQL</phrase> データベースの root パスワードを設定すべきです。データベースとテーブルをセットアップする OpenStack のプログラムは、パスワードが設定されているとプロンプトを表示します。

source: You must delete the anonymous users that are created when the database is first started. Otherwise, database connection problems occur when you follow the instructions in this guide. To do this, use the <placeholder-1/> command. Note that if <placeholder-2/> fails you might need to use <placeholder-3/> first:
ja: データベースを初めて起動したときに作成される匿名ユーザーを削除する必要があります。そうしなければ、このガイドにある説明に従うとき、データベースの接続に関する問題が発生します。これをするために <placeholder-1/> コマンドを使用します。<placeholder-2/> が失敗した場合、まず <placeholder-3/> を使用する必要があるかもしれないことに注意してください。

source: <phrase os="rhel;centos;fedora;opensuse;sles">If you have not already set a root database password, press <keycap>ENTER</keycap> when you are prompted for the password.</phrase> This command presents a number of options for you to secure your database installation. Respond <placeholder-1/> to all prompts unless you have a good reason to do otherwise.
ja: <phrase os="rhel;centos;fedora;opensuse;sles">root データベースパスワードをまだ設定していなければ、パスワードのプロンプトが出たときに、そのまま <keycap>ENTER</keycap> を押します。</phrase> このコマンドはデータベース環境をセキュアにするための多くのオプションを示します。他に良い理由がなければ、すべてのプロンプトに <placeholder-1/> と答えます。

source: Node setup
ja: ノードのセットアップ

source: Distributions might release OpenStack packages as part of their distribution or through other methods because the OpenStack and distribution release times are independent of each other.
ja: ディストリビューションはその一部として OpenStack パッケージをリリースしているかもしれません。または、OpenStack とディストリビューションのリリース間隔がお互いに独立しているため、他の方法によりリリースしているかもしれません。

source: This section describes the configuration you must complete after you configure machines to install the latest OpenStack packages.
ja: このセクションは、最新の OpenStack パッケージをインストールするために、マシンを設定した後に完了する必要がある設定について説明します。

source: The EPEL package includes GPG keys for package signing and repository information. This should only be installed on Red Hat Enterprise Linux and CentOS, not Fedora. Install the latest <package>epel-release</package> package (see <link href="http://download.fedoraproject.org/pub/epel/6/x86_64/repoview/epel-release.html">http://download.fedoraproject.org/pub/epel/6/x86_64/repoview/epel-release.html</link>). For example:
ja: EPEL パッケージはパッケージ署名とリポジトリ情報のために GPG キーを含みます。これは Red Hat Enterprise Linux と CentOS のみにインストールすべきです。Fedora では必要がありません。最新の <package>epel-release</package> パッケージ (<link href="http://download.fedoraproject.org/pub/epel/6/x86_64/repoview/epel-release.html">http://download.fedoraproject.org/pub/epel/6/x86_64/repoview/epel-release.html</link> 参照) をインストールします。例:

source: Use the Open Build Service repositories for <glossterm>Icehouse</glossterm> based on your openSUSE or SUSE Linux Enterprise Server version, for example if you run openSUSE 12.3 use:
ja: openSUSE または SUSE Linux Enterprise Server のバージョンに基づいた <glossterm>Icehouse</glossterm> 用 Open Build Service リポジトリを使用します。例えば、openSUSE 12.3 を実行している場合、以下を使用します。

source: For openSUSE 13.1 use:
ja: openSUSE 13.1 を利用している場合:

source: If you use SUSE Linux Enterprise Server 11 SP3, use:
ja: SUSE Linux Enterprise Server 11 SP3 を使用している場合、以下を使用します。

source: The <package>openstack-utils</package> package contains utility programs that make installation and configuration easier. These programs are used throughout this guide. Install <package>openstack-utils</package>. This verifies that you can access the Open Build Service repository:
ja: <package>openstack-utils</package> パッケージはインストールと設定を簡単にするユーティリティプログラムを含みます。これらのプログラムはこのガイドを通して使用されます。<package>openstack-utils</package> をインストールします。これにより Open Build Service リポジトリにアクセスできることを確認します。

source: The <application>openstack-config</application> program in the <package>openstack-utils</package> package uses <application>crudini</application> to manipulate configuration files. However, <application>crudini</application> version 0.3 does not support multi valued options. See <link href="https://bugs.launchpad.net/openstack-manuals/+bug/1269271">https://bugs.launchpad.net/openstack-manuals/+bug/1269271</link>. As a work around, you must manually set any multi valued options or the new value overwrites the previous value instead of creating a new option.
ja: <package>openstack-utils</package> パッケージにある <application>openstack-config</application> プログラムは設定ファイルを操作するために <application>crudini</application> を使用します。しかしながら、<application>crudini</application> バージョン 3.0 は複数の値を持つオプションをサポートしません。<link href="https://bugs.launchpad.net/openstack-manuals/+bug/1269271">https://bugs.launchpad.net/openstack-manuals/+bug/1269271</link> を参照してください。回避策として、複数の値を持つオプションを手動で設定する必要があります。または、新しいオプションを作成する代わりに、新しい値で前の値を上書きします。

source: Upgrade your system packages:
ja: お使いのシステムのパッケージをアップグレードします。

source: If the upgrade included a new kernel package, reboot the system to ensure the new kernel is running:
ja: アップグレードが新しいカーネルパッケージを含む場合、確実に新しいカーネルを実行するために、システムを再起動します。

source: To use the Ubuntu Cloud Archive for Icehouse
ja: Icehouse 用 Ubuntu Cloud Archive の使用法

source: The <link href="https://wiki.ubuntu.com/ServerTeam/CloudArchive">Ubuntu Cloud Archive</link> is a special repository that allows you to install newer releases of OpenStack on the stable supported version of Ubuntu.
ja: <link href="https://wiki.ubuntu.com/ServerTeam/CloudArchive">Ubuntu Cloud Archive</link> は、Ubuntu の安定サポートバージョンで OpenStack の最新版をインストールできるようにするための特別なリポジトリです。

source: Install the Ubuntu Cloud Archive for <glossterm>Icehouse</glossterm>: <placeholder-1/>
ja: <glossterm>Icehouse</glossterm> 向け Ubuntu Cloud Archive をインストールします。 <placeholder-1/>

source: To use the Debian Wheezy backports archive for Icehouse
ja: Debian Wheezy を使用する場合、Icehouse 向けアーカイブをバックポートします

source: The <glossterm>Icehouse</glossterm> release is available only in Debian Sid (otherwise called Unstable). However, the Debian maintainers of OpenStack also maintain a non-official Debian repository for OpenStack containing Wheezy backports.
ja: <glossterm>Icehouse</glossterm> リリースは Debian Sid (開発版とも言います) のみで利用できます。しかしながら、OpenStack の Debian メンテナーは、Wheezy バックポートを含む OpenStack の非公式 Debian リポジトリをメンテナンスしています。

source: Install the Debian Wheezy backport repository Icehouse:
ja: Debian Wheezy バックポート Icehouse リポジトリをインストールします。

source: Install the Debian Wheezy OpenStack repository for Icehouse:
ja: Debian Wheezy OpenStack Icehouse リポジトリをインストールします。
