Repository: 25hours/openstack-manuals
Catalog: doc/install-guide/locale/*.po
Languages: ja, ru, vi_vn, zh_cn

source: This network type is often created by the OpenStack administrator to map directly to an existing physical network in the data center (called a "provider network"). This allows the provider to use a physical router on that data center network as the gateway for VMs to reach the outside world. For each subnet on an external network, the gateway configuration on the physical router must be manually configured outside of OpenStack.
ja: このネットワーク形式は、データセンターにある既存の物理ネットワーク (いわゆる「プロバイダーネットワーク」) に直接対応づけるために、しばしば OpenStack 管理者により作成されます。これによりプロバイダーが物理ルーターを使用できます。これは仮想マシンが外部にアクセスするためのゲートウェイとしてデータセンターにあるものです。外部ネットワークにある各サブネットに対して、物理ルーターのゲートウェイ設定は OpenStack とは別に正しく手動設定する必要があります。

source: Use case: multiple flat network
ja: ユースケース: 複数のフラットなネットワーク

source: This use case is similar to the above single flat network use case, except that tenants can see multiple shared networks via the Networking API and can choose which network (or networks) to plug into.
ja: このユースケースは単一のフラットなネットワークのユースケースと似ています。プロジェクトが Networking API 経由で複数の共有ネットワークを認識でき、接続するネットワークを選択できることが異なります。

source: Use case: mixed flat and private network
ja: ユースケース: フラットなネットワークとプライベートネットワークの混在

source: This use case is an extension of the above Flat Network use cases. In addition to being able to see one or more shared networks via the OpenStack Networking API, tenants can also have access to private per-tenant networks (only visible to tenant users).
ja: このユースケースは上のフラットなネットワークのユースケースの拡張です。OpenStack Networking API 経由で 1 つ以上の共有ネットワークを認識できることに加えて、プロジェクトは (プロジェクトのユーザーだけに認識できる) テナントごとのプライベートなネットワークにアクセスできます。

source: Created VMs can have NICs on any of the shared or private networks that the tenant owns. This enables the creation of multi-tier topologies that use VMs with multiple NICs. It also enables a VM to act as a gateway so that it can provide services such as routing, NAT, and load balancing.
ja: 作成された仮想マシンは、共有ネットワークやプロジェクトが所有するプライベートネットワークのどれかに NIC を持つことができます。これにより、複数の NIC を持つ仮想マシンを使用する、複数階層のトポロジーの作成ができるようになります。また、仮想マシンがルーティング、NAT、負荷分散のようなサービスを提供できるよう、ゲートウェイとして動作することもできます。

source: Basic environment configuration
ja: 環境の基本設定

source: Use the instructions in <xref linkend="ch_basics"/> to configure the system. Note the following differences from the installation instructions for the controller node:
ja: システムを設定するために <xref linkend="ch_basics"/> にある方法を使用します。以下の項目はコントローラーノードのインストール説明と異なることに注意してください。

source: Set the host name to <literal>block1</literal>. Ensure that the IP addresses and host names for both nodes are listed in the <filename>/etc/hosts</filename> file on each system.
ja: ホスト名を <literal>block1</literal> に設定します。両方のノードの IP アドレスとホスト名が各システムの <filename>/etc/hosts</filename> にあることを確認します。

source: Follow the instructions in <xref linkend="basics-ntp"/> to synchronize from the controller node.
ja: コントローラーノードから同期するために、<xref linkend="basics-ntp"/> にある説明に従います。

source: Create the LVM physical and logical volumes. This guide assumes a second disk <literal>/dev/sdb</literal> that is used for this purpose:
ja: LVM の物理ボリュームと論理ボリュームを作成します。このガイドはこの目的のために使用される 2 番目のディスク <literal>/dev/sdb</literal> を仮定します。

source: You must add required physical volumes for LVM on the Block Storage host. Run the <placeholder-1/> command to get a list or required volumes.
ja: Block Storage のホストに LVM 用に必要となる物理ボリュームを追加する必要があります。必要となるボリュームの一覧を取得するために <placeholder-1/> コマンドを実行します。

source: Each item in the filter array starts with either an <literal>a</literal> for accept, or an <literal>r</literal> for reject. The physical volumes that are required on the Block Storage host have names that begin with <literal>a</literal>. The array must end with "<literal>r/.*/</literal>" to reject any device not listed.
ja: フィルター配列にある各項目は、許可するために <literal>a</literal> から、拒否するために <literal>r</literal> から始まります。Block Storage のホストで必要となる物理ボリュームは <literal>a</literal> から始まる名前を持つ必要があります。配列は一覧に無いすべてのデバイスを拒否するために "<literal>r/.*/</literal>" で終わる必要があります。

source: In this example, <literal>/dev/sda1</literal> is the volume where the volumes for the operating system for the node reside, while <literal>/dev/sdb</literal> is the volume reserved for <literal>cinder-volumes</literal>.
ja: この例では、<literal>/dev/sda1</literal> がノードのオペレーティングシステム用のボリュームが置かれるボリュームです。<literal>/dev/sdb</literal> は <literal>cinder-volumes</literal> のために予約されたボリュームです。

source: Create a <literal>cinder</literal> user.
ja: <literal>cinder</literal> ユーザーを作成します。

source: for Red Hat Enterprise Linux, CentOS, and Fedora
ja: Red Hat Enterprise Linux, CentOS, Fedora 版

source: for Ubuntu 12.04/14.04 (LTS)
ja: Ubuntu 12.04/14.04 (LTS) 版

source: for openSUSE and SUSE Linux Enterprise Server
ja: openSUSE, SUSE Linux Enterprise Server 版

source: for Debian 7.0 (Wheezy)
ja: Debian 7.0 (Wheezy) 版

source: OpenStack Installation Guide<placeholder-1/><placeholder-2/><placeholder-3/><placeholder-4/>
ja: OpenStack インストールガイド <placeholder-1/><placeholder-2/><placeholder-3/><placeholder-4/>

source: Edit <filename>/etc/sysctl.conf</filename> to contain the following:
ja: <filename>/etc/sysctl.conf</filename> を編集し、以下の内容を含めます。

source: Edit the <filename>/etc/neutron/plugins/ml2/ml2_conf.ini</filename> file.
ja: <filename>/etc/neutron/plugins/ml2/ml2_conf.ini</filename> ファイルを編集します。

source: Add the following keys to the <literal>[ml2_type_gre]</literal> section:
ja: 以下のキーを <literal>[ml2_type_gre]</literal> セクションに追加します。

source: Add the integration bridge:
ja: 統合ブリッジを追加します。

source: This guide describes how to deploy these services in a functional test environment and, by example, teaches you how to build a production environment.
ja: このガイドはこれらのサービスを機能テスト環境に導入する方法について説明します。例えば、本番環境を構築する方法を教えます。

source: Two-node architecture with legacy networking. See <xref linkend="example-architecture-with-legacy-networking"/>.
ja: レガシーなネットワークを持つ 2 ノードアーキテクチャー。<xref linkend="example-architecture-with-legacy-networking"/>を参照してください。

source: The basic controller node runs the Identity service, Image Service, management portions of Compute and Networking, Networking plug-in, and the dashboard. It also includes supporting services such as MySQL, AMQP, and NTP.
ja: 基本的なコントローラーノードは、Identity Service、Image Service、および Compute、Networking、Networking プラグイン、ダッシュボードの管理部分を実行します。MySQL、AMQP、NTP のようなサポートサービスも含まれます。

source: Three-node architecture with OpenStack Networking (neutron)
ja: OpenStack Networking (Neutron) を持つ 3 ノードアーキテクチャー

source: Install the dashboard
ja: Dashboard のインストール

source: Before you can install and configure the dashboard, meet the requirements in <xref linkend="dashboard-system-requirements"/>.
ja: Dashboard をインストールし、設定する前に <xref linkend="dashboard-system-requirements"/> にある要件を満たしている必要があります。

source: When you install only Object Storage and the Identity Service, even if you install the dashboard, it does not pull up projects and is unusable.
ja: bject Storage と Identity Service のみをインストールしたとき、Dashboard をインストールしても、プロジェクトが表示されず、使用することもできません。

source: For more information about how to deploy the dashboard, see <link href="http://docs.openstack.org/developer/horizon/topics/deployment.html">deployment topics in the developer documentation</link>.
ja: Dashboard の導入方法の詳細は <link href="http://docs.openstack.org/developer/horizon/topics/deployment.html">deployment topics in the developer documentation</link> を参照してください。

source: Install the dashboard on the node that can contact the Identity Service as root:
ja: Identity Service と通信できるノードに root として Dashboard をインストールします。

source: Note for Ubuntu users
ja: Ubuntu ユーザー向け注記

source: Remove the <literal>openstack-dashboard-ubuntu-theme</literal> package. This theme prevents translations, several menus as well as the network map from rendering correctly: <placeholder-1/>
ja: <literal>openstack-dashboard-ubuntu-theme</literal> パッケージを削除します。このテーマは翻訳、いくつかのメニュー、ネットワークマップが正しく表示されません。 <placeholder-1/>

source: Note for Debian users
ja: Debian ユーザー向けの注記

source: To install the Apache package:
ja: Apache のパッケージをインストールする方法:

source: This command installs and configures Apache correctly, provided that the user asks for it during the <package>debconf</package> prompts. The default SSL certificate is self-signed, and it is probably wise to have it signed by a root Certificate Authority (CA).
ja: このコマンドはユーザーが <package>debconf</package> プロンプトに答えたとおりに Apache を正しくインストールし、設定します。標準の SSL 証明書は自己署名です。ルート認証局 (CA) により署名されたものを使用したほうが良いです。

source: Modify the value of <literal>CACHES['default']['LOCATION']</literal> in <filename os="ubuntu;debian">/etc/openstack-dashboard/local_settings.py</filename><filename os="centos;fedora;rhel">/etc/openstack-dashboard/local_settings</filename><filename os="opensuse;sles">/srv/www/openstack-dashboard/openstack_dashboard/local/local_settings.py</filename> to match the ones set in <filename os="ubuntu;debian">/etc/memcached.conf</filename><filename os="centos;fedora;rhel;opensuse;sles">/etc/sysconfig/memcached</filename>.
ja: <filename os="ubuntu;debian">/etc/memcached.conf</filename><filename os="centos;fedora;rhel;opensuse;sles">/etc/sysconfig/memcached</filename> に設定したものと一致されるために、<filename os="ubuntu;debian">/etc/openstack-dashboard/local_settings.py</filename><filename os="centos;fedora;rhel">/etc/openstack-dashboard/local_settings</filename><filename os="opensuse;sles">/srv/www/openstack-dashboard/openstack_dashboard/local/local_settings.py</filename> の <literal>CACHES['default']['LOCATION']</literal> の値を変更します。

source: Open <filename os="ubuntu;debian">/etc/openstack-dashboard/local_settings.py</filename><filename os="centos;fedora;rhel">/etc/openstack-dashboard/local_settings</filename> and look for this line:
ja: <filename os="ubuntu;debian">/etc/openstack-dashboard/local_settings.py</filename><filename os="centos;fedora;rhel">/etc/openstack-dashboard/local_settings</filename> を開き、この行を探します。

source: Notes
ja: 注

source: The address and port must match the ones set in <filename os="ubuntu;debian">/etc/memcached.conf</filename><filename os="centos;fedora;rhel;opensuse;sles">/etc/sysconfig/memcached</filename>.
ja: アドレスとポートは <filename os="ubuntu;debian">/etc/memcached.conf</filename><filename os="centos;fedora;rhel;opensuse;sles">/etc/sysconfig/memcached</filename> に設定したものと一致する必要があります。

source: If you change the memcached settings, you must restart the Apache web server for the changes to take effect.
ja: memcached 設定を変更する場合、変更を反映するために Apache ウェブサーバーを再起動する必要があります。

source: You can use options other than memcached option for session storage. Set the session back-end through the <parameter>SESSION_ENGINE</parameter> option.
ja: セッションストレージのために memcached 以外のオプションを使用することもできます。<parameter>SESSION_ENGINE</parameter> オプションによりセッションバックエンドを設定します。

source: To change the timezone, use the dashboard or edit the <filename os="centos;fedora;rhel">/etc/openstack-dashboard/local_settings</filename><filename os="ubuntu;debian">/etc/openstack-dashboard/local_settings.py</filename><filename os="opensuse;sles">/srv/www/openstack-dashboard/openstack_dashboard/local/local_settings.py</filename> file.
ja: タイムゾーンを変更する場合、ダッシュボードを使用します。または <filename os="centos;fedora;rhel">/etc/openstack-dashboard/local_settings</filename><filename os="ubuntu;debian">/etc/openstack-dashboard/local_settings.py</filename><filename os="opensuse;sles">/srv/www/openstack-dashboard/openstack_dashboard/local/local_settings.py</filename> ファイルを編集します。

source: Change the following parameter: <code>TIME_ZONE = "UTC"</code>
ja: 次のパラメーターを変更します。 <code>TIME_ZONE = "UTC"</code>

source: Update the <literal>ALLOWED_HOSTS</literal> in <filename>local_settings.py</filename> to include the addresses you wish to access the dashboard from.
ja: Dashboard にアクセスしたいアドレスを含めるために <filename>local_settings.py</filename> の <literal>ALLOWED_HOSTS</literal> を更新します。

source: Edit <filename os="centos;fedora;rhel">/etc/openstack-dashboard/local_settings</filename><filename os="ubuntu;debian">/etc/openstack-dashboard/local_settings.py</filename><filename os="opensuse;sles">/srv/www/openstack-dashboard/openstack_dashboard/local/local_settings.py</filename>:
ja: filename os="centos;fedora;rhel">/etc/openstack-dashboard/local_settings</filename><filename os="ubuntu;debian">/etc/openstack-dashboard/local_settings.py</filename><filename os="opensuse;sles">/srv/www/openstack-dashboard/openstack_dashboard/local/local_settings.py</filename> を編集します。

source: This guide assumes that you are running the Dashboard on the controller node. You can easily run the dashboard on a separate server, by changing the appropriate settings in <filename>local_settings.py</filename>.
ja: このガイドはコントローラーノードで Dashboard を実行していると仮定します。<filename>local_settings.py</filename> の設定を適切に変更することにより、別のサーバーで Dashboard を簡単に実行できます。

source: Edit <filename os="centos;fedora;rhel">/etc/openstack-dashboard/local_settings</filename><filename os="ubuntu;debian">/etc/openstack-dashboard/local_settings.py</filename><filename os="opensuse;sles">/srv/www/openstack-dashboard/openstack_dashboard/local/local_settings.py</filename> and change <literal>OPENSTACK_HOST</literal> to the hostname of your Identity Service:
ja: <filename os="centos;fedora;rhel">/etc/openstack-dashboard/local_settings</filename><filename os="ubuntu;debian">/etc/openstack-dashboard/local_settings.py</filename><filename os="opensuse;sles">/srv/www/openstack-dashboard/openstack_dashboard/local/local_settings.py</filename> を編集し、<literal>OPENSTACK_HOST</literal> を Identity Service のホスト名に変更します。

source: Setup Apache configuration: <placeholder-1/>
ja: Apache 設定をセットアップします。 <placeholder-1/>

source: By default, the <systemitem>openstack-dashboard</systemitem> package enables a database as session store. Before you continue, either change the session store set up as described in <xref linkend="dashboard-sessions"/> or finish the setup of the database session store as explained in <xref linkend="dashboard-session-database"/>.
ja: <systemitem>openstack-dashboard</systemitem> パッケージは標準でセッションストアとしてデータベースを有効化します。続行する前に、<xref linkend="dashboard-sessions"/> に記載されているとおりセットアップしたセッションストアを変更します。または、<xref linkend="dashboard-session-database"/> に記載されているとおりデータベースのセッションストアのセットアップを完了します。

source: Ensure that the SELinux policy of the system is configured to allow network connections to the HTTP server.
ja: システムの SELinux ポリシーが HTTP サーバーにネットワーク接続を許可するよう設定されていることを確認します。

source: Start the Apache web server and memcached:
ja: Apache ウェブサーバーと memcached を起動します。

source: You can now access the dashboard at <uri os="ubuntu">http://controller/horizon</uri><uri os="debian">https://controller/</uri><uri os="centos;fedora;rhel">http://controller/dashboard</uri><uri os="opensuse;sles">http://controller</uri>.
ja: これで Dashboard に <uri os="ubuntu">http://controller/horizon</uri><uri os="debian">https://controller/</uri><uri os="centos;fedora;rhel">http://controller/dashboard</uri><uri os="opensuse;sles">http://controller</uri> からアクセスできます。

source: Login with credentials for any user that you created with the OpenStack Identity Service.
ja: OpenStack Identity Service で作成したどれかのユーザーのクレデンシャルでログインします。

source: Messaging server
ja: メッセージングサーバー
ru: Сервер сообщений

source: On the controller node, install the messaging queue server. Typically this is <phrase os="ubuntu;debian;opensuse;sles"><glossterm>RabbitMQ</glossterm></phrase><phrase os="centos;rhel;fedora"><glossterm>Qpid</glossterm></phrase> but <phrase os="ubuntu;debian;opensuse;sles"><glossterm>Qpid</glossterm></phrase><phrase os="centos;rhel;fedora"><glossterm>RabbitMQ</glossterm></phrase> and <glossterm>ZeroMQ</glossterm> (0MQ) are also available.
ja: コントローラーノードにメッセージキューサーバーをインストールします。一般的に <phrase os="ubuntu;debian;opensuse;sles"><glossterm>RabbitMQ</glossterm></phrase><phrase os="centos;rhel;fedora"><glossterm>Qpid</glossterm></phrase> ですが、<phrase os="ubuntu;debian;opensuse;sles"><glossterm>Qpid</glossterm></phrase><phrase os="centos;rhel;fedora"><glossterm>RabbitMQ</glossterm></phrase> や <glossterm>ZeroMQ</glossterm> (0MQ) も利用できます。

source: Important security consideration
ja: 重要なセキュリティ考慮事項

source: The <package>rabbitmq-server</package> package configures the RabbitMQ service to start automatically and creates a <literal>guest</literal> user with a default <literal>guest</literal> password. The RabbitMQ examples in this guide use the <literal>guest</literal> account, though it is strongly advised to change its default password, especially if you have IPv6 available: by default the RabbitMQ server enables anyone to connect to it by using guest as login and password, and with IPv6, it is reachable from the outside.
ja: <package>rabbitmq-server</package> パッケージは、RabbitMQ サービスが自動的に起動するよう設定し、デフォルトの <literal>guest</literal> パスワードで <literal>guest</literal> ユーザーを作成します。このガイドの RabbitMQ の例は <literal>guest</literal> アカウントを使用しますが、特に IPv6 が利用可能な場合、そのデフォルトのパスワードを変更することを強く推奨します。RabbitMQ サーバーはデフォルトで、ログインとパスワードとしてゲストを使用することにより、すべてのものが接続できます。IPv6 を用いると、外部から到達可能です。

source: To change the default guest password of RabbitMQ:
ja: RabbitMQ のデフォルトのゲストパスワードを変更する方法:

source: Disable Qpid authentication by editing <filename>/etc/qpidd.conf</filename> file and changing the <literal>auth</literal> option to <literal>no</literal>.
ja: <filename>/etc/qpidd.conf</filename> ファイルを編集し、<literal>auth</literal> オプションを <literal>no</literal> に変更することにより、Qpid 認証を無効化します。

source: To simplify configuration, the Qpid examples in this guide do not use authentication. However, we strongly advise enabling authentication for production deployments. For more information on securing Qpid refer to the <link href="http://qpid.apache.org/books/trunk/AMQP-Messaging-Broker-CPP-Book/html/chap-Messaging_User_Guide-Security.html">Qpid Documentation</link>.
ja: 設定を簡単にするために、このガイドの Qpid 例は認証を使用しません。しかしながら、本番環境では認証を有効化することを強く推奨します。Qpid のセキュア化に関する詳細は <link href="http://qpid.apache.org/books/trunk/AMQP-Messaging-Broker-CPP-Book/html/chap-Messaging_User_Guide-Security.html">Qpid のドキュメント</link>を参照してください。

source: After you enable Qpid authentication, you must update the configuration file of each OpenStack service to ensure that the <literal>qpid_username</literal> and <literal>qpid_password</literal> configuration keys refer to a valid Qpid username and password, respectively.
ja: Qpid 認証を有効化した後、<literal>qpid_username</literal> と <literal>qpid_password</literal> 設定キーがそれぞれ有効な Qpid のユーザー名とパスワードを確実に参照するよう、各 OpenStack サービスの設定ファイルを更新する必要があります。

source: Start Qpid and set it to start automatically when the system boots.
ja: Qpid を起動し、システム起動時に自動的に起動するよう設定します。

source: Start the messaging service and set it to start automatically when the system boots:
ja: メッセージングサービスを起動し、システム起動時に自動的に起動するよう設定します。

source: Congratulations, now you are ready to install OpenStack services!
ja: おめでとうございます。これで OpenStack サービスをインストールする準備ができました。

source: Install the Orchestration service
ja: Orchestration Service のインストール

source: Install the Orchestration module on the controller node:
ja: コントローラーノードに Orchestration モジュールをインストールします。

source: Respond to prompts for <link linkend="debconf-dbconfig-common">database management</link>, <link linkend="debconf-keystone_authtoken"><systemitem>[keystone_authtoken]</systemitem> settings</link>, <link linkend="debconf-rabbitqm">RabbitMQ credentials</link> and <link linkend="debconf-api-endpoints">API endpoint</link> registration.
ja: <link linkend="debconf-dbconfig-common">データベース管理</link>、<link linkend="debconf-keystone_authtoken"><literal>[keystone_authtoken]</literal> 設定</link>、<link linkend="debconf-rabbitqm">RabbitMQ クレデンシャル</link>、<link linkend="debconf-api-endpoints">API エンドポイント</link>の登録に関するプロンプトに答えます。

source: In the configuration file, specify the location of the database where the Orchestration service stores data. These examples use a MySQL database with a <literal>heat</literal> user on the controller node. Replace <replaceable>HEAT_DBPASS</replaceable> with the password for the database user:
ja: Orchestration Service がデータを保存するデータベースの場所を設定ファイルで指定します。これらの例はコントローラーノードにユーザー名 <literal>heat</literal> で MySQL データベースを使用します。<literal><replaceable>HEAT_DBPASS</replaceable></literal> をデータベースのユーザーの適切なパスワードで置き換えます。

source: Use the password that you set previously to log in as <literal>root</literal> and create a <literal>heat</literal> database user:
ja: <literal>root</literal> としてログインするために前に設定したパスワードを使用し、<literal>heat</literal> データベースユーザーを作成します。

source: Create the heat service tables:
ja: heat サービスのテーブルを作成します。

source: Ignore <errortext>DeprecationWarning</errortext> errors.
ja: <errortext>DeprecationWarning</errortext> エラーを無視します。

source: The Ubuntu packages do not correctly set up logging. Edit the <filename>/etc/heat/heat.conf</filename> file and change the <literal>[DEFAULT]</literal> section:
ja: Ubuntu パッケージはロギングを正しくセットアップしません。<filename>/etc/heat/heat.conf</filename> ファイルを編集し、<literal>[DEFAULT]</literal> セクションを変更します。

source: Configure the Orchestration Service to use the RabbitMQ message broker.
ja: Orchestration Service が RabbitMQ メッセージブローカーを使用するよう設定します。

source: Edit <filename>/etc/heat/heat.conf</filename> and modify the <literal>[DEFAULT]</literal> section:
ja: <filename>/etc/heat/heat.conf</filename> を編集し、<literal>[DEFAULT]</literal> セクションを変更します。

source: Create a <literal>heat</literal> user that the Orchestration service can use to authenticate with the Identity Service. Use the <literal>service</literal> tenant and give the user the <literal>admin</literal> role:
ja: Orchestration サービスが Identity Service で認証するために使用する <literal>heat</literal> ユーザーを作成します。<literal>service</literal> プロジェクトを使用し、ユーザーに <literal>admin</literal> ロールを与えます。

source: Start the <systemitem class="service">heat-api</systemitem>, <systemitem class="service">heat-api-cfn</systemitem> and <systemitem class="service">heat-engine</systemitem> services and configure them to start when the system boots:
ja: <systemitem class="service">heat-api</systemitem>、<systemitem class="service">heat-api-cfn</systemitem>、<systemitem class="service">heat-engine</systemitem> サービスを起動し、システムの起動時にそれらが起動するよう設定します。

source: Install the Compute agent for Telemetry
ja: Telemetry 用 Compute エージェントのインストール
ru: Установите агента Compute для Telemetry

source: Telemetry provides an API service that provides a collector and a range of disparate agents. This procedure details how to install the agent that runs on the compute node.
ja: Telemetry は情報収集機能とさまざまな種類のエージェントを提供する API サービスを提供します。この手順はコンピュートノードで実行するエージェントをインストールする方法を詳細に説明します。

source: Install the Telemetry service on the compute node:
ja: コンピュートノードに Telemetry Service をインストールします。

source: Set the following options in the <filename>/etc/nova/nova.conf</filename> file:
ja: <filename>/etc/nova/nova.conf</filename> ファイルに以下のオプションを設定します。

source: The <option>notification_driver</option> option is a multi valued option, which <application>openstack-config</application> cannot set properly. See <xref linkend="basics-packages"/>.
ja: <option>notification_driver</option> オプションは複数の値を持つオプションです。<application>openstack-config</application> はこれを正しく設定できません。<xref linkend="basics-packages"/>を参照してください。

source: Edit the <filename>/etc/nova/nova.conf</filename> file and add the following lines to the <literal>[DEFAULT]</literal> section:
ja: <filename>/etc/nova/nova.conf</filename> ファイルを編集し、<literal>[DEFAULT]</literal> セクションに以下の行を追加します。

source: You must set the secret key that you defined previously. The Telemetry service nodes share this key as a shared secret:
ja: 前に設定したシークレットキーを設定する必要があります。Telemetry Service ノードは共有シークレットとしてこのキーを共有します。

source: Configure the QPid access:
ja: Qpid のアクセス権を設定します。

source: Add the Identity service credentials:
ja: Identity Service のクレデンシャルを追加します。

source: Start the service and configure it to start when the system boots:
ja: サービスを起動し、システム起動時に起動するよう設定します。

source: Neutron deployment use cases
ja: Neutron 導入ユースケース

source: This section describes how to configure the Networking service and its components for some typical use cases.
ja: このセクションはいくつかの種類のユースケース向けに Networking Service とそのコンポーネントを設定する方法について記載します。
