Repository: 25hours/openstack-manuals
Catalog: doc/install-guide/locale/*.po
Languages: ja, ru, vi_vn, zh_cn

source: Any roles that you create must map to roles specified in the <filename>policy.json</filename> file included with each OpenStack service. The default policy for most services grants administrative access to the <literal>admin</literal> role. For more information, see the <link href="http://docs.openstack.org/openstack-ops/content/projects_users.html">Operations Guide - Managing Projects and Users</link>.
ru: Любые роли, которые вы создаёте, должны соотноситься с ролями, указанными в файле <filename>policy.json</filename>, входящем в каждый сервис OpenStack. Политика по-умолчанию для большинства сервисов предоставляет административный доступ роли <literal>admin</literal>. Подробнее смотрите в <link href="http://docs.openstack.org/openstack-ops/content/projects_users.html">Руководстве по эксплуатации- Управление проектами и пользователями</link>.
zh_cn: 任何您所创建的角色必须映射到包含了各个 OpenStack 服务的 <filename>policy.json</filename> 文件的特定角色中。大部分服务的默认策略给<literal>管理员</literal>角色赋予了管理员的访问权限。要获取更多相关信息，请阅读 <link href="http://docs.openstack.org/openstack-ops/content/projects_users.html">Operations Guide - Managing Projects and Users</link>。

source: Create a demo tenant and user for typical operations in your environment:
ru: Создайте демонстрационный проект и пользователя для типичных операций в вашей среде:
zh_cn: 创建一个 demo 租户和用户，用于环境中的一般操作：

source: Create the <literal>demo</literal> tenant:
ja: <literal>demo</literal> プロジェクトを作成します。
ru: Создайте проект <literal>demo</literal>:
zh_cn: 创建 <literal>demo</literal> 租户：

source: Do not repeat this step when creating additional users for this tenant.
ru: Не повторяйте эти шаги при создании дополнительных пользователей для этого проекта.
zh_cn: 为这个租户创建额外的用户时，不需要重复这个步骤。

source: Create the <literal>demo</literal> user under the <literal>demo</literal> tenant:
ru: Создайте пользователя <literal>demo</literal> под проект <literal>demo</literal>:
zh_cn: 在 <literal>demo</literal> 租户下创建 <literal>demo</literal> 用户：

source: Replace <replaceable>DEMO_PASS</replaceable> with a suitable password and <replaceable>EMAIL_ADDRESS</replaceable> with a suitable e-mail address.
ru: Замените <replaceable>DEMO_PASS</replaceable> на подходящий пароль и <replaceable>EMAIL_ADDRESS</replaceable> на подходящий адрес электронной почты.
zh_cn: 将其中的 <replaceable>DEMO_PASS</replaceable> 替换为您要设置的一个合适的密码，其中的 <replaceable>EMAIL_ADDRESS</replaceable> 替换为合适的 e-mail 地址。

source: Using the <literal>--tenant</literal> option automatically assigns the <literal>_member_</literal> role to a user. This option will also create the <literal>_member_</literal> role if it does not exist.
ru: Использование опции <literal>--tenant</literal> автоматически назначает роль <literal>_member_</literal> пользователю. Эта опция так же создаст роль <literal>_member_</literal> если она не существует.
zh_cn: 使用 <literal>--tenant</literal> 选项可以自动分配 <literal>_member_</literal> 角色给一个用户。如果所指定的 <literal>_member_</literal> 角色不存在，这个选项会创建一个 <literal>_member_</literal> 角色。

source: You can repeat this procedure to create additional tenants and users.
ru: Вы можете повторить эту процедуру для создания допольнительных проектов и пользователей.
zh_cn: 您可以重复这个过程来创建额外的租户和用户。

source: OpenStack services also require a tenant, user, and role to interact with other services. Each service typically requires creating one or more unique users with the <literal>admin</literal> role under the <literal>service</literal> tenant.
ru: Сервисам OpenStack также требуются проект, пользователь и роль для взаимодействия с другими сервисами. Каждый сервис, как правило, требует создания одного или нескольких уникальных пользователей с ролью <literal>admin</literal> под проект <literal>service</literal>.
zh_cn: OpenStack 服务也需要租户、用户和角色来与其他服务交互。每个服务一般需要在 <literal>service</literal> 租户下创建一个或多个用户，并赋予 <literal>admin</literal> 的角色。

source: Create the <literal>service</literal> tenant:
ja: <literal>service</literal> プロジェクトを作成します。
ru: Создайте проект <literal>service</literal>:
zh_cn: 创建 <literal>service</literal> 租户：

source: Telemetry uses a combination of notifications and an agent to collect Compute metrics. Perform these steps on each compute node.
zh_cn: Telemetry 通过结合使用通知和代理来收集Computer度量值。在每个计算节点上执行这些步骤。

source: In the <literal>[DEFAULT]</literal> section, configure <application>RabbitMQ</application> message broker access:
ru: В секции <literal>[DEFAULT]</literal>, настройте доступ до брокера сообщений <application>RabbitMQ</application>:
zh_cn: 在 <literal>[DEFAULT]</literal> 段，对 <application>RabbitMQ</application> 消息代理相关参数进行配置：

source: Replace <replaceable>RABBIT_PASS</replaceable> with the password you chose for the guest account in RabbitMQ.
ru: Замените <replaceable>RABBIT_PASS</replaceable> на пароль, который вы выбрали для гостевого аккаунта в RabbitMQ.
zh_cn: 将其中的 <replaceable>RABBIT_PASS</replaceable> 替换为您所设置的 RabbitMQ 的 guest 帐户的密码。

source: First, edit <placeholder-1/> parameter in the <literal>[database]</literal> section. The URL provided here should point to an empty database. For instance, connection string for MySQL database will be: <placeholder-2/>
zh_cn: 首先，修改 <placeholder-1/><literal>[database]</literal> 部分的参数。这里所要提供的 URL 需要指向一个空的数据库。例如，连接到 MySQL 数据库的字符串为：<placeholder-2/>

source: Switch to the <literal>[keystone_authtoken]</literal> section. The <placeholder-1/> parameter should point to the public Identity API endpoint. <placeholder-2/> should point to the admin Identity API endpoint. For example: <placeholder-3/>
zh_cn: 切换到 <literal>[keystone_authtoken]</literal> 部分。<placeholder-1/>参数需要指向 public 身份认证的 API 入口点。<placeholder-2/>需要指向 admin 身份认证的 API 入口点。例如：<placeholder-3/>

source: You must register the Data processing service with the Identity service so that other OpenStack services can locate it. Register the service and specify the endpoint: <placeholder-1/>
zh_cn: 您必须通过身份认证服务注册到数据处理服务中，这样其他的 OpenStack 服务才能找到它。注册服务并指定入口点：<placeholder-1/>

source: Start the sahara service: <placeholder-1/><placeholder-2/>
zh_cn: 启动 sahara 服务：<placeholder-1/><placeholder-2/>

source: (Optional) Enable the Data processing service to start on boot <placeholder-1/><placeholder-2/>
zh_cn: (可选的) 将数据处理服务设置为随系统启动<placeholder-1/><placeholder-2/>

source: Use the <placeholder-1/> command to retrieve metrics on demand. For more information, see <link href="http://docs.openstack.org/admin-guide-cloud/content/section_telemetry-cinder-audit-script.html"><citetitle>Block Storage audit script setup to get notifications</citetitle></link>.
zh_cn: 使用 <placeholder-1/> 命令来获取所需的测量值。要了解更多信息，见 <link href="http://docs.openstack.org/admin-guide-cloud/content/section_telemetry-cinder-audit-script.html"><citetitle>安装块存储审计脚本以获取消息</citetitle></link>.

source: Verify operation of the Image Service using <link href="http://launchpad.net/cirros">CirrOS</link>, a small Linux image that helps you test your OpenStack deployment.
zh_cn: 使用<link href="http://launchpad.net/cirros">CirrOS</link>验证镜像服务操作，一个小的Linux镜像用来帮助您测试您的OpenStack部署。

source: For more information about how to download and build images, see <link href="http://docs.openstack.org/image-guide/content/index.html"><citetitle>OpenStack Virtual Machine Image Guide</citetitle></link>. For information about how to manage images, see the <link href="http://docs.openstack.org/user-guide/content/index.html"><citetitle>OpenStack User Guide</citetitle></link>.
ja: ダウンロード方法とイメージ構築の詳細は<link href="http://docs.openstack.org/image-guide/content/index.html"><citetitle>OpenStack 仮想マシンイメージガイド</citetitle></link>を参照してください。イメージの管理方法の詳細は<link href="http://docs.openstack.org/user-guide/content/index.html"><citetitle>OpenStack ユーザーガイド</citetitle></link>を参照してください。
ru: Подробнее о том, как скачивать и создавать образы, смотрите в <link href="http://docs.openstack.org/image-guide/content/index.html"><citetitle>Руководстве по Виртуальным Машинам OpenStack</citetitle></link>. Подробнее об управлении образами смотрите в <link href="http://docs.openstack.org/user-guide/content/index.html"><citetitle>Руководстве пользователя OpenStack</citetitle></link>.
zh_cn: 下载和创建镜像的更多信息，参阅<link href="http://docs.openstack.org/image-guide/content/index.html"><citetitle>OpenStack虚拟机镜像指南</citetitle></link>。管理镜像的更多信息，参阅<link href="http://docs.openstack.org/user-guide/content/index.html"><citetitle>OpenStack用户指南</citetitle></link>。

source: Upload the image to the Image Service using the <glossterm baseform="QEMU Copy On Write 2 (QCOW2)">QCOW2</glossterm> disk format, <glossterm>bare</glossterm> container format, and public visibility so all projects can access it:
zh_cn: 使用<glossterm baseform="QEMU Copy On Write 2 (QCOW2)">QCOW2</glossterm>磁盘格式，<glossterm>空白</glossterm>容器格式，和公开可见，上传镜像到镜像服务，以便所有的项目都能访问它：

source: For information about the <placeholder-1/> parameters, see <link href="http://docs.openstack.org/cli-reference/content/glanceclient_commands.html#glanceclient_subcommand_image-create">Image Service command-line client</link> in the <citetitle>OpenStack Command-Line Interface Reference</citetitle>.
zh_cn: 要了解 <placeholder-1/>参数的信息，见<citetitle>OpenStack 命令行接口参考</citetitle>中的<link href="http://docs.openstack.org/cli-reference/content/glanceclient_commands.html#glanceclient_subcommand_image-create">镜像服务命令行客户端</link>。

source: For information about disk and container formats for images, see <link href="http://docs.openstack.org/image-guide/content/image-formats.html">Disk and container formats for images</link> in the <citetitle>OpenStack Virtual Machine Image Guide</citetitle>.
ru: За информацией о форматах дисков и контейнеров для образов обратитесь к разделу <link href="http://docs.openstack.org/image-guide/content/image-formats.html">Форматы дисков и контейнеров для образов</link> в <citetitle>Руководстве по Образам Виртуальных Машин OpenStack</citetitle>.
zh_cn: 要了解镜像的磁盘和容器框架的信息，请阅读 <citetitle>OpenStack Virtual Machine Image Guide</citetitle> 中的 <link href="http://docs.openstack.org/image-guide/content/image-formats.html">Disk and container formats for images</link> 部分。

source: OpenStack Networking (neutron)
zh_cn: OpenStack 网络 (neutron)

source: You must remove or comment the line beginning with <literal>127.0.1.1</literal>.
ru: Вы должны удалить или закомментировать строку, начинающуюся на <literal>127.0.1.1</literal>.
zh_cn: 您必须移除或注释掉以 <literal>127.0.1.1</literal> 开头的行。

source: From the <emphasis>compute</emphasis> node, <placeholder-1/> the instance tunnels interface on the <emphasis>network</emphasis> node:
ru: С <emphasis>вычислительного</emphasis> узла сделайте <placeholder-1/> интерфейса туннелей на <emphasis>сетевом</emphasis> узле:
zh_cn: 从 <emphasis>计算</emphasis> 节点， <placeholder-1/> 实例通道接口位于<emphasis>网络</emphasis> 节点：

source: Networking provides the networks, subnets, and routers object abstractions. Each abstraction has functionality that mimics its physical counterpart: networks contain subnets, and routers route traffic between different subnet and networks.
ru: Сетевая подсистема предоставляет абстрактные сети, подсети и маршрутизаторы. Каждая из них по функциональности имитирует физические аналоги: сети содержат подсети, маршрутизаторы маршрутизируют траффик между разными подсетями и сетями.
zh_cn: Networking 提供网络、子网和路由对象的概念。每个概念有自己的功能，可以模仿对应的物理设备：网络包括子网，路由则在不同的子网和网络之间进行路由转发。

source: Additionally, you can allocate IP addresses on external networks to ports on the internal network. Whenever something is connected to a subnet, that connection is called a port.You can associate external network IP addresses with ports to VMs. This way, entities on the outside network can access VMs.
zh_cn: 另外，您能够将外部网络的IP地址分配到内部网络的端口。无论合适有什么连接上了子网，那个连接就被称为一个端口。您能连接外部网络的IP地址和虚拟机的端口。这样，外面网络的实体就能访问虚拟机了。

source: For example, using an exclusive slice of <literal>203.0.113.0/24</literal> with IP address range <literal>203.0.113.24</literal> to <literal>203.0.113.32</literal>:
ru: Например, используя экслюзивный сегмент <literal>203.0.113.0/24</literal> с дапозоном адресов от <literal>203.0.113.24</literal> до <literal>203.0.113.32</literal>:
zh_cn: 例如，使用一个IP地址为从<literal>203.0.113.24</literal> 到 <literal>203.0.113.32</literal> 的 <literal>203.0.113.0/24</literal> 的专有段落：

source: The OpenStack dashboard, also known as <link href="http://git.openstack.org/cgit/openstack/horizon">Horizon</link>, is a Web interface that enables cloud administrators and users to manage various OpenStack resources and services.
zh_cn: OpenStack 仪表盘，即 <link href="http://git.openstack.org/cgit/openstack/horizon">Horizon</link>，是云管理员和用户管理OpenStack资源和服务的网络界面。

source: Customize your dashboard. See section <link href="http://docs.openstack.org/admin-guide-cloud/content/ch_install-dashboard.html#dashboard-custom-brand">Customize the dashboard</link> in the <link href="http://docs.openstack.org/admin-guide-cloud/content/"><citetitle>OpenStack Cloud Administrator Guide</citetitle></link> for information on setting up colors, logos, and site titles.
ru: Настроить вашу панель. Смотрите раздел <link href="http://docs.openstack.org/admin-guide-cloud/content/ch_install-dashboard.html#dashboard-custom-brand">Настроить панель управления</link> в <link href="http://docs.openstack.org/admin-guide-cloud/content/"><citetitle>Руководстве Администратора Облака OpenStack</citetitle></link> за подробной информацией о настройке цветов, логотипов и заголовков страниц.
zh_cn: 自定义您的仪表板。请看 <link href="http://docs.openstack.org/admin-guide-cloud/content/"><citetitle>OpenStack Cloud 管理员手册</citetitle></link>中的<link href="http://docs.openstack.org/admin-guide-cloud/content/ch_install-dashboard.html#dashboard-custom-brand">自定义仪表板</link>部分，以获取更多设置颜色、logo 和站点标题的相关信息。

source: Set up session storage. See section <link href="http://docs.openstack.org/admin-guide-cloud/content/dashboard-sessions.html#dashboard-sessions">Set up session storage for the dashboard</link> in the <link href="http://docs.openstack.org/admin-guide-cloud/content/"><citetitle>OpenStack Cloud Administrator Guide</citetitle></link> for information on user session data.
ru: Настроить хранилище сессий. Смотрите раздел <link href="http://docs.openstack.org/admin-guide-cloud/content/dashboard-sessions.html#dashboard-sessions">Настройка хранилища сессий для панели</link> в <link href="http://docs.openstack.org/admin-guide-cloud/content/"><citetitle></citetitle></link> за подробной информацией о данных пользовательских сессий.
zh_cn: 设置会话存储。请看<link href="http://docs.openstack.org/admin-guide-cloud/content/"><citetitle>OpenStack Cloud 管理员手册</citetitle> 中的 <link href="http://docs.openstack.org/admin-guide-cloud/content/dashboard-sessions.html#dashboard-sessions">为仪表盘设置会话存储</link>部分，以获取用户会话数据的相关信息。

source: This section describes how to verify operation of the Identity service.
ru: Этот раздел описывает, как проверить работу службы Идентификации.
zh_cn: 这个部分描述如何验证身份认证服务的操作。

source: Unset the temporary <envar>OS_SERVICE_TOKEN</envar> and <envar>OS_SERVICE_ENDPOINT</envar> environment variables:
ru: Сбросьте временные переменные среды <envar>OS_SERVICE_TOKEN</envar> и <envar>OS_SERVICE_ENDPOINT</envar>:
zh_cn: 取消 <envar>OS_SERVICE_TOKEN</envar> 和 <envar>OS_SERVICE_ENDPOINT</envar> 临时环境变量的设置：

source: As the <literal>admin</literal> tenant and user, request an authentication token:
ru: Как тенант и пользователь <literal>admin</literal>, запросите авторизационный токен:
zh_cn: 使用<literal>admin</literal> 租户和用户，需要一个认证的令牌：

source: Replace <replaceable>ADMIN_PASS</replaceable> with the password you chose for the <literal>admin</literal> user in the Identity service. You might need to use single quotes (') around your password if it includes special characters.
ru: Замените <replaceable>ADMIN_PASS</replaceable> на пароль, который вы выбрали для пользователя <literal>admin</literal> в службе Идентификации. Возможно, вам нужно будет использовать одинарные кавычки (') вокруг вашего пароля, если он включает специальные символы.
zh_cn: 将其中的 <replaceable>ADMIN_PASS</replaceable> 替换为您在身份认证服务中为 <literal>admin</literal> 用户设置的密码。如果包含特殊字符，您可能需要使用单引号 (') 将密码引用。

source: As the <literal>admin</literal> tenant and user, list tenants to verify that the <literal>admin</literal> tenant and user can execute admin-only CLI commands and that the Identity service contains the tenants that you created in <xref linkend="keystone-users"/>:
ru: Как тенант и пользователь <literal>admin</literal>, запросите список тенантов чтобы убедиться, что тенант и пользователь <literal>admin</literal> может исполнять административные CLI команды и что служба Идентификации содержит тенантов, которых вы создали в <xref linkend="keystone-users"/>:
zh_cn: 使用 <literal>admin</literal> 租户和用户，列出租户以验证 <literal>admin</literal> 租户和用户能够执行只有管理员才能执行的命令行，且身份认证服务包含您在 <xref linkend="keystone-users"/> 中创建的租户：

source: As the <literal>admin</literal> tenant and user, list tenants to verify that the <literal>admin</literal> tenant and user can execute admin-only CLI commands and that the Identity service contains the tenants created by the configuration tool:
ru: Как тенант и пользователь <literal>admin</literal>, запросите список тенантов чтобы убедиться, что тенант и пользователь <literal>admin</literal> может исполнять административные CLI команды и что сервис Identity содержит тенантов созданных инструментом настройки:
zh_cn: 使用 <literal>admin</literal> 租户和用户，列出租户以验证 <literal>admin</literal> 租户和用户能够执行只有管理员才能执行的命令行，且身份认证服务包含您使用配置工具所创建的租户：

source: Because OpenStack generates IDs dynamically, you will see different values from this example command output.
ru: Поскольку OpenStack создаёт ID динамически, вы увидите значения отличные от приведённых в примере вывода команды.
zh_cn: 由于 OpenStack 是动态生成 ID 的，您看到的值会与这个示例的输出不同。

source: As the <literal>admin</literal> tenant and user, list users to verify that the Identity service contains the users that you created in <xref linkend="keystone-users"/>:
ru: Как тенант и пользователь <literal>admin</literal>, запросите список пользователей, чтобы убедиться, что сервис Identity содержит пользователей, которых вы создали в <xref linkend="keystone-users"/>:
zh_cn: 使用 <literal>admin</literal> 租户和用户，列出用户以验证身份认证服务包含您在 <xref linkend="keystone-users"/> 中创建的用户：

source: As the <literal>admin</literal> tenant and user, list users to verify that the Identity service contains the users created by the configuration tool:
ru: Как тенант и пользователь <literal>admin</literal>, запросите список пользователей, чтобы убедиться, что сервис Identity содержит пользователей созданных инструментом настройки:
zh_cn: 使用 <literal>admin</literal> 租户和用户，列出用户以验证身份认证服务包含您使用配置工具所创建的用户：

source: As the <literal>admin</literal> tenant and user, list roles to verify that the Identity service contains the role that you created in <xref linkend="keystone-users"/>:
ru: Как тенант и пользователь <literal>admin</literal>, запросите список ролей, чтобы убедиться, что сервис Identity содержит роли, которых вы создали в <xref linkend="keystone-users"/>:
zh_cn: 使用 <literal>admin</literal> 租户和用户，列出角色以验证 身份认证服务包含您在 <xref linkend="keystone-users"/> 中创建的角色：

source: As the <literal>admin</literal> tenant and user, list roles to verify that the Identity service contains the role created by the configuration tool:
ru: Как тенант и пользователь <literal>admin</literal>, запросите список ролей, чтобы убедиться, что сервис Identity содержит роли созданных инструментом настройки:
zh_cn: 使用 <literal>admin</literal> 租户和用户，列出租角色验证身份认证服务包含您使用配置工具所创建的角色：

source: As the <literal>demo</literal> tenant and user, request an authentication token:
ru: Как тенант и пользователь <literal>demo</literal>, запросите авторизационный токен:
zh_cn: 使用 <literal>demo</literal> 租户和用户，需要一个认证的令牌：

source: Replace <replaceable>DEMO_PASS</replaceable> with the password you chose for the <literal>demo</literal> user in the Identity service.
ru: Замените <replaceable>DEMO_PASS</replaceable> на выбранный вами пароль для пользователя <literal>demo</literal> в сервисе Identity.
zh_cn: 将其中的 <replaceable>DEMO_PASS</replaceable> 替换为您在身份认证服务中为 <literal>demo</literal> 用户所设置的密码。

source: As the <literal>demo</literal> tenant and user, attempt to list users to verify that you cannot execute admin-only CLI commands:
ru: Как тенант и пользователь <literal>demo</literal>, попробуйте получить список пользователей, чтобы убедиться, что вы не можете исполнять административные CLI команды:
zh_cn: 使用 <literal>demo</literal> 租户和用户，尝试列出用户以验证您不能执行只有管理员才能执行的命令行：

source: Each OpenStack service references a <filename>policy.json</filename> file to determine the operations available to a particular tenant, user, or role. For more information, see the <link href="http://docs.openstack.org/openstack-ops/content/projects_users.html">Operations Guide - Managing Projects and Users</link>.
ru: Каждый сервис OpenStack ссылается на файл <filename>policy.json</filename>, чтобы определить операции, доступные конкретному тенанту, пользователю или роли. Подробнее смотрите в <link href="http://docs.openstack.org/openstack-ops/content/projects_users.html">Руководстве по эксплуатации - Управление поектами и пользователями</link>.
zh_cn: 每个 OpenStack 服务关联一个 <filename>policy.json</filename> 文件来决定特定租户、用户和角色的可用操作。要获取更多信息，请阅读<link href="http://docs.openstack.org/openstack-ops/content/projects_users.html">Operations Guide - Managing Projects and Users</link>。

source: Install the <package>yum-plugin-priorities</package> package to enable assignment of relative priorities within repositories:
ru: Установите пакет <package>yum-plugin-priorities</package> для задействования относительных приоритетов в репозиториях:
zh_cn: 安装 <package>yum-plugin-priorities</package> 包，以启用仓库中相对优先级的分配：

source: On RHEL and CentOS, enable the <link href="http://download.fedoraproject.org/pub/epel/7/x86_64/repoview/epel-release.html">EPEL</link> repository:
ru: На RHEL и CentOS подключите репозиторий <link href="http://download.fedoraproject.org/pub/epel/7/x86_64/repoview/epel-release.html">EPEL</link>:
zh_cn: 在RHEL和CentOS中，启用<link href="http://download.fedoraproject.org/pub/epel/7/x86_64/repoview/epel-release.html">EPEL</link>仓库：

source: On RHEL, enable the extras repository using the subscription manager:
ru: На RHEL подключите репозиторий extras использую менеджер подписок:
zh_cn: 在RHEL中，使用订阅管理器启用extras仓库：

source: CentOS and Fedora do not require this repository.
ru: CentOS и Fedora не требуется этот репозиторий.
zh_cn: CentOS和Fedora不需要这个仓库。

source: Install the <package>rdo-release-juno</package> package to enable the RDO repository:
ru: Устанровите пакет <package>rdo-release-juno</package> для задействования репозитория RDO:
zh_cn: 安装包 <package>rdo-release-juno</package> 以启用 RDO 仓库：

source: On openSUSE 13.1:
ru: На openSUSE 13.1:
zh_cn: 在openSUSE 13.1中：

source: On SLES 11 SP3:
ru: На SLES 11 SP3:
zh_cn: 在SLES 11 SP3中：

source: Numerous archive.gplhost.com mirrors are available around the world. All are available with both FTP and HTTP protocols (you should use the closest mirror). The list of mirrors is available at <link href="http://archive.gplhost.com/readme.mirrors">http://archive.gplhost.com/readme.mirrors</link>.
ja: 数多くの archive.gplhost.com ミラーが世界中で利用可能です。すべて FTP と HTTP のプロトコルで利用可能です (最寄りのミラーを使用すべきです)。ミラーの一覧は <link href="http://archive.gplhost.com/readme.mirrors">http://archive.gplhost.com/readme.mirrors</link> にあります。
zh_cn: 许多archive.gplhost.com镜像在世界上可用。所有的都支持FTP和HTTP协议（你可以选择最近的镜像）。镜像列表在<link href="http://archive.gplhost.com/readme.mirrors">http://archive.gplhost.com/readme.mirrors</link>。
