Repository: 25hours/openstack-manuals
Catalog: doc/install-guide/locale/*.po
Languages: ja, ru, vi_vn, zh_cn

source: Optionally, the Block Storage node runs a Telemetry agent to collect meters. Also, it can contain a second network interface on a separate storage network to improve performance of storage services.
vi_vn: Ngoài ra node Block Storage còn chạy các Telemetry agent để thu thập các thước đo. Nó còn có thể có một giao diện mạng thứ hai trên một hệ thống mạng lưu trữ riêng biệt để cải thiện hiệu suất của các dịch vụ lưu trữ.

source: Optionally, the compute node runs a Telemetry agent to collect meters. Also, it can contain a third network interface on a separate storage network to improve performance of storage services.
vi_vn: Ngoài ra node tính toán còn chạy các Telemetry agent để thu thập các thước đo. Nó còn có thể có một giao diện mạng thứ ba trên một hệ thống mạng lưu trữ riêng biệt để cải thiện hiệu suất của các dịch vụ lưu trữ.

source: Optionally, the controller node runs portions of Block Storage, Object Storage, Orchestration, Telemetry, Database, and Data processing services. These components provide additional features for your environment.
vi_vn: Ngoài ra, node điều khiển còn chạy các phần của các dịch vụ Block Storage, Object Storage, Orchestration, Telemetry, Database và xử lý Dữ liệu. Các thành phần này cung cấp các thêm các tính năng cho môi trường của bạn.

source: Optionally, these nodes can contain a second network interface on a separate storage network to improve performance of storage services.
ru: Дополнительно эти узлы могут содержать второй сетевой интерфейс в отдельной сети хранения для улучшения производительности служб хранения.
vi_vn: Ngoài ra, các node này còn có thể chứa một giao diện mạng thứ hai nằm trên một mạng lưu trữ riêng biệt để cải thiện hiệu suất của các dịch vụ lưu trữ.

source: Other nodes
ru: На других узлах
vi_vn: Các nút khác
zh_cn: 其它节点服务器

source: Overview
ja: 概要
ru: Обзор
vi_vn: Tổng quan
zh_cn: 概况

source: Perform these commands on the controller node.
ru: Выполните эти команды на управляющем узле.
vi_vn: Thực hiện các lệnh sau trên node điều khiển.
zh_cn: 在控制节点上执行这些命令。

source: Perform these steps on each storage node.
vi_vn: Thực hiện các bước sau trên mỗi nút lưu trữ.
zh_cn: 在每个存储节点上执行这些步骤。

source: Perform these steps on the controller and any other nodes that run the Object Storage proxy service.
vi_vn: Thực hiện các bước sau trên controller và bất cứ node nào chạy dịch vụ Object Storage proxy.
zh_cn: 在控制节点上执行这些步骤，在其他节点上运行对象存储的代理服务。

source: Perform these steps on the controller node.
vi_vn: Thực hiện các bước sau trên node điều khiển.
zh_cn: 在控制节点上执行这些步骤。

source: Permit <glossterm>ICMP</glossterm> (ping):
ja: <glossterm>ICMP</glossterm> (ping) を許可します。
ru: Разрешите <glossterm>ICMP</glossterm> (ping):
vi_vn: Cho phép <glossterm>ICMP</glossterm> (ping):
zh_cn: 允许 <glossterm>ICMP</glossterm> (ping)：

source: Permit configuration, write, and read access for the <literal>openstack</literal> user:
vi_vn: Cho phép người dùng <literal>openstack</literal> có quyền truy cập cấu hình, viết và đọc:
zh_cn: 为<literal>openstack</literal>用户开启配置，读写权限：

source: Permit secure shell (SSH) access:
ja: secure shell (SSH) アクセスを許可します。
ru: Разрешите доступ до защищённой оболочки (SSH):
vi_vn: Cho phép truy cập shell bảo mật (SSH):
zh_cn: 允许安全 shell (SSH) 的访问：

source: Populate the Block Storage database:
ru: Заполните базу данных сервиса Блочного хранилища:
vi_vn: Truyền thông tin vào cơ sở dữ liệu Block Storage:
zh_cn: 初始化块设备服务的数据库：

source: Populate the Compute database:
ru: Заполните базу данных Вычислительного сервиса:
vi_vn: Truyền thông tin vào cơ sở dữ liệu Compute
zh_cn: 同步Compute 数据库：

source: Populate the Identity service database:
ru: Заполните базу данных службы Идентификации:
vi_vn: Điền dữ liệu vào cơ sở dữ liệu dịch vụ Identity:
zh_cn: 初始化身份认证服务的数据库：

source: Populate the Image service database:
vi_vn: Truyền thông tin vào cơ sở dữ liệu dịch vụ Image:

source: Populate the Orchestration database:
ru: Заполните базу данных сервиса Оркестровки:
vi_vn: Truyền thông tin vào cơ sở dữ liệu Orchestration:
zh_cn: 同步Orchestration数据库：

source: Populate the database:
ru: Заполните базу данных:
vi_vn: Truyền thông tin vào cơ sở dữ liệu:
zh_cn: 同步数据库：

source: Pre-seed debconf prompts
ja: 事前シード debconf プロンプト
ru: Подготовьте ответы на запросы debconf
vi_vn: Sắp xếp trước các nhắc nhở debconf
zh_cn: 预置debconf的提示输入

source: Prepare the Database service:
vi_vn: Chuẩn bị dịch vụ Database:
zh_cn: 准备数据库服务：

source: Prepare the trove admin database:
vi_vn: Chuẩn bị cơ sở dữ liệu admin trove
zh_cn: 准备trove管理员数据库：

source: Prerequisites
ja: 前提
ru: Предварительные требования
vi_vn: Điều kiện tiên quyết
zh_cn: 先决条件

source: Proceed to network configuration for the example <link linkend="basics-networking-neutron">OpenStack Networking (neutron) </link> or <link linkend="basics-networking-nova">legacy networking (nova-network)</link> architecture.
ru: Продолжите настраивать сеть для примерной архитектуры <link linkend="basics-networking-neutron">Сети OpenStack (neutron) </link> или <link linkend="basics-networking-nova">старой сети (nova-network)</link>
vi_vn: Tiếp tục đến phần cấu hình hệ thống mạng cho kiến trúc mẫu sử dụng <link linkend="basics-networking-neutron">OpenStack Networking (neutron) </link> hoặc <link linkend="basics-networking-nova">legacy networking (nova-network)</link>.
zh_cn: 为架构样例中的 <link linkend="basics-networking-neutron">OpenStack Networking (neutron) </link> 或 <link linkend="basics-networking-nova">legacy networking (nova-network)</link> 进行网络配置。

source: Provide users with a public IP address, a username, and a password so they can access the dashboard through a web browser. In case of any SSL certificate connection problems, point the server IP address to a domain name, and give users access.
vi_vn: Cung cấp cho người dùng một địa chỉ IP public, một tên người dùng và một mật khẩu để họ có thể truy cập dashboard thông qua trình duyệt web. Trong trường hợp xảy ra lỗi kết nối chứng chỉ SSL, trỏ địa chỉ IP của máy chú đến một tên miền và cho phép người dùng truy cập.

source: RHEL and CentOS enable <glossterm>SELinux</glossterm> by default. Install the <package>openstack-selinux</package> package to automatically manage security policies for OpenStack services:
ru: RHEL и CentOS включают <glossterm>SELinux</glossterm> по-умолчанию. Установите пакет <package>openstack-selinux</package> для автоматического управления политиками безопасности служб OpenStack:
vi_vn: RHEL và CentOS mặc định bật <glossterm>SELinux</glossterm>. Cài đặt gói <package>openstack-selinux</package> để tự động quản lý các chính sách bảo mật cho các dịch vụ OpenStack:
zh_cn: RHEL 和 CentOS 默认启用了<glossterm>SELinux</glossterm>。安装 <package>openstack-selinux</package> 的包来为 OpenStack 服务自动管理安全策略：

source: RabbitMQ credentials parameters
ja: RabbitMQ クレデンシャルパラメーター
ru: Параметры входа на RabbitMQ
vi_vn: Các tham số chứng thực RabbitMQ
zh_cn: RabbitMQ认证信息参数

source: Rebalance the ring:
ru: Ребалансируйте кольцо:
vi_vn: Cân bằng lại ring:

source: Reboot the system to activate the changes.
ru: Перезагрузите систему чтобы применить изменения.
vi_vn: Khởi động lại hệ thống để kích hoạt các thay đổi.
zh_cn: 重启系统以激活修改。

source: Reconfiguring network interfaces will interrupt network connectivity. We recommend using a local terminal session for these procedures.
ru: Перенастройка сетевых интерфейсов сбросит сетевые соединения. Мы рекомендуем использовать локальную терминальную сессию для этих процедур.
vi_vn: Việc cấu hình lại các giao diện mạng sẽ làm gián đoạn kết nối mạng. Chúng tôi khuyên bạn nên sử dụng phiên làm việc trên thiết bị đầu cuối cục bộ cho các thao tác này.
zh_cn: 重新配置网络接口会中断网络连接。我们建议使用本地终端会话来进行这个过程。

source: Red Hat Enterprise Linux, CentOS, and Fedora
ru: Red Hat Enterprise Linux, CentOS, и Fedora
vi_vn: Red Hat Enterprise Linux, CentOS và Fedora
zh_cn: Red Hat Enterprise Linux, CentOS, 和 Fedora

source: Register API endpoints
ja: API エンドポイントの登録
ru: Зарегистрируйте точки доступа API
vi_vn: Đăng ký các API endpoint
zh_cn: 注册API端点

source: Regular (non-admin) tasks should use an unprivileged project and user. As an example, this guide creates the <literal>demo</literal> project and user.
vi_vn: Các tác vụ thông thường (không phải của admin) nên sử dụng project và người dùng không có quyền ưu tiên. Ví dụ, bài hướng dẫn này khởi tạo project và người dùng <literal>demo</literal>.

source: Reload the web server configuration:
vi_vn: Nạp lại cấu hình web server:

source: Remove the <filename>/var/lib/ntp/ntp.conf.dhcp</filename> file if it exists.
ru: Удалите файл <filename>/var/lib/ntp/ntp.conf.dhcp</filename>, если он существует.
vi_vn: Xóa bỏ thư mục <filename>/var/lib/ntp/ntp.conf.dhcp</filename> nếu nó đã tồn tại.
zh_cn: 如果存在文件 <filename>/var/lib/ntp/ntp.conf.dhcp</filename>，那么将它删除。

source: Remove the previously downloaded image file <filename>/tmp/cirros.img</filename>:
vi_vn: Xóa tập tin image <filename>/tmp/cirros.img</filename> đã tải về trước đó:

source: Remove the temporary local directory and source image:
vi_vn: Loại bỏ thư mục cục bộ tạm thời và image nguồn:
zh_cn: 移除临时本地目录和源镜像：

source: Repeat this command for each storage device on each storage node. In the example architecture, use the command in four variations:
vi_vn: Lặp lại câu lệnh này cho từng thiết bị lưu trữ trên từng node lưu trữ. Trong kiến trúc mẫu, sử dụng câu lệnh này theo bốn biến thể:

source: Replace <literal>ADMIN_PASS</literal> with the password you chose for the <literal>admin</literal> user in the Identity service.
ru: Замените <literal>ADMIN_PASS</literal> на пароль, который вы выбрали для пользователя <literal>admin</literal> в службе Идентификации.
vi_vn: Thay <literal>ADMIN_PASS</literal> bằng mật khẩu bạn đã chọn cho người dùng <literal>admin</literal> trong dịch vụ Identity.
zh_cn: 将其中的 <literal>ADMIN_PASS</literal> 替换为您在身份认证服务中为 <literal>admin</literal> 用户设置的密码。

source: Replace <literal>DEMO_PASS</literal> with the password you chose for the <literal>demo</literal> user in the Identity service.
ru: Замените <literal>DEMO_PASS</literal> на пароль, который вы выбрали для пользователя <literal>demo</literal> в службе Идентификации.
vi_vn: Thay <literal>DEMO_PASS</literal> bằng mật khẩu bạn đã chọn người dùng <literal>demo</literal> trong dịch vụ Identity.
zh_cn: 将其中的 <literal>DEMO_PASS</literal> 替换为您在身份认证服务中为 <literal>demo</literal> 用户设置的密码。

source: Replace <literal>NOVA_PASS</literal> with the password you chose for the <literal>nova</literal> user in the Identity service.
vi_vn: Thay <literal>NOVA_PASS</literal> bằng mật khẩu bạn đã chọn cho người dùng <literal>nova</literal> trong dịch vụ Identity.

source: Replace <replaceable>ADMIN_TOKEN</replaceable> with the authentication token that you generated in <xref linkend="keystone-install"/>. For example:
vi_vn: Thay <replaceable>ADMIN_TOKEN</replaceable> bằng token xác thực bạn đã sinh ra trong <xref linkend="keystone-install"/>. Ví dụ:

source: Replace <replaceable>ADMIN_TOKEN</replaceable> with the random value that you generated in a previous step.
ru: Замените <replaceable>ADMIN_TOKEN</replaceable> на случайную строку, которую вы сгенерировали на предыдущем шаге.
vi_vn: Thay thế <replaceable>ADMIN_TOKEN</replaceable> bằng giá trị ngẫu nhiên mà bạn đã tạo ra ở bước trước đó.
zh_cn: 将 <replaceable>ADMIN_TOKEN</replaceable> 替换为上一步中生成的随机字符串。

source: Replace <replaceable>CEILOMETER_DBPASS</replaceable> with a suitable password.
ru: Замените <replaceable>CEILOMETER_DBPASS</replaceable> на подходящий пароль.
vi_vn: Thay <replaceable>CEILOMETER_DBPASS</replaceable> bằng một mật khẩu thích hợp.
zh_cn: 将其中的 <replaceable>CEILOMETER_DBPASS</replaceable> 替换为一个合适的密码。

source: Replace <replaceable>CEILOMETER_DBPASS</replaceable> with the password you chose for the Telemetry module database. You must escape special characters such as ':', '/', '+', and '@' in the connection string in accordance with RFC2396.
vi_vn: Thay <replaceable>CEILOMETER_DBPASS</replaceable> bằng mật khẩu bạn đã chọn cho cơ sở dữ liệu của module Telemetry. Bạn phải tránh việc sử dụng các ký tự đặc biệt như ':', '/', '+', và '@' trong chuỗi kết nối theo RFC2396.
zh_cn: 将其中的 <replaceable>CEILOMETER_DBPASS</replaceable> 替换为您为 Telemetry 模块数据库所设置的密码。在给定的 RFC2396 字符串连接中，要避开一些特殊字符，例如 ':', '/', '+' 和 '@'。

source: Replace <replaceable>CEILOMETER_PASS</replaceable> with the password you chose for the <literal>ceilometer</literal> user in the Identity service.
ru: Замените <replaceable>CEILOMETER_PASS</replaceable> на пароль, который вы выбрали для пользователя <literal>ceilometer</literal> в службе Идентификации.
vi_vn: Thay <replaceable>CEILOMETER_PASS</replaceable> bằng mật khẩu bạn đã chọn cho người dùng <literal>ceilometer</literal> trong dịch vụ Identity.
zh_cn: 将其中的 <replaceable>CEILOMETER_PASS</replaceable> 替换为您在身份认证服务中为 <literal>ceilometer</literal> 用户所设置的密码。

source: Replace <replaceable>CEILOMETER_PASS</replaceable> with the password you chose for the Telemetry module database.
ru: Замените <replaceable>CEILOMETER_PASS</replaceable> на пароль, который вы выбрали для базы данных модуля Телеметрии.
vi_vn: Thay thế <replaceable>CEILOMETER_PASS</replaceable> bằng mật khẩu bạn đã chọn cho cơ sở dữ liệu module Telemetry.
zh_cn: 将其中的 <replaceable>CEILOMETER_PASS</replaceable> 替换为您为 Telemetry 模块数据库所设置的密码。

source: Replace <replaceable>CINDER_DBPASS</replaceable> with a suitable password.
ru: Замените <replaceable>CINDER_DBPASS</replaceable> на подходящий пароль.
vi_vn: Thay đổi <replaceable>CINDER_DBPASS</replaceable> với một mật khẩu thích hợp.
zh_cn: 将 <replaceable>CINDER_DBPASS</replaceable> 替换为实际的密码。

source: Replace <replaceable>CINDER_DBPASS</replaceable> with the password you chose for the Block Storage database.
ru: Замените <replaceable>CINDER_DBPASS</replaceable> на пароль, который вы выбрали для базы данных службы Блочного хранения.
vi_vn: Thay <replaceable>CINDER_DBPASS</replaceable> bằng mật khẩu bạn đã chọn cho cơ sở dữ liệu Block Storage.
zh_cn: 将 <replaceable>CINDER_DBPASS</replaceable> 替换为之前为块设备服务数据库设定的密码。

source: Replace <replaceable>CINDER_PASS</replaceable> with the password you chose for the <literal>cinder</literal> user in the Identity service.
ru: Замените <replaceable>CINDER_PASS</replaceable> на пароль, который вы выбрали для пользователя <literal>cinder</literal> в службе Идентификации.
vi_vn: Thay <replaceable>CINDER_PASS</replaceable> bằng mật khẩu bạn đã chọn cho người dùng <literal>cinder</literal> trong dịch vụ Identity.
zh_cn: 将 <replaceable>CINDER_PASS</replaceable> 替换为在身份认证服务中为 cinder 用户配置的密码。

source: Replace <replaceable>DEMO_NET_ID</replaceable> with the ID of the <literal>demo-net</literal> tenant network.
ru: Замените <replaceable>DEMO_NET_ID</replaceable> на ID сети <literal>demo-net</literal> проекта.
vi_vn: Thay thế <replaceable>DEMO_NET_ID</replaceable> bởi ID của mạng <literal>demo-net</literal> tenant.
zh_cn: 将其中的 <replaceable>DEMO_NET_ID</replaceable> 替换为 <literal>demo-net</literal> 租户网络的 ID。

source: Replace <replaceable>FILE</replaceable> with the name of a local file to upload to the <literal>demo-container1</literal> container.
ru: Замените <replaceable>FILE</replaceable> на имя локального файла, который вы хотите загрузить в контейнер <literal>demo-container1</literal>.
vi_vn: Thay <replaceable>FILE</replaceable> bằng tên của tập tin nội vùng sẽ được tải lên container <literal>demo-container1</literal>.
zh_cn: 将其中的 <replaceable>FILE</replaceable> 替换为要上传到 <literal>demo-container1</literal> 容器上的本地文件的名称。

source: Replace <replaceable>FILE</replaceable> with the name of the file uploaded to the <literal>demo-container1</literal> container.
ru: Замените <replaceable>FILE</replaceable> на имя файла, который вы загрузили в контейнер <literal>demo-container1</literal>.
vi_vn: Thay <replaceable>FILE</replaceable> bằng tên của tập tin được tải lên container <literal>demo-container1</literal>.
zh_cn: 将其中的 <replaceable>FILE</replaceable> 替换为上传到 <literal>demo-container1</literal> 容器的文件的名称。

source: Replace <replaceable>FLOATING_IP_START</replaceable> and <replaceable>FLOATING_IP_END</replaceable> with the first and last IP addresses of the range that you want to allocate for floating IP addresses. Replace <replaceable>EXTERNAL_NETWORK_CIDR</replaceable> with the subnet associated with the physical network. Replace <replaceable>EXTERNAL_NETWORK_GATEWAY</replaceable> with the gateway associated with the physical network, typically the ".1" IP address. You should disable <glossterm>DHCP</glossterm> on this subnet because instances do not connect directly to the external network and floating IP addresses require manual assignment.
ru: Замените <replaceable>FLOATING_IP_START</replaceable> и <replaceable>FLOATING_IP_END</replaceable> на первый и последний IP-адреса из диапазона, который вы хотите выделить для внешних IP-адресов. Замените <replaceable>EXTERNAL_NETWORK_CIDR</replaceable> на подсеть, связанную с физической сетью. Замените <replaceable>EXTERNAL_NETWORK_GATEWAY</replaceable> на шлюз, связанный с физической сетью, как правило это ".1" IP-адрес. Вам стоит отключить <glossterm>DHCP</glossterm> на этой подсети, поскольку инстансы не соединяются напрямую с внешней сетью и статичные IP-адреса требуется задавать вручную.
vi_vn: Thay <replaceable>FLOATING_IP_START</replaceable> và <replaceable>FLOATING_IP_END</replaceable> bằng địa chỉ IP đầu và cuối của chuỗi IP động mà bạn muốn sử dụng. Thay <replaceable>EXTERNAL_NETWORK_CIDR</replaceable> bằng subnet của mạng vật lý. Thay <replaceable>EXTERNAL_NETWORK_GATEWAY</replaceable> bằng gateway của mạng vật lý, thường là địa chỉ IP “.1”.Bạn nên tắt dịch vụ <glossterm>DHCP</glossterm> trên subnet này bởi vì các instance không kết nối trực tiếp tới hệ thống mạng ngoại vùng và các địa chỉ IP động yêu cầu phải được gán bằng tay.
zh_cn: 使用您想用来分配给浮动IP的第一个和最后一个IP地址来替换<replaceable>FLOATING_IP_START</replaceable> 和<replaceable>FLOATING_IP_END</replaceable>。用和物理网络相关联的子网替换<replaceable>EXTERNAL_NETWORK_CIDR</replaceable>。 用和物理网络相关联的网关替换 <replaceable>EXTERNAL_NETWORK_GATEWAY</replaceable> 常见的是 ".1" IP 地址。您应该关闭此子网上的<glossterm>DHCP</glossterm>，因为实例不直接连接到外部网络，并且浮动IP需要手工分配。

source: Replace <replaceable>GLANCE_DBPASS</replaceable> with a suitable password.
ru: Замените <replaceable>GLANCE_DBPASS</replaceable> на подходящий пароль.
vi_vn: Thay đổi <replaceable>GLANCE_DBPASS</replaceable> với một mật khẩu thích hợp.
zh_cn: 将其中的 <replaceable>GLANCE_DBPASS</replaceable> 替换为一个合适的密码。

source: Replace <replaceable>GLANCE_DBPASS</replaceable> with the password you chose for the Image service database.
vi_vn: Thay <replaceable>GLANCE_DBPASS</replaceable> bằng mật khẩu bạn đã chọn cơ sở dữ liệu của dịch vụ Image.

source: Replace <replaceable>GLANCE_PASS</replaceable> with the password you chose for the <literal>glance</literal> user in the Identity service.
ru: Замените <replaceable>GLANCE_PASS</replaceable> на пароль, который вы выбрали для пользователя <literal>glance</literal> в службе Идентификации.
vi_vn: Thay <replaceable>GLANCE_PASS</replaceable> bằng mật khẩu bạn đã chọn cho người dùng <literal>glance</literal> trong dịch vụ Identity.
zh_cn: 将其中的 <replaceable>GLANCE_PASS</replaceable> 替换为您在身份认证服务中为 <literal>glance</literal> 用户所设置的密码。

source: Replace <replaceable>HASH_PATH_PREFIX</replaceable> and <replaceable>HASH_PATH_SUFFIX</replaceable> with unique values.
vi_vn: Thay <replaceable>HASH_PATH_PREFIX</replaceable> và <replaceable>HASH_PATH_SUFFIX</replaceable> bằng các giá trị độc nhất.
zh_cn: 将其中的 <replaceable>HASH_PATH_PREFIX</replaceable> 和 <replaceable>HASH_PATH_SUFFIX</replaceable> 替换为唯一的值。

source: Replace <replaceable>HEAT_DBPASS</replaceable> with a suitable password.
ru: Замените <replaceable>HEAT_DBPASS</replaceable> на подходящий пароль.
vi_vn: Thay <replaceable>HEAT_DBPASS</replaceable> bằng một mật khẩu thích hợp.
zh_cn: 将其中的 <replaceable>HEAT_DBPASS</replaceable> 替换为一个合适的密码。

source: Replace <replaceable>HEAT_DBPASS</replaceable> with the password you chose for the Orchestration database.
ru: Замените <replaceable>HEAT_DBPASS</replaceable> на пароль, который вы выбрали для базы данных Оркестровки.
vi_vn: Thay <replaceable>HEAT_DBPASS</replaceable> bằng mật khẩu bạn đã chọn cho cơ sở dữ liệu của Orchestration.
zh_cn: 将其中的 <replaceable>HEAT_DBPASS</replaceable> 替换为您为 Orchestration 数据库所设置的密码。

source: Replace <replaceable>HEAT_DOMAIN_PASS</replaceable> with a suitable password.
vi_vn: Thay <replaceable>HEAT_DOMAIN_PASS</replaceable> bằng một mật khẩu thích hợp.

source: Replace <replaceable>HEAT_DOMAIN_PASS</replaceable> with the password you chose for the admin user of the <literal>heat</literal> user domain in the Identity service.
vi_vn: Thay <replaceable>HEAT_DOMAIN_PASS</replaceable> bằng mật khẩu bạn đã chọn cho người dùng admin của miền người dùng heat trong dịch vụ Identity.

source: Replace <replaceable>HEAT_PASS</replaceable> with the password you chose for the <literal>heat</literal> user in the Identity service.
ru: Замените <replaceable>HEAT_PASS</replaceable> на пароль, который вы выбрали для пользователя <literal>heat</literal> в службе Идентификации.
vi_vn: Thay <replaceable>HEAT_PASS</replaceable> bằng mật khẩu bạn đã chọn cho người dùng <literal>heat</literal> trong dịch vụ Identity.
zh_cn: 将其中的 <replaceable>HEAT_PASS</replaceable> 替换为您在身份认证服务中为 <literal>heat</literal> 用户设置的密码。

source: Replace <replaceable>INTERFACE_NAME</replaceable> with the actual interface name. For example, <emphasis>eth1</emphasis> or <emphasis>ens224</emphasis>.
ru: Замените <replaceable>INTERFACE_NAME</replaceable> на имя интерфейса. Например, <emphasis>eth1</emphasis> или <emphasis>ens224</emphasis>.
vi_vn: Thay <replaceable>INTERFACE_NAME</replaceable> bằng tên của giao diện thật. Ví dụ, <emphasis>eth1</emphasis> hoặc <emphasis>ens224</emphasis>.
zh_cn: 将其中的 <replaceable>INTERFACE_NAME</replaceable> 替换为实际的接口名称。例如，<emphasis>eth1</emphasis> 或 <emphasis>ens224</emphasis>。

source: Replace <replaceable>INTERFACE_NAME</replaceable> with the actual interface name. For example, <emphasis>eth2</emphasis> or <emphasis>ens256</emphasis>.
ru: Замените <replaceable>INTERFACE_NAME</replaceable> на действительное имя интерфейса. Например, <emphasis>eth2</emphasis> или <emphasis>ens256</emphasis>.
vi_vn: Thay <replaceable>INTERFACE_NAME</replaceable> bằng tên thật của giao diện. Ví dụ, <emphasis>eth2</emphasis> hoặc <emphasis>ens256</emphasis>.
zh_cn: 将其中的 <replaceable>INTERFACE_NAME</replaceable> 替换为实际的接口名称。例如，<emphasis>eth2</emphasis> 或 <emphasis>ens256</emphasis>。

source: Replace <replaceable>KEYSTONE_DBPASS</replaceable> with a suitable password.
ru: Замените <replaceable>KEYSTONE_DBPASS</replaceable> подходящим паролем.
vi_vn: Thay thế <replaceable>KEYSTONE_DBPASS</replaceable> bằng một mật khẩu phù hợp.
zh_cn: 将 <replaceable>KEYSTONE_DBPASS</replaceable> 替换为实际的密码。

source: Replace <replaceable>KEYSTONE_DBPASS</replaceable> with the password you chose for the database.
ru: Замените <replaceable>KEYSTONE_DBPASS</replaceable> на пароль, который вы установили для базы данных.
vi_vn: Thay thế <replaceable>KEYSTONE_DBPASS</replaceable> bằng mật khẩu mà bạn đã chọn cho cơ sỡ dữ liệu.
zh_cn: 将 <replaceable>KEYSTONE_DBPASS</replaceable> 替换为实际的数据库用户的密码。
