Repository: 25hours/openstack-manuals
Catalog: doc/install-guide/locale/*.po
Languages: ja, ru, vi_vn, zh_cn

source: Select the <literal>keystone</literal> pipeline to configure the Image service to use the Identity service:
vi_vn: Chọn <literal>keystone</literal> pipeline để cấu hình sao cho dịch vụ Image sử dụng dịch vụ Identity:

source: Select the ML2 plug-in:
ru: Выберите плагин ML2:
vi_vn: Chọn plug-in ML2:
zh_cn: 选择 ML2 插件：

source: Selecting the ML2 plug-in also populates the <placeholder-1/> and <placeholder-2/> options in the <filename>/etc/neutron/neutron.conf</filename> file with the appropriate values.
ru: Выбор плагина ML2 так же заполняет параметры <placeholder-1/> и <placeholder-2/> в файле <filename>/etc/neutron/neutron.conf</filename> соответствующими занчениями.
vi_vn: Việc chọn plug-in ML2 cũng đồng thời truyền các dữ liệu thích hợp vào các tùy chọn <placeholder-1/> và <placeholder-2/> trong file <filename>/etc/neutron/neutron.conf</filename>
zh_cn: 选择ML2插件也会在<filename>/etc/neutron/neutron.conf</filename>文件中的<placeholder-1/> 和 <placeholder-2/> 选项中填充适当的值。

source: Services and the [keystone_authtoken]
ja: サービスと [keystone_authtoken]
ru: Службы и [keystone_authtoken]
vi_vn: Các dịch vụ và [keystone_authtoken]
zh_cn: 服务和[keystone_authtoken]

source: Set the hostname of the node to <code><replaceable>controller</replaceable></code>.
ru: Измените имя узла на <code><replaceable>controller</replaceable></code>.
vi_vn: Đặt tên của node thành <code><replaceable>controller</replaceable></code>.
zh_cn: 将节点的主机名设置为 <code><replaceable>controller</replaceable></code>。

source: Set the hostname of the node to <code>compute1</code>.
ru: Измените имя узла на <code>compute1</code>.
vi_vn: Đặt tên cho node này là <code>compute1</code>.
zh_cn: 将该节点的主机名设置为 <code>compute1</code>。

source: Set the hostname of the node to <code>network</code>.
ru: Измените имя узла на <code>network</code>.
vi_vn: Đặt tên cho node này là <code>network</code>.
zh_cn: 将该节点的主机名设置为 <code>network</code>。

source: Set the hostname of the node to <replaceable>block1</replaceable>.
ru: Задайте имя хоста на узле <replaceable>block1</replaceable>.
vi_vn: Đặt tên máy của node là <replaceable>block1</replaceable>.
zh_cn: 设置节点的主机名为<replaceable>block1</replaceable>.

source: Set the hostname of the node to <replaceable>object1</replaceable>.
vi_vn: Đặt hostname cho nút là <replaceable>object1</replaceable>.
zh_cn: 将节点的主机名设置为 <replaceable>object1</replaceable>。

source: Set the hostname of the node to <replaceable>object2</replaceable>.
vi_vn: Đặt hostname cho nút là <replaceable>object2</replaceable>.
zh_cn: 将节点的主机名设置为 <replaceable>object2</replaceable>。

source: Set up session storage. See section <link xlink:href="http://docs.openstack.org/admin-guide-cloud/content/dashboard-sessions.html#dashboard-sessions">Set up session storage for the dashboard</link> in the <link xlink:href="http://docs.openstack.org/admin-guide-cloud/content/"><citetitle>OpenStack Cloud Administrator Guide</citetitle></link> for information on user session data.
vi_vn: Thiết lập kho lưu trữ phiên làm việc. Xem phần <link xlink:href="http://docs.openstack.org/admin-guide-cloud/content/dashboard-sessions.html#dashboard-sessions">Thiết lập kho lưu trữ phiên làm việc cho dashboard</link> trong <link xlink:href="http://docs.openstack.org/admin-guide-cloud/content/"><citetitle>Hướng dẫn Quản trị viên OpenStack Cloud</citetitle></link> để biết thông tin về dữ liệu phiên làm việc người dùng.

source: Show the service status:
vi_vn: Hiển thị trạng thái dịch vụ:
zh_cn: 显示服务状态：

source: Similarly, if your compute nodes use LVM on the operating system disk, you must also modify the filter in the <literal>/etc/lvm/lvm.conf</literal> file on those nodes to include only the operating system disk. For example, if the <literal>/dev/sda</literal> device contains the operating system:
ru: Таким же образом, если вычислительный узел использует LVM на диске с операционной системой, вам необходимо модифицировать фильтр в файле <literal>/etc/lvm/lvm.conf</literal> на этих узлах так, чтобы он включал только диск с операционной системой. Например, если устройство <literal>/dev/sda</literal> содержит операционную систему:
vi_vn: Tương tự, nếu các node tính toán sử dụng LVM trên đĩa hệ thống, bạn phải chỉnh sửa bộ lọc trong file <literal>/etc/lvm/lvm.conf</literal> trên các node này để chỉ bao gồm đĩa hệ thống. Ví dụ, nếu thiết bị <literal>/dev/sda</literal> chứa hệ điều hành:
zh_cn: 类似地，如果您的计算节点在操作系统磁盘上使用了 LVM，您也必需修改这些节点上 <literal>/etc/lvm/lvm.conf</literal> 文件中的过滤器，将操作系统磁盘包含到过滤器中。例如，如果 <literal>/dev/sda</literal> 设备包含了操作系统：

source: So, if using Debian, you wont need to care about database creation, access rights and character sets. All that is handled for you by the packages.
ru: Поэтому, если вы используете Debian, вам не нужно будет беспокоиться о создании базы данных, правах доступа и наборах символов. Всё это обрабатывается за вас самими пакетами.
vi_vn: Nếu bạn sử dụng Debian, bạn sẽ không cần phải quan tâm đến việc tạo cơ sở dữ liệu, quyền truy cập và hệ thống kí tự vì tất cả đều được các gói phần mềm xử lí giúp bạn.
zh_cn: 因此，如果使用的是 Debian 系统，您将不需要关心数据库的创建、访问权限以及属性的配置。所有这些都由包来处理。

source: Some OpenStack packages generate and assign user IDs automatically during package installation. In these cases, the user ID value is not important. The existence of the user ID is what matters.
ja: いくつかの OpenStack パッケージはインストール中にユーザー ID を自動的に生成し、割り当てます。これらのケースで、ユーザー ID 値が重要ではありません。ユーザー ID の存在が重要です。
vi_vn: Một vài gói OpenStack tự động sinh ra và gán các ID người dùng trong quá trình cài đặt. Trong các trường hợp này, giá trị của ID người dùng không quan trọng. Sự hiện diện của ID người dùng mới quan trọng.
zh_cn: 一些 OpenStack 的包在安装过程中会自动生成和分配用户 ID。在这些情况下，用户 ID 的值是不重要的。用户 ID 的存在才是重要的。

source: Some cloud images ignore the DHCP MTU option in which case you should configure it using metadata, a script, or another suitable method.
ru: Некоторые образы для облаков игнорируют параметр DHCP MTU, на этот случай вам необходимо настроить его используя метаданные, скрипт или другой подходящий метод.
vi_vn: Một vài cloud image bỏ qua tùy chọn DHCP MTU, trong trường hợp đó bạn nên cấu hình để nó sử dụng metadata, script hoặc một phương thức thích hợp khác.
zh_cn: 一些云镜像会忽略 DHCP MTU 选项，在这种情况下，您要配置其使用 metadata、一个脚本或其他合适方法。

source: Some distributions add an extraneous entry in the <filename>/etc/hosts</filename> file that resolves the actual hostname to another loopback IP address such as <literal>127.0.1.1</literal>. You must comment out or remove this entry to prevent name resolution problems.
vi_vn: Một số bản phân phối chèn thêm một mục không liên quan trong file<filename>/etc/hosts</filename> để phân giải hostname thực sự tới một địa chỉ IP loopback khác như <literal>127.0.1.1</literal>. Bạn phải chú thích lại hoặc xóa bỏ phần này đi để ngăn chặn các vấn đề liên quan tới việc phân giải tên.

source: Some distributions include LVM by default.
ru: Некоторые дистрибутивы включают LVM по умолчанию.
vi_vn: Một vài triển khai mặc định bao gồm LVM.
zh_cn: 一些发行版默认包含了LVM。

source: Source the <filename>demo-openrc.sh</filename> file.
ru: Загрузите файл <filename>demo-openrc.sh</filename>.
vi_vn: Đưa ra file <filename>demo-openrc.sh</filename>.
zh_cn: Source <filename>demo-openrc.sh</filename> 文件。

source: Source the <literal>admin</literal> credentials to gain access to admin-only CLI commands.
vi_vn: Sử dụng thông tin xác thực <literal>admin</literal> để có quyền truy cập và các câu lệnh CLI chỉ dành cho admin.
zh_cn: Source <literal>admin</literal> 凭证来获取访问只有管理员可以执行的 CLI 命令：

source: Source the <literal>admin</literal> credentials to gain access to admin-only CLI commands:
ru: Загрузите учётные данные пользователя <literal>admin</literal> для получения доступа к административным CLI командам:
vi_vn: Sử dụng thông tin xác thực <literal>admin</literal> để có quyền truy cập và giao diện dòng lệnh chỉ dành cho người quản trị:
zh_cn: 导入 <literal>admin</literal> 身份凭证以执行管理员用户专有的命令：

source: Source the <literal>admin</literal> tenant credentials:
ja: <literal>admin</literal> プロジェクトのクレデンシャルを読み込みます。
ru: Загрузите учётные данные проекта <literal>admin</literal>:
vi_vn: Đưa ra thông tin xác thực của <literal>admin</literal> tenant.
zh_cn: Source <literal>admin</literal> 租户凭证：

source: Source the <literal>demo</literal> credentials to gain access to user-only CLI commands:
ru: Загрузите учётные данные пользователя <literal>demo</literal> для получения доступа к пользовательским CLI командам:
vi_vn: Đưa ra các thông tin xác thực <literal>demo</literal> để có quyền truy cập vào các câu lệnh CLI chỉ dành cho người dùng:
zh_cn: Source <literal>demo</literal> 凭证来获取访问只有用户可以执行的 CLI 命令：

source: Source the <literal>demo</literal> credentials to perform the following steps as a non-administrative project:
vi_vn: Đưa ra các thông tin xác thực <literal>demo</literal> để thực hiện các bước sau với tư cách là một project không có quyền quản trị:

source: Source the <literal>demo</literal> credentials:
vi_vn: Đưa ra thông tin xác thực <literal>demo</literal>:

source: Source the <literal>demo</literal> tenant credentials:
ru: Загрузите учётные данные проекта <literal>demo</literal>:
vi_vn: Đưa ra các thông tin xác thực của <literal>demo</literal> tenant:
zh_cn: Source <literal>demo</literal> 租户凭证：

source: Start the <systemitem class="service">rsync</systemitem> service:
ja: <systemitem class="service">rsync</systemitem> サービスを起動します。
vi_vn: Khởi động dịch vụ <systemitem class="service">rsync</systemitem>:
zh_cn: 启动<systemitem class="service">rsync</systemitem>服务：

source: Start the <systemitem class="service">rsyncd</systemitem> service and configure it to start when the system boots:
ru: Запустите сервис <systemitem class="service">rsyncd</systemitem> и настройте его автоматический запуск при загрузке системы:
vi_vn: Khởi động dịch vụ <systemitem class="service">rsyncd</systemitem> và cấu hình để cho dịch vụ này được khởi động cùng hệ thống:
zh_cn: 启动 <systemitem role="service">rsync</systemitem> 服务并将其设置为随系统启动：

source: Start the Block Storage services and configure them to start when the system boots:
ru: Запустите сервис службы Блочного хранения и настройте его автоматический запуск при загрузке системы:
vi_vn: Khởi động các dịch vụ của Block Storage và cấu hình sao cho chúng được khởi động cùng với hệ thống:
zh_cn: 启动块设备存储服务，并将其配置为开机自启：

source: Start the Block Storage volume service including its dependencies and configure them to start when the system boots:
ru: Запустите сервис дисков Блочного хранения, включая его зависимости, и настройте их автоматический запуск при загрузке системы:
vi_vn: Khởi động dịch vụ ổ lưu trữ của Block Storage bao gồm các thành phần phụ thuộc của nó và cấu hình cho chúng khởi động cùng với hệ thống:
zh_cn: 启动块存储卷服务及其依赖的服务，并将其配置为随系统启动：

source: Start the Compute service including its dependencies and configure them to start automatically when the system boots:
ru: Запустите сервис службы Вычислений, включая его зависимости, и настройте их автоматический запуск при загрузке системы:
vi_vn: Khởi động dịch vụ Compute bao gồm các phần phụ thuộc của nó và cấu hình cho chúng tự động khởi động cùng với hệ thống:
zh_cn: 启动计算服务及其依赖，并将其配置为随系统自动启动：

source: Start the Compute services and configure them to start when the system boots:
ru: Запустите сервис службы Вычислений и настройте его автоматический запуск при загрузке системы:
vi_vn: Khởi động các dịch vụ Compute và cấu hình để khởi động cùng lúc với hệ thống:
zh_cn: 启动 Compute 服务并将其设置为随系统启动：

source: Start the Data processing service and configure it to start when the system boots: <placeholder-1/>
vi_vn: Khởi chạy dịch vụ xử lý Dữ liệu và cấu hình để dịch vụ khởi động cùng với hệ thống: <placeholder-1/>

source: Start the Database services and configure them to start when the system boots:
ru: Запустите сервисы службы Базы Данных и настройте их автоматический запуск при загрузке системы:
vi_vn: Khởi động các dịch vụ Database và cấu hình sao cho chúng khởi động cùng hệ thống:
zh_cn: 启动数据库服务并将其设置为随系统启动：

source: Start the Image service services and configure them to start when the system boots:
vi_vn: Khởi động các dịch vụ của dịch vụ Image và cấu hình cho chúng khởi động cùng hệ thống:

source: Start the LVM metadata service and configure it to start when the system boots:
ru: Запустите сервис метаданных LVM и настройте его автоматический запуск при загрузке системы:
vi_vn: Khởi động dịch vụ LVM metadata và cấu hình cho nó khởi động cùng hệ thống:
zh_cn: 启动LVM的metadata服务并且设置该服务随系统启动：

source: Start the Memcached service and configure it to start when the system boots:
vi_vn: Chạy dịch vụ Memcached và cấu hình để dịch vụ này chạy khi hệ thống khởi động:

source: Start the MongoDB services and configure them to start when the system boots:
ru: Запустите сервисы MongoDB и настройте их автоматический запуск при загрузке системы:
vi_vn: Khởi động các dịch vụ MongoDB và cấu hình cho chung khởi động cùng với hệ thống:
zh_cn: 启动 MongoDB 服务并将其配置为随系统启动：

source: Start the NTP service and configure it to start when the system boots:
ru: Запустите сервис NTP и настройте его автоматический запуск при загрузке системы:
vi_vn: Khởi động dịch vụ NTP và cấu hình sao cho chúng được khởi động cùng hệ thống:
zh_cn: 启动 NTP 服务将将其配置为随系统启动：

source: Start the Networking service and configure it to start when the system boots:
ja: Networking サービスを起動し、システム起動時に起動するよう設定します。
ru: Запустите сервис службы Сети и настройте его автоматический запуск при загрузке системы:
vi_vn: Khởi động dịch vụ Networking và cấu hình cho nó khởi động cùng với hệ thống:
zh_cn: 启动 Networking 服务并将其配置为随系统启动：

source: Start the Networking services and configure them to start when the system boots:
ru: Запустите сервисы службы Сети и настройте их автоматический запуск при загрузке системы:
vi_vn: Khởi động các dịch vụ Networking và cấu hình để chúng khởi động cùng hệ thống:
zh_cn: 启动 Networking 服务并将其配置为随系统启动：

source: Start the OVS service and configure it to start when the system boots:
ru: Запустите сервис OVS и настройте его автоматический запуск при загрузке системы:
vi_vn: Khởi động dịch vụ OVS và cấu hình để nó khởi động cùng với hệ thống:
zh_cn: 启动 OVS 服务并将其配置为随系统启动：

source: Start the Open vSwitch (OVS) agent and configure it to start when the system boots:
ru: Запустите агент Open vSwitch (OVS) и настройте его автоматический запуск при загрузке системы:
vi_vn: Khởi động Open vSwitch (OVS) agent và cấu hình cho phép nó khởi động cùng hệ thống:
zh_cn: 启动 Open vSwitch (OVS) 代理并将其配置为随系统启动：

source: Start the Orchestration services and configure them to start when the system boots:
ru: Запустите сервис Оркестровки и настройте его автоматический запуск при загрузке системы:
vi_vn: Khởi động các dịch vụ Orchestration và cấu hình cho chúng khởi động cùng với hệ thống:
zh_cn: 启动 Orchestration 服务并将其设置为随系统启动：

source: Start the Telemetry agent and configure it to start when the system boots:
vi_vn: Chạy agent Telemetry và cấu hình để khởi động cùng hệ thống:
zh_cn: 启动 Telemetry 代理并将其配置为随系统启动：

source: Start the Telemetry services and configure them to start when the system boots:
ru: Запустите сервисы Телеметрии и настройте их автоматический запуск при загрузке системы:
vi_vn: Khởi động các dịch vụ Telemetry và cấu hình cho chúng khởi động cùng với hệ thống:
zh_cn: 启动Telemetry服务并将其配置为随系统启动：

source: Start the database service and configure it to start when the system boots:
ru: Запустите сервис баз данных и настройте его автоматический запуск при загрузке системы:
vi_vn: Chạy dịch vụ cơ sở dữ liệu và cấu hình để nó chạy khi hệ thống khởi động:
zh_cn: 启动数据库服务，并将其配置为开机自启：

source: Start the message queue service and configure it to start when the system boots:
vi_vn: Khởi động dịch vụ hàng đợi message và cấu hình sao cho chúng được khởi động cùng hệ thống:
zh_cn: 启动消息队列服务并将其配置为随系统启动：

source: Start the services and configure them to start when the system boots:
ru: Запустите сервисы и настройте их автоматический запуск при загрузке системы:
vi_vn: Khởi động các dịch vụ và cấu hình để chúng có thể khởi động cùng hệ thống:
zh_cn: 启动服务并设置为随系统启动：

source: Start the web server and session storage service and configure them to start when the system boots:
ru: Запустите веб-сервер и службу хранилища сессий и настройте их автоматический запуск при загрузке системы:
vi_vn: Khởi động web server và dịch vụ lưu trữ phiên làm việc và cấu hình cho chúng khởi động cùng hệ thống:
zh_cn: 启动 web 服务器和会话存储服务，并将其配置为随系统启动：

source: Switch to the <literal>[DEFAULT]</literal> section. Proceed to the networking parameters. If you are using Neutron for networking, then set <literal>use_neutron=true</literal>. Otherwise if you are using <systemitem>nova-network</systemitem> set the given parameter to <literal>false</literal>.
vi_vn: Chuyển tới phần <literal>[MẶC ĐỊNH]</literal>. Tiếp tục với các tham số mạng kết nối. Nếu bạn đang sử dụng Neutron cho mạng kết nối của mình, hãy đặt <literal>use_neutron=true</literal>. Còn nếu bạn đang sử dụng <systemitem>nova-network</systemitem> hãy đặt tham số đó là <literal>false</literal>.
zh_cn: 切换到 <literal>[DEFAULT]</literal> 部分。继续配置网络参数。如果您使用的是 Neutron 网络，那么请设置 <literal>use_neutron=true</literal>。否则，如果您使用的是 <systemitem>nova-network</systemitem>，请将给定的参数设置为 <literal>false</literal>。

source: Switch to the <literal>[keystone_authtoken]</literal> section. The <placeholder-1/> option should point to the public Identity API endpoint. <placeholder-2/> should point to the admin Identity API endpoint. For example: <placeholder-3/>
vi_vn: Chuyển sang mục <literal>[keystone_authtoken]</literal>. Tùy chọn <placeholder-1/> cần trỏ đến điểm đầu nút công khai của API dịch vụ Identity. <placeholder-2/> cần trỏ đến điểm đầu nút quản trị của dịch vụ Indentity. Ví dụ: <placeholder-3/>

source: Telemetry provides a framework for monitoring and metering the OpenStack cloud. It is also known as the ceilometer project.
vi_vn: Telemetry cung cấp một framework phục vụ cho việc theo dõi và đo đạc OpenStack cloud. Nó còn được biết đến là dự án ceilometer.
zh_cn: Telemetry 提供一个监控和检测 OpenStack 云的框架。也就是大家所知道的 ceilometer 项目。

source: Telemetry uses a combination of notifications and an agent to collect Compute meters. Perform these steps on each compute node.
vi_vn: Telemetry sử dụng kết hợp các thông báo và một agent để thu thập các bộ đếm của node tính toán. Thực hiện các bước sau trên mỗi node tính toán.

source: Tenant network
ja: テナントネットワーク
ru: Сеть проекта
vi_vn: Hệ thống mạng tenant
zh_cn: 租户网络

source: That should be enough for the first run. If you want to increase logging level for troubleshooting, there are two parameters in the config: <literal>verbose</literal> and <literal>debug</literal>. If the former is set to <literal>true</literal>, sahara will start to write logs of <literal>INFO</literal> level and above. If <literal>debug</literal> is set to <literal>true</literal>, sahara will write all the logs, including the <literal>DEBUG</literal> ones.
vi_vn: Như thế là đủ cho lần chạy đầu tiên. Nếu bạn muốn tăng mức độ ghi chép thông tin nhật ký để phụ vụ việc chuẩn đoán và sửa chữa lỗi, có hai thông số trong phần cấu hình: <literal>verbose</literal> và <literal>debug</literal>. Nếu <literal>verbose</literal> được đặt giá trị là <literal>true</literal>, sahara sẽ bắt đầu ghi chép các thông tin nhật ký ở mức <literal>INFO</literal> trở lên. Nếu <literal>debug</literal> được đặt giá trị là <literal>true</literal>, sahara sẽ ghi chép tất cả thông tin nhật ký, bảo gồm cả các thông tin mức <literal>DEBUG</literal>.
zh_cn: 这些设置对于第一次运行来说已经足够了。如果您为故障排除而想要增加日志，这里有两个配置文件中的参数可配置：<literal>verbose</literal> 和 <literal>debug</literal>。如果前一个参数设置为 <literal>true</literal>，sahara 会开始将 <literal>INFO</literal> 级别及以上的内容写入日志。如果 <literal>debug</literal> 参数设置为 <literal>true</literal>，sahara 会写入所有的日志，包括 <literal>DEBUG</literal> 的内容。

source: The <code>seen true</code> option tells <package>debconf</package> that a specified screen was already seen by the user so do not show it again. This option is useful for upgrades.
ja: <code>seen true</code> オプションにより、指定された画面がすでにユーザーにより参照されたことを <package>debconf</package> に通知します。そのため、それを再び表示しません。このオプションはアップグレードのために有用です。
vi_vn: Tùy chọn <code>seen true</code> nói với <package>debconf</package> rằng một màn hình cụ thể đã được người dùng nhìn thấy nên đừng hiển thị nó lại. Tùy chọn này hữu ích khi thực hiện các nâng cấp.
zh_cn: <code>seen true</code>选项表示用户已经能够看到某个窗口，<package>debconf</package>无需创建一个新的。这个选项在升级的时候很有用。

source: The <glossterm baseform="Metadata agent">metadata agent</glossterm> provides configuration information such as credentials to instances.
ru: <glossterm baseform="Metadata agent">Агент метаданных</glossterm> предоставляет информацию о конфигурации, такую как учётные данные, инстансам.
vi_vn: <glossterm baseform="Metadata agent">Metadata agent</glossterm> cung cấp các thông tin cấu hình như là thông tin xác thực cho các instance.
zh_cn: <glossterm baseform="Metadata agent">metadata agent</glossterm> 提供一些配置信息，如实例的凭据。

source: The <glossterm baseform="cloud controller node">controller node</glossterm> runs the Identity service, Image Service, management portions of Compute and Networking, Networking plug-in, and the dashboard. It also includes supporting services such as a SQL database, <glossterm>message queue</glossterm>, and <glossterm>Network Time Protocol (NTP)</glossterm>.
ru: <glossterm baseform="cloud controller node">Управляющий узел</glossterm> предоставляет службы Идентификации, Образов, управляющие части Вычислительной и Сетевой службы, Сетевые плагины и Панель управления. Он так же включает вспомогательные службы, такие как SQL СУБД, <glossterm>очередь сообщений</glossterm> и <glossterm>Протокол сетевого времени (NTP)</glossterm>.
vi_vn: <glossterm baseform="node điều khiển cloud">node điều khiển</glossterm> chạy các dịch vụ Identity, Image, các phần quản lý của Compute và Networking, Networking plug-in và dashboard. Nó cũng bao gồm các dịch vụ bổ trợ như cơ sở dữ liệu SQL, <glossterm>message queue</glossterm>, và <glossterm>Giao thức Thời gian Mạng(NTP)</glossterm>.
zh_cn: <glossterm baseform="cloud controller node">控制节点服务器</glossterm>运行身份认证服务、镜像服务，管理部分计算和网络服务，运行网络插件以及仪表板。它还包括一些支持服务，例如 SQL 数据库、<glossterm>消息队列</glossterm>和<glossterm>网络时间协议 (NTP)</glossterm>。

source: The <glossterm baseform="cloud controller node">controller node</glossterm> runs the Identity service, Image service, management portion of Compute, and the dashboard. It also includes supporting services such as a SQL database, <glossterm>message queue</glossterm>, and <glossterm>Network Time Protocol (NTP)</glossterm>.
vi_vn: <glossterm baseform="cloud controller node">Controller node</glossterm> sẽ chạy dịch vụ Identity, Image, phần quản lý của Compute và dashboard. Nó cũng bao gồm cả các dịch vụ hỗ trợ như cơ sở dữ liệu SQL, <glossterm>hàng đợi message</glossterm> và <glossterm>Network Time Protocol (NTP)</glossterm>.

source: The <glossterm>DHCP agent</glossterm> provides DHCP services for virtual networks.
ru: <glossterm>Агент DHCP</glossterm> предоставляет службы DHCP для виртуальных сетей.
vi_vn: <glossterm>DHCP agent</glossterm> cung cấp các dịch vụ DHCP cho các mạng ảo.
zh_cn: <glossterm>DHCP 代理</glossterm>为实例提供 DHCP 服务。
