Repository: 25hours/openstack-manuals
Catalog: doc/install-guide/locale/*.po
Languages: ja, ru, vi_vn, zh_cn

source: Create the <filename os="ubuntu">/etc/apache2/sites-available/wsgi-keystone.conf</filename><filename os="rhel;centos;fedora">/etc/httpd/conf.d/wsgi-keystone.conf</filename><filename os="opensuse;sles">/etc/apache2/conf.d/wsgi-keystone.conf</filename> file with the following content:
vi_vn: Tạo ra file <filename os="ubuntu">/etc/apache2/sites-available/wsgi-keystone.conf</filename><filename os="rhel;centos;fedora">/etc/httpd/conf.d/wsgi-keystone.conf</filename><filename os="opensuse;sles">/etc/apache2/conf.d/wsgi-keystone.conf</filename> với nội dung như sau:

source: Create the <literal>/etc/swift</literal> directory.
ru: Создайте директорию <literal>/etc/swift</literal>.
vi_vn: Khởi tạo thư mục <literal>/etc/swift</literal>.
zh_cn: 创建<literal>/etc/swift</literal>目录。

source: Create the <literal>ResellerAdmin</literal> role:
vi_vn: Tạo role <literal>ResellerAdmin</literal>:
zh_cn: 创建 <literal>ResellerAdmin</literal> 角色：

source: Create the <literal>admin</literal> project:
vi_vn: Tạo ra project <literal>admin</literal>:

source: Create the <literal>admin</literal> role:
ja: <literal>admin</literal> ロールを作成します。
ru: Создайте роль <literal>admin</literal>:
vi_vn: Tạo role <literal>admin</literal>:
zh_cn: 创建 <literal>admin</literal> 角色：

source: Create the <literal>admin</literal> tenant and user:
ru: Создайте проект и пользователя <literal>admin</literal>:
vi_vn: Tạo tenant và user <literal>admin</literal>:
zh_cn: 创建 <literal>admin</literal> tenant和用户：

source: Create the <literal>admin</literal> user:
ja: <literal>admin</literal> ユーザーを作成します。
ru: Создайте пользователя <literal>admin</literal>:
vi_vn: Tạo user <literal>admin</literal>:
zh_cn: 创建 <literal>admin</literal> 用户：

source: Create the <literal>ceilometer</literal> database:
ru: Создайте базу данных <literal>ceilometer</literal>:
vi_vn: Khởi tạo cơ sở dữ liệu <literal>ceilometer</literal>:
zh_cn: 创建<literal>ceilometer</literal>数据库：

source: Create the <literal>ceilometer</literal> service entity:
ru: Создайте сервисный объект <literal>ceilometer</literal>:
vi_vn: Khởi tạo thực thể dịch vụ <literal>ceilometer</literal>:
zh_cn: 创建<literal>ceilometer</literal>服务条目：

source: Create the <literal>ceilometer</literal> user:
ru: Создайте пользователя <literal>ceilometer</literal>:
vi_vn: Khởi tạo người dùng <literal>ceilometer</literal>:
zh_cn: 创建<literal>ceilometer</literal>用户：

source: Create the <literal>cinder</literal> database:
ru: Создайте базу данных <literal>cinder</literal>:
vi_vn: Tạo cơ sở dữ liệu <literal>cinder</literal>:
zh_cn: 创建 <literal>cinder</literal> 数据库：

source: Create the <literal>cinder</literal> service entities:
ru: Создайте сервисные объекты <literal>cinder</literal>:
vi_vn: Tạo các thực thể dịch vụ <literal>cinder</literal>:
zh_cn: 创建 <literal>cinder</literal> 服务实体：

source: Create the <literal>demo</literal> project:
vi_vn: Tạo dự án <literal>demo</literal>:

source: Create the <literal>demo</literal> user:
ja: <literal>demo</literal> ユーザーを作成します。
vi_vn: Tạo người dùng <literal>demo</literal>:

source: Create the <literal>glance</literal> database:
ru: Создайте базу данных <literal>glance</literal>:
vi_vn: Tạo cơ sở dữ liệu <literal>glance</literal>:
zh_cn: 创建 <literal>glance</literal> 数据库：

source: Create the <literal>glance</literal> service entity:
ru: Создайте сервисный объект <literal>glance</literal>.
vi_vn: Khởi tạo thực thể dịch vụ <literal>glance</literal>:
zh_cn: 创建 <literal>glance</literal> 服务实体：

source: Create the <literal>glance</literal> user:
ru: Создайте пользователя <literal>glance</literal>:
vi_vn: Khởi tạo người dùng <literal>glance</literal>:
zh_cn: 创建 <literal>glance</literal> 用户：

source: Create the <literal>heat</literal> and <literal>heat-cfn</literal> service entities:
ru: Создайте сервисные объекты <literal>heat</literal> и <literal>heat-cfn</literal>:
vi_vn: Khởi tạo các thực thể dịch vụ <literal>heat</literal> và <literal>heat-cfn</literal>:
zh_cn: 创建 <literal>heat</literal> 和 <literal>heat-cfn</literal> 服务实体：

source: Create the <literal>heat</literal> database:
ru: Создайте базу данных <literal>heat</literal>:
vi_vn: Khởi tạo cơ sở dữ liệu <literal>heat</literal>:
zh_cn: 创建 <literal>heat</literal> 数据库：

source: Create the <literal>heat</literal> user:
ru: Создайте пользователя <literal>heat</literal>:
vi_vn: Khởi tạo người dùng <literal>heat</literal>:
zh_cn: 创建<literal>heat</literal>用户：

source: Create the <literal>heat_stack_owner</literal> role:
ru: Создайте роль <literal>heat_stack_owner</literal>:
vi_vn: Khởi tạo vai trò <literal>heat_stack_owner</literal>:
zh_cn: 创建<literal>heat_stack_owner</literal>角色：

source: Create the <literal>heat_stack_user</literal> role:
ru: Создайте роль <literal>heat_stack_user</literal>:
vi_vn: Khởi tạo vai trò <literal>heat_stack_user</literal>:
zh_cn: 创建 <literal>heat_stack_user</literal> 角色：

source: Create the <literal>keystone</literal> database:
ru: Создайте базу данных <literal>keystone</literal>:
vi_vn: Tạo cơ sở dữ liệu <literal>keystone</literal>:
zh_cn: 创建 <literal>keystone</literal> 数据库：

source: Create the <literal>neutron</literal> database:
ru: Создайте базу данных <literal>neutron</literal>:
vi_vn: Khởi tạo cơ sở dữ liệu <literal>neutron</literal>:
zh_cn: 创建 <literal>neutron</literal> 数据库：

source: Create the <literal>neutron</literal> service entity:
ru: Создайте сервисный объект <literal>neutron</literal>:
vi_vn: Khởi tạo thực thể dịch vụ <literal>neutron</literal>:
zh_cn: 创建 <literal>neutron</literal> 服务实体：

source: Create the <literal>neutron</literal> user:
ru: Создайте пользователя <literal>neutron</literal>:
vi_vn: Khởi tạo người dùng <literal>neutron</literal>:
zh_cn: 创建 <literal>neutron</literal> 用户：

source: Create the <literal>nova</literal> database:
ru: Создайте базу данных <literal>nova</literal>:
vi_vn: Khởi tạo cơ sở dữ liệu <literal>nova</literal>:
zh_cn: 创建 <literal>nova</literal> 数据库：

source: Create the <literal>nova</literal> service entity:
ru: Создайте сервисный объект <literal>nova</literal>:
vi_vn: Khởi tạo thực thể dịch vụ <literal>nova</literal>:
zh_cn: 创建 <literal>nova</literal> 服务实体：

source: Create the <literal>nova</literal> user:
ru: Создайте пользователя <literal>nova</literal>:
vi_vn: Khởi tạo người dùng <literal>nova</literal>:
zh_cn: 创建 <literal>nova</literal> 用户：

source: Create the <literal>recon</literal> directory and ensure proper ownership of it:
ru: Создайте директорию <literal>recon</literal> и установите ей корректного владельца:
vi_vn: Tạo thư mục <literal>recon</literal> và đảm bảo quyền sở hữu hợp pháp của nó:

source: Create the <literal>sahara</literal> database:
vi_vn: Tạo cơ sở dữ liệu <literal>sahara</literal>:
zh_cn: 创建 <literal>sahara</literal> 数据库：

source: Create the <literal>sahara</literal> service entity:
vi_vn: Tạo thực thể dịch vụ <literal>sahara</literal>:

source: Create the <literal>sahara</literal> user:
vi_vn: Tạo người dùng <literal>sahara</literal>:

source: Create the <literal>service</literal> project:
vi_vn: Tạo ra dự án <literal>service</literal>:

source: Create the <literal>swift</literal> service entity:
ru: Создайте сервисный объект <literal>swift</literal>:
vi_vn: Khởi tạo thực thể dịch vụ <literal>swift</literal>:
zh_cn: 创建 <literal>swift</literal> 服务实体：

source: Create the <literal>swift</literal> user:
ru: Создайте пользователя <literal>swift</literal>:
vi_vn: Khởi tạo người dùng <literal>swift</literal>:
zh_cn: 创建 <literal>swift</literal> 用户：

source: Create the <literal>trove</literal> user:
vi_vn: Khởi tạo người dùng <literal>trove</literal>:

source: Create the <literal>user</literal> role:
vi_vn: Tạo role <literal>user</literal>:

source: Create the Block Storage service API endpoints:
vi_vn: Tạo các điểm cuối API của dịch vụ Block Storage:
zh_cn: 创建块存储服务的 API 入口点：

source: Create the Compute service API endpoint:
vi_vn: Khởi tạo API endpoint của dịch vụ Compute:

source: Create the Data processing service API endpoint:
vi_vn: Khởi tạo API endpoint cho dịch vụ xử lý Dữ liệu:

source: Create the Database service API endpoint:
vi_vn: Khởi tạo API endpoint cho dịch vụ Database:

source: Create the Identity service API endpoint:
vi_vn: Khởi tạo API endpoint cho dịch vụ Identity:

source: Create the Identity service endpoints
ru: Создайте точки доступа для сервиса Identity
vi_vn: Tạo ra các endpoint của dịch vụ Identity
zh_cn: 创建身份认证的入口点

source: Create the Image service API endpoint:
vi_vn: Khởi tạo API endpoint cho dịch vụ Image:

source: Create the LVM physical volume <literal>/dev/sdb1</literal>:
ru: Создайте физический раздел LVM <literal>/dev/sdb1</literal>:
vi_vn: Khởi tạo ổ lưu trữ vậy lý LVM <literal>/dev/sdb1</literal>:
zh_cn: 创建LVM物理卷<literal>/dev/sdb1</literal>：

source: Create the LVM volume group <literal>cinder-volumes</literal>:
ru: Создайте группу дисков LVM <literal>cinder-volumes</literal>:
vi_vn: Khởi tạo nhóm ổ lưu trữ LVM <literal>cinder-volumes</literal>:
zh_cn: 创建LVM卷组<literal>cinder-volumes</literal>：

source: Create the Networking service API endpoint:
vi_vn: Khởi tạo API endpoint cho dịch vụ Networking:

source: Create the Object Storage service API endpoint:
vi_vn: Khởi tạo API endpoint cho dịch vụ Object Storage:

source: Create the Orchestration service API endpoints:
vi_vn: Khởi tạo các API endpoint cho dịch vụ Orchestration:
zh_cn: 创建 Orchestration 服务的 API 端点：

source: Create the Telemetry module API endpoint:
vi_vn: Khởi tạo API endpoint cho module Telemetry:

source: Create the base <filename>account.builder</filename> file:
vi_vn: Khởi tạo file <filename>account.builder</filename> gốc:
zh_cn: 创建基本的<filename>account.builder</filename>文件：

source: Create the base <filename>container.builder</filename> file:
vi_vn: Khởi tạo file <filename>container.builder</filename> gốc:

source: Create the base <filename>object.builder</filename> file:
vi_vn: Khởi tạo file <filename>object.builder</filename> gốc:

source: Create the directory structure for the WSGI components:
vi_vn: Tạo cấu trúc thư mục cho các thành phần của WSGI:

source: Create the heat domain in Identity service:
vi_vn: Khởi tạo miền heat trong dịch vụ Identity:

source: Create the mount point directory structure:
vi_vn: Tạo cấu trúc thư mục mount point:

source: Create the network:
ja: ネットワークを作成します。
ru: Создайте сеть:
vi_vn: Tạo một mạng:
zh_cn: 创建网络：

source: Create the router:
ja: ルーターを作成します。
ru: Создать маршрутизатор:
vi_vn: Khởi tạo router:
zh_cn: 创建路由：

source: Create the service entity and API endpoint
ru: Создайте объект для сервиса и точку доступа API
vi_vn: Khởi tạo thực thể dịch vụ và API endpoint.
zh_cn: 创建服务实体和 API 端点

source: Create the service entity for the Identity service:
ru: Создайте сервисный объект для сервиса Identity:
vi_vn: Khởi tạo thực thể dịch vụ cho dịch vụ Identity:
zh_cn: 创建服务实体和身份认证服务：

source: Create the subnet:
ja: サブネットを作成します。
ru: Создайте подсеть:
vi_vn: Khởi tạo subnet:
zh_cn: 创建子网：

source: Customize your dashboard. See section <link xlink:href="http://docs.openstack.org/admin-guide-cloud/content/ch_install-dashboard.html#dashboard-custom-brand">Customize the dashboard</link> in the <link xlink:href="http://docs.openstack.org/admin-guide-cloud/content/"><citetitle>OpenStack Cloud Administrator Guide</citetitle></link> for information on setting up colors, logos, and site titles.
vi_vn: Tùy chỉnh dashboard của bạn. Xem phần <link xlink:href="http://docs.openstack.org/admin-guide-cloud/content/ch_install-dashboard.html#dashboard-custom-brand">Tùy chỉnh dashboard</link> trong <link xlink:href="http://docs.openstack.org/admin-guide-cloud/content/"><citetitle>Hướng dẫn Quản trị viên OpenStack Cloud</citetitle></link> để biết thông tin về cách thiết lập màu sắc, logo và tiêu đề cho trang.

source: Database population occurs later for Networking because the script requires complete server and plug-in configuration files.
ru: Заполнение базы данных происходит посже для службы Сети, поскольку скрипт требует заполненных файлов настроек сервера и плагинов.
vi_vn: Việc truyền thông tin vào cơ sở dữ liệu vào Networking xảy ra sau bởi vì script yêu cầu server hoàn chỉnh và các file cấu hình plug-in.
zh_cn: 数据库的同步发生在 Networking 之后，因为脚本需要完成服务器和插件的配置文件。

source: Debian does not use a separate ML2 plug-in package.
ru: Debian не использует отдельный пакет для плагина ML2.
vi_vn: Debian không sử dụng một gói plug-in ML2 riêng lẻ.
zh_cn: Debian 不使用单独的 ML2 插件包。

source: Default configuration files vary by distribution. You might need to add these sections and options rather than modifying existing sections and options. Also, an ellipsis (...) in the configuration snippets indicates potential default configuration options that you should retain.
vi_vn: Các file cấu hình mặc định khác nhau tùy vào bản phân phối. Bạn có thể cần phải thêm các mục và tùy chọn này thay vì sửa các mục và tùy chọn có sẵn. Đồng thời, dấu chấm lửng (...) trong các đoạn trích cấu hình ngụ ý các tuỳ chọn cấu hình mặc định tiềm năng mà bạn nên giữ nguyên.
zh_cn: 默认的配置文件根据不同发行版本而不同。有可能需要增加这些部分或是选项，而不是修改现有的部分或是选项。另外，配置文件代码段中的省略号(...)表明这可能是你需要保留的默认配置选项。

source: Default gateway: 10.0.0.1
ru: Маршрут по умолчанию: 10.0.0.1
vi_vn: Gateway mặc định: 10.0.0.1
zh_cn: 默认网关: 10.0.0.1

source: Description
ja: 説明
ru: Описание
vi_vn: Mô tả chi tiết
zh_cn: 描述

source: Determine whether your compute node supports hardware acceleration for virtual machines:
ru: Определите, поддерживает ли ваш вычислительный узел аппаратное ускорение для виртуальных машин:
vi_vn: Xác định xem node tính toán của bạn có hỗ trợ tăng tốc phần cứng cho các máy ảo hay không:
zh_cn: 确定您的计算节点是否支持虚拟机的硬件加速。

source: Disable or remove any automatic update services because they can impact your OpenStack environment.
ru: Отключите или удалите все службы автоматического обновления, поскольку они могут повлиять на вашу среду OpenStack.
vi_vn: Vô hiệu hóa hoặc xóa bỏ tất cả các dịch vụ tự động update vì chúng có thể gây ảnh hưởng tới môi trường OpenStack của bạn.
zh_cn: 禁用或移除所有自动更新的服务，因为它们会影响到您的 OpenStack 环境。

source: Disable the <systemitem class="service">keystone</systemitem> service from starting automatically after installation:
vi_vn: Vô hiệu hóa việc khởi động tự động sau khi cài đặt của dịch vụ <systemitem class="service">keystone</systemitem>:

source: Distribute ring configuration files
vi_vn: Phân phối các file cấu hình ring

source: Distributions release OpenStack packages as part of the distribution or using other methods because of differing release schedules. Perform these procedures on all nodes.
ru: Дистрибутивы выпускают пакеты OpenStack как часть дистрибутива или используя другие методы из-за различных графиков выпуска. Выполните эти действия на всех узлах.
vi_vn: Các phân phối phát hành các gói OpenStack như là một phần của phân phối hoặc sử dụng các cách thức khác bởi sự khác nhau trong lịch phát hành. Thực hiện các thủ tục sau trên tất cả các node.
zh_cn: 由于不同的发布日程，分类发布 OpenStack 的包作为分布或使用其他方式的一部分。请在所有节点上执行这些程序。

source: Do not change the <literal>HWADDR</literal> and <literal>UUID</literal> keys.
ru: Не изменяйте ключи <literal>HWADDR</literal> и <literal>UUID</literal>.
vi_vn: Không thay đổi các khóa <literal>HWADDR</literal> và <literal>UUID</literal>.
zh_cn: 不要修改 <literal>HWADDR</literal> 和 <literal>UUID</literal> 关键字的内容。

source: Do not explicitly start the <systemitem class="service">neutron-ovs-cleanup</systemitem> service.
vi_vn: Không khởi động dịch vụ <systemitem class="service">neutron-ovs-cleanup</systemitem> một cách rõ ràng.
zh_cn: 请勿直接地启动 <systemitem class="service">neutron-ovs-cleanup</systemitem> 服务。

source: Do not repeat this step when creating additional users for this project.
vi_vn: Không lặp lại bước này khi tạo thêm người dùng cho dự án này.

source: Download a test file:
vi_vn: Tải về một file thử nghiệm:
zh_cn: 下载一个测试文件：

source: Download an image from the Image service:
vi_vn: Tải về một image từ dịch vụ Image:

source: Download the source image into it:
vi_vn: Tải image nguồn vào bên trong nó:
zh_cn: 将源镜像下载到里面：

source: Due to a packaging bug, the dashboard CSS fails to load properly. Run the following command to resolve this issue:
ru: Из-за ошибки в пакете, CSS панели управления не загружается корректно. Исполните следующую команду для решения этой проблемы:
vi_vn: Do một lỗi trong quá trình đóng gói, CSS của dashboard không thể tải chuẩn xác. Chạy lệnh sau để giải quyết vấn đề này:
zh_cn: 由于一个包的 bug，仪表板的 CSS 会加载失败。可以执行以下命令来解决这个问题：

source: During the final stage of the package installation, it is possible to automatically create an admin tenant and an admin user. This can later be used for other OpenStack services to contact the Identity service. This is the equivalent of running the below commands:
ru: На последней стадии установки пакета есть возможность автоматически создать проект и пользователя admin. Позже они будут использоваться другими службами OpenStack для связи со службой Идентификации. Это эквивалентно исполнению следующих команд:
vi_vn: Giai đoạn cuối cùng của việc cài đặt gói phần mềm, chúng ta có thể tạo tenant admin và user admin một cách tự động. Thông tin này sau đó có thể sử dụng cho các dịch vụ khác của OpenStack để liên lạc với dịch vụ Identity. Việc này đồng nghĩa với chạy các câu lệnh sau:
zh_cn: 在安装包的最后一步，可以自动创建一个 admin 租户和一个 admin 用户。之后可以用于 OpenStack 服务以与身份认证服务进行联系。这等效于执行以下命令：

source: Each item in the filter array begins with <literal>a</literal> for <emphasis>accept</emphasis> or <literal>r</literal> for <emphasis>reject</emphasis> and includes a regular expression for the device name. The array must end with <literal>r/.*/</literal> to reject any remaining devices. You can use the <placeholder-1/> command to test filters.
vi_vn: Mỗi mục trong chuỗi lọc đều bắt đầu bằng <literal>a</literal> có nghĩa là <emphasis>cho phép</emphasis> hoặc<literal>r</literal> có nghĩa là <emphasis>từ chối</emphasis> và bao gồm cách thể hiện thông thường đối với tên thiết bị. Chuỗi phải kết thúc bằng <literal>r/.*/</literal> để từ chối tất cả các thiết bị còn lại. Bạn có thể sử dụng lệnh <placeholder-1/> để kiểm tra các bộ lọc.
zh_cn: 每个过滤器序列中的元素都以 <literal>a</literal> 开头，即为 <emphasis>accept</emphasis>，或以 <literal>r</literal> 开头，即为 <emphasis>reject</emphasis>，并好括一些设备名称的表示规则。您可以使用 <placeholder-1/> 命令来测试过滤器。

source: Each plug-in that Networking uses has its own concepts. While not vital to operating the VNI and OpenStack environment, understanding these concepts can help you set up Networking. All Networking installations use a core plug-in and a security group plug-in (or just the No-Op security group plug-in). Additionally, Firewall-as-a-Service (FWaaS) and Load-Balancer-as-a-Service (LBaaS) plug-ins are available.
vi_vn: Mỗi plug-in mà Networking sử dụng đều có khái niệm riêng của nó. Mặc dù nó không quá quan trọng để vận hành VNI và môi trường OpenStack, hiểu được các khái niệm này có thể giúp bạn cài đặt Networking. Tất cả các cài đặt Networking đều sử dụng một plug-in chính và một plug-in nhóm bảo mật (hoặc chỉ plug-in nhóm bảo mật No-OP). Thêm vào đó plug-in Firewall-as-a-Service (FWaaS) và Load-Balancer-as-a-Service (LBaaS) cũng có sẵn.
zh_cn: 每一个Networking使用的插件都有其自有的概念。虽然对操作VNI和OpenStack环境不是至关重要的，但理解这些概念能帮助你设置Networking。所有的Networking安装使用了一个核心插件和一个安全组插件(或仅是空操作安全组插件)。另外，防火墙即服务(FWaaS)和负载均衡即服务(LBaaS)插件是可用的。

source: Each router has one gateway that connects to a network, and many interfaces connected to subnets. Subnets can access machines on other subnets connected to the same router.
ru: Каждый маршрутизатор имеет один шлюз, подключенный к сети, и множество интерфейсов, подключенных к подсетям. Из подсетей есть доступ к машинам в других подсетях, подключенных к одному маршртутизатору.
vi_vn: Mỗi router đều có một gateway kết nối đến một hệ thống mạng và nhiều giao diện kết nối đến các subnet. Các subnet có thể truy cập các máy trên các subnet khác được kết nối vào cùng một router.
zh_cn: 每个路由都有一个连接到网络的网关，并且很多接口都连接到子网中。子网可以访问其他连接到相同路由其他子网的机器。

source: Each service that you add to your OpenStack environment requires one or more service entities and one API endpoint in the Identity service.
vi_vn: Mỗi dịch vụ bạn thêm vào môi trường OpenStack của bạn yêu cầu một hoặc nhiều các thực thể dịch vụ và một API endpoint trong dịch vụ Identity.

source: Each user belongs to a user group with the same name as the user.
ja: 各ユーザーはユーザーと同じ名前のユーザーグループに所属します。
vi_vn: Mỗi người dùng thuộc về một nhóm người dùng cùng tên với người dùng đó.
zh_cn: 每个用户都属于一个和用户同名的用户组。

source: Edit <filename>/etc/sahara/sahara.conf</filename> configuration file
vi_vn: Chỉnh sửa file cấu hình tập tin <filename>/etc/sahara/sahara.conf</filename>
zh_cn: 修改配置文件 <filename>/etc/sahara/sahara.conf</filename>

source: Edit the <filename os="opensuse;sles;ubuntu">/etc/mongodb.conf</filename><filename os="rhel;centos;fedora">/etc/mongod.conf</filename> file and complete the following actions:
vi_vn: Sửa file <filename os="opensuse;sles;ubuntu">/etc/mongodb.conf</filename><filename os="rhel;centos;fedora">/etc/mongod.conf</filename> và hoàn thành các công việc sau:

source: Edit the <filename os="ubuntu">/etc/apache2/apache2.conf</filename><filename os="rhel;centos;fedora">/etc/httpd/conf/httpd.conf</filename> file and configure the <literal>ServerName</literal> option to reference the controller node:
vi_vn: Chỉnh sửa file <filename os="ubuntu">/etc/apache2/apache2.conf</filename><filename os="rhel;centos;fedora">/etc/httpd/conf/httpd.conf</filename> và cấu hình <literal>ServerName</literal> để trỏ tới controller node:

source: Edit the <filename os="ubuntu;debian">/etc/mysql/my.cnf</filename><filename os="rhel;centos;fedora;sles;opensuse">/etc/my.cnf</filename> file and change the <literal>max_allowed_packet</literal> option:
vi_vn: Chỉnh sửa tập tin <filename os="ubuntu;debian">/etc/mysql/my.cnf</filename><filename os="rhel;centos;fedora;sles;opensuse">/etc/my.cnf</filename> và thay đổi lựa chọn của <literal>max_allowed_packet</literal>:
zh_cn: 修改配置文件 <filename os="ubuntu;debian">/etc/mysql/my.cnf</filename><filename os="rhel;centos;fedora;sles;opensuse">/etc/my.cnf</filename> 并修改 <literal>max_allowed_packet</literal> 选项：

source: Edit the <filename os="ubuntu;sles;opensuse">/etc/keystone/keystone-paste.ini</filename><filename os="rhel;centos;fedora">/usr/share/keystone/keystone-dist-paste.ini</filename> file and remove <literal>admin_token_auth</literal> from the <literal>[pipeline:public_api]</literal>, <literal>[pipeline:admin_api]</literal>, and <literal>[pipeline:api_v3]</literal> sections.
vi_vn: Sửa file <filename os="ubuntu;sles;opensuse">/etc/keystone/keystone-paste.ini</filename><filename os="rhel;centos;fedora">/usr/share/keystone/keystone-dist-paste.ini</filename> và xóa <literal>admin_token_auth</literal> từ các mục <literal>[pipeline:public_api]</literal>, <literal>[pipeline:admin_api]</literal>, và <literal>[pipeline:api_v3]</literal>.

source: Edit the <filename>/etc/ceilometer/ceilometer.conf</filename> file and complete the following actions:
ru: Отредактируйте файл <filename>/etc/ceilometer/ceilometer.conf</filename> следующим образом:
vi_vn: Chỉnh sửa file <filename>/etc/ceilometer/ceilometer.conf</filename> và hoàn tất các thao tác sau:
zh_cn: 修改配置文件 <filename>/etc/ceilometer/ceilometer.conf</filename> 并完成以下操作：

source: Edit the <filename>/etc/cinder/cinder.conf</filename> file and complete the following actions:
ru: Отредактируйте файл <filename>/etc/cinder/cinder.conf</filename> следующим образом:
vi_vn: Chỉnh sửa file <filename>/etc/cinder/cinder.conf</filename> và hoàn tất các thao tác sau:
zh_cn: 编辑 <filename>/etc/cinder/cinder.conf</filename> 并完成下列操作：
