Repository: 25hours/openstack-manuals
Catalog: doc/networking-guide/source/locale/*/LC_MESSAGES/networking-guide.po
Languages: id, tr_tr

source: The Networking service, code-named neutron, provides an API that lets you define network connectivity and addressing in the cloud. The Networking service enables operators to leverage different networking technologies to power their cloud networking. The Networking service also provides an API to configure and manage a variety of network services ranging from L3 forwarding and :term:`NAT <Network Address Translation (NAT)>` to load balancing, perimeter firewalls, and virtual private networks.
id: Layanan Networking, code-named neutron, menyediakan API yang memungkinkan Anda menentukan konektivitas jaringan dan menangani di cloud. Layanan Networking mengaktifkan para operator untuk memanfaatkan teknologi jaringan yang berbeda untuk memperdayakan jaringan cloud mereka. Layanan Networking juga menyediakan API untuk mengkonfigurasi dan mengelola berbagai layanan jaringan mulai dari L3 forwarding dan :term:`NAT <Network Address Translation (NAT)>` sampai load balancing, perimeter firewall, dan jaringan private virtual.
tr_tr: Neutron olarak kodlanan Ağ hizmeti, bulutta ağ bağlantısını ve adreslemeyi tanımlamanıza izin veren bir API sağlar. Ağ hizmeti, operatörlerin bulut ağlarını güçlendirmek için farklı ağ teknolojilerini kullanmalarını sağlar. Ağ hizmeti, aynı zamanda, L3 yönlendirme ve yük dengeleme için :term:`NAT <Network Address Translation (NAT)>`, çevre güvenlik duvarları ve sanal özel ağlar arasında değişen çeşitli ağ hizmetlerini yapılandırmak ve yönetmek için bir API sağlar.

source: The Newton implementation contains the following limitations:
id: Penerapan Newton berisi keterbatasan berikut:
tr_tr: Newton uygulaması aşağıdaki kısıtlamaları içerir:

source: The OVS integration bridge ``int-br-provider`` patch port (19) forwards the packet to the OVS provider bridge ``phy-br-provider`` patch port (20).
id: OVS integration bridge ``int-br-provider`` patch port (19) meneruskan paket ke OVS provider bridge ``phy-br-provider`` patch port (20).
tr_tr: OVS entegrasyon köprüsü ``int-br-provider`` yama bağlantı noktası (19) paketi OVS sağlayıcı köprü ``phy-br-provider`` yama bağlantı noktasına paketi iletir (20).

source: The OVS integration bridge ``int-br-provider`` patch port (6) forwards the packet to the OVS provider bridge ``phy-br-provider`` patch port (7).
id: OVS integration bridge ``int-br-provider`` patch port (6) meneruskan paket ke OVS provider bridge ``phy-br-provider`` patch port (7).
tr_tr: OVS entegrasyon köprüsü ``int-br-provider`` yama bağlantı noktası (6), paketi, OVS sağlayıcı köprüsü``phy-br-provider`` yama bağlantı noktasına (7) iletir.

source: The OVS integration bridge ``patch-tun`` patch port (10) forwards the packet to the OVS tunnel bridge ``patch-int`` patch port (11).
id: OVS integration bridge ``patch-tun`` patch port (10) meneruskan paket ke OVS tunnel bridge ``patch-int`` patch port (11).
tr_tr: OVS entegrasyon köprüsü ``patch-tun``` yama bağlantı noktası (10) paketi OVS tünel köprüsü ``patch-int`` yama bağlantı noktasına (11) iletir.

source: The OVS integration bridge ``patch-tun`` patch port (19) forwards the packet to the OVS tunnel bridge ``patch-int`` patch port (20).
id: OVS integration bridge ``patch-tun`` patch port (19) meneruskan paket ke OVS tunnel bridge ``patch-int`` patch port (20).
tr_tr: OVS entegrasyon köprüsü ``patch-tun`` patch portu (19) paketi OVS tünel köprüsü ``patch-int`` patch portuna (20) iletir.

source: The OVS integration bridge ``patch-tun`` patch port (6) forwards the packet to the OVS tunnel bridge ``patch-int`` patch port (7).
id: OVS integration bridge ``patch-tun`` patch port (6) meneruskan paket ke OVS tunnel bridge ``patch-int`` patch port (7).
tr_tr: OVS entegrasyon köprüsü ``patch-tun`` yama portu (6) paketi OVS tünel köprüsü ``patch-int`` patch portuna (7) iletir.

source: The OVS integration bridge ``patch-tun`` port (10) forwards the packet to the OVS tunnel bridge ``patch-int`` port (11).
id: OVS integration bridge ``patch-tun`` port (10) meneruskan paket ke OVS tunnel bridge ``patch-int`` port (11).
tr_tr: OVS entegrasyon köprüsü ``patch-tun`` bağlantı noktası (10) paketi OVS tünel köprüsü ``patch-int`` bağlantı noktasına (11) iletir.

source: The OVS integration bridge adds an internal VLAN tag to the packet.
id: OVS integration bridge menambahkan tag VLAN internal ke paket.
tr_tr: OVS entegrasyon köprüsü pakete dahili bir VLAN etiketi ekler.

source: The OVS integration bridge adds the internal VLAN tag to the packet.
id: OVS integration bridge menambahkan internal VLAN tag ke paket.
tr_tr: OVS entegrasyon köprüsü pakete dahili VLAN etiketini ekler.

source: The OVS integration bridge exchanges the internal VLAN tag for an internal tunnel ID.
id: OVS integration bridge menukarkan internal VLAN tag ke internal tunnel ID.
tr_tr: OVS entegrasyon köprüsü dahili VLAN etiketi ile dahili bir tünel kimliğini değiştirir.

source: The OVS integration bridge patch port (6) forwards the packet to the OVS tunnel bridge patch port (7).
id: OVS integration bridge patch port (6) meneruskan paket ke OVS tunnel bridge patch port (7).
tr_tr: OVS entegrasyon köprü yama bağlantı noktası (6) paketi OVS tünel köprü yama bağlantı noktasına (7) iletir.

source: The OVS integration bridge port for self-service network 1 (15) removes the internal VLAN tag and forwards the packet to the self-service network 1 interface (16) in the router namespace.
id: OVS integration bridge port untuk jaringan self-service 1 (15) menghapus internal VLAN tag dan meneruskan paket ke jaringan self-service 1 antarmuka (16) dalam namespace router.
tr_tr: Self-servis ağı 1 (15) için OVS entegrasyon köprü portu, dahili VLAN etiketini kaldırır ve paketi yönlendirici ad alanındaki self-servis ağı 1 arabirimine (16) iletir.

source: The OVS integration bridge port for self-service network 1 (6) removes the internal VLAN tag and forwards the packet to the self-service network 1 interface in the distributed router namespace (6).
id: OVS integration bridge port untuk self-service network 1 (6) menghapus internal VLAN tag dan meneruskan paket ke self-service network 1 interface di distributed router namespace (6).
tr_tr: Self servis ağı 1 (6) için OVS entegrasyon köprü portu, dahili VLAN etiketini kaldırır ve paketi dağıtılmış router ad alanında (6) self-servis ağı 1 arabirimine iletir.

source: The OVS integration bridge port for the provider network (6) removes the internal VLAN tag and forwards the packet to the provider network interface (6) in the router namespace.
id: OVS integration bridge port untuk the provider network (6) menghapus internal VLAN tag dan meneruskan paket ke provider network interface (6) dalam router namespace.
tr_tr: Sağlayıcı ağı (6) için OVS entegrasyon köprü portu dahili VLAN etiketini kaldırır ve paketi yönlendirici ad alanındaki sağlayıcı ağ arabirimine (6) iletir.

source: The OVS integration bridge port for the provider network (6) removes the internal VLAN tag and forwards the packet to the provider network interface (7) in the floating IP namespace. This interface responds to any ARP requests for the instance floating IPv4 address.
id: OVS integration bridge port untuk provider network (6) menghapus internal VLAN tagdan meneruskan paket ke provider network interface (7) dalam namespace IP mengambang. Interface ini merespon setiap permintaan ARP untuk alamat IPv4 mengambang instance.
tr_tr: Sağlayıcı ağı (6) için OVS entegrasyon köprü portu, dahili VLAN etiketini kaldırır ve paketi, kayan IP ad alanındaki sağlayıcı ağ arabirimine (7) iletir. Bu arabirim, sunucu yüzen IPv4 adresi için herhangi bir ARP isteğine yanıt verir.

source: The OVS integration bridge port for the self-service network (15) removes the internal VLAN tag and forwards the packet to the self-service network interface (16) in the router namespace.
id: OVS integration bridge port untuk the self-service network (15) menghaps internal VLAN tag dan meneruskan paket ke self-service network interface (16) dalam router namespace.
tr_tr: Self servis ağı (15) için OVS entegrasyon köprü portu, dahili VLAN etiketini kaldırır ve paketi yönlendirici alanındaki self servis ağ arabirimine (16) iletir.

source: The OVS integration bridge removes the internal VLAN tag from the packet.
id: OVS integration bridge menghapus tag VLAN internal dari paket.
tr_tr: OVS entegrasyon köprüsü, dahili VLAN etiketini paketten kaldırır.

source: The OVS integration bridge security group port (12) forwards the packet to the security group bridge OVS port (13) via ``veth`` pair.
id: OVS integration bridge security group port (12) meneruskan paket ke security group bridge OVS port (13) melalui pasangan ``veth``.
tr_tr: OVS entegrasyon köprü güvenlik grubu portu (12), ``veth`` çifti vasıtasıyla paketi güvenlik grubu köprüsü OVS portuna (13) iletir.

source: The OVS integration bridge security group port (15) forwards the packet to the security group bridge OVS port (16) via ``veth`` pair.
id: OVS integration bridge security group port (15) meneruskan paket ke security group bridge OVS port (16) melalui pasangan ``veth``.
tr_tr: OVS entegrasyon köprü güvenlik grubu bağlantı noktası (15) paketi ``veth`` çifti aracılığıyla güvenlik grubu köprüsü OVS bağlantı noktasına (16) iletir.

source: The OVS integration bridge security group port (16) forwards the packet to the security group bridge OVS port (17).
id: OVS integration bridge security group port (16) menerskan paket ke security group bridge OVS port (17).
tr_tr: OVS entegrasyon köprü güvenlik grubu bağlantı noktası (16), paketi güvenlik grubu köprüsü OVS bağlantı noktasına (17) iletir.

source: The OVS integration bridge security group port (19) forwards the packet to the security group bridge OVS port (20) via ``veth`` pair.
id: OVS integration bridge security group port (19) meneruskan paket ke the security group bridge OVS port (20) melalui pasangan ``veth``.
tr_tr: OVS entegrasyon köprü güvenlik grubu portu (19) paketi ``veth`` çifti ile güvenlik grubu köprüsü OVS portuna (20) iletir.

source: The OVS integration bridge security group port (20) removes the internal VLAN tag and forwards the packet to the security group bridge OVS port (21).
id: OVS integration bridge security group port (20) menghapus internal VLAN tag dan meneruskan paket ke security group bridge OVS port (21).
tr_tr: OVS integrasyon köprü güvenlik grup bağlantı noktası (20) dahili VLAN etiketini kaldırır ve paketi güvenlik grup köprüsü OVS bağlantı noktasına (21) iletir.

source: The OVS integration bridge security group port (28) forwards the packet to the security group bridge OVS port (29) via ``veth`` pair.
id: OVS integration bridge security group port (28) meneruskan paket ke security group bridge OVS port (29) melalui pasangan ``veth``.
tr_tr: OVS entegrasyon köprü güvenlik grubu bağlantı noktasına (28) ``veth`` çifti vasıtasıyla paketi güvenlik grubu köprüsü OVS bağlantı noktasına (29) iletir.

source: The OVS integration bridge swaps the actual VLAN tag 101 with the internal VLAN tag.
id: OVS integration bridge menukar (swap) actual VLAN tag 101 dengan internal VLAN tag.
tr_tr: OVS entegrasyon köprüsü, gerçek VLAN 101 etiketini dahili VLAN etiketi ile değiştirir.

source: The OVS integration bridge swaps the actual VLAN tag 102 with the internal VLAN tag.
id: OVS integration bridge menukar (swap) actual VLAN tag 102 dengan internal VLAN tag.
tr_tr: OVS entegrasyon köprüsü gerçek VLAN 102 etiketini dahili VLAN etiketi ile değiştirir.

source: The OVS provider bridge ``phy-br-provider`` patch port (14) forwards the packet to the OVS integration bridge ``int-br-provider`` patch port (15).
id: OVS provider bridge ``phy-br-provider`` patch port (14) meneruskan paket ke OVS integration bridge ``int-br-provider`` patch port (15).
tr_tr: OVS sağlayıcı köprüsü ``phy-br-provider`` yama bağlantı noktası (14) paketi OVS entegrasyon köprüsü ``int-br-provider`` yama bağlantı noktasına (15) iletir.

source: The OVS provider bridge ``phy-br-provider`` patch port (18) forwards the packet to the OVS integration bridge ``int-br-provider`` patch port (19).
id: OVS provider bridge ``phy-br-provider`` patch port (18) meneruskan paket ke OVS integration bridge ``int-br-provider`` patch port (19).
tr_tr: OVS sağlayıcı köprü ``phy-br-provider`` yama bağlantı noktası (18) paketi OVS entegrasyon köprüsü ``int-br-provider`` yama bağlantı noktasına (19) iletir.

source: The OVS provider bridge ``phy-br-provider`` port (4) forwards the packet to the OVS integration bridge ``int-br-provider`` port (5).
id: OVS provider bridge ``phy-br-provider`` port (4) meneruskan paket ke OVS integration bridge ``int-br-provider`` port (5).
tr_tr: OVS sağlayıcı köprüsü ``phy-br-provider`` portu (4) paketi OVS entegrasyon köprüsü ``int-br-provider`` portuna iletir (5).

source: The OVS provider bridge provider network port (21) forwards the packet to the physical network interface (22).
id: OVS provider bridge provider network port (21) meneruskan paket ke physical network interface (22).
tr_tr: OVS sağlayıcı köprü sağlayıcı ağ bağlantı noktası (21) paketi fiziksel ağ arabirimine (22) iletir.

source: The OVS provider bridge provider network port (8) forwards the packet to the physical network interface (9).
id: OVS provider bridge provider network port (8) meneruskan paket ke physical network interface (9).
tr_tr: OVS sağlayıcısı köprü sağlayıcısı ağ bağlantı noktası (8) paketi fiziksel ağ arabirimine iletir (9).

source: The OVS provider bridge swaps actual VLAN tag 101 with the internal VLAN tag.
id: OVS provider bridge menukar actual VLAN tag 101 dengan internal VLAN tag.
tr_tr: OVS sağlayıcı köprüsü, gerçek VLAN etiketi 101'i dahili VLAN etiketi ile değiştirir.

source: The OVS provider bridge swaps the internal VLAN tag with actual VLAN tag 101.
id: OVS provider bridge menukar (swap) VLAN tag dengan actual VLAN tag 101.
tr_tr: OVS sağlayıcı köprüsü, dahili VLAN etiketini gerçek VLAN etiketi 101 ile değiştirir.

source: The OVS tunnel bridge (12) wraps the packet using VNI 101.
id: OVS tunnel bridge (12) membungkus paket menggunakan VNI 101.
tr_tr: OVS tünel köprüsü (12), VNI 101'i kullanarak paketi sarar.

source: The OVS tunnel bridge (21) wraps the packet using VNI 102.
id: OVS tunnel bridge (21) membungkus paket menggunakan VNI 102.
tr_tr: OVS tünel köprüsü (21), VNI 102'yi kullanarak paketi sarar.

source: The OVS tunnel bridge (8) wraps the packet using VNI 101.
id: OVS tunnel bridge (8) membungkus (wrap) paket menggunakan VNI 101.
tr_tr: OVS tünel köprüsü (8) VNI 101'i kullanarak paketi sarmalar.

source: The OVS tunnel bridge ``patch-int`` patch port (13) forwards the packet to the OVS integration bridge ``patch-tun`` patch port (14).
id: OVS tunnel bridge ``patch-int`` patch port (13) meneruskan paket ke OVS integration bridge ``patch-tun`` patch port (14).
tr_tr: OVS tünel köprüsü ``patch-int`` yama bağlantı noktası (13) paketi OVS entegrasyon köprüsü ``patch-tun`` yama bağlantı noktasına (14) iletir.

source: The OVS tunnel bridge ``patch-int`` patch port (17) forwards the packet to the OVS integration bridge ``patch-tun`` patch port (18).
id: OVS tunnel bridge ``patch-int`` patch port (17) meneruskan paket ke OVS integration bridge ``patch-tun`` patch port (18).
tr_tr: OVS tünel köprüsü ``patch-int`` yama portu (17) paketi OVS entegrasyon köprüsü ``patch-tun`` yama portuna (18) iletir.

source: The OVS tunnel bridge ``patch-int`` patch port (26) forwards the packet to the OVS integration bridge ``patch-tun`` patch port (27).
tr_tr: OVS tünel köprüsü ``patch-int`` yama portu (26), paketi OVS entegrasyon köprüsü ``patch-tun`` yama portuna (27) iletir.

source: The OVS tunnel bridge exchanges the internal tunnel ID for an internal VLAN tag.
id: OVS tunnel bridge menukar internal tunnel ID dengan internal VLAN tag.
tr_tr: OVS tünel köprüsü dahili bir VLAN etiketi için dahili tünel kimliğini değiştirir.

source: The OVS tunnel bridge patch port (13) forwards the packet to the OVS integration bridge patch port (14).
id: OVS tunnel bridge patch port (13) meneruskan paket ke OVS integration bridge patch port (14).
tr_tr: OVS tünel köprüsü yama portu (13) paketi OVS entegrasyon köprüsü yama portuna (14) iletir.

source: The OVS tunnel bridge unwraps the packet and adds an internal tunnel ID to it.
id: OVS tunnel bridge membuka paket dan menambahkan internal tunnel IDuntuk paket itu.
tr_tr: OVS tünel köprüsü paketi açar ve ona bir dahili tünel kimliği ekler.

source: The Open vSwitch (OVS) mechanism driver uses a combination of OVS and Linux bridges as interconnection devices. However, optionally enabling the OVS native implementation of security groups removes the dependency on Linux bridges.
id: Driver mekanisme Open vSwitch (OVS) menggunakan kombinasi OVS dan Linux bridge sebagai perangkat interkoneksi. Namun, secara opsional pengaktifan OVS native implementation of security group menghilangkan ketergantungan pada Linux bridge.
tr_tr: Open vSwitch (OVS) mekanizması sürücüsü, arabağlantı aygıtları olarak OVS ve Linux köprülerinin bir kombinasyonunu kullanır. Bununla birlikte, opsiyonel olarak güvenlik gruplarının OVS yerli uygulamasını etkinleştirmek, Linux köprülerindeki bağımlılığı ortadan kaldırır.

source: The Open vSwitch agent configures the Open vSwitch to realize L2 networks for OpenStack resources.
id: Agen Open vSwitch mengkonfigurasi Open vSwitch untuk mewujudkan jaringan L2 untuk sumber daya OpenStack.
tr_tr: Open vSwitch aracı Open vSwitch'i OpenStack kaynakları için L2 ağları gerçekleştirmek üzere yapılandırır.

source: The OpenStack :term:`Networking service <Networking service (neutron)>` provides an API that allows users to set up and define network connectivity and addressing in the cloud. The project code-name for Networking services is neutron. OpenStack Networking handles the creation and management of a virtual networking infrastructure, including networks, switches, subnets, and routers for devices managed by the OpenStack Compute service (nova). Advanced services such as firewalls or :term:`virtual private networks (VPNs) <virtual private network (VPN)>` can also be used.
id: OpenStack :term:`Networking service <Networking service (neutron)>` menyediakan API yang mengizinkan pengguna untuk mengatur dan menentukan konektivitas jaringan dan menanganinya di cloud. Code-name proyek untuk layanan Networking adalah neutron. OpenStack Networking menangani pembuatan dan pengelolaan infrastruktur jaringan virtual, termasuk jaringan, switch, subnet, dan router untuk perangkat yang dikelola oleh layanan OpenStack Compute (nova). Layanan canggih seperti firewall atau :term:`virtual private networks (VPNs) <virtual private network (VPN)>` juga dapat digunakan.
tr_tr: OpenStack :term:`Ağ hizmeti <Networking service (neutron)>` kullanıcıların bulutta ağ bağlantısını ve adreslemeyi kurmalarını ve tanımlamalarını sağlayan bir API sağlar. Ağ hizmetlerinin proje kod adı, neutron'dur. OpenStack Ağ, ağlar, anahtarlar, alt ağlar ve OpenStack Hesaplama hizmeti (nova) tarafından yönetilen aygıtlar için yönlendiriciler de dahil olmak üzere sanal bir ağ altyapısının oluşturulmasını ve yönetilmesini yönetir. Güvenlik duvarları veya :term:`sanal özel ağlar (VPNs) <virtual private network (VPN)>` gibi gelişmiş hizmetler de kullanılabilir.

source: The OpenStack Networking API includes support for Layer 2 networking and :term:`IP address management (IPAM) <IP Address Management (IPAM)>`, as well as an extension for a Layer 3 router construct that enables routing between Layer 2 networks and gateways to external networks. OpenStack Networking includes a growing list of plug-ins that enable interoperability with various commercial and open source network technologies, including routers, switches, virtual switches and software-defined networking (SDN) controllers.
id: OpenStack Networking API meliputi dukungan untuk Layer 2 networking dan :term:`IP address management (IPAM) <IP Address Management (IPAM)>`, serta ekstensi konstruksi untuk Layer 3 router yang mengaktifkan routing diantara Layer 2 networks dan gateway ke jaringan eksternal. OpenStack Networking meliputi daftar tumbuh plug-in yang mengaktifkan interoperabilitas dengan berbagai teknologi jaringan komersial dan open source, termasuk router, switch, switch virtual dan software-defined networking (SDN) controller.
tr_tr: OpenStack Ağ API'si, Katman 2 ağları ve harici ağ geçitleri arasında yönlendirmeyi etkin kılan Katman 3 yönlendirici yapısı için bir uzantı sağladığı gibi Katman 2 ağ ve :term:`IP adres yönetimi (IPAM) <IP Address Management (IPAM)>` desteğini de içerir. OpenStack Ağ, yönlendiriciler, anahtarlar, sanal anahtarlar ve yazılım tanımlı ağ iletişimi (SDN) denetleyicileri gibi çeşitli ticari ve açık kaynak ağ teknolojileri ile birlikte çalışılmasını sağlayan eklentilerin giderek artan bir listesini içerir.

source: The OpenStack Networking service is extensible. Extensions serve two purposes: they allow the introduction of new features in the API without requiring a version change and they allow the introduction of vendor specific niche functionality. Applications can programmatically list available extensions by performing a GET on the :code:`/extensions` URI. Note that this is a versioned request; that is, an extension available in one API version might not be available in another.
id: Layanan OpenStack Networking adalah extensible. Ekstensi melayani dua tujuan: mereka mengizinkan pengenalan fitur baru di API tanpa memerlukan perubahan versi dan mereka mengizinkan pengenalan niche spesifik vendor secara fungsional. Aplikasi secara pemrograman bisa mendaftar ekstensi yang tersedia dengan melakukan GET pada :code:`/extensions` URI. Catatan bahwa ini adalah permintaan berversi; yaitu, extension tersedia dalam suatu versi API mungkin tidak tersedia di versi lain.
tr_tr: OpenStack Ağ servisi genişletilebilir. Uzantılar iki amaca hizmet eder: bir sürüm değişikliği yapmadan yeni özelliklerin API'ye girmesine izin veriyorlar ve satıcıya özgü niş işlevselliğinin kullanılmasına izin veriyorlar. Uygulamalar, :code:`/extensions` URI'sinde bir GET gerçekleştirerek kullanılabilir uzantıları programlı olarak listeleyebilir. Bunun bir sürümlü istek olduğunu unutmayın; diğer bir deyişle, bir API sürümünde kullanılabilen bir uzantı başka bir yerde kullanılamayabilir.

source: The PTR records will be created in zones owned by a project with admin privileges. See :ref:`config-dns-int-ext-serv` for more details.
id: Catatan PTR akan dibuat di zona yang dimiliki oleh sebuah proyek dengan hak admin. Lihat :ref: `config-dns-int-ext-serv` untuk lebih jelasnya.
tr_tr: PTR kayıtları, yönetici ayrıcalıklarına sahip bir projenin sahip olduğu bölgelerde oluşturulacaktır. Daha fazla ayrıntı için bakınız :ref:`config-dns-int-ext-serv`.

source: The QoS implementation requires a burst value to ensure proper behavior of bandwidth limit rules in the Open vSwitch and Linux bridge agents. If you do not provide a value, it defaults to 80% of the bandwidth limit which works for typical TCP traffic.
id: Pelaksanaan QoS memerlukan burst value untuk memastikan perilaku yang tepat dari aturan batas bandwidth dalam agen Open vSwitch dan Linux bridge. Jika Anda tidak memberikan nilai, standarnya ke 80% dari batas bandwidth yang bekerja untuk lalu lintas TCP tipikal.
tr_tr: QoS uygulaması, Open vSwitch ve Linux köprü ajanlarında bant genişliği sınır kurallarının uygun davranışından emin olmak için bir patlama değeri gerektirir. Bir değer vermezseniz, tipik bir TCP trafiği için çalışan bant genişliği sınırının % 80'ine varsayılan olarak ayarlanır.
