Repository: 25hours/openstack-manuals
Catalog: doc/networking-guide/source/locale/*/LC_MESSAGES/networking-guide.po
Languages: id, tr_tr

source: With IPv4, the default_quota can be set to the number of absolute addresses any given project is allowed to consume from the pool. For example, with a quota of 128, I might get 203.0.113.128/26, 203.0.113.224/28, and still have room to allocate 48 more addresses in the future.
id: Dengan IPv4, default_quota yang dapat diatur untuk jumlah alamat absolut setiap proyek yang diberikan diperbolehkan untuk mengkonsumsi dari kolam. Misalnya, dengan kuota 128, saya mungkin akan mendapatkan 203.0.113.128/26, 203.0.113.224/28, dan masih memiliki ruang untuk mengalokasikan 48 alamat lebih di masa depan.
tr_tr: IPv4 ile default_quota, belirli bir projenin havuzdan tüketmesine izin verilen mutlak adres sayısına ayarlanabilir. Örneğin, 128 kotasıyla 203.0.113.128/26, 203.0.113.224/28 alabilir ve gelecekte 48 daha fazla adres tahsis etme imkânı kalır.

source: With IPv6 it is a little different. It is not practical to count individual addresses. To avoid ridiculously large numbers, the quota is expressed in the number of /64 subnets which can be allocated. For example, with a default_quota of 3, I might get 2001:db8:c18e:c05a::/64, 2001:db8:221c:8ef3::/64, and still have room to allocate one more prefix in the future.
id: Dengan IPv6 itu adalah sedikit berbeda. Hal ini tidak praktis untuk menghitung alamat individu. Untuk menghindari nomor besar yang tidak masuk akal, kuota dinyatakan dalam jumlah /64 subnet yang dapat dialokasikan. Misalnya, dengan default_quota dari 3, saya bisa mendapatkan 2001:db8:c18e:c05a::/64, 2001:db8:221c:8ef3::/64, dan masih memiliki ruang untuk mengalokasikan satu awalan (prefix) lebih di masa depan.
tr_tr: IPv6 ile biraz farklıdır. Bireysel adresleri saymak pratik değildir. Gülünç derecede büyük sayılardan kaçınmak için, kota tahsis edilebilen /64 alt ağacın sayısıyla ifade edilir. Örneğin, default_quota değeri 3 olan ben 2001:db8:c18e:c05a::/64, 2001:db8:221c:8ef3::/64 alabilirim ve yine de gelecekte bir önek daha ayırmak için yerim var.

source: With subnet pools, all addresses in use within the address scope are unique from the point of view of the address scope owner. Therefore, add more than one subnet pool to an address scope if the pools have different owners, allowing for delegation of parts of the address scope. Delegation prevents address overlap across the whole scope. Otherwise, you receive an error if two pools have the same address ranges.
id: Dengan kolam subnet, semua alamat digunakan dalam lingkup alamat menjadi unik dari sudut pandang pemilik lingkup alamat. Oleh karena itu, tambahkan lebih dari satu subnet kolam untuk lingkup alamat jika kolam memiliki pemilik yang berbeda, yang memungkinkan untuk pendelegasian bagian dari lingkup alamat. Delegasi mencegah alamat tumpang tindih di seluruh lingkup. Jika tidak, Anda menerima pesan kesalahan jika dua kolam memiliki rentang alamat yang sama.
tr_tr: Alt ağ havuzlarıyla, adres alanı içinde kullanılan tüm adresler, adres alanı sahibi açısından farklıdır. Bu nedenle, havuzların farklı adrese sahip olması ve adres alanının bölümlerinin temsilciliğine izin vermesi durumunda, adres alanına birden fazla alt ağ havuzu ekleyin. Delegasyon, tüm alan boyunca adres çakışmasını engeller. Aksi takdirde, iki havuzun aynı adres aralıklarına sahip olması durumunda bir hata mesajı alırsınız.

source: With subnets, the resource is the IP address space. Some subnets take more of it than others. For example, 203.0.113.0/24 uses 256 addresses in one subnet but 198.51.100.224/28 uses only 16. If address space is limited, the quota system can encourage efficient use of the space.
id: Dengan subnet, sumber daya adalah ruang alamat IP. Beberapa subnet mengambil lebih banyak daripada lainnya. Misalnya, 203.0.113.0/24 menggunakan 256 alamat dalam satu subnet tetapi 198.51.100.224/28 hanya menggunakan 16. Jika ruang alamat terbatas, sistem kuota dapat mendorong efisiensi penggunaan ruang.
tr_tr: Alt ağlarla, kaynak, IP adresi alanıdır. Bazı alt ağlar diğerlerinden daha fazla alır. Örneğin, 203.0.113.0/24 bir alt ağda 256 adres kullanıyor ancak 198.51.100.224/28 yalnızca 16 kullanıyor. Adres alanı sınırlıysa, kota sistemi alanın verimli kullanılmasını teşvik edebilir.

source: With the load balancer online, you can add a listener for plaintext HTTP traffic on port 80:
id: Dengan load balancer online, Anda dapat menambahkan pendengar untuk lalu lintas HTTP plaintext pada port 80:
tr_tr: Yük dengeleyici çevrimiçi olduğunda, bağlantı noktası 80'de düz metin HTTP trafiği için bir dinleyici ekleyebilirsiniz:

source: Within a network, use a unique physical network name for each segment which enables reuse of the same segmentation details between subnets. For example, using the same VLAN ID across all segments of a particular provider network. Similar to conventional provider networks, the operator must provision the layer-2 physical network infrastructure accordingly.
id: Dalam jaringan, gunakan nama jaringan fisik yang unik untuk setiap segmen yang mengaktifkan penggunaan kembali rincian segmentasi yang sama antara subnet. Misalnya, penggunaan VLAN ID yang sama di semua segmen dari jaringan operator tertentu. Serupa dengan jaringan penyedia konvensional, operator harus menyediakan infrastruktur jaringan fisik lapisan-2 yang sesuai.
tr_tr: Bir ağ içinde, alt segmentler arasında aynı bölümlendirme ayrıntılarının tekrar kullanılmasını sağlayan her segment için benzersiz bir fiziksel ağ adı kullanın. Örneğin, belirli bir sağlayıcı ağının tüm kesimlerinde aynı VLAN kimliği kullanılarak. Geleneksel sağlayıcı ağlarına benzer şekilde, operatör katman-2 fiziksel ağ altyapısını buna göre hazırlamalıdır.

source: Workflow
id: Workflow (alur kerja)
tr_tr: İş Akışı

source: YES
tr_tr: EVET

source: Yes
tr_tr: Evet

source: You can add a health monitor so that unresponsive servers are removed from the pool:
id: Anda dapat menambahkan monitor kesehatan sehingga server yang tidak responsif dapat dikeluarkan dari kolam:
tr_tr: Yanıt vermeyen sunucular havuzdan kaldırılacak şekilde bir sağlık monitörü ekleyebilirsiniz:

source: You can add another listener on port 443 for HTTPS traffic. LBaaS v2 offers SSL/TLS termination at the load balancer, but this example takes a simpler approach and allows encrypted connections to terminate at each member server.
id: Anda dapat menambahkan pendengar lain pada port 443 untuk lalu lintas HTTPS. LBaaS v2 menawarkan terminasi SSL/TLS pada penyeimbang beban, tapi contoh ini mengambil pendekatan yang lebih sederhana dan memungkinkan koneksi terenkripsi untuk mengakhiri di setiap server anggota.
tr_tr: HTTPS trafiği için 443 bağlantı noktası üzerine başka bir dinleyici ekleyebilirsiniz. LBaaS v2, yük dengeleyicide SSL/TLS bitimi sunar, ama bu örnek benzer bir yaklaşım alır ve şifrelenmiş bağlantının her bir üye sunucuda sonlanmasına olanak sağlar.

source: You can add this mechanism driver to an existing environment using either the Linux bridge or OVS mechanism drivers with only provider networks or provider and self-service networks. You can change the configuration of existing compute nodes or add compute nodes with the Macvtap mechanism driver. The example configuration assumes addition of compute nodes with the Macvtap mechanism driver to the :ref:`deploy-lb-selfservice` or :ref:`deploy-ovs-selfservice` deployment examples.
id: Anda dapat menambahkan driver mekanisme ini untuk lingkungan yang ada menggunakan jembatan Linux ataupun driver mekanisme OVS dengan hanya jaringan provider atau jaringan provider dan jaringan self-service. Anda dapat mengubah konfigurasi node komputasi yang ada atau menambahkan node komputasi dengan driver mekanisme Macvtap. Contoh konfigurasi mengasumsikan penambahan node komputasi dengan driver mekanisme Macvtap ke contoh pengerahan :ref:`deploy-lb-selfservice` atau :ref:`deploy-ovs-selfservice` .
tr_tr: Bu mekanizma sürücüsünü yalnızca sağlayıcı ağlarıyla veya sağlayıcı ve self-servis hizmet ağlarıyla Linux köprü veya OVS mekanizma sürücülerini kullanarak mevcut bir ortama ekleyebilirsiniz. Var olan hesaplama düğümlerinin yapılandırmasını değiştirebilir veya Macvtap mekanizma sürücüsüyle hesaplama düğümleri ekleyebilirsiniz. Örnek yapılandırmada, :ref:`deploy-lb-selfservice` veya :ref:`deploy-ovs-selfservice` dağıtım örneklerine Macvtap mekanizma sürücüsü ile hesaplama düğümleri eklenmesi varsayılmaktadır.

source: You can adjust quotas using the :command:`neutron quota-update` command:
id: Anda dapat mengatur kuota menggunakan perintah :command:`neutron quota-update`
tr_tr: Kotaları :command:`neutron quota-update` komutunu kullanarak ayarlayabilirsiniz:

source: You can also add a health monitor for the HTTPS pool:
id: Anda juga dapat menambahkan monitor kesehatan untuk HTTPS pool:
tr_tr: HTTPS havuzu için sağlık durumu izleyicisi de ekleyebilirsiniz:

source: You can also identify floating IP agent gateways in your environment to assist with verifying operation of the BGP speaker.
id: Anda juga dapat mengidentifikasi agent gateway IP mengambang di lingkungan Anda untuk membantu memverifikasi operasi BGP speaker.
tr_tr: BGP yayıncının çalışıp çalışmadığını doğrulamak için çevrenizdeki yüzen IP aracı ağ geçitlerini de tanımlayabilirsiniz.

source: You can also include minimum bandwidth rules in your policy:
tr_tr: Ayrıca politikanızda en küçük bant genişliği kurallarını kapsayabilirsiniz:

source: You can attach networks to a QoS policy. The meaning of this is that any compute port connected to the network will use the network policy by default unless the port has a specific policy attached to it. Network owned ports like DHCP and router ports are excluded from network policy application.
tr_tr: Bir QoS politikasına ağ bağlayabilirsiniz. Bunun anlamı, ağa bağlı herhangi bir hesaplama bağlantı noktasına, bağlantı noktasına bağlı belirli bir politika olmadığı sürece varsayılan olarak ağ politikasını kullanmasıdır. DHCP ve yönlendirici bağlantı noktaları gibi ağa ait bağlantı noktaları, ağ ilkesi uygulamasından çıkarılır.

source: You can begin building a pool and adding members to the pool to serve HTTP content on port 80. For this example, the web servers are ``192.0.2.16`` and ``192.0.2.17``:
tr_tr: Bir havuz inşa etmeye ve port 80'de HTTP içeriği sunmak için havuza üye eklemeye başlayabilirsiniz. Bu örnek için, web sunucuları ``192.0.2.16`` ve ``192.0.2.17`` dir:

source: You can control the default number of DHCP agents assigned to a network by setting the following configuration option in the file ``/etc/neutron/neutron.conf``.
id: Anda dapat mengontrol jumlah default agen DHCP yang ditugaskan ke jaringan dengan menetapkan pilihan konfigurasi berikut di file ``/etc/neutron/neutron.conf``.
tr_tr: Aşağıdaki yapılandırma seçeneğini ``/etc/neutron/neutron.conf`` dosyasında belirleyerek bir ağa atanmış varsayılan DHCP ajanlarının sayısını kontrol edebilirsiniz.

source: You can create a firewall policy without any rules and add rules later, as follows:
id: Anda dapat membuat kebijakan firewall tanpa aturan dan menambahkan aturan kemudian, sebagai berikut:
tr_tr: Herhangi bir kural olmadan bir güvenlik duvarı ilkesi oluşturabilir ve daha sonra aşağıdaki gibi kurallar ekleyebilirsiniz:

source: You can create, update, list, delete, and show DSCP markings with the neutron client:
id: Anda dapat membuat, memperbarui, mendaftar, menghapus, dan menunjukkan DSCP marking dengan klien neutron:
tr_tr: Neutron istemcisi ile DSCP işaretlerini oluşturabilir, güncelleyebilir, listeleyebilir, silebilir ve görüntüleyebilirsiniz:

source: You can determine the maximum number of VFs a PF can support:
tr_tr: Bir PF'nin destekleyebileceği maksimum VF sayısını belirleyebilirsiniz:

source: You can disable security groups including basic and anti-spoofing rules by setting the port attribute ``port_security_enabled`` to ``False``.
id: Anda dapat menonaktifkan kelompok keamanan termasuk aturan dasar dan anti-spoofing dengan menetapkan atribut port ``port_security_enabled`` ke ``False``.
tr_tr: ``port_security_enabled`` bağlantı noktasını ``False`` olarak ayarlayarak, temel ve anti-spoofing kurallarını içeren güvenlik gruplarını devre dışı bırakabilirsiniz.

source: You can initiate an ARP request manually using the :command:`arping` command. For example, to send an ARP request to IP address ``10.30.0.132``:
id: Anda dapat melakukan permintaan ARP secara manual menggunakan perintah :command:`arping` . Misalnya, untuk mengirim permintaan ARP untuk alamat IP ``10.30.0.132``:
tr_tr: :command:`arping` komutunu kullanarak el ile bir ARP isteği başlatabilirsiniz. Örneğin, ``10.30.0.132`` IP adresine bir ARP isteği göndermek için:

source: You can keep the DHCP and metadata agents on each compute node or move them to the network node.
id: Anda dapat menjaga agen DHCP dan metadata pada setiap node komputasi atau memindahkan mereka ke node jaringan.
tr_tr: DHCP ve meta veri aracısını her hesaplama düğümünde tutabilir veya ağ düğümüne taşıyabilirsiniz.

source: You can keep the DHCP and metadata agents on each compute node or move them to the network nodes.
id: Anda dapat menjaga DHCP dan agen metadata pada setiap node komputasi atau memindahkannya ke node jaringan.
tr_tr: DHCP ve meta veri aracısını her hesaplama düğümünde tutabilir veya ağ düğümlerine taşıyabilirsiniz.

source: You can modify or delete this policy with the same constraints as any other RBAC ``access_as_external`` policy.
id: Anda dapat mengubah atau menghapus kebijakan ini dengan kendala yang sama seperti kebijakan ``access_as_external`` RBAC lainnya.
tr_tr: Bu politikayı diğer RBAC ``access_as_external`` politikasıyla aynı kısıtlamaları kullanarak değiştirebilir veya silebilirsiniz.

source: You can modify rules at runtime. Rule modifications will be propagated to any attached port.
id: Anda dapat memodifikasi aturan pada saat runtime. Modifikasi aturan akan disebarkan ke port yang terpasang.
tr_tr: Çalışma zamanında kuralları değiştirebilirsiniz. Kural değişiklikleri, ekli herhangi bir bağlantı noktasına aktarılır.

source: You can now ping ``instance2`` directly because ``instance2`` shares the same address scope as the external network:
id: Anda sekarang dapat ping ``instance2`` langsung karena share ``instance2`` lingkup alamat sama dengan jaringan eksternal:
tr_tr: Şimdi ``instance2``ye doğrudan ping atabilirsiniz çünkü ``instance2`` harici ağ ile aynı adres alanını paylaşır:

source: You can repeat the ``--flow-classifier`` option to specify multiple flow classifiers for a port chain. Each flow classifier identifies a flow.
id: Anda dapat mengulangi ``opsi --flow-classifier`` untuk menentukan beberapa pengklasifikasi aliran untuk rantai port. Setiap klassifier aliran mengidentifikasi aliran.
tr_tr: Bir bağlantı noktası zinciri için birden fazla akış sınıflandırıcı belirtmek için ``--flow-classifier`` seçeneğini tekrarlayabilirsiniz. Her akış sınıflandırıcısı bir akış tanımlar.

source: You can repeat the ``--port-pair-group`` option to specify additional port pair groups in the port chain. A port chain must contain at least one port pair group.
id: Anda dapat mengulangi opsi ``--port-pair-group`` untuk menentukan tambahan kelompok pasangan port dalam rantai port. Sebuah rantai port harus mengandung setidaknya satu kelompok pasangan port.
tr_tr: Bağlantı noktası zincirinde ek bağlantı noktası çifti grupları belirtmek için ``--port-pair-group`` seçeneğini tekrarlayabilirsiniz. Bir bağlantı zinciri, en az bir bağlantı noktası çifti grubu içermelidir.

source: You can repeat the ``--port-pair`` option for multiple port pairs of functionally equivalent service functions.
id: Anda dapat mengulangi opsi ``--port-pair`` untuk beberapa pasang port fungsi layanan setara secara fungsional.
tr_tr: İşlevsel olarak eşdeğer servis fonksiyonlarının çoklu bağlantı noktası çiftleri için ``--port-pair`` seçeneğini tekrarlayabilirsiniz.

source: You can request a specific subnet from the pool. You need to specify a subnet that falls within the pool's prefixes. If the subnet is not already allocated, the request succeeds. You can leave off the IP version because it is deduced from the subnet pool.
id: Anda dapat meminta subnet dari kolam. Anda perlu menentukan subnet yang termasuk dalam awalan (prefix) kolam ini. Jika subnet tersebut belum dialokasikan, permintaan berhasil. Anda dapat meninggalkan versi IP karena disimpulkan dari subnet kolam.
tr_tr: Havuzdan belirli bir alt ağ isteyebilirsiniz. Havuzun öneklerine giren bir alt ağ belirtmeniz gerekir. Alt ağ önceden ayrılmış değilse, istek başarılı olur. IP versiyonunu, alt ağ havuzundan çıkarsa bırakabilirsiniz.

source: You can see that only the DHCP agent for HostB is hosting the ``net2`` network.
id: Anda dapat melihat bahwa hanya agen DHCP untuk HostB menjadi host jaringan ``net2``.
tr_tr: HostB için yalnızca DHCP ajanının ``net2`` ağını barındırdığını görebilirsiniz.

source: You can trigger MTU recalculation for existing networks by changing the MTU configuration and restarting the ``neutron-server`` service. However, propagating MTU calculations to the data plane may require users to delete and recreate ports on the network.
id: Anda dapat mencetuskan (trigger) perhitungan kembali MTU untuk jaringan yang ada dengan mengubah konfigurasi MTU dan restart layanan ``neutron-server``. Namun, pengerahan perhitungan MTU terhadap data plane mungkin mengharuskan pengguna untuk menghapus dan menciptakan port pada jaringan.
tr_tr: MTU yapılandırmasını değiştirerek ve ``neutron-server`` hizmetini yeniden başlatarak mevcut ağlar için MTU yeniden hesaplamasını tetikleyebilirsin. Bununla birlikte, MTU hesaplamalarını veri düzlemine yaymak, kullanıcıların ağdaki bağlantı noktalarını silmelerini ve yeniden oluşturmalarını gerektirebilir.

source: You can use ``curl`` to verify connectivity through the load balancers to your web servers:
id: Anda dapat menggunakan ``curl`` untuk memverifikasi konektivitas melalui load balancers ke server web Anda:
tr_tr: Yük dengeleyicileri aracılığıyla web sunucularınıza olan bağlantıyı doğrulamak için ``curl`` komutunu kullanabilirsiniz:

source: You can use the :command:`neutron lbaas-loadbalancer-show` command from the beginning of this section to locate the ``vip_port_id``. The ``vip_port_id`` is the ID of the network port that is assigned to the load balancer. You can associate a free floating IP address to the load balancer using :command:`neutron floatingip-associate`:
id: Anda dapat menggunakan perintah :command:`neutron lbaas-loadbalancer-show` dari awal bagian ini untuk menemukan ``vip_port_id``. ``vip_port_id`` adalah ID dari port jaringan yang ditugaskan untuk penyeimbang beban. Anda dapat mengaitkan alamat IP mengambang bebas untuk penyeimbang beban menggunakan :command:`neutron floatingip-associate`:
tr_tr: ``vip_port_id``i bulmak için bu bölümün başından itibaren :command:`neutron lbaas-loadbalancer-show` komutunu kullanabilirsiniz. ``vip_port_id``, yük dengeleyicisine atanan ağ bağlantı noktasının kimliğidir. Yük dengeleyicisine, serbest kayan bir IP adresini :command:`neutron floatingip-associate` komutunu kullanarak ilişkilendirebilirsiniz:

source: You can view the load balancer status and IP address with the :command:`neutron lbaas-loadbalancer-show` command:
id: Anda dapat melihat status penyeimbang beban dan alamat IP dengan perintah :command:`neutron lbaas-loadbalancer-show`:
tr_tr: Yük dengeleyici durumunu ve IP adresini şu komutu kullanarak görüntüleyebilirsiniz :command:`neutron lbaas-loadbalancer-show`:

source: You can virtualize these nodes for demonstration, training, or proof-of-concept purposes. However, you must use physical hosts for evaluation of performance or scaling.
id: Anda dapat virtualisasi node ini untuk demonstrasi, pelatihan, atau tujuan proof-of-concept. Namun, Anda harus menggunakan host fisik untuk evaluasi kinerja atau scaling (pembesaran).
tr_tr: Bu düğümleri gösteri, eğitim veya konsept ispat amacıyla sanal haline getirebilirsiniz. Bununla birlikte, performansın veya ölçeklemenin değerlendirilmesi için fiziksel ana makineler kullanmanız gerekir.

source: You cannot ping ``instance1`` directly because the address scopes do not match:
id: Anda tidak bisa ping langsung ``instance1`` karena lingkup alamat tidak cocok:
tr_tr: Doğrudan ``instance1``'ye ping atamazsınız çünkü adres alanı eşleşmedi:

source: You may change them to work with your particular network infrastructure.
id: Anda dapat mengubah mereka untuk bekerja dengan infrastruktur jaringan tertentu.
tr_tr: Belirli ağ altyapınızla çalışacak şekilde değiştirebilirsiniz.

source: You must configure this option for all eligible DHCP agents and restart them to activate the values.
id: Anda harus mengkonfigurasi opsi ini untuk semua agen DHCP yang memenuhi syarat dan restart mereka untuk mengaktifkan nilai.
tr_tr: Bu seçeneği tüm uygun DHCP ajanları için yapılandırmanız ve değerleri etkinleştirmek için yeniden başlatmanız gerekir.

source: \* A firewall group can be applied to all ports on a given router in order to effect this.
id: \* Sekelompok firewall dapat diterapkan ke semua port pada router yang diberikan supaya efek ini.
tr_tr: \* Bunu yapmak için belirli bir yönlendirici üzerindeki tüm bağlantı noktalarına bir güvenlik duvarı grubu uygulanabilir.

source: \*\* This feature is planned for Ocata.
id: \*\* Fitur ini direncanakan untuk Ocata.
tr_tr: \*\* Bu özellik Ocata için planlanıyor.

source: `Basic Load-Balancer-as-a-Service operations <https://docs.openstack.org/admin-guide/networking-adv-features.html#basic-load-balancer-as-a-service-operations>`__
tr_tr: `Temel Servis-olarak-Yük-Dengeleyici işlemleri <https://docs.openstack.org/admin-guide/networking-adv-features.html#basic-load-balancer-as-a-service-operations>`__

source: `Load-Balancer-as-a-Service (LBaaS) overview <https://docs.openstack.org/admin-guide/networking-introduction.html#load-balancer-as-a-service-lbaas-overview>`__
tr_tr: `Servis-olarak-yük-dengeleyici (LBaaS) özet <https://docs.openstack.org/admin-guide/networking-introduction.html#load-balancer-as-a-service-lbaas-overview>`__

source: `RFC 1918 <https://tools.ietf.org/html/rfc1918>`_ reserves the following three subnets as private addresses:
id: `RFC 1918 <https://tools.ietf.org/html/rfc1918>`_ mencadangkan tiga subnet berikut sebagai alamat pribadi:
tr_tr: `RFC 1918 <https://tools.ietf.org/html/rfc1918>`_ aşağıdaki üç altağı özel adresler olarak ayırır:

source: ``$1`` The operation being performed.
id: ``$1``, Operasi yang dilakukan.
tr_tr: ``$1`` işlemi gerçekleştirilir.

source: ``$IFACE`` The network interface upon which the request was received.
id: ``$IFACE``, Antarmuka jaringan dimana permintaan itu diterima.
tr_tr: ``$IFACE`` hangi isteğin alındığına bağlı olarak ağ arabirimi.

source: ``$PREFIX1`` The prefix being added/deleted by the Dibbler server.
id: ``$PREFIX1``, Awalan yang ditambahkan/dihapus oleh server Dibbler.
tr_tr: ``$PREFIX1`` öneki Dibbler sunucusu tarafından eklenir/silinir.

source: ``$REMOTE_ADDR`` The IP address of the requesting Dibbler client.
id: ``$REMOTE_ADDR`` Alamat IP dari klien Dibbler yang meminta.
tr_tr: ``$REMOTE_ADDR`` istenen Dibbler istemcisinin IP adresi.

source: ``ACTIVE``
tr_tr: ``AKTİF``

source: ``BUILD``
tr_tr: ``YAPIM``

source: ``DEGRADED``
tr_tr: ``BOZULMUŞ``

source: ``DOWN``
tr_tr: ``KAPALI``

source: ``ERROR``
tr_tr: ``HATA``
