Repository: 25hours/openstack-manuals
Catalog: doc/networking-guide/source/locale/*/LC_MESSAGES/networking-guide.po
Languages: id, tr_tr

source: Proprietary (vendor)
tr_tr: Müseccel (satıcı)

source: Provider (public/external) networks using IPv4 and IPv6
id: Jaringan (public/external) provider menggunakan IPv4 dan IPv6
tr_tr: IPv4 ve IPv6 kullanan sağlayıcı (ortak/harici) ağlar

source: Provider network (VLAN)
id: Jaringan operator (VLAN)
tr_tr: Sağlayıcı ağ (VLAN)

source: Provider network 1 (VLAN)
id: Jaringan provider 1 (VLAN)
tr_tr: Sağlayıcı ağ 1 (VLAN)

source: Provider network 1:
id: Provider network (jaringan provider) 1:
tr_tr: Sağlayıcı ağ 1:

source: Provider network 2 (VLAN)
id: Jaringan provider 2 (VLAN)
tr_tr: Sağlayıcı ağ 2 (VLAN)

source: Provider network 2:
id: Provider network (jaringan provider) 2:
tr_tr: Sağlayıcı ağ 2:

source: Provider network types
id: Tipe jaringan operator (provider)
tr_tr: Sağlayıcı ağ türleri

source: Provider networks
id: Jaringan provider
tr_tr: Sağlayıcı ağlar

source: Provider networks generally offer simplicity, performance, and reliability at the cost of flexibility. By default only administrators can create or update provider networks because they require configuration of physical network infrastructure. It is possible to change the user who is allowed to create or update provider networks with the following parameters of ``policy.json``:
id: Jaringan provider umumnya menawarkan kesederhanaan, kinerja, dan kehandalan pada biaya fleksibilitas. Secara default hanya administrator dapat membuat atau memperbarui jaringan provider karena mereka memerlukan konfigurasi infrastruktur jaringan fisik. Hal ini dimungkinkan untuk mengubah pengguna yang diizinkan untuk membuat atau memperbarui jaringan provider dengan parameter berikut `` policy.json``:
tr_tr: Sağlayıcı ağları genellikle esneklik pahasına basitlik, performans ve güvenilirlik sunar. Varsayılan olarak, yalnızca yöneticiler, fiziksel ağ altyapısının yapılandırılmasını gerektirdiği için sağlayıcının ağlarını oluşturabilir veya güncelleyebilir. Sağlayıcı ağlarını oluşturmaya veya güncellemeye izin verilen kullanıcıyı ``policy.json`` parametreleriyle değiştirmek mümkündür:

source: Provider networks offer layer-2 connectivity to instances with optional support for DHCP and metadata services. These networks connect, or map, to existing layer-2 networks in the data center, typically using VLAN (802.1q) tagging to identify and separate them.
id: Jaringan provider menawarkan layer-2 connectivity untuk instance dengan dukungan opsional untuk DHCP dan layanan metadata. Jaringan ini menghubungkan, atau memetakan, untuk layer-2 network yang ada di pusat data, biasanya menggunakan VLAN (802.1q) tagging untuk mengidentifikasi dan memisahkan mereka.
tr_tr: Sağlayıcı ağları, DHCP ve meta veri hizmetleri için isteğe bağlı destek olan örneklere katman-2 bağlantısı sunar. Bu ağlar, veri merkezindeki mevcut katman-2 ağlarına bağlanır veya bunları belirlemek ve ayırmak için tipik olarak VLAN (802.1q) etiketleme kullanarak eşleştirir.

source: Provider networks provide connectivity like project networks. But only administrative (privileged) users can manage those networks because they interface with the physical network infrastructure. More information about provider networks see :doc:`intro-os-networking` or the `OpenStack Administrator Guide <https://docs.openstack.org/admin-guide/networking-adv-features.html#provider-networks>`__.
id: Jaringan provider menyediakan konektivitas seperti jaringan proyek. Tetapi hanya pengguna administratif (istimewa) dapat mengelola jaringan mereka karena mereka berhadapan dengan infrastruktur jaringan fisik. Informasi lebih lanjut tentang jaringan provider lihat :doc:`intro-os-networking` atau `OpenStack Administrator Guide <https://docs.openstack.org/admin-guide/networking-adv-features.html#provider-networks>`__.
tr_tr: Sağlayıcı ağları, proje ağları gibi bağlantı sağlar. Ancak, fiziksel ağ altyapısıyla arabirim oluşturduklarından, bu ağları yalnızca idari (ayrıcalıklı) kullanıcılar yönetebilir. Sağlayıcı ağıyla ilgili daha fazla bilgi için :doc:`intro-os-networking` veya `OpenStack Yönetici Kılavuzu <https://docs.openstack.org/admin-guide/networking-adv-features.html#provider-networks>` __.

source: Provider: Connects virtual and physical networks at layer-2. Typically uses physical network infrastructure for switching/routing traffic to external networks such as the Internet.
id: Provider: Menghubungkan jaringan virtual dan fisik pada lapisan-2. Biasanya menggunakan infrastruktur jaringan fisik untuk lalu lintas switching/routing untuk jaringan eksternal seperti Internet.
tr_tr: Sağlayıcı: Katman-2'de sanal ve fiziksel ağları bağlar. Tipik olarak, İnternet gibi harici ağlara trafik anahtarlamak/yönlendirmek için fiziksel ağ altyapısı kullanılır.

source: Provides API, manages database, etc.
id: Sediakan API, kelola database, dll
tr_tr: API sağlar, veri tabanını yönetir vs.

source: Provides layer 2/3 connectivity to instances
id: Sediakan konektivitas lapisan 2/3 untuk instance
tr_tr: Sunuculara katman 2/3 bağlantılarını sağlar

source: QoS currently works with ml2 only (SR-IOV, Open vSwitch, and linuxbridge are drivers that are enabled for QoS in Mitaka release).
id: QoS saat ini bekerja dengan ML2 saja (SR-IOV, Open vSwitch, dan linuxbridge adalah driver yang diaktifkan untuk QoS dalam rilis Mitaka).
tr_tr: QoS şu an yalnızca ml2 ile çalışmaktadır (SR-IOV, Open vSwitch ve linuxbridge, Mitaka sürümünde QoS için etkinleştirilen sürücülerdir).

source: QoS is an advanced service plug-in. QoS is decoupled from the rest of the OpenStack Networking code on multiple levels and it is available through the ml2 extension driver.
id: QoS adalah plug-in layanan canggih. QoS dipisahkan dari sisa kode OpenStack Networking pada beberapa tingkat dan tersedia melalui driver ekstensi ml2.
tr_tr: QoS, gelişmiş bir servis eklentisidir. QoS, OpenStack Ağ kodunun geri kalanından birden fazla düzeyde ayrılır ve ml2 uzantı sürücüsünden edinilebilir.

source: QoS is defined as the ability to guarantee certain network requirements like bandwidth, latency, jitter, and reliability in order to satisfy a Service Level Agreement (SLA) between an application provider and end users.
id: QoS didefinisikan sebagai kemampuan untuk menjamin kebutuhan jaringan tertentu seperti bandwidth, latency, jitter, dan kehandalan untuk memenuhi Service Level Agreement (SLA) antara penyedia aplikasi dan pengguna akhir (end user).
tr_tr: QoS, bir uygulama sağlayıcısı ve son kullanıcılar arasındaki bir Servis Düzeyi Sözleşmesi'ni (SLA) karşılamak için bant genişliği, gecikme, titreme ve güvenilirlik gibi belirli ağ gereksinimlerini garanti etme yeteneği olarak tanımlanır.

source: QoS policies are only created by admins with the default ``policy.json``. Therefore, you should have the cloud operator set them up on behalf of the cloud projects.
id: Kebijakan QoS hanya dibuat oleh admin dengan ``policy.json`` default. Oleh karena itu, Anda harus memiliki operator cloud mengaturnya atas nama proyek cloud.
tr_tr: QoS politikaları yalnızca varsayılan ``policy.json`` ile yöneticiler tarafından oluşturulur. Bu nedenle bulut projeleri adına onları ayarlayan bulut işletmenine sahip olmanız gerekir.

source: Quality of Service (QoS)
tr_tr: Servis Kalitesi (QoS)

source: Quotas
id: Quotas (kuota)
tr_tr: Kota

source: Quotas are available for limiting the number of load balancers and load balancer pools. By default, both quotas are set to 10.
id: Kuota tersedia untuk membatasi jumlah penyeimbang beban dan kolam penyeimbang beban. Secara default, kedua kuota itu ditetapkan 10.
tr_tr: Yük dengeleyici ve yük dengeleyici havuz sayısını sınırlamak için kota kullanılabilir. Varsayılan olarak, her iki kota da 10 olarak ayarlanır.

source: RW(POST only)
tr_tr: RW(sadece POST)

source: Rack
tr_tr: Raf

source: Re-enable the hypervisor.
id: Aktifkan kembali hypervisor.
tr_tr: Hypervisor'ı yeniden etkinleştir.

source: Reboot the hypervisor (or run "smart" live transition tool if available).
id: Reboot hypervisor (atau menjalankan alat transisi hidup "smart" jika tersedia).
tr_tr: Hypervisor'ı yeniden başlat (veya "smart" canlı geçiş aracı kullanılabilirse çalıştır).

source: Reference Implementation
tr_tr: Referans Uygulamalar

source: Reference implementations
id: Implementasi referensi
tr_tr: Kılavuz uygulamaları

source: Reference implementations and other agents
id: implementasi referensi dan agen lainnya
tr_tr: Referans uygulamalar ve diğer ajanlar

source: References
id: Referensi
tr_tr: Kaynaklar

source: Referencing a subnet pool during subnet creation
id: Mengacu kolam subnet selama pembuatan subnet
tr_tr: Alt ağ oluşturma sırasında bir alt ağ havuzuna başvurma

source: Regardless of address scopes, the floating IPs can be pinged from the external network:
id: Terlepas dari lingkup alamat, IP mengambang dapat ping dari jaringan eksternal:
tr_tr: Adres alanına bakmaksızın, yüzen IP'lere harici ağdan ping atılabilir:

source: Regular port creation permissions on networks (since Liberty).
id: Izin pembuatan port regular di jaringan (sejak Liberty).
tr_tr: Ağlarda normal bağlantı noktası oluşturma izinleri (Liberty'den beri).

source: Remove a network from a specified DHCP agent.
id: Hapus jaringan dari agen DHCP ditentukan.
tr_tr: Belirtilen bir DHCP ajanında bir ağ kaldırın.

source: Remove a tag from a resource:
id: Hapus tag dari sumber daya:
tr_tr: Bir kaynaktan bir etiketi kaldır:

source: Rename the default segment to ``segment1``.
id: Mengubah nama segmen default ke ``segment1``.
tr_tr: Varsayılan dilimi ``segment1`` olarak yeniden adlandırın.

source: Replace ``DNS_RESOLVER`` with the IP address of a DNS resolver reachable from all virtual networks. For example:
id: Ganti ``DNS_RESOLVER`` dengan alamat IP dari DNS resolver yang dapat dijangkau dari semua jaringan virtual. Sebagai contoh:
tr_tr: ``DNS_RESOLVER`` parametresini, tüm sanal ağlardan erişilebilen bir DNS çözümleyicisinin IP adresiyle değiştirin. Örneğin:

source: Replace ``DNS_RESOLVER`` with the IP address of a DNS resolver reachable from the virtual network and ``SUBNET_ID_OR_NAME`` with the UUID or name of the subnet. For example, using the ``selfservice`` subnet:
id: Ganti ``DNS_RESOLVER`` dengan alamat IP dari DNS resolver yang dapat dicapai dari jaringan virtual dan ``SUBNET_ID_OR_NAME`` dengan UUID atau nama subnet. Misalnya, menggunakan subnet ``selfservice``:
tr_tr: ``DNS_RESOLVER``ı sanal ağdan erişilebilen bir DNS çözümleyicisinin IP adresiyle ve UUID veya alt ağın adıyla ``SUBNET_ID_OR_NAME`` olarak değiştirin. Örneğin, ``selfservice`` alt ağını kullanarak:

source: Replace ``DNS_RESOLVER`` with the IP address of a DNS resolver reachable from the virtual network. For example:
id: Ganti ``DNS_RESOLVER`` dengan alamat IP dari DNS resolver yang dapat dicapai dari jaringan virtual. Sebagai contoh:
tr_tr: ``DNS_RESOLVER`` parametresini, sanal ağdan erişilebilen DNS çözümleyicisinin IP adresiyle değiştirin. Örneğin:

source: Replace ``INTERFACE_DRIVER`` with the interface driver that the layer-2 agent in your environment uses. For example, ``openvswitch`` for Open vSwitch or ``linuxbridge`` for Linux bridge.
id: Ganti ``INTERFACE_DRIVER`` dengan driver antarmuka dimana agen layer-2 di lingkungan Anda menggunakannya. Sebagai contoh, ``openvswitch`` untuk Open vSwitch atau ``linuxbridge`` for Linux bridge.
tr_tr: ``INTERFACE_DRIVER`` yerine, ortamınızdaki katman-2 ajanının kullandığı arabirim sürücüsünü değiştirin. Örneğin, Open vSwitch için ``openvswitch``, Linux köprüsü için ``linuxbridge``.

source: Replace ``LOCAL_AS`` with an appropriate local autonomous system number. The example configuration uses AS 1234.
id: Ganti ``LOCAL_AS`` dengan nomor sistem otonomi lokal yang tepat. Konfigurasi Contoh menggunakan AS 1234.
tr_tr: ``LOCAL_AS`` yerine uygun yerel özerk sistem numarası koyun. Örnek yapılandırmada AS 1234 kullanılıyor.

source: Replace ``MACVTAP_INTERFACE`` with the name of the underlying interface that handles Macvtap mechanism driver interfaces. If using a prerequisite deployment example, replace ``MACVTAP_INTERFACE`` with the name of the underlying interface that handles overlay networks. For example, ``eth1``.
id: Ganti `` MACVTAP_INTERFACE`` dengan nama interface yang mendasari yang menangani antarmuka driver mekanisme Macvtap. Jika menggunakan contoh penyebaran prasyarat, ganti `` MACVTAP_INTERFACE`` dengan nama interface yang mendasari yang menangani jaringan overlay. Misalnya, ``eth1``.
tr_tr: ``MACVTAP_INTERFACE`` parametresini, Macvtap mekanizması sürücü arayüzlerini işleyen alttaki arayüzün adıyla değiştirin. Bir önkoşul dağıtım örneği kullanılıyorsa, yer paylaşımı ağlarını işleyen alttaki arayüzün adı ile ``MACVTAP_INTERFACE``i değiştirin. Örneğin, ``eth1``.

source: Replace ``MIN_VXLAN_ID`` and ``MAX_VXLAN_ID`` with VXLAN ID minimum and maximum values suitable for your environment.
id: Gantilah ``MIN_VXLAN_ID`` dan ``MAX_VXLAN_ID`` dengan nilai minimum dan maksimum VXLAN ID yang cocok dengan lingkungan Anda.
tr_tr: Ortamınıza uygun VXLAN ID minimum ve maksimum değerleriyle ``MIN_VXLAN_ID`` ve ``MAX_VXLAN_ID``'i değiştirin.

source: Replace ``NETWORK_ID`` with the ID of the additional self-service network.
id: Gantilah ``NETWORK_ID`` dengan ID dari jaringan self-service tambahan
tr_tr: ``NETWORK_ID``yi ek self-servis ağı kimliği ile değiştirin.

source: Replace ``NETWORK_ID`` with the ID of the provider network.
id: Gantilah ``NETWORK_ID`` dengan ID dari jaringan provider.
tr_tr: ``NETWORK_ID``yi sağlayıcı ağın ID'si ile değiştirin.

source: Replace ``NETWORK_ID`` with the ID of the self-service network.
id: Ganti ``NETWORK_ID`` dengan ID jaringan self-service.
tr_tr: ``NETWORK_ID`` ile self servis ağın ID'sini değiştirin.

source: Replace ``OVERLAY_INTERFACE_IP_ADDRESS`` with the IP address of the interface that handles VXLAN overlays for self-service networks.
id: Gantilah ``OVERLAY_INTERFACE_IP_ADDRESS`` dengan alamat IP dari antarmuka yang menangani VXLAN overlay untuk jaringan self-service.
tr_tr: ``OVERLAY_INTERFACE_IP_ADDRESS``i self servis ağları için VXLAN yer paylaşımlarını yöneten arabirimin IP adresiyle değiştirin.

source: Replace ``P1_ID``, ``P2_ID``, ``P3_ID``, ``P4_ID``, ``P5_ID``, and ``P6_ID`` with the UUIDs of the respective ports.
id: Gantikan ``P1_ID``, ``P2_ID``, ``P3_ID``, ``P4_ID``, ``P5_ID``, dan ``P6_ID`` dengan UUID dari port masing-masing.
tr_tr: ``P1_ID``, ``P2_ID``, ``P3_ID``, ``P4_ID``, ``P5_ID``, ve ``P6_ID``yi sıralı bağlantı noktalarının UUIDleri ile yer değiştirin.

source: Replace ``PROJECT_ID`` with the project ID.
id: Ganti ``PROJECT_ID`` dengan ID proyek.
tr_tr: ``PROJECT_ID``yi proje ID'si ile değiştirin.

source: Replace ``PROVIDER_INTERFACE`` with the name of the underlying interface that handles provider networks. For example, ``eth1``.
id: Gantilah ``PROVIDER_INTERFACE`` dengan nama interface yang mendasarinya yang menangani jaringan penyedia. Sebagai contoh,``eth1``.
tr_tr: Sağlayıcı ağları barındıran ilgili arabirimin adı ile ``PROVIDER_INTERFACE``i yer değiştirin. Örnek, ``eth1``.

source: Replace ``REMOTE_AS`` with an appropriate remote autonomous system number. The example configuration uses AS 4321 which triggers EBGP peering.
id: Ganti `` REMOTE_AS`` dengan nomor sistem otonom jarak jauh yang sesuai. Konfigurasi contoh menggunakan AS 4321 yang memicu EBGP peering.
tr_tr: ``REMOTE_AS`` dosyasını uygun bir uzak özerk sistem numarası ile değiştirin. Örnek konfigürasyon, EBGP denkliği tetikleyen AS 4321'i kullanır.

source: Replace ``ROUTER_ID`` with a suitable unique 32-bit number, typically an IPv4 address on the host running the agent. For example, 192.0.2.2.
id: Ganti ``ROUTER_ID`` dengan nomor 32-bit unik dan cocok, biasanya alamat IPv4 dari host menjalankan agen. Misalnya, 192.0.2.2.
tr_tr: ``ROUTER_ID``'yi uygun benzersiz tipik olarak ajanın çalıştığı sunucuda bir IPv4 adresi 32-bit numara ile değiştir. Örneğin, 192.0.2.2.

source: Replace ``TUNNEL_INTERFACE_IP_ADDRESS`` with the IP address of the interface that handles VXLAN project networks.
id: Ganti ``TUNNEL_INTERFACE_IP_ADDRESS`` dengan alamat IP dari antarmuka yang menangani jaringan proyek VXLAN.
tr_tr: ``TUNNEL_INTERFACE_IP_ADDRESS``i VXLAN proje ağını taşıyan arayüzün IP adresi ile değiştirin.

source: Replace ``VNI_START`` and ``VNI_END`` with appropriate numerical values.
id: Gantilah ``VNI_START`` dan ``VNI_END`` dengan nilai-nilai numerik yang sesuai.
tr_tr: ``VNI_START`` ve ``VNI_END`` değerlerini uygun sayısal değerlerle değiştirin.

source: Replace all tags on the resource:
id: Ganti semua tag pada sumber daya:
tr_tr: Kaynak üzerindeki tüm etiketleri değiştir:

source: Required
tr_tr: Gerekli

source: Required extensions
id: Ekstensi yang diperlukan
tr_tr: Gerekli uzantılar

source: Requirements
tr_tr: Gereksinimler

source: Resource
tr_tr: Kaynak

source: Resource purge
id: Pembersihan sumber daya
tr_tr: Kaynakların silinmesi

source: Resource tags
id: Tag sumber daya
tr_tr: Kaynak etiketleri

source: Resources
id: Resources (sumber daya)
tr_tr: Kaynaklar

source: Restart Apache to activate the new panel:
id: Restart Apache untuk mengaktifkan panel baru:
tr_tr: Yeni paneli aktifleştirmek için Apache'yi yeniden başlatın:

source: Restart the Network service to activate the new configuration. You are now ready to create and manage load balancers with Octavia.
id: Restart layanan jaringan untuk mengaktifkan konfigurasi baru. Anda sekarang siap untuk membuat dan mengelola penyeimbang beban dengan Octavia.
tr_tr: Yeni yapılandırmayı etkinleştirmek için Ağ hizmetini yeniden başlatın. Şimdi Octavia ile yük dengeleyici yaratmaya ve yönetmeye hazırsınız.

source: Restart the Network service to activate the new configuration. You are now ready to create load balancers with the LBaaS v2 agent.
id: Restart layanan jaringan untuk mengaktifkan konfigurasi baru. Anda sekarang siap untuk membuat penyeimbang beban dengan agen v2 LBaaS.
tr_tr: Yeni yapılandırmayı etkinleştirmek için Ağ hizmetini yeniden başlatın. Artık LBaaS v2 aracı ile yük dengeleyici oluşturmaya hazırsınız.

source: Restart the ``neutron-l3-agent`` and ``neutron-server`` services to apply the settings.
id: Restart layanan ``neutron-l3-agent`` dan ``neutron-server`` untuk menerapkan pengaturan.
tr_tr: Ayarları uygulamak için ``neutron-l3-agent`` ve ``neutron-server`` servislerini yeniden başlatın.

source: Restart the ``neutron-server`` service.
id: Restart layanan ``neutron-server``.
tr_tr: ``neutron-server`` servisini yeniden başlatın.

source: Restart the ``nova-compute`` service for the changes to go into effect.
id: Restart layanan ``nova-compute`` agar perubahan berlaku.
tr_tr: Değişikliklerin etki etmesi için ``nova-compute`` servisini yeniden başlatın.

source: Restart the ``nova-scheduler`` service.
id: Restart layanan ``nova-scheduler``.
tr_tr: ``nova-scheduler`` servisini yeniden başlatın.

source: Restart the following services:
id: Restart layanan berikut:
tr_tr: Aşağıdaki servisleri yeniden başlatın:

source: Result
tr_tr: Sonuç

source: Retrieving load balancer statistics
id: Pengambilan statistik penyeimbang beban
tr_tr: Yük dengeleyici istatistiklerinin getirilmesi

source: Return traffic follows similar steps in reverse.
id: Lalu lintas balik mengikuti langkah yang sama secara terbalik.
tr_tr: Dönüş trafik akışı benzer adımlardan tersine takip eder.

source: Return traffic follows similar steps in reverse. However, without a floating IPv4 address, hosts on the provider or external networks cannot originate connections to instances on the self-service network.
id: Lalu lintas balik mengikuti langkah yang sama secara terbalik. Namun, tanpa alamat IPv4 mengambang, host pada provider atau eksternal jaringan tidak dapat berasal koneksi untuk instance pada jaringan self-service.
tr_tr: Geri dönüş trafiği de benzer adımları izlemektedir. Bununla birlikte, kayan bir IPv4 adresi olmadan, sağlayıcıdaki veya dış ağdaki ana bilgisayarlar, self servis ağı üzerindeki sunucular ile bağlantılar kuramaz.

source: Role-Based Access Control (RBAC)
tr_tr: Rol-tabanlı Erişim Kontrolü (RBAC)

source: Routed provider networks
id: jaringan penyedia (provider) yang diarahkan
tr_tr: Yönlendirilmiş sağlayıcı ağlar

source: Routed provider networks imply that compute nodes reside on different segments. The operator must ensure that every compute host that is supposed to participate in a router provider network has direct connectivity to one of its segments.
id: Jaringan provider Routed menyiratkan bahwa komputasi node berada pada segmen yang berbeda. Operator harus memastikan bahwa setiap komputasi host yang seharusnya berpartisipasi dalam jaringan provider router telah memiliki konektivitas langsung ke salah satu segmen tersebut.
tr_tr: Yönlendirilmiş sağlayıcı ağları, hesaplama düğümlerinin farklı segmentlerde bulunduğunu ima eder. Operatör, bir yönlendirici sağlayıcı ağına katılmayı düşündüğü her bilgisayarın kendi bölümlerinden birine doğrudan bağlandığından emin olmalıdır.

source: Routed provider networks offer layer-3 connectivity to instances. These networks map to existing layer-3 networks in the data center. More specifically, the network maps to multiple layer-2 segments, each of which is essentially a provider network. Each has a router gateway attached to it which routes traffic between them and externally. The Networking service does not provide the routing.
id: Jaringan provider yang di-rute menawarkan lapisan-3 konektivitas untuk instance. Jaringan ini memetakan jaringan lapisan-3 yang ada di pusat data. Lebih khusus, jaringan memetakan ke beberapa segmen lapisan-2, masing-masing yang pada dasarnya adalah jaringan provider. Masing-masing jaringan memiliki router gateway yang terhubung ke yang me-rute lalu lintas antara jaringan mereka dan secara eksternal. Layanan Networking tidak menyediakan routing.
tr_tr: Yönlendirilmiş sağlayıcı ağları, örneklere katman-3 bağlantısı sunar. Bu ağlar veri merkezinde mevcut katman-3 ağlarına eşlenir. Daha spesifik olarak, ağ, her biri esas itibarıyla bir sağlayıcı ağı olan çoklu katman-2 segmentlere eşlenir. Her biri, aralarında trafik yönlendiren ve harici olarak yönlendiren bir yönlendirici ağ geçidine sahiptir. Ağ hizmeti yönlendirme sağlamaz.

source: Routed provider networks offer performance at scale that is difficult to achieve with a plain provider network at the expense of guaranteed layer-2 connectivity.
id: Jaringan provider yang di-rute menawarkan kinerja di skala yang sulit dicapai dengan jaringan provider polos (plain) pada tingkat ongkos konektivitas lapisan-2 yang terjamin.
tr_tr: Yönlendirilmiş sağlayıcı ağları, garantili katman-2 bağlantısı pahasına düz bir sağlayıcı ağıyla elde edilmesi güç bir ölçekte performans sunar.

source: Routed provider networks require additional prerequisites over conventional provider networks. We recommend using the following procedure:
id: Jaringan penyedia dialihkan (routed) memerlukan prasyarat tambahan melalui jaringan penyedia konvensional. Sebaiknya, kita gunakan prosedur berikut:
tr_tr: Yönlendirilmiş sağlayıcı ağları, geleneksel sağlayıcı ağları üzerinden ek önkoşullar gerektirir. Aşağıdaki yöntemi kullanmanızı öneririz:

source: Router 1 contains IP addresses 203.0.113.11 and 10.0.1.1.
tr_tr: Yönlendirici 1, 203.0.113.11 ve 10.0.1.1 IP adreslerini içerir.

source: Router 2 contains IP addresses 203.0.113.12 and 10.0.2.1.
tr_tr: Yönlendirici 2, IP adresi 203.0.113.12 ve 10.0.2.1 içerir.

source: Router 3 contains IP addresses 203.0.113.13 and 10.0.3.1.
tr_tr: Yönlendirici 3, 203.0.113.13 ve 10.0.3.1 IP adreslerini içerir.

source: Router advertisements
id: Penyiaran update dan perubahan router
tr_tr: Yönlendirici tanıtımları

source: Router interfaces
id: Antarmuka router
tr_tr: Yönlendirici arabirimleri

source: Router scheduler
id: Alat penjadwal router
tr_tr: Yönlendirici zamanlayıcı
