Repository: 25hours/openstack-manuals
Catalog: doc/networking-guide/source/locale/*/LC_MESSAGES/networking-guide.po
Languages: id, tr_tr

source: Line 2 of the output specifies that IPs in the ``10.0.2.0/24`` subnet are on the local network associated with the network interface eth0.
id: Baris 2 output menetapkan bahwa IP dalam subnet ``10.0.2.0/24`` berada di jaringan lokal yang terkait dengan eth0 antarmuka jaringan.
tr_tr: Çıktının 2. satırı ``10.0.2.0/24`` altağındaki IPlerin eth0 ağ arabirimi ile alakalı yerel ağ üzerinde olduğunu belirler.

source: Line 3 of the output specifies that IPs in the ``192.168.27.0/24`` subnet are on the local network associated with the network interface eth1.
id: Baris 3 output menetapkan bahwa IP dalam subnet ``192.168.27.0/24`` berada di jaringan lokal yang terkait dengan eth1 antarmuka jaringan.
tr_tr: Çıktının 3. satırı ``192.168.27.0/24`` alt ağındaki IP'lerin eth1 ağ arayüzü ile ilişkili yerel ağ üzerinde olduğunu belirtir.

source: Line 4 of the output specifies that IPs in the ``192.168.122.0/24`` subnet are on the local network associated with the network interface virbr0.
id: Baris 4 output menetapkan bahwa IP dalam subnet ``192.168.122.0/24`` berada di jaringan lokal yang terkait dengan virbr0 antarmuka jaringan.
tr_tr: Çıktının 4. satırı ``192.168.122.0/24`` altağındaki IPlerin virbr0 ağ arabirimi ile ilişkili yerel ağ üzerinde olduğunu belirtir.

source: Linux Bridge
id: Linux Bridge (jembatan Linux)
tr_tr: Linux Köprü

source: Linux bridge
id: Linux bridge (jembatan Linux)
tr_tr: Linux köprü

source: Linux bridge & Linux bridge agent
id: Agen jembatan Linux & jembatan Linux
tr_tr: Linux köprü & Linux köprü ajanı

source: Linux bridge agent
id: Agen jembatan Linux
tr_tr: Linux köprü ajanı

source: Linux bridge mechanism and Linux bridge agent
id: Mekanisme jembatan Linux dan agen jembatan Linux
tr_tr: Linux köprü mekanizması ve Linux köprü ajanı

source: Linux bridge mechanism driver
id: Linux bridge mechanism driver (driver mekanisme jembatan linux)
tr_tr: Linux köprü mekanizması sürücüsü

source: Linux bridge: High availability using VRRP
id: Linux bridge: High availability menggunakan VRRP
tr_tr: Linux köprü: VRRP kullanarak yüksek kullanılabilirlik

source: Linux bridge: Provider networks
tr_tr: Linux köprü: Sağlayıcı ağlar

source: Linux bridge: Self-service networks
id: Linux bridge: Jaringan self-service
tr_tr: Linux köprü: Self-servis ağları

source: Linux bridging for implementing a layer 2 network
id: Linux bridging untuk implementasi jaringan layer 2
tr_tr: Bir katman 2 ağı oluşturmak için Linux köprüleme

source: Linux distributions often package older releases of Open vSwitch that can introduce issues during operation with the Networking service. We recommend using at least the latest long-term stable (LTS) release of Open vSwitch for the best experience and support from Open vSwitch. See `<http://www.openvswitch.org>`__ for available releases and the `installation instructions <https://github.com/openvswitch/ovs/blob/master/INSTALL.md>`__ for
id: Distribusi Linux sering memaket rilis yang lebih tua dari Open vSwitch yang dapat menimbulkan masalah selama operasi dengan layanan Networking. Sebaiknya gunakan setidaknya rilis jangka panjang yang stabil (LTS) terbaru dari Open vSwitch untuk pengalaman terbaik dan dukungan dari Open vSwitch. Lihat `<http://www.openvswitch.org>` __ untuk rilis yang tersedia dan `installation instructions <https://github.com/openvswitch/ovs/blob/master/INSTALL.md>`__
tr_tr: Linux dağıtımları çoğu zaman Open vSwitch'in eski sürümlerini paketler ve bu da Ağ Hizmeti ile çalışma sırasında sorunlara neden olabilir. Open vSwitch'ten en iyi deneyim ve destek için en azından Open vSwitch'in en yeni uzun süreli kararlı (LTS) sürümünü kullanmanızı öneririz. Mevcut bültenler için `<http://www.openvswitch.org>`__ ve `kurulum talimatları <https://github.com/openvswitch/ovs/blob/master/INSTALL.md>`__ için.

source: Linux network namespaces
id: Namespaces jaringan Linux
tr_tr: Linux ağ ad alanları

source: List DHCP agents that host a specified network:
id: Daftar agen DHCP yang menjadi tempat jaringan tertentu:
tr_tr: Belirtilen bir ağa ev sahipliği yapan DHCP aracılarını listele:

source: List all agents:
id: Daftar semua agen:
tr_tr: Tüm ajanları listele:

source: List the networks hosted by a given DHCP agent:
id: Daftar jaringan yang ditempati oleh agen DHCP yang diberikan:
tr_tr: Belirli bir DHCP ajanı tarafından barındırılan ağları listeleyin:

source: Listener
tr_tr: Dinleyici

source: Live migration is not supported for instances with SR-IOV ports.
id: Migrasi langsung (live) tidak didukung untuk instance dengan port SR-IOV.
tr_tr: Canlı geçiş, SR-IOV bağlantı noktalı örnekler için desteklenmez.

source: Load Balancer as a Service (LBaaS)
tr_tr: Servis olarak Yük Dengeleme (LBaaS)

source: Load balancer
id: Penyeimbang beban (load balancer)
tr_tr: Yük dengeleyici

source: Load balancers
id: Load balancers (penyeimbang beban)
tr_tr: Yük dengeleyiciler

source: Load balancers can be software-based or hardware-based devices that allow traffic to evenly be distributed across several servers. By distributing the traffic across multiple servers, it avoids overload of a single server thereby preventing a single point of failure in the product. This further improves the performance, network throughput, and response time of the servers. Load balancers are typically used in a 3-tier architecture. In this model, a load balancer receives a request from the front-end web server, which then forwards the request to one of the available back-end database servers for processing. The response from the database server is passed back to the web server for further processing.
id: Penyeimbang beban dapat menjadi perangkat software-based atau hardware-based yang memungkinkan lalu lintas terdistribusi secara merata di beberapa server. Dengan mendistribusikan lalu lintas di beberapa server, penyeimbang beban menghindari kelebihan beban di sebuah server tunggal sehingga mencegah satu titik kegagalan dalam produk. Hal ini semakin meningkatkan kinerja, throughput jaringan, dan waktu respon dari server. Penyeimbang beban biasanya digunakan dalam arsitektur 3-tier. Dalam model ini, penyeimbang beban menerima permintaan dari web server front-end, yang kemudian meneruskan permintaannya ke salah satu server database back-end yang tersedia untuk diproses. Tanggapan dari server database dilewatkan kembali ke web server untuk diproses lebih lanjut.
tr_tr: Yük dengeleyici, trafiklerin çeşitli sunuculara eşit olarak dağıtılmasına izin veren yazılım tabanlı veya donanım tabanlı aygıtlar olabilir. Trafiği birden çok sunucuya dağıtarak, tek bir sunucunun aşırı yüklenmesini önleyerek ürünün tek bir başarısızlığını engeller. Bu, sunucuların performansını, ağ verimini ve tepki süresini daha da geliştirir. Yük dengeleyicileri genellikle 3 katmanlı mimaride kullanılır. Bu modelde, bir yük dengeleyici, ön uç web sunucusundan bir istek alır; daha sonra istek, işleme tabi tutulmak üzere kullanılabilir arka uç veritabanı sunucularından birine iletilir. Veritabanı sunucusundan gelen yanıt daha fazla işlem için web sunucusuna geri gönderilir.

source: Load balancers can listen for requests on multiple ports. Each one of those ports is specified by a listener.
id: Penyeimbang beban dapat mendengarkan permintaan pada beberapa port. Masing-masing dari port itu ditentukan oleh pendengar (listener).
tr_tr: Yük dengeleyici, birden çok bağlantı noktasındaki istekleri dinleyebilir. Bu portlardan her biri bir dinleyici tarafından belirtilir.

source: Load balancers that are deployed on a public or provider network that are accessible to external clients do not need a floating IP address assigned. External clients can directly access the virtual IP address (VIP) of those load balancers.
id: Balancers beban yang digunakan pada jaringan publik atau penyedia yang dapat diakses oleh klien eksternal tidak membutuhkan alamat IP mengambang yang ditetapkan. Klien eksternal dapat langsung mengakses virtual IP address (VIP) dari load balancer mereka
tr_tr: Harici istemciler tarafından erişilebilen bir genel veya sağlayıcı ağında dağıtılan yük dengeleyicileri atanan bir kayan IP adresine ihtiyaç duymaz. Harici istemciler, bu yük dengeleyicilerinin sanal IP adresine (VIP) doğrudan erişebilir.

source: Log in to the ``myserver4`` VM, and run ``udhcpc``, ``dhclient`` or other DHCP client.
id: Log in ke ``myserver4`` VM, dan jalankan ``udhcpc``, ``dhclient`` atau klien DHCP lainnya.
tr_tr: ``myserver4`` VM'ine giriş yapın ve ``udhcpc``, ``dhclient`` veya başka DHCP istemcisini çalıştırın.

source: Look at the ``availability_zones`` attribute of each resource to confirm in which zone the resource is hosted:
id: Lihatlah atribut ``availability_zones`` dari setiap sumber untuk mengkonfirmasi zona dimana sumber disimpan (hosted):
tr_tr: Kaynağın hangi bölgede barındırıldığını teyit etmek için her kaynağın ``availability_zones`` özelliğine bakınız:

source: ML2 driver support matrix
id: Matriks dukungan driver ML2
tr_tr: ML2 sürücü destek matrisi

source: ML2 plug-in
tr_tr: ML2 eklentisi

source: MTU considerations
id: Pertimbangan MTU
tr_tr: MTU değerlendirmeleri

source: MacVTap & MacVTap agent
id: Agen MacVTap & MacVTap
tr_tr: MacVTap & MacVTap ajanı

source: MacVTap agent
id: Agen MacVTap
tr_tr: MacVTap ajanı

source: MacVTap mechanism driver and MacVTap agent
id: Driver mekanisme MacVTap dan agen MacVTap
tr_tr: MacVTap mekanizma sürücüsü ve MacVTap ajanı

source: MacVTap offers a direct connection with very little overhead between instances and down to the adapter. You can use MacVTap agent on the compute node when you require a network connection that is performance critical. It does not require specific hardware (like with SRIOV).
id: MacVTap menawarkan koneksi langsung dengan overhead yang sangat kecil antara instance dan turun sampai adaptor. Anda dapat menggunakan agen MacVTap pada node komputasi ketika Anda membutuhkan koneksi jaringan kinerja kritis. Ini tidak memerlukan perangkat keras khusus (seperti dengan SRIOV).
tr_tr: MacVTap, sunucular arasında ve adaptöre indirgenecek çok az yük ile doğrudan bağlantı sunar. Performans açısından kritik bir ağ bağlantısı gerektirdiğinde, hesaplama düğümünde MacVTap aracısını kullanabilirsiniz. Belli bir donanıma (SRIOV gibi) ihtiyaç yoktur.

source: Macvtap agent
id: agen Macvtap
tr_tr: Macvtap ajanı

source: Macvtap mechanism driver
id: Driver mekanisme Macvtap
tr_tr: Macvtap mekanizma sürücüsü

source: Make Compute REST API read-write again. This means legacy networking DB is now unused, new changes are now stored in the Networking DB, and no rollback is possible from here without losing those new changes.
id: Buat Compute REST API read-write lagi. Ini berarti legacy networking DB sekarang tidak terpakai, perubahan baru sekarang disimpan di Networking DB, dan tidak ada rollback adalah mungkin dari sini tanpa kehilangan perubahan baru.
tr_tr: Compute REST API'sını yeniden okuma-yazma yapın. Bu, eski ağ DB'nin kullanılmadığı, yeni değişiklikler şimdi Ağ DB'de saklandığı anlamına gelir ve buradan yeni değişiklikleri kaybetmeden herhangi bir geri alma mümkün değildir.

source: Make sure both DHCP agents hosting ``net2``:
id: Pastikan kedua agen DHCP menjadi host ``net2``:
tr_tr: Her iki DHCP ajanının ``net2``'yi barındırdığına emin olun:

source: Make sure that subnets on an external network are created from the subnet pools created above:
id: Pastikan bahwa subnet pada jaringan eksternal diciptakan dari kolam subnet yang dibuat di atas:
tr_tr: Harici bir ağdaki alt ağların yukarıda oluşturulan alt ağ havuzlarından oluşturulduğundan emin olun:

source: Make sure that the router's ``ha`` attribute has changed to ``False``.
id: Pastikan bahwa atribut router ``ha`` telah berubah menjadi ``False``.
tr_tr: Yönlendiricinin ``ha`` özniteliğinin ``False`` olarak değiştirildiğinden emin olun.

source: Make sure that the router's ``ha`` attribute has changed to ``True``.
id: Pastikan bahwa atribut router ``ha`` telah berubah menjadi ``True``.
tr_tr: Yönlendiricinin ``ha`` özniteliğinin ``True`` olarak değiştirildiğinden emin olun.

source: Make the Compute REST API read-only.
id: Buatlah Compute REST API read-only.
tr_tr: Hesaplama REST API salt okunur yapın.

source: Make the Networking API read-write and disable legacy networking.
id: Membuat Networking API read-write dan menonaktifkan legacy networking.
tr_tr: Ağ Oluşturma API'sını okuma-yazmaya izin verin ve eski ağları devre dışı bırakın.

source: Managed Configuration Flag = 0
tr_tr: Yönetilen Yapılandırma Bayrağı = 0

source: Managed Configuration Flag = 1
tr_tr: Yönetilen Yapılandırma Bayrağı = 1

source: Management impact
id: Dampak manajemen
tr_tr: Yönetim etkisi

source: Management network: 10.0.0.0/24
tr_tr: Yönetim ağı: 10.0.0.0/24

source: Management: Handles API requests from clients and control plane traffic for OpenStack services including their dependencies.
id: Management: Menangani permintaan API dari klien dan control plane traffic untuk layanan OpenStack termasuk dependensinya..
tr_tr: Yönetim: İstemcilerden gelen API isteklerini ve bağımlılıkları da dahil olmak üzere OpenStack hizmetleri için kontrol düzlemi trafiğini yönetir.

source: Manages agents
id: Kelola agen
tr_tr: Ajanları yönetir

source: Managing agents in neutron deployment
id: Mengelola agen dalam pengerahan neutron
tr_tr: Neutron yayınlamasında ajanların yönetimi

source: Managing assignment of networks to DHCP agent
id: Mengelola tugas jaringan agen DHCP
tr_tr: DHCP ajanına ağ ataması yönetimi

source: Map segments to compute nodes.
id: Segmen peta untuk node komputasi
tr_tr: Dilimleri hesaplama düğümleriyle eşleştir.

source: Mechanism Driver
id: Mechanism Driver (driver mekanisme)
tr_tr: Mekanizma Sürücüsü

source: Mechanism drivers
id: Driver mekanisme
tr_tr: Mekanizma sürücüleri

source: Mechanism drivers and L2 agents
id: Driver mekanisme dan agen L2
tr_tr: Mekanizma sürücüleri ve L2 ajanları

source: Mechanism drivers can utilize L2 agents (via RPC) and/or interact directly with external devices or controllers.
id: Driver mekanisme dapat memanfaatkan agen L2 (melalui RPC) dan/atau berinteraksi langsung dengan perangkat eksternal atau controller.
tr_tr: Mekanizma sürücüleri, L2 aracılarını (RPC aracılığıyla) kullanabilir ve/veya harici aygıtlar veya denetleyicilerle doğrudan etkileşime girebilir.

source: Member
tr_tr: Üye

source: Members are servers that serve traffic behind a load balancer. Each member is specified by the IP address and port that it uses to serve traffic.
id: Anggota adalah server yang melayani lalu lintas di belakang penyeimbang beban. Setiap anggota ditentukan oleh alamat IP dan port yang menggunakannya untuk melayani lalu lintas.
tr_tr: Üyeler, bir yük dengeleyicisinin arkasında trafiğe neden olan sunuculardır. Her üye trafik sunmak için kullandığı IP adresi ve bağlantı noktası ile belirtilir.

source: Members may go offline from time to time and health monitors divert traffic away from members that are not responding properly. Health monitors are associated with pools.
id: Anggota dapat offline dari waktu ke waktu dan monitor kesehatan dapat mengalihkan lalu lintas dari anggota yang tidak merespon dengan baik. Monitor kesehatan dihubungankan dengan kolam.
tr_tr: Üyeler zaman zaman çevrimdışı olabilirler ve sağlık monitörleri trafiği düzgün yanıt vermeyen üyelerden uzaklaştırır. Sağlık monitörleri havuzlarla ilişkilidir.

source: Messaging queue
id: Antrian pesan
tr_tr: Mejlaşma kuyruğu

source: Metadata
tr_tr: Üstveri

source: Metadata agent
id: Agen Metadata
tr_tr: Metadata ajanı

source: Migrating a router from distributed only, HA only, or legacy to distributed HA is not supported at this time. The router must be created as distributed HA. The reverse direction is also not supported. You cannot reconfigure a distributed HA router to be only distributed, only HA, or legacy.
id: Migrasi router dari hanya didistribusikan, hanya HA, atau legacy ke HA yang didistribusikan tidak didukung saat ini. Router harus dibuat sebagai HA yang didistribusikan. Arah sebaliknya juga tidak didukung. Anda tidak dapat mengkonfigurasi ulang router HA yang didistribusikan ke hanya didistribusikan, hanya HA, atau legacy (warisan).
tr_tr: Yalnızca dağıtılmış, yalnızca HA veya geçmişten dağıtılmış bir HA'ya bir yönlendirici taşınması şu anda desteklenmiyor. Yönlendirici, dağıtılmış HA olarak oluşturulmalıdır. Ters yön de desteklenmiyor. Dağıtımlı bir HA yönlendiricisini yalnızca dağıtılan, yalnızca HA veya miras olarak yeniden yapılandırabilirsiniz.

source: Migration
id: Migrasi
tr_tr: Göç

source: Migration Completed!
id: Migrasi Selesai!
tr_tr: Göç Tamamlandı!

source: Migration process overview
id: ikhtisar proses migrasi
tr_tr: Göç işlemi özeti

source: Miscellaneous
id: Miscellaneous (lain-lain)
tr_tr: Çeşitli

source: Modify ``/etc/neutron/policy.json`` policy entries as follows:
id: Modifikasi entri kebijakan ``/etc/neutron/policy.json`` sebagai berikut:
tr_tr: ``/etc/neutron/policy.json`` politika girdilerini aşağıdaki gibi düzenleyin:

source: Modify the compute nodes with the following components:
id: Memodifikasi node komputasi dengan komponen-komponen berikut:
tr_tr: Hesaplama düğümlerini aşağıdaki bileşenlerle düzenleyin:

source: More information about L2 population see the `OpenStack Manuals <http://docs.ocselected.org/openstack-manuals/kilo/networking-guide/content/ml2_l2pop_scenarios.html>`__.
id: Informasi lebih lanjut tentang populasi L2 lihat `Manual OpenStack<http://docs.ocselected.org/openstack-manuals/kilo/networking-guide/content/ml2_l2pop_scenarios.html>`__.
tr_tr: L2 popülasyonu ile ilgili daha fazla bilgi için `OpenStack Kılavuzu <http://docs.ocselected.org/openstack-manuals/kilo/networking-guide/content/ml2_l2pop_scenarios.html>`__ belgesine bakınız.

source: Most OpenStack deployments use the `libvirt <http://libvirt.org>`__ toolkit for interacting with the hypervisor. Specifically, OpenStack Compute uses libvirt for tasks such as booting and terminating virtual machine instances. When OpenStack Compute boots a new instance, libvirt provides OpenStack with the VIF associated with the instance, and OpenStack Compute plugs the VIF into a virtual device provided by OpenStack Network. The libvirt toolkit itself does not provide any networking functionality in OpenStack deployments.
tr_tr: Çoğu OpenStack kurulumu hypervisor ile iletişime geçmek için `libvirt <http://libvirt.org>`__ araç takımını kullanır. Özellikle, OpenStack Hesaplama, sanal makine sunucuları önyükleme ve sonlandırma gibi görevler için libvirt kullanır. OpenStack Hesaplama yeni bir sunucuyu başlattığında, libvirt, OpenStack'a sunucu ile ilişkili VIF'yi sağlar ve OpenStack Hesaplama, VIF'yi OpenStack Ağ tarafından sağlanan bir sanal aygıta takar. Libvirt araç seti kendisi OpenStack dağıtımlarında herhangi bir ağ işlevselliği sağlamaz.

source: Multiple ``--config-file`` options can be passed if needed.
id: Beberapa opsi ``--config-file`` dapat dilewatkan jika diperlukan.
tr_tr: Eğer gerekliyse birden fazla ``--config-file`` seçeneği verilebilir.

source: Multiple mechanism and type drivers can be used simultaneously to access different ports of the same virtual network.
id: Beberapa driver mekanisme dan tipe dapat digunakan secara bersamaan untuk mengakses port yang berbeda dari jaringan virtual yang sama.
tr_tr: Aynı sanal ağın farklı portlarına erişmek için birden fazla mekanizma ve tip sürücüsü aynı anda kullanılabilir.

source: Multiple smaller layer-2 networks
id: Beberapa jaringan lapisan-2 lebih kecil
tr_tr: Çok katmanlı daha küçük katman-2 ağları

source: Multiple smaller layer-2 networks scale better and shrink failure domains, but leave network selection to the user. Without additional information, users cannot easily differentiate these networks.
id: Beberapa jaringan lapisan-2 lebih kecil berskala yang lebih baik dan menyusutkan failure domain, tetapi meninggalkan pilihan jaringan untuk pengguna. Tanpa informasi tambahan, pengguna tidak dapat dengan mudah membedakan jaringan ini.
tr_tr: Birden çok daha küçük katman-2 ağları daha iyi ölçeklenir ve başarısızlık alanlarını küçültür ancak ağ seçimini kullanıcıya bırakır. Ek bilgi olmadan, kullanıcılar bu ağları kolayca ayırt edemezler.

source: Multiqueue support is available if the following newer versions are used:
id: Dukungan multiqueue tersedia jika versi yang lebih baru berikut digunakan:
tr_tr: Aşağıdaki yeni sürümler kullanıldığında çoklu kuyruk desteği kullanılabilirdir:

source: NAT & Floating IPs
id: NAT & IP mengambang
tr_tr: NAT & Yüzen IP'ler

source: NAT is often implemented by routers, and so we will refer to the host performing NAT as a *NAT router*. However, in OpenStack deployments it is typically Linux servers that implement the NAT functionality, not hardware routers. These servers use the `iptables <http://www.netfilter.org/projects/iptables/index.html>`_ software package to implement the NAT functionality.
id: NAT sering dijalankan oleh router, dan sehingga kita akan merujuk ke host melakukan NAT sebagai *NAT router*. Namun, dalam pengerahan OpenStack, hal itu biasanya server Linux yang mengimplementasikan fungsi NAT, bukan router hardware. Server ini menggunakan `iptables <http://www.netfilter.org/projects/iptables/index.html>` _ paket perangkat lunak untuk menjalankan fungsi NAT.
tr_tr: NAT genellikle yönlendiriciler tarafından uygulanır ve bu nedenle NAT'ı bir * NAT yönlendiricisi * olarak gerçekleştiren ana makineye değineceğiz. Bununla birlikte, OpenStack dağıtımlarında genellikle NAT yönlendiricisini değil, NAT işlevselliğini uygulayan Linux sunucularıdır. Bu sunucular NAT işlevselliğini uygulamak için `iptables <http://www.netfilter.org/projects/iptables/index.html>` _ yazılım paketini kullanmaktadır.

source: NO
tr_tr: HAYIR

source: NO*
tr_tr: HAYIR*

source: NO**
tr_tr: HAYIR**

source: Name
tr_tr: İsim

source: Name resolution for instances
id: Resolusi nama untuk instance
tr_tr: Sunucular için isim çözümleme

source: Name: vm1
tr_tr: İsim: vm1

source: Name: vm2
tr_tr: İsim: vm2

source: Name: vm3
tr_tr: İsim: vm3

source: Native Open vSwitch firewall driver
id: Driver firewall Open vSwitch asli
tr_tr: Yerek Open vSwitch güvenlik duvarı sürücüsü

source: Network IP Availability is an information-only API extension that allows a user or process to determine the number of IP addresses that are consumed across networks and the allocation pools of their subnets. This extension was added to neutron in the Mitaka release.
id: Network IP Availability merupakan information-only API extension yang mengizinkan pengguna atau proses untuk menentukan jumlah alamat IP yang dikonsumsi di seluruh jaringan dan kolam alokasi subnet mereka. Extension (perpanjangan) ini telah ditambahkan ke neutron dalam rilis Mitaka.
tr_tr: Ağ IP Kullanılabilirliği, bir kullanıcıya veya işlemin, ağlar arasında tüketilen IP adreslerinin sayısını ve alt ağlarının tahsis havuzlarını belirlemesine olanak tanıyan salt bilgilendirme amaçlı bir API uzantısıdır. Bu uzantı, Mitaka sürümünde nötrona eklendi.

source: Network address translation
id: Terjemahan alamat Jaringan
tr_tr: Ağ adresi çevirisi

source: Network components
id: Komponen jaringan
tr_tr: Ağ bileşenleri
