Repository: 25hours/openstack-manuals
Catalog: doc/networking-guide/source/locale/*/LC_MESSAGES/networking-guide.po
Languages: id, tr_tr

source: The example configuration involves the following components:
id: Contoh konfigurasi melibatkan komponen-komponen berikut:
tr_tr: Örnek yapılandırma aşağıdaki bileşenleri içerir:

source: The example network ``net1`` must exist before creating ports on it.
tr_tr: Örnek ağ ``net1`` üzerinde bağlantı noktası oluşturulmadan önce var olmalıdır.

source: The examples assume the OpenStack DNS service as the external DNS.
id: Contoh ini menganggap layanan DNS OpenStack sebagai DNS eksternal.
tr_tr: Örnekler, OpenStack DNS hizmetini harici DNS olarak varsayar.

source: The external and self-service network reside in the same address scope.
id: Jaringan eksternal dan self-service berada dalam lingkup alamat yang sama.
tr_tr: Harici ve self-servis ağı aynı adres alanındadır.

source: The external network (12) receives the packet.
id: Jaringan eksternal (12) menerima paket.
tr_tr: Harici ağ (12) paketi alır.

source: The external network (16) receives the packet.
id: External network (16) menerima paket.
tr_tr: Harici ağ (16) paketi alır.

source: The firewall remains in PENDING\_CREATE state until you create a Networking router and attach an interface to it.
id: firewall tetap dalam keadaan PENDING \_CREATE sampai Anda membuat router Networking dan menghubungkan sebuah antarmuka untuk itu.
tr_tr: Güvenlik duvarı, bir Ağ yönlendirici oluşturana ve ona bir arabirim ekleyene kadar PENDING\_CREATE durumunda kalır.

source: The first branch is called expand and is used to store expansion-only migration rules. These rules are strictly additive and can be applied while the Neutron server is running.
id: Cabang pertama disebut memperluas dan digunakan untuk menyimpan aturan migrasi expansion-only. Aturan-aturan ini secara ketat aditif dan dapat diterapkan ketika server Neutron berjalan.
tr_tr: İlk dala genişletme adı verilir ve yalnızca genişleme geçiş kurallarını depolamak için kullanılır. Bu kurallar kesinlikle ilavedir ve Neutron sunucusu çalışırken uygulanabilir.

source: The first step to configure the integration with an external DNS service is to enable the functionality described in :ref:`config-dns-int-dns-resolution`. Once this is done, the user has to take the following steps and restart ``neutron-server``.
id: Langkah pertama untuk mengkonfigurasi integrasi dengan layanan DNS eksternal adalah mengaktifkan fungsi yang dijelaskan dalam :ref: `config-dns-int-dns-resolution`. Setelah ini dilakukan, pengguna harus mengambil langkah berikut dan restart ``neutron-server``.
tr_tr: Entegrasyonu harici bir DNS servisi ile yapılandırmanın ilk adımı, şu konularda açıklanan işlevselliği etkinleştirmektir :ref:`config-dns-int-dns-resolution`. Bu yapıldığında, kullanıcının aşağıdaki adımları atması ve ``neutron-server``ı yeniden başlatması gerekir.

source: The first time host *A* attempts to communicate with host *B*, the destination MAC address is not known. Host *A* makes an ARP request to the local network. The request is a broadcast with a message like this:
id: Waktu pertama host *A* mencoba untuk berkomunikasi dengan host *B*, alamat MAC tujuan tidak diketahui. Host *A* membuat permintaan ARP ke jaringan lokal. Permintaan ini adalah broadcast (penyiaran) dengan pesan seperti ini:
tr_tr: İlk kez ana bilgisayar *A*, ana bilgisayar *B* ile iletişim kurmaya çalışırken, hedef MAC adresi bilinmiyor. Ana makine *A* yerel ağa ARP isteğinde bulunur. İstek şu şekilde bir ileti yayınlıyor:

source: The first value in the ``tenant_network_types`` option becomes the default project network type when a regular user creates a network.
id: Nilai pertama dalam opsi ``tenant_network_types`` menjadi tipe jaringan proyek default ketika user biasa membuat sebuah jaringan.
tr_tr: ``tenant_network_types`` seçeneğindeki ilk değer, normal bir kullanıcı bir ağ oluşturduğunda varsayılan proje ağ türü haline gelir.

source: The flag ``--default`` (and ``--no-default`` flag) is only effective with external networks and has no effects on regular (or internal) networks.
tr_tr: ``--default`` (ve ``--no-default``) bayrağı sadece harici ağlarda etkilisir ve düz (veya dahili) ağlara bir etkisi yoktur.

source: The floating IP agent gateways (one per compute node) reside on 203.0.113.12, 203.0.113.13, and 203.0.113.14.
id: Agen gateway IP mengambang (satu per node komputasi) berada pada 203.0.113.12, 203.0.113.13, dan 203.0.113.14.
tr_tr: Yüzen IP ajan ağ geçitleri (her hesaplama düğümü için bir) 203.0.113.12, 203.0.113.13, ve 203.0.113.14 üzerinde yerleşiktir.

source: The floating IP namespace routes the packet (8) to the distributed router namespace (9) using a pair of IP addresses on the DVR internal network. This namespace contains the instance floating IPv4 address.
id: Namespace IP mengambang me-rute paket (8) ke distributed router namespace (9) menggunakan sepasang alamat IP pada jaringan internal DVR. Namespace ini berisi alamat IPv4 mengambang instance.
tr_tr: Yüzen IP ad alanı, paketi (8) dağıtılmış yönlendirici ad alanına (9) yönlendirir ve DVR dahili ağında bir çift IP adresi kullanır. Bu ad, sunucu kayan IPv4 adresini içerir.

source: The following attributes are added into network and router:
id: Atribut berikut ditambahkan ke dalam jaringan dan router:
tr_tr: Aşağıdaki özellikler ağa ve yönlendiriciye eklendi:

source: The following deployment examples provide building blocks of increasing architectural complexity using the Networking service reference architecture which implements the Modular Layer 2 (ML2) plug-in and either the Open vSwitch (OVS) or Linux bridge mechanism drivers. Both mechanism drivers support the same basic features such as provider networks, self-service networks, and routers. However, more complex features often require a particular mechanism driver. Thus, you should consider the requirements (or goals) of your cloud before choosing a mechanism driver.
id: Contoh pengerahan berikut menyediakan blok bangunan seiring dengan peningkatan kompleksitas arsitektur menggunakan arsitektur referensi layanan Networking yang mengimplementasikan Modular Layer 2 (ML2) plug-in dan Open vSwitch (OVS) ataupun driver mekanisme Linux bridge. Kedua driver mekanisme mendukung fitur dasar yang sama seperti jaringan provider, jaringan self-service, dan router. Namun, fitur yang lebih kompleks sering membutuhkan driver mekanisme tertentu. Dengan demikian, Anda harus mempertimbangkan persyaratan (atau tujuan) dari cloud Anda sebelum pemilihan driver mekanisme.
tr_tr: Aşağıdaki dağıtım örnekleri, Modüler Katman 2 (ML2) eklentisini ve Open vSwitch (OVS) veya Linux köprü mekanizması sürücülerini uygulayan Ağ hizmeti başvuru mimarisi kullanılarak artan mimari karmaşıklığın yapı taşlarını sağlar. Her iki mekanizma sürücüsü, sağlayıcı ağları, self servis ağlar ve yönlendiriciler gibi aynı temel özellikleri destekler. Bununla birlikte, daha karmaşık özellikler genellikle belirli bir mekanizma sürücüsü gerektirir. Bu nedenle, bir mekanizma sürücüsü seçmeden önce bulutunuzun gereksinimlerini (veya hedeflerini) düşünmelisiniz.

source: The following diagram depicts FWaaS v1 protection. It illustrates the flow of ingress and egress traffic for the VM2 instance:
id: Diagram berikut menggambarkan perlindungan FWaaS v1. Ini menggambarkan aliran masuknya (ingress) dan lalu lintas jalan keluar (egress) untuk instance VM2:
tr_tr: Aşağıdaki diyagram FWaaS v1 korumasını tasvir etmektedir. VM2 örneği için giriş ve çıkış trafiğinin akışını göstermektedir:

source: The following example outlines how you can configure service subnets in a DVR-enabled deployment, with the goal of minimizing public IP address consumption. This example uses three subnets on the same external network:
id: Contoh berikut menguraikan bagaimana Anda dapat mengkonfigurasi subnet layanan dalam pengerahan DVR-enabled, dengan tujuan meminimalkan konsumsi alamat IP publik. Contoh ini menggunakan tiga subnet pada jaringan eksternal yang sama:
tr_tr: Aşağıdaki örnek, genel IP adresi tüketimini en aza indirgemek amacıyla bir DVR etkin dağıtımda servis alt ağlarını nasıl yapılandırabileceğinizin ana hatlarını vermektedir. Bu örnek aynı dış ağ üzerinde üç alt ağ kullanmaktadır:

source: The following example uses the ``neutron`` command-line interface (CLI) to create a port chain consisting of three service function instances to handle HTTP (TCP) traffic flows from 192.0.2.11:1000 to 198.51.100.11:80.
tr_tr: Aşağıdaki örnek, 192.0.2.11:1000'den 198.51.100.11:80'e kadar HTTP (TCP) trafik akışlarını işlemek için üç servis işlev sunucusundan oluşan bir bağlantı zinciri oluşturmak için ``neutron`` komut satırı arabirimini (CLI) kullanmaktadır.

source: The following figure describes virtual connectivity among components for two tagged (VLAN) networks. Essentially, all networks use a single OVS integration bridge with different internal VLAN tags. The internal VLAN tags almost always differ from the network VLAN assignment in the Networking service. Similar to the untagged network case, the DHCP agent may reside on a different compute node.
id: Gambar berikut menjelaskan konektivitas virtual antara komponen untuk dua jaringan tag (VLAN). Pada dasarnya, semua jaringan menggunakan jembatan OVS integrasi tunggal dengan tag VLAN internal yang berbeda. Tag VLAN internal yang hampir selalu berbeda dari tugas VLAN jaringan dalam layanan Networking. Mirip dengan kasus jaringan untagged, agen DHCP dapat berada pada node komputasi yang berbeda.
tr_tr: Aşağıdaki resim, iki etiketli (VLAN) ağlar için bileşenler arasındaki sanal bağlantıyı açıklamaktadır. Esasen, tüm ağlar farklı dahili VLAN etiketleriyle tek bir OVS entegrasyon köprüsü kullanır. Dahili VLAN etiketleri, Ağ hizmeti genelde ağ VLAN atamasından farklıdır. Etiketsiz ağ durumunda olduğu gibi DHCP aracı da farklı bir hesaplama düğümünde bulunabilir.

source: The following figure describes virtual connectivity among components for two tagged (VLAN) networks. Essentially, each network uses a separate bridge that contains a port on the VLAN sub-interface on the provider physical network interface. Similar to the single untagged network case, the DHCP agent may reside on a different compute node.
id: Gambar berikut menjelaskan konektivitas virtual antar komponen untuk dua jaringan tag (VLAN). Pada dasarnya, setiap jaringan menggunakan jembatan terpisah yang berisi port pada sub-interface VLAN pada antarmuka jaringan fisik provider. Mirip dengan kasus jaringan tunggal untagged, agen DHCP dapat berada pada node komputasi yang berbeda.
tr_tr: Aşağıdaki resim, iki etiketli (VLAN) ağlar için bileşenler arasındaki sanal bağlantıyı açıklamaktadır. Esasen, her ağ, sağlayıcı fiziksel ağ arayüzündeki VLAN alt arabiriminde bir bağlantı noktası bulunan ayrı bir köprü kullanır. Tek etiketsiz ağ durumunda olduğu gibi, DHCP aracı da farklı bir hesaplama düğümünde bulunabilir.

source: The following figure shows components and connectivity for one self-service network and one untagged (flat) network. In this particular case, the instance resides on the same compute node as the DHCP agent for the network. If the DHCP agent resides on another compute node, the latter only contains a DHCP namespace with a port on the OVS integration bridge.
id: Gambar berikut menunjukkan komponen dan konektivitas untuk satu jaringan self-service dan satu jaringan tanpa tanda (flat). Dalam kasus ini, instance berada pada node komputasi yang sama sebagai agen DHCP untuk jaringan. Jika agen DHCP berada pada node komputasi lain, yang terakhir hanya berisi namespace DHCP dengan port pada jembatan integrasi OVS.
tr_tr: Aşağıdaki resim, bir self-servis ağı ve bir etiketsiz (düz) ağ için bileşenleri ve bağlantıyı göstermektedir. Bu durumda, sunucu, ağ için DHCP aracı ile aynı hesaplama düğümünde bulunur. DHCP aracı başka bir hesaplama düğümünde bulunuyorsa, sonuncusu yalnızca OVS entegrasyon köprüsünde bir bağlantı noktasına sahip bir DHCP ad alanını içerir.

source: The following figure shows components and connectivity for one self-service network and one untagged (flat) network. The master router resides on network node 1. In this particular case, the instance resides on the same compute node as the DHCP agent for the network. If the DHCP agent resides on another compute node, the latter only contains a DHCP namespace and Linux bridge with a port on the overlay physical network interface.
id: Gambar berikut menunjukkan komponen dan konektivitas untuk satu jaringan self-service dan satu jaringan untagged (flat). Router master berada pada node jaringan 1. Dalam kasus ini, instance berada pada node komputasi yang sama sebagai agen DHCP untuk jaringan. Jika agen DHCP berada pada node komputasi lain, yang terakhir hanya berisi namespace DHCP dan Linux bridge dengan port pada interface jaringan fisik overlay.
tr_tr: Aşağıdaki resim, bir self-servis ağı ve bir etiketsiz (düz) ağ için bileşenleri ve bağlantıyı göstermektedir. Ana yönlendirici, ağ düğümü 1'de bulunur. Bu durumda, sunucu, ağ için DHCP aracı ile aynı hesaplama düğümünde bulunur. DHCP aracı başka bir hesaplama düğümünde bulunuyorsa, sonuncusu yalnızca bir DHCP ad alanı ve yer paylaşımı fiziksel ağ arayüzünde bir bağlantı noktası olan Linux köprüsü içerir.

source: The following figure shows components and connectivity for one self-service network and one untagged (flat) provider network. In this particular case, the instance resides on the same compute node as the DHCP agent for the network. If the DHCP agent resides on another compute node, the latter only contains a DHCP namespace and Linux bridge with a port on the overlay physical network interface.
id: Gambar berikut menunjukkan komponen dan konektivitas untuk satu jaringan self-service dan satu jaringan operator untagged (flat). Dalam kasus ini, instance berada pada node komputasi yang sama sebagai agen DHCP untuk jaringan. Jika agen DHCP berada pada node komputasi lain, yang terakhir hanya berisi namespace DHCP dan jembatan Linux dengan port pada interface jaringan fisik overlay.
tr_tr: Aşağıdaki resim, bir kendi kendine hizmet ağına ve bir etiketsiz (düz) sağlayıcı ağı için bileşenleri ve bağlanabilirliği göstermektedir. Bu durumda, sunucu, ağ için DHCP aracı ile aynı hesaplama düğümünde bulunur. DHCP aracı başka bir hesaplama düğümünde bulunuyorsa, sonuncusu yalnızca bir DHCP ad alanı ve yer paylaşımı fiziksel ağ arayüzünde bir bağlantı noktası olan Linux köprüsü içerir.

source: The following figure shows components and connectivity for one self-service network and one untagged (flat) provider network. In this particular case, the instance resides on the same compute node as the DHCP agent for the network. If the DHCP agent resides on another compute node, the latter only contains a DHCP namespace and with a port on the OVS integration bridge.
id: Gambar berikut menunjukkan komponen dan konektivitas untuk satu jaringan self-service dan satu jaringan provider tanpa tanda (flat). Dalam kasus ini, instance berada pada node komputasi yang sama sebagai agen DHCP untuk jaringan. Jika agen DHCP berada pada node komputasi lain, yang terakhir hanya berisi namespace DHCP dan dengan port di jembatan integrasi OVS.
tr_tr: Aşağıdaki resim, bir self-servis ağı ve bir etiketsiz (düz) sağlayıcı ağı için bileşenleri ve bağlanabilirliği göstermektedir. Bu durumda, sunucu, ağ için DHCP aracı ile aynı hesaplama düğümünde bulunur. DHCP aracı başka bir hesaplama düğümünde bulunuyorsa, sonuncusu yalnızca DHCP ad alanı içerir ve OVS entegrasyon köprüsünde bir bağlantı noktası bulunur.

source: The following figure shows components and connectivity for one untagged (flat) network. In this particular case, the instance resides on the same compute node as the DHCP agent for the network. If the DHCP agent resides on another compute node, the latter only contains a DHCP namespace and Linux bridge with a port on the provider physical network interface.
id: Gambar berikut menunjukkan komponen dan konektivitas untuk satu jaringan untagged (flat). Dalam kasus ini, instance berada pada node komputasi yang sama sebagai agen DHCP untuk jaringan. Jika agen DHCP berada pada node komputasi lain, yang terakhir hanya berisi namespace DHCP dan Linux bridge dengan port pada antarmuka jaringan fisik provider.
tr_tr: Aşağıdaki resim, bir etiketsiz (düz) ağ için bileşenleri ve bağlantıları göstermektedir. Bu durumda, örnek, ağ için DHCP aracı ile aynı hesaplama düğümünde bulunur. DHCP aracı başka bir hesaplama düğümünde bulunuyorsa, sonuncusu yalnızca DHCP ad alanı ve sağlayıcı fiziksel ağ arayüzünde bir bağlantı noktası olan Linux köprüsü içerir.

source: The following figure shows components and connectivity for one untagged (flat) network. In this particular case, the instance resides on the same compute node as the DHCP agent for the network. If the DHCP agent resides on another compute node, the latter only contains a DHCP namespace with a port on the OVS integration bridge.
id: Gambar berikut menunjukkan komponen dan konektivitas untuk satu jaringan untagged (flat). Dalam kasus ini, instance berada pada node komputasi yang sama sebagai agen DHCP untuk jaringan. Jika agen DHCP berada pada node komputasi lain, yang terakhir hanya berisi namespace DHCP dengan port di jembatan integrasi OVS.
tr_tr: Aşağıdaki resim, bir etiketsiz (düz) ağ için bileşenleri ve bağlantıları göstermektedir. Bu durumda, sunucu, ağ için DHCP aracı ile aynı hesaplama düğümünde bulunur. DHCP aracı başka bir hesaplama düğümünde bulunuyorsa, sonuncusu yalnızca OVS entegrasyon köprüsünde bir bağlantı noktasına sahip bir DHCP ad alanını içerir.

source: The following illustrates the creation of a port with ``my-port`` in its ``dns_name`` attribute.
id: Berikut ini menggambarkan pembuatan port dengan ``my-port`` dalam attributnya ``dns_name``.
tr_tr: Aşağıda, ``dns_name`` özniteliğinde ``my-port`` ile bir bağlantı noktası oluşturulması gösterilmektedir.

source: The following is an example of an instance creation, showing how its ``hostname`` populates the ``dns_name`` attribute of the allocated port:
id: Berikut ini adalah contoh dari pembuatan instance, yang menunjukkan bagaimana ``hostname`` akan mengisi atribut ``dns_name`` dari port yang dialokasikan:
tr_tr: Aşağıda, sunucu oluşturma işleminin, ``hostname``ini tahsis edilen bağlantı noktasının ``dns_name`` özniteliğini nasıl doldurduğunu gösteren bir örnek verilmiştir:

source: The following is an example:
id: Berikut ini adalah contoh:
tr_tr: Aşağıda bir örnek verilmiştir:

source: The following link provides a great step by step tutorial on setting up IPv6 with OpenStack: `Tenant IPV6 deployment in OpenStack Kilo release <http://www.debug-all.com/?p=52>`_.
id: Link berikut memberikan langkah besar tutorial langkah demi langkah tentang pengaturan IPv6 dengan OpenStack: `Tenant IPV6 deployment in OpenStack Kilo release <http://www.debug-all.com/?p=52>`_.
tr_tr: Şu bağlantı OpenStack ile IPv6 yapılandırması üzerine muhteşem bir adım adım kılavuzu sağlar: `OpenStack Kilo sürümünde kiracı IPv6 kurulumu <http://www.debug-all.com/?p=52>`_.

source: The following manufacturers are known to work:
id: Produsen berikut diketahui bekerja:
tr_tr: Aşağıdaki üreticilerin çalışmaları bilinmektedir:

source: The following sections describe the flow of network traffic in several common scenarios. *North-south* network traffic travels between an instance and external network such as the Internet. *East-west* network traffic travels between instances on the same or different networks. In all scenarios, the physical network infrastructure handles switching and routing among provider networks and external networks such as the Internet. Each case references one or more of the following components:
id: Bagian berikut menjelaskan arus lalu lintas jaringan di beberapa skenario umum. Lalu lintas jaringan *north-south* berjalan antara instance dan jaringan eksternal seperti Internet. Lalu lintas jaringan *east-barat * berjalan antara instance pada jaringan yang sama atau berbeda. Dalam semua skenario, infrastruktur jaringan fisik menangani switching dan routing antara jaringan provider dan jaringan eksternal seperti Internet. Setiap kasus merujuk satu atau lebih dari komponen berikut:
tr_tr: Aşağıdaki bölümlerde, birkaç yaygın senaryoda ağ trafiğinin akışını açıklanmaktadır. *kuzey-güney* ağ trafiği, bir sunucu ile İnternet gibi harici bir ağ arasında dolaşır. *doğu-batı* ağ trafiği aynı veya farklı ağlardaki sunucular arasında dolaşır. Tüm senaryolarda, fiziksel ağ altyapısı, sağlayıcının ağları ve Internet gibi harici ağlar arasındaki geçiş ve yönlendirmeyi ele alır. Her bir durum aşağıdaki bileşenlerden birini veya daha fazlasını referans gösteriyor:

source: The following shows the dnsmasq process that libvirt manages as it appears in the output of :command:`ps`::
id: Berikut ini menunjukkan proses dnsmasq dimana libvirt mengelola seperti yang muncul dalam output :command:`ps`::
tr_tr: Aşağıda, :command:`ps`: komutunun çıktısında göründüğü gibi libvirt'in yönettiği dnsmasq işlemi gösterilmektedir:

source: The following steps create a routed provider network with two segments. Each segment contains one IPv4 subnet and one IPv6 subnet.
id: Langkah-langkah berikut membuat jaringan penyedia dialihkan dengan dua segmen. Setiap segmen berisi satu subnet IPv4 dan satu subnet IPv6.
tr_tr: Aşağıdaki adımlar, iki bölümlü yönlendirilmiş sağlayıcı ağı oluşturur. Her bölüm bir IPv4 alt ağ ve bir de IPv6 alt ağ içerir.

source: The following steps involve compute node 1.
id: Langkah berikut melibatkan komputasi node 1.
tr_tr: Aşağıdaki adımlar hesaplama düğüm 1'i içerir.

source: The following steps involve compute node 1:
id: Langkah berikut melibatkan komputasi node 1:
tr_tr: Aşağıdaki adımlar hesaplama düğümü 1'i içerir:

source: The following steps involve compute node 2:
id: Langkah berikut melibatkan komputasi node 2:
tr_tr: Aşağıdaki adımlar hesaplama düğüm 2'yi içerir:

source: The following steps involve the compute node:
id: Langkah berikut melibatkan node komputasi:
tr_tr: Aşağıdaki adımlar, hesaplama düğümünü içerir:

source: The following steps involve the network node:
id: Langkah berikut melibatkan node jaringan:
tr_tr: Aşağıdaki adımlar ağ düğümünü içerir:

source: The following steps involve the physical network infrastructure:
id: Langkah-langkah berikut melibatkan infrastruktur jaringan fisik:
tr_tr: Aşağıdaki adımlar fiziksel ağ altyapısını içerir:

source: The following table compares v1 and v2 features.
id: Tabel berikut membandingkan fitur v1 dan v2.
tr_tr: Aşağıdaki tablo v1 ve v2'nin özelliklerini karşılaştırmaktadır.

source: The following tables shows which reference implementations support which non-L2 neutron agents:
id: Tabel berikut menunjukkan dimana reference implementation mendukung yang agen neutron non-L2:
tr_tr: Aşağıdaki tablolar hangi referans uygulamalarının L2 olmayan neutron ajanlarını desteklediğini göstermektedir:

source: The following terms are used throughout this document:
id: Istilah berikut digunakan di seluruh dokumen ini:
tr_tr: Bu belge boyunca aşağıdaki terimler kullanılır:

source: The following type drivers are available
id: Driver tipe berikut tersedia
tr_tr: Aşağıdaki tür sürücüleri kullanılabilir

source: The following use cases refer to adding tags to networks, but the same can be applicable to any other supported Networking service resource:
id: Kasus penggunaan (use case) berikut mengacu pada penambahan tag ke jaringan, tetapi hal yang sama dapat berlaku untuk setiap sumber daya layanan Networking yang didukung lainnya:
tr_tr: Aşağıdaki kullanım durumları, ağlara etiket eklemeyi ifade eder, ancak desteklenen herhangi bir Ağ hizmeti kaynağı için de aynı şey geçerli olabilir:
