Repository: 25hours/openstack-manuals
Catalog: doc/networking-guide/source/locale/*/LC_MESSAGES/networking-guide.po
Languages: id, tr_tr

source: The administrator can configure some optional configuration options. For more details, see the related section in the `Configuration Reference <https://docs.openstack.org/ocata/config-reference/networking/networking_options_reference.html#modular-layer-2-ml2-l2-population-mechanism-configuration-options>`__.
id: Administrator dapat mengkonfigurasi beberapa opsi konfigurasi opsional. Untuk lebih jelasnya, lihat bagian terkait di `Configuration Reference <https://docs.openstack.org/ocata/config-reference/networking/networking_options_reference.html#modular-layer-2-ml2-l2-population-mechanism-configuration-options>`__.
tr_tr: Yönetici bazı isteğe bağlı yapılandırma seçeneklerini yapılandırabilir. Daha fazla detay için, `Yapılandırma Referansı <https://docs.openstack.org/ocata/config-reference/networking/networking_options_reference.html#modular-layer-2-ml2-l2-population-mechanism-configuration-options>`__ belgesinde ilgili bölüme bakınız.

source: The administrator can configure the VXLAN multicast group that should be used.
id: Administrator dapat mengkonfigurasi grup multicast VXLAN yang harus digunakan.
tr_tr: Yönetici, kullanılması gereken VXLAN çok noktaya yayın grubunu yapılandırabilir.

source: The administrator needs to configure a list of physical network names that can be used for provider networks. For more details, see the related section in the `Configuration Reference <https://docs.openstack.org/ocata/config-reference/networking/networking_options_reference.html#modular-layer-2-ml2-flat-type-configuration-options>`__.
id: Administrator perlu mengkonfigurasi daftar nama jaringan fisik yang dapat digunakan untuk jaringan provider. Untuk lebih jelasnya, lihat bagian terkait di `Configuration Reference <https://docs.openstack.org/ocata/config-reference/networking/networking_options_reference.html#modular-layer-2-ml2-flat-type-configuration-options>`__.
tr_tr: Yönetici, sağlayıcı ağları için kullanılabilecek fiziksel ağ adlarının bir listesini yapılandırmalıdır. Daha fazla bilgi için, `Yapılandırma <https://docs.openstack.org/ocata/config-reference/networking/networking_options_reference.html#modular-layer-2-ml2-flat-type-configuration-options>`__'ndaki ilgili bölümüne bakın.

source: The administrator needs to configure a list of physical network names that can be used for provider networks. For more details, see the related section in the `Configuration Reference <https://docs.openstack.org/ocata/config-reference/networking/networking_options_reference.html#modular-layer-2-ml2-vlan-type-configuration-options>`__.
id: Administrator perlu mengkonfigurasi daftar nama jaringan fisik yang dapat digunakan untuk jaringan provider. Untuk lebih jelasnya, lihat bagian terkait di `Configuration Reference <https://docs.openstack.org/ocata/config-reference/networking/networking_options_reference.html#modular-layer-2-ml2-vlan-type-configuration-options>`__.
tr_tr: Yönetici, sağlayıcı ağları için kullanılabilecek fiziksel ağ adlarının bir listesini yapılandırmalıdır. Daha fazla bilgi için, `Yapılandırma Referansı <https://docs.openstack.org/ocata/config-reference/networking/networking_options_reference.html#modular-layer-2-ml2-vlan-type-configuration-options>`__ belgesindeki ilgili bölüme bakınız.

source: The administrator needs to configure the range of VLAN IDs that can be used for project network allocation. For more details, see the related section in the `Configuration Reference <https://docs.openstack.org/ocata/config-reference/networking/networking_options_reference.html#modular-layer-2-ml2-vlan-type-configuration-options>`__.
id: Administrator perlu untuk mengkonfigurasi berbagai ID VLAN yang dapat digunakan untuk alokasi jaringan proyek. Untuk lebih jelasnya, lihat bagian terkait di `Configuration Reference <https://docs.openstack.org/ocata/config-reference/networking/networking_options_reference.html#modular-layer-2-ml2-vlan-type-configuration-options>`__.
tr_tr: Yönetici, proje ağı tahsisi için kullanılabilen VLAN kimlikleri aralığını yapılandırmalıdır. Daha fazla bilgi için, `Yapılandırma Kılavuzu <https://docs.openstack.org/ocata/config-reference/networking/networking_options_reference.html#modular-layer-2-ml2-vlan-type-configuration-options>`__ belgesinde ilgili bölüme bakınız.

source: The administrator needs to configure the range of VXLAN IDs that can be used for project network allocation. For more details, see the related section in the `Configuration Reference <https://docs.openstack.org/ocata/config-reference/networking/networking_options_reference.html#modular-layer-2-ml2-vxlan-type-configuration-options>`__.
id: Administrator perlu untuk mengkonfigurasi berbagai ID VXLAN yang dapat digunakan untuk alokasi jaringan proyek. Untuk lebih jelasnya, lihat bagian terkait di `Configuration Reference <https://docs.openstack.org/ocata/config-reference/networking/networking_options_reference.html#modular-layer-2-ml2-vxlan-type-configuration-options>`__.
tr_tr: Yönetici, proje ağı tahsisi için kullanılabilecek VXLAN kimlikleri aralığını yapılandırmalıdır. Daha fazla bilgi için `Yapılandırma Kılavuzu <https://docs.openstack.org/ocata/config-reference/networking/networking_options_reference.html#modular-layer-2-ml2-vxlan-type-configuration-options>`__ belgesinde ilgili alana bakınız.

source: The administrator needs to configure the range of tunnel IDs that can be used for project network allocation. For more details, see the related section in the `Configuration Reference <https://docs.openstack.org/ocata/config-reference/networking/networking_options_reference.html#modular-layer-2-ml2-gre-type-configuration-options>`__.
id: Administrator perlu untuk mengkonfigurasi berbagai ID terowongan (tunnel ID) yang dapat digunakan untuk alokasi jaringan proyek. Untuk lebih jelasnya, lihat bagian terkait di `Configuration Reference <https://docs.openstack.org/ocata/config-reference/networking/networking_options_reference.html#modular-layer-2-ml2-gre-type-configuration-options>`__.
tr_tr: Yönetici, proje ağı tahsisi için kullanılabilecek tünel kimliği aralığını yapılandırmalıdır. Daha fazla bilgi için, `Yapılandırma Kılavuzu <https://docs.openstack.org/ocata/config-reference/networking/networking_options_reference.html#modular-layer-2-ml2-gre-type-configuration-options>`__ belgesindeki ilgili bölüme bakınız.

source: The administrator needs to define a list PCI hardware that shall be used by OpenStack. For more details, see the related section in the `Configuration Reference <https://docs.openstack.org/ocata/config-reference/networking/networking_options_reference.html#modular-layer-2-ml2-sr-iov-mechanism-configuration-options>`__.
id: Administrator perlu mendefinisikan daftar hardware PCI yang harus digunakan oleh OpenStack. Untuk lebih jelasnya, lihat bagian terkait di `Configuration Reference <https://docs.openstack.org/ocata/config-reference/networking/networking_options_reference.html#modular-layer-2-ml2-sr-iov-mechanism-configuration-options>`__.
tr_tr: Yönetici, OpenStack tarafından kullanılacak bir PCI donanım listesi tanımlamalıdır. Daha fazla detay için, `Yapılandırma Referansı <https://docs.openstack.org/ocata/config-reference/networking/networking_options_reference.html#modular-layer-2-ml2-sr-iov-mechanism-configuration-options>`__ belgesinde ilgili bölüme bakınız.

source: The agent currently only supports the Ryu BGP driver.
id: Agen saat ini hanya mendukung driver Ryu BGP.
tr_tr: Ajan mevcutta sadece Ryu BGP sürücüsünü destekler.

source: The attributes can also be left unset.
id: Atribut juga dapat dibiarkan tanpa disetel.
tr_tr: Öz nitelikler ayarlanmadan bırakılabilir.

source: The auto-allocated topology for a user never changes. In practice, when a user boots a server omitting the ``--nic`` option, and not have any neutron network available, nova will invoke the API behind ``auto-allocated-topology-show``, fetch the network UUID, and pass it on during the boot process.
tr_tr: Bir kullanıcı için otomatik olarak ayrılan topoloji hiçbir zaman değişmez. Uygulamada, bir kullanıcı ``--nic`` seçeneğini ihmal eden ve herhangi bir neutron ağı bulunmayan bir sunucu önyüklediğinde, nova ``auto-allocated-topology-show``'ın arkasındaki API'yi çağırıp ağ UUID'sini getirir, ve önyükleme işlemi sırasında onu iletir.

source: The auto-allocation feature creates one network topology in every project where it is used. The auto-allocated network topology for a project contains the following resources:
id: Fitur auto-alokasi menciptakan satu topologi jaringan di setiap proyek dimana ia digunakan. Topologi jaringan auto-allocated untuk proyek berisi sumber daya berikut:
tr_tr: Otomatik ayırma özelliği, kullanılan her projede bir ağ topolojisi oluşturur. Bir proje için otomatik olarak ayrılan ağ topolojisi aşağıdaki kaynakları içerir:

source: The auto-allocation feature introduced in Mitaka simplifies the procedure of setting up an external connectivity for end-users, and is also known as **Get Me A Network**.
id: Fitur auto-alokasi yang diperkenalkan di Mitaka menyederhanakan prosedur pemasangan sebuah konektivitas eksternal untuk end-user, dan juga dikenal sebagai **Get Me A Network**.
tr_tr: Mitaka'da tanıtılan otomatik tahsis özelliği son kullanıcılar için harici bir bağlantı kurma yordamını kolaylaştırır ve ayrıca **Bana Bir Ağ Al** olarak da bilinir.

source: The auto-allocation feature requires at least one default subnetpool. One for IPv4, or one for IPv6, or one of each.
id: Fitur auto-alokasi membutuhkan setidaknya satu subnetpool default. Satu untuk IPv4, atau satu untuk IPv6, atau masing-masing satu.
tr_tr: Otomatik yer ayırma özelliği en azından bir adet varsayılan alt ağ havuzuna ihtiyaç duyar. Bir tane IPv4 için veya bir tane IPv6 için veya bir tane her ikisi için.

source: The basic deployment model consists of one controller node, two or more network nodes, and multiple computes nodes.
id: Model pengerahan dasar terdiri dari satu controller node, dua atau lebih node jaringan, dan beberapa node komputasi.
tr_tr: Temel dağıtım modeli, bir denetleyici düğümden, iki veya daha fazla ağ düğümünden ve çoklu hesaplama düğümlerinden oluşur.

source: The basics
id: Dasar
tr_tr: Temeller

source: The behavior of the neutron router for IPv6 is different than for IPv4 in a few ways.
tr_tr: IPv6 için neutron yönlendiricisinin davranışı birkaç yönden IPv4'ten farklıdır.

source: The burst value is given in kilobits, not in kilobits per second as the name of the parameter might suggest. This is an amount of data which can be sent before the bandwidth limit applies.
id: Burst value diberikan dalam kilobit, bukan di kilobit per detik sebagai nama parameter mungkin menyarankan. Ini adalah jumlah data yang dapat dikirim sebelum batas bandwidth berlaku.
tr_tr: Patlama değeri, parametrenin adı öne sürdüği için saniyede kilobit cinsinden değil, kilobit cinsinden verilmiştir. Bu, bant genişliği uygulanmadan önce gönderilebilen veri miktarıdır.

source: The central concepts with OpenStack firewalls are the notions of a firewall policy and a firewall rule. A policy is an ordered collection of rules. A rule specifies a collection of attributes (such as port ranges, protocol, and IP addresses) that constitute match criteria and an action to take (allow or deny) on matched traffic. A policy can be made public, so it can be shared across projects.
id: Konsep pusat dengan firewall OpenStack adalah pengertian dari kebijakan firewall dan aturan firewall. Kebijakan adalah koleksi aturan yang diperintahkan. Aturan menentukan koleksi atribut (seperti rentang port, protokol, dan alamat IP) yang merupakan kriteria yang cocok dan suatu tindakan untuk melakukan (mengizinkan atau menolak) pada lalu lintas yang cocok. Sebuah kebijakan dapat dibuat publik, sehingga bisa dibagi di seluruh proyek.
tr_tr: OpenStack güvenlik duvarlarıyla temel kavramlar bir güvenlik duvarı politikası ve bir güvenlik duvarı kuralı kavramlarıdır. Bir politika, kuralların sıralı bir birleşimidir. Kural, eşleşme ölçütlerini oluşturan bir eşleşme kümesini (ör. Bağlantı noktası aralıkları, protokol ve IP adresleri) ve eşleşen trafikte (kabul veya reddetmek için) bir eylem belirtir. Bir politika kamuoyuna açıklanabilir, dolayısıyla projeler arasında paylaşılabilir.

source: The client sends a discover ("I’m a client at MAC address ``08:00:27:b9:88:74``, I need an IP address")
id: Klien mengirimkan pilihan ("I’m a client at MAC address ``08:00:27:b9:88:74``, I need an IP address")
tr_tr: İstemci keşif gönderir ("Ben ``08:00:27:b9:88:74`` adresindeki istemciyim, Bir IP adresine ihtiyacım var")

source: The client sends a request ("Server ``10.10.0.131``, I would like to have IP ``10.10.0.112``")
id: Klien mengirimkan permintaan ("Server ``10.10.0.131``, I would like to have IP ``10.10.0.112``")
tr_tr: İstemci bir istek gönderir ("Sunucu ``10.10.0.131``, ``10.10.0.112`` IP adresini almak istiyorum")

source: The cloud consumer can decide via the neutron APIs VNIC_TYPE attribute, if an instance gets a normal OVS port or an SRIOV port.
id: Konsumen cloud dapat memutuskan melalui atribut API VNIC_TYPE neutron, jika sebuah instance mendapat port OVS normal atau port SRIOV.
tr_tr: Bulut tüketici, bir sunucu normal bir OVS bağlantı noktası veya SRIOV bağlantı noktası alırsa, neutron API'leri VNIC_TYPE özniteliği aracılığıyla karar verebilir.

source: The command also indicates if a project lacks network resources.
id: Perintah ini juga menunjukkan jika proyek tidak memiliki sumber daya jaringan.
tr_tr: Komut, ayrıca bir projenin ağ kaynaklarının eksik olup olmadığını da gösterir.

source: The command provides no output.
id: Perintah ini tidak memberikan keluaran (output).
tr_tr: Komut hiç çıktı sağlamaz.

source: The command provides output that includes a completion percentage and the quantity of successful or unsuccessful network resource deletions. An unsuccessful deletion usually indicates sharing of a resource with one or more additional projects.
id: Perintah ini menyediakan output yang mencakup persentase penyelesaian dan kuantitas penghapusan sumber daya jaringan sukses atau gagal. Sebuah penghapusan berhasil biasanya menunjukkan berbagi sumber daya dengan satu atau lebih proyek tambahan.
tr_tr: Komut, bir tamamlanma yüzdesi ve başarılı veya başarısız ağ kaynağı silme miktarını içeren bir çıktı sağlar. Başarısız bir silme genellikle bir kaynağın bir veya daha fazla ek projeyle paylaşılabileceğini gösterir.

source: The configuration supports multiple VXLAN self-service networks. For simplicity, the following procedure creates one self-service network and a router with a gateway on the flat provider network. The router uses NAT for IPv4 network traffic and directly routes IPv6 network traffic.
id: Konfigurasi mendukung beberapa jaringan self-service VXLAN. Untuk mempermudah, prosedur berikut menciptakan satu jaringan self-service dan router dengan gateway di jaringan provider datar (flat). Router menggunakan NAT untuk lalu lintas jaringan IPv4 dan langsung me-rute lalu lintas jaringan IPv6.
tr_tr: Yapılandırma, birden fazla VXLAN self servis ağını destekler. Kolaylık sağlamak için, aşağıdaki yordam bir self-servis ağı ve düz tedarikçi ağında bir ağ geçidi bulunan bir yönlendirici oluşturur. Yönlendirici, IPv4 ağ trafiğinde NAT kullanır ve doğrudan IPv6 ağ trafiğini yönlendirir.

source: The configuration supports one flat or multiple VLAN provider networks. For simplicity, the following procedure creates one flat provider network.
id: Konfigurasi ini mendukung satu jaringan datar atau beberapa jaringan penyedia VLAN. Untuk mempermudah, prosedur berikut menciptakan satu jaringan operator datar.
tr_tr: Yapılandırma, bir düz veya birden çok VLAN sağlayıcı ağını destekler. Kolaylık olması için, aşağıdaki prosedür bir düz tedarikçi ağı oluşturur.

source: The coordination between the Networking service and the Compute scheduler requires the following minimum API micro-versions.
id: Koordinasi antara layanan Networking dan Compute schedule memerlukan mikro-versi API minimum berikut.
tr_tr: Ağ hizmeti ve Hesaplama zamanlayıcısı arasındaki koordinasyon, aşağıdaki minimum API mikro sürümlerini gerektirir.

source: The core plug-in must support the ``availability_zone`` extension. The core plug-in also must support the ``network_availability_zone`` extension to schedule a network according to availability zones. The ``Ml2Plugin`` supports it. The router service plug-in must support the ``router_availability_zone`` extension to schedule a router according to the availability zones. The ``L3RouterPlugin`` supports it.
id: Plug-in inti harus mendukung ekstensi ``availability_zone``. Plug-in inti juga harus mendukung ekstensi ``network_availability_zone`` untuk menjadwalkan jaringan sesuai dengan zona ketersediaan. ``Ml2Plugin`` mendukungnya. Layanan router plug-in harus mendukung ekstensi ``router_availability_zone`` untuk menjadwal router sesuai dengan zona ketersediaan. ``L3RouterPlugin`` mendukungnya.
tr_tr: Çekirdek eklentinin ``availability_zone`` uzantısını desteklemesi gerekir. Çekirdek eklenti, bir ağın kullanılabilirlik bölgelerine göre zamanlamak için ``network_availability_zone`` uzantısını da desteklemelidir. ``Ml2Plugin`` bunu destekliyor. Yönlendirici servisi eklentisi, kullanılabilirlik bölgelerine göre bir yönlendiriciyi zamanlamak için ``router_availability_zone`` uzantısını desteklemelidir. ``L3RouterPlugin`` bunu destekliyor.

source: The creation and modification of provider networks enables use of physical network resources, such as VLAN-s. Enable these changes only for trusted tenants.
tr_tr: Sağlayıcı ağlarının oluşturulması ve değiştirilmesi, VLAN'lar gibi fiziksel ağ kaynaklarının kullanılmasını sağlar. Bu değişiklikleri yalnızca güvenilir kiracılar için etkinleştirin.

source: The current process as designed is a minimally viable migration with the goal of deprecating and then removing legacy networking. Both the Compute and Networking teams agree that a one-button migration process from legacy networking to OpenStack Networking (neutron) is not an essential requirement for the deprecation and removal of the legacy networking at a future date. This section includes a process and tools which are designed to solve a simple use case migration.
id: Proses saat seperti yang dirancang adalah migrasi minimal yang layak dengan tujuan mencela (deprecating) dan kemudian menghapus (removing) jaringan legacy. Tim Compute maupun Networking setuju bahwa proses migrasi one-button dari warisan jaringan untuk OpenStack Networking (neutron) bukan merupakan persyaratan penting untuk depresiasi dan penghapusan warisan jaringan di masa mendatang. Bagian ini mencakup proses dan alat-alat yang dirancang untuk memecahkan migrasi use case migration yang sederhana.
tr_tr: Tasarlanan mevcut süreç, eski ağın kullanımını reddetmek ve ardından kaldırmak amacı ile minimum düzeyde uygulanabilir bir geçiş. Hem Hesaplama hem de Ağ ekipleri, eski ağdan OpenStack Ağa (neutron) tek tuşla geçiş işlemi, gelecekteki bir tarihte eski ağın kaldırılmasına ve kaldırılmasına ilişkin temel bir gereklilik olmadığına katılıyor. Bu bölüm, basit bir kullanım durumu taşıma işlemini çözmek için tasarlanmış bir süreç ve araçları içerir.

source: The currently supported resources are:
id: Sumber daya saat ini didukung adalah:
tr_tr: Şu anda desteklenen kaynaklar şunlardır:

source: The database management command-line tool is called :command:`neutron-db-manage`. Pass the ``--help`` option to the tool for usage information.
id: Alat command-line manajemen database disebut :command:`neutron-db-manage`. Melewatkan opsi ``--help`` ke alat itu untuk informasi penggunaan.
tr_tr: Bu, admin_state_up tekrar ``True`` olarak ayarlanıncaya kadar ciddi güney-kuzey bağlantılarına neden olur. Veritabanı yönetim komut satırı aracı :command:`neutron-db-manage` olarak adlandırılır. Kullanım bilgisi için aracı ``--help`` seçeneği ile çalıştırın.

source: The default ``policy.json`` file will not allow regular users to share objects with every other project using a wildcard; however, it will allow them to share objects with specific project IDs.
id: File ``policy.json`` default tidak akan mengizinkan pengguna biasa untuk berbagi objek dengan proyek lainnya menggunakan wildcard; Namun, hal itu akan mengizinkan mereka untuk berbagi objek dengan ID proyek tertentu.
tr_tr: Varsayılan ``policy.json`` dosyası, normal kullanıcıların nesnelere joker karakter kullanarak başka her projeyle paylaşmalarına izin vermez; Ancak, nesneleri belirli proje kimlikleri ile paylaşmalarına izin verir.

source: The deployment examples refer one or more of the following nodes:
id: Contoh pengerahan merujuk satu atau lebih node berikut:
tr_tr: Dağıtım örnekleri, aşağıdaki düğümlerin bir veya daha fazlasına değinir:

source: The deployment examples refer to one or more of the following networks and network interfaces:
id: Contoh penyebaran mengacu pada satu atau lebih jaringan berikut dan antarmuka jaringan:
tr_tr: Dağıtım örnekleri, aşağıdaki ağlardan bir veya daha fazlasına ve ağ arayüzlerine karşılık gelir:

source: The destination IP address ``93.184.216.34`` is not on any of the connected local networks and would be forwarded to the default gateway at ``10.0.2.2``:
id: Alamat IP tujuan ``93.184.216.34`` tidak pada salah satu jaringan lokal yang terhubung dan akan diteruskan ke gateway default di ``10.0.2.2``:
tr_tr: ``93.184.216.34`` hedef IP adresi bağlı yerel ağlardan birinde değil ve ``10.0.2.2`` varsayılan ağ geçidine iletilecektir:

source: The distributed router namespace routes the packet to self-service network 2.
id: Distributed router namespace me-rute paket ke self-service network 2.
tr_tr: Dağıtılmış yönlendirici ad alanı, paketin self servis ağı 2'ye yönlendirilmesini sağlar.

source: The driver interface is designed to allow separate drivers for each subnet pool. However, the current implementation allows only a single IPAM driver system-wide.
id: Interface driver dirancang untuk memungkinkan driver yang terpisah untuk setiap kolam subnet. Namun, pelaksanaan saat ini memungkinkan hanya system-wide driver IPAM tunggal.
tr_tr: Sürücü arabirimi, her bir alt ağ havuzu için ayrı sürücülere izin verecek şekilde tasarlanmıştır. Bununla birlikte, mevcut uygulama, sistem çapında yalnızca tek bir IPAM sürücüsüne izin verir.

source: The enablement of this functionality is prerequisite for the enablement of the Networking service integration with an external DNS service, which is described in detail in :ref:`config-dns-int-ext-serv`.
id: Pemberdayaan fungsi ini merupakan prasyarat untuk pemberdayaan dari integrasi layanan Networking dengan layanan DNS eksternal, yang dijelaskan secara rinci dalam :ref: `config-dns-int-ext-serv`.
tr_tr: Bu işlevselliğin etkinleştirilmesi, ayrıntılı olarak :ref:`config-dns-int-ext-serv`de açıklanan harici bir DNS hizmeti ile Ağ hizmeti entegrasyonunun etkinleştirilmesi için ön şarttır.

source: The example configuration assumes sufficient knowledge about the Networking service, routing, and BGP. For basic deployment of the Networking service, consult one of the :ref:`deploy`. For more information on BGP, see `RFC 4271 <https://tools.ietf.org/html/rfc4271>`_.
id: Contoh konfigurasi mengasumsikan pengetahuan yang cukup tentang layanan Networking, routing, dan BGP. Untuk pengerahan dasar layanan Networking, konsultasikan salah satu :ref: `deploy`. Untuk informasi lebih lanjut tentang BGP, lihat `RFC 4271 <https://tools.ietf.org/html/rfc4271>`_.
tr_tr: Örnek yapılandırma, Ağ servisi, yönlendirme ve BGP hakkında yeterli bilgiyi üstlenir. Ağ servisinin temel dağıtımı için, aşağıdakilerden birine başvurun:ref:`deploy`. BGP üzerideki daha fazla bilgi için, `RFC 4271 <https://tools.ietf.org/html/rfc4271>`_ belgesine bakınız.
