Repository: 25hours/openstack-manuals
Catalog: doc/networking-guide/source/locale/*/LC_MESSAGES/networking-guide.po
Languages: id, tr_tr

source: Direct port and normal port instances reside on the same compute node.
id: Instance port langsung dan instance port yang normal berada pada node komputasi yang sama.
tr_tr: Doğrudan bağlantı noktası ve normal bağlantı noktası sunucuları aynı hesaplama düğümüne aittir.

source: Direct port instance that uses floating IP address and network node are located on the same host.
id: Instance port langsung yang menggunakan alamat IP mengambang dan node jaringan terletak pada host yang sama.
tr_tr: Yüzen IP adresini ve ağ düğümünü kullanan doğrudan bağlantı noktası sunucusu aynı ana bilgisayarda bulunur.

source: Disable libvirt networking
id: Nonaktifkan libvirt networking
tr_tr: Libvirt Ağı Etkisiz hale getir

source: Disable nova-compute.
id: Nonaktifkan nova-compute.
tr_tr: Nova-compute'u devre dışı bırak.

source: Disable service plug-ins because provider networks do not require any. However, this breaks portions of the dashboard that manage the Networking service. See the `Ocata Install Tutorials and Guides <https://docs.openstack.org/project-install-guide/ocata>`__ for more information.
id: Nonaktifkan layanan plug-in karena jaringan operator tidak memerlukan. Namun, ini mengistirahatkan bagian dari dashboard yang mengelola layanan Networking. Lihat `Ocata Install Tutorials and Guides <https://docs.openstack.org/project-install-guide/ocata>`__ untuk informasi lebih lanjut.
tr_tr: Hizmet sağlayıcı eklentilerini devre dışı bırakın; çünkü sağlayıcı ağları herhangi bir gereklilik göstermez. Bununla birlikte, bu, Ağ hizmetini yöneten gösterge tablosunun bölümlerini bozar. Daha fazla bilgi için `Ocata Kurulum Belgeleri ve Kılavuzları <https://docs.openstack.org/project-install-guide/ocata>`__ na bakın.

source: Disable the DHCP agent on HostA before you stop it:
id: Menonaktifkan agen DHCP pada HostA sebelum Anda menghentikannya:
tr_tr: HostA'daki DHCP ajanını durdurmadan önce devre dışı bırakın:

source: Disable the hypervisor. This would be a good time to live migrate or evacuate the compute node, if supported.
id: Nonaktifkan hypervisor. Ini akan menjadi saat yang tepat untuk bermigrasi secara langsung (live) atau mengevakuasi node komputasi, jika didukung.
tr_tr: Üst denetleyiciyi devre dışı bırakın. Destekleniyorsa hesaplama düğümünü göç ettirmek veya boşaltmak için iyi bir zaman olacaktır.

source: Disabling and removing an agent
id: Menonaktifkan dan menghapus agen
tr_tr: Bir ajanı devre dışı bırakmak veya kaldırmak

source: Distributed Virtual Routing with VRRP
id: Distributed Virtual Routing dengan VRRP
tr_tr: VRRP ile Dağıtık Sanal Yönlendirme

source: Do essentially the same thing for IPv6 and there are now two subnet pools. Regular projects can see them. (the output is trimmed a bit for display)
id: Lakukan hal pada dasarnya yang sama untuk IPv6 dan sekarang ada dua kolam subnet. Proyek regular dapat melihat mereka. (Output dipangkas sedikit untuk display)
tr_tr: IPv6 için temel olarak aynı şeyi yapın ve şimdi iki altağ havuzunuz var. Normal projeler bunları görebilir. (çıktı görselleştirmek için sadeleştirilmiştir)

source: Do not use this tool when creating or migrating an instance as it throws an error when the bridge does not exist.
id: Jangan menggunakan alat ini saat membuat atau memigrasikan instance seperti pelemparan kesalahan ketika jembatan (bridge) tidak ada.
tr_tr: Köprü mevcut değilken bir sunucu oluştururken veya göç ederken bu aracı kullanmayın, çünkü köprü mevcut değilse bir hata üretir.

source: Downlink the router on the previously created subnet
id: Downlink router di subnet yang dibuat sebelumnya
tr_tr: Daha önce oluşturulmuş altağa yönlendiriciyi bağlayın

source: Drivers other than the default one may require extra configuration, please refer to :ref:`extra-driver-conf`
id: Driver lain dari yang standar mungkin memerlukan konfigurasi tambahan, silakan lihat :ref:`extra-driver-conf`
tr_tr: Varsayılanın dışındaki sürücüler fazladan bir yapılandırma gerektirebilir, lütfen bakın :ref:`extra-driver-conf`

source: Due to direct connection, some features are not available when using SRIOV. For example, DVR, security groups, migration.
id: Karena hubungan langsung, beberapa fitur tidak tersedia saat penggunaan SRIOV. Misalnya, DVR, kelompok keamanan, migrasi.
tr_tr: Doğrudan bağlantı nedeniyle, bazı özellikler SRIOV kullanırken kullanılamaz. Örneğin, DVR, güvenlik grupları, göç.

source: Due to the direct connection, some features are not available when using it on the compute node. For example, DVR, security groups and arp-spoofing protection.
id: Karena hubungan langsung, beberapa fitur tidak tersedia saat menggunakannya pada node komputasi. Misalnya, DVR, kelompok keamanan dan perlindungan arp-spoofing.
tr_tr: Doğrudan bağlantı nedeniyle, hesaplama düğümünde kullanırken bazı özellikler kullanılamaz. Örneğin, DVR, güvenlik grupları ve arp aldatmacası koruması.

source: During IP allocation, the :ref:`IPAM <config-ipam>` driver returns an address from a subnet with a service type matching the port device owner. If no subnets match, or all matching subnets lack available IP addresses, the IPAM driver attempts to use a subnet without any service types to preserve compatibility. If all subnets on a network have a service type, the IPAM driver cannot preserve compatibility. However, this feature enables strict IP allocation from subnets with a matching device owner. If multiple subnets contain the same service type, or a subnet without a service type exists, the IPAM driver selects the first subnet with a matching service type. For example, a floating IP agent gateway port uses the following selection process:
id: Selama alokasi IP, driver :ref:`IPAM <config-ipam>` mengembalikan alamat dari subnet dengan tipe layanan yang cocok dengan pemilik perangkat port. Jika tidak ada subnet cocok, atau semua subnet yang cocok kekurangan alamat IP yang tersedia, driver IPAM mencoba untuk menggunakan subnet tanpa tipe layanan untuk melestarikan kompatibilitas. Jika semua subnet pada jaringan memiliki tipe layanan, driver IPAM tidak dapat melestarikan kompatibilitas. Namun, fitur ini mengaktifkan alokasi IP yang ketat dari subnet dengan pemilik perangkat yang cocok. Jika beberapa subnet berisi tipe layanan yang sama, atau subnet tanpa tipe layanan itu ada, driver IPAM memilih subnet pertama dengan tipe layanan yang cocok. Misalnya, port gerbang agen IP mengambang menggunakan proses seleksi berikut:
tr_tr: IP tahsisi sırasında :ref:`IPAM <config-ipam>` sürücüsü, bağlantı noktası aygıtı sahibiyle eşleşen bir hizmet türüne sahip bir alt ağdan bir adres döndürür. Hiçbir alt ağa uymuyorsa veya eşleşen tüm alt ağların kullanılabilir IP adresleri yoksa, IPAM sürücüsü uyumluluğu korumak için herhangi bir hizmet türü olmaksızın bir alt ağ kullanmaya çalışır. Bir ağdaki tüm alt ağların bir hizmet türü varsa, IPAM sürücüsü uyumluluğu koruyamaz. Bununla birlikte, bu özellik eşleşen bir aygıt sahibi olan alt ağlardan sıkı IP tahsisi yapılmasını sağlar. Birden çok alt ağa aynı hizmet türü içeriyorsa veya bir hizmet türü olmayan bir alt ağ varsa, IPAM sürücüsü, eşleşen bir hizmet türü olan ilk alt ağı seçer. Örneğin, bir kayan IP aracı ağ geçidi bağlantı noktası aşağıdaki seçim sürecini kullanır:

source: During normal operation, ``keepalived`` on the master router periodically transmits *heartbeat* packets over a hidden network that connects all VRRP routers for a particular project. Each project with VRRP routers uses a separate hidden network. By default this network uses the first value in the ``tenant_network_types`` option in the ``ml2_conf.ini`` file. For additional control, you can specify the self-service network type and physical network name for the hidden network using the ``l3_ha_network_type`` and ``l3_ha_network_name`` options in the ``neutron.conf`` file.
id: Selama operasi normal, `` keepalived`` pada router utama secara berkala mentransmisikan paket *heartbeat* melalui jaringan tersembunyi yang menghubungkan semua router VRRP untuk proyek tertentu. Setiap proyek dengan router VRRP menggunakan jaringan tersembunyi yang terpisah. Secara default jaringan ini menggunakan nilai pertama dalam opsi ``tenant_network_types`` dalam file ``ml2_conf.ini`` file. Untuk kontrol tambahan, Anda dapat menentukan tipe jaringan self-service dan nama jaringan fisik untuk jaringan tersembunyi menggunakan opsi ``l3_ha_network_type`` dan ``l3_ha_network_name`` dalam file ``neutron.conf``.
tr_tr: Normal çalışma sırasında ana yönlendirici üzerindeki "keepalived", belirli bir proje için tüm VRRP yönlendiricilerini birbirine bağlayan gizli bir ağa *heartbeat* paketlerini periyodik olarak iletir. VRRP yönlendiricileriyle yapılan her proje ayrı bir gizli ağ kullanır. Varsayılan olarak bu ağ, ``ml2_conf.ini`` dosyasındaki ``tenant_network_types`` seçeneğindeki ilk değeri kullanır. Ek kontrol için, ``neutron.conf`` dosyasındaki ``l3_ha_network_name`` ve ``l3_ha_network_name`` seçeneklerini kullanarak gizli ağ için self servis ağ türünü ve fiziksel ağ adını belirtebilirsiniz.

source: During normal operation, the master router periodically transmits *heartbeat* packets over a hidden project network that connects all HA routers for a particular project.
id: Selama operasi normal, master router secara periodik mengirimkan paket *heartbeat* melalui jaringan proyek tersembunyi yang menghubungkan semua router HA untuk proyek tertentu.
tr_tr: Normal işlem sırasında, ana yönlendirici, periyodik olarak, belli bir proje için tüm HA yönlendiricilerin bağlandığı gizli proje ağları üzerinden *heartbeat* paketleri geçirir.

source: During the migration, nova-network API calls will go through an additional internal conversion to Networking calls. This will have different and likely poorer performance characteristics compared with either the pre-migration or post-migration APIs.
id: Selama migrasi, panggilan nova-network API akan melalui konversi internal tambahan untuk panggilan Networking. Ini akan memiliki karakteristik kinerja yang berbeda dan mungkin lebih buruk dibandingkan dengan pre-migration API ataupun post-migration API
tr_tr: Taşıma sırasında, nova-ağ API çağrıları, Ağ çağrılarına ek bir dahili dönüştürme yoluyla geçecektir. Bu, taşıma öncesi veya geçiş sonrası API'lara kıyasla farklı ve muhtemelen daha kötü performans özelliklerine sahip olacak.

source: Each available network type is managed by an ML2 type driver. Type drivers maintain any needed type-specific network state. They validate the type specific information for provider networks and are responsible for the allocation of a free segment in project networks.
id: Setiap tipe jaringan yang tersedia dikelola oleh driver tipe ML2. Driver tipe memelihara setiap keadaan jaringan type-specific yang dibutuhkan. Mereka memvalidasi informasi spesifik tipe untuk jaringan penyedia dan bertanggung jawab untuk alokasi segmen bebas di jaringan proyek.
tr_tr: Kullanılabilir her ağ türü bir ML2 türü sürücü tarafından yönetilir. Tür sürücüleri, türe özgü herhangi bir ağ durumunu korur. Sağlayıcı ağları için türe özgü bilgileri doğrularlar ve proje ağlarında ücretsiz bir bölüm tahsisinden sorumludurlar.

source: Each building block defines the quantity and types of nodes including the components on each node.
id: Setiap blok bangunan mendefinisikan jumlah dan tipe node termasuk komponen pada setiap node.
tr_tr: Her bir yapı bloğu, her düğümdeki bileşenler de dahil olmak üzere düğümlerin niceliğini ve türünü tanımlar.

source: Each network namespace also has its own routing table, and in fact this is the main reason for namespaces to exist. A routing table is keyed by destination IP address, so network namespaces are what you need if you want the same destination IP address to mean different things at different times - which is something that OpenStack Networking requires for its feature of providing overlapping IP addresses in different virtual networks.
id: Setiap namespace jaringan juga memiliki tabel routing sendiri, dan sebenarnya ini adalah alasan utama untuk namespace ada. Sebuah tabel routing diketik dengan alamat IP tujuan, sehingga namespace jaringan menjadi apa yang Anda butuhkan jika Anda ingin alamat IP tujuan yang sama dengan kata lain hal yang berbeda pada waktu yang berbeda - namespace merupakan sesuatu dimana OpenStack Networking perlu mengetahui fitur-fiturnya yang menjadi sumber alamat IP yang tumpang tindih di berbagai jaringan virtual.
tr_tr: Her ağ ad alanı kendi yönlendirme tablosuna sahiptir, ve aslında bu ad alanlarının var olmasının ana sebebidir. Bir yönlendirme tablosu hedef IP adresi ile anahtarlanır, böylece ağ ad alanları, eğer farklı zamanlarda farklı şeyler ifade eden aynı hedef IP adresini - farklı sanal ağlardaki yer paylaşımlı IP adresleri sağlama özelliği için OpenStack Ağ servinin ihtiyaç duyduğu - istiyorsanız ihtiyacınız olan şeydir.

source: Each network namespace also has its own set of iptables (for both IPv4 and IPv6). So, you can apply different security to flows with the same IP addressing in different namespaces, as well as different routing.
id: Setiap namespace jaringan juga telah mempunyai IP sendiri dari iptables (untuk IPv4 dan IPv6). Jadi, Anda dapat menerapkan keamanan yang berbeda untuk arus (flow) dengan alamat IP yang sama di namespace yang berbeda, serta routing yang berbeda juga
tr_tr: Her ağ ad alanının kendi iptables kümesi (hem IPv4 hem de IPv6 için) vardır. Bu nedenle, farklı ad alanlarında aynı IP adresiyle akışlara farklı yönlendirme uygulayabilir ve farklı yönlendirme yapabilirsiniz.

source: Each project contains a ``default`` security group that allows all egress traffic and denies all ingress traffic. You can change the rules in the ``default`` security group. If you launch an instance without specifying a security group, the ``default`` security group automatically applies to it. Similarly, if you create a port without specifying a security group, the ``default`` security group automatically applies to it.
id: Setiap proyek berisi grup keamanan ``default`` yang mengizinkan semua lalu lintas egress dan menyangkal semua lalu lintas ingress. Anda dapat mengubah aturan dalam grup keamanan ``default``. Jika Anda memulai sebuah instance tanpa menentukan kelompok keamanan, grup keamanan ``default`` otomatis berlaku untuk itu. Demikian pula, jika Anda membuat sebuah port tanpa menentukan kelompok keamanan, grup keamanan ``default`` otomatis berlaku untuk itu.
tr_tr: Her proje, tüm çıkış trafiğini mümkün kılan ve tüm giriş trafiğini reddeden bir ``varsayılan`` güvenlik grubu içermektedir. Kuralları ``varsayılan`` güvenlik grubundan değiştirebilirsiniz. Bir sunucuyu bir güvenlik grubu belirtmeden başlatırsanız, ``varsayılan`` güvenlik grubu otomatik olarak ona uygulanır. Benzer şekilde, bir güvenlik grubu belirtmeden bir bağlantı noktası oluşturursanız, ``varsayılan`` güvenlik grubu otomatik olarak ona uygulanır.

source: Each router interface is associated with an address scope by looking at subnets connected to the network. When a router connects to an external network with matching address scopes, network traffic routes between without Network address translation (NAT). The router marks all traffic connections originating from each interface with its corresponding address scope. If traffic leaves an interface in the wrong scope, the router blocks the traffic.
id: Setiap interface router dikaitkan dengan lingkup alamat dengan melihat subnet terhubung ke jaringan. Ketika router menghubungkan ke jaringan eksternal dengan pencocokan lingkup alamat, lalu lintas me-rute jaringan antar tanpa Network Address Translation (NAT). Router menandai semua koneksi lalu lintas yang berasal dari masing-masing antarmuka dengan lingkup alamat yang sesuai. Jika lalu lintas meninggalkan antarmuka dalam lingkup yang salah, router memblok lalu lintas.
tr_tr: Her yönlendirici arabirimi, ağa bağlı alt ağlara bakarak bir adres alanıyla ilişkilendirilir. Bir yönlendirici, eşleşen adres alanlarıyla harici bir ağa bağlandığında, Ağ trafiği, Ağ adresi çevirisi (NAT) olmadan güzergah yönlendirir. Yönlendirici, her arayüzden gelen tüm trafik bağlantılarını ilgili adres alanı ile işaretler. Trafiğin bir arabirimi yanlış alanda bırakması durumunda, yönlendirici trafiği engeller.

source: Each segment requires at least one subnet that explicitly belongs to that segment. The association between a segment and a subnet distinguishes a routed provider network from other types of networks. The Networking service enforces that either zero or all subnets on a particular network associate with a segment. For example, attempting to create a subnet without a segment on a network containing subnets with segments generates an error.
id: Setiap segmen memerlukan setidaknya satu subnet yang memilik segmen itu secara eksplisit. Hubungan antara segmen dan subnet membedakan jaringan penyedia dialihkan (routed) dari jenis jaringan lainnya. Layanan Networking memberlakukan bahwa subnet nol atau semua subnet pada jaringan tertentu yang berasosiasi dengan segmen. Misalnya, usaha untuk membuat subnet tanpa segmen pada jaringan yang berisi subnet dengan segmen akan menghasilkan kesalahan.
tr_tr: Her bölüm, açıkça bu segmente ait en az bir alt ağ gerektirir. Bir segment ve bir alt ağ arasındaki ilişki, yönlendirilmiş bir sağlayıcı ağını diğer ağ türlerinden ayırır. Ağ hizmeti, belirli bir ağdaki sıfır veya tüm alt ağların bir bölümle ilişkilendirilmesini zorlar. Örneğin, segmentleri olan alt ağları içeren bir ağda bir bölüm olmadan bir alt ağ oluşturmaya çalışılırken bir hata oluşur.

source: East-west scenario 1: Instances on different networks on the same router
id: East-west scenario 1: Instances pada jaringan yang berbeda pada router yang sama
tr_tr: Doğu-batı senaryosu 1: Aynı yönlendirici üzerindeki farklı ağlardaki sunucular

source: East-west scenario 1: Instances on the same network
id: East-west scenario 1: Instance pada jaringan yang sama
tr_tr: Doğu-batı senaryosu 1: Aynı ağ üzerindeki sunucular

source: East-west scenario 2: Instances on different networks
id: East-west scenario 2: Instances pada jaringan yang berbeda
tr_tr: Doğu-batı senaryosu 2: Farklı ağlardaki sunucular

source: Edit the FWaaS section in the ``/etc/neutron/neutron.conf`` file to indicate the agent version and driver:
id: Edit bagian FWaaS di file ``/etc/neutron/neutron.conf`` menunjukkan versi agen dan driver:
tr_tr: Ajan sürümünü ve sürücüsünü belirtmek için ``/etc/neutron/neutron.conf`` dosyasındaki FWaaS bölümünü düzenleyin:

source: Edit the ``/etc/neutron/neutron.conf`` file and assign a value different to ``openstacklocal`` (its default value) to the ``dns_domain`` parameter in the ``[default]`` section. As an example:
id: Edit file ``/etc/neutron/neutron.conf`` dan menetapkan nilai yang berbeda untuk (nilai default) ``openstacklocal`` ke parameter ``dns_domain`` dalam bagian ``[default]``. Sebagai contoh:
tr_tr: ``/etc/neutron/neutron.conf`` dosyasını düzenleyin ve ``[default]`` bölümündeki ``dns_domain`` parametresine ``openstacklocal``(varsayılan değeri)'dan farklı bir değer atayın. Örnek olarak:

source: Edit the ``[default]`` section of ``/etc/neutron/neutron.conf`` and specify the external DNS service driver to be used in parameter ``external_dns_driver``. The valid options are defined in namespace ``neutron.services.external_dns_drivers``. The following example shows how to set up the driver for the OpenStack DNS service:
id: Edit ``[default]`` section of ``/etc/neutron/neutron.conf`` dan tentukan driver layanan DNS eksternal yang akan digunakan dalam parameter ``external_dns_driver``. Opsi valid didefinisikan dalam namespace ``neutron.services.external_dns_drivers``. Contoh berikut menunjukkan cara mengatur driver untuk layanan DNS OpenStack:
tr_tr: ``/etc/neutron/neutron.conf`` dosyasının ``[default]`` bölümünü düzenleyin ve ``external_dns_driver`` parametresinde kullanılacak harici DNS servis sürücüsünü belirtin. Geçerli seçenekler ad alanı ``neutron.services.external_dns_drivers`` olarak tanımlanır. Aşağıdaki örnek, OpenStack DNS hizmeti için sürücüyü nasıl ayarlayacağınızı gösterir:

source: Edit the ``ovs_agent.ini`` or ``linuxbridge_agent.ini`` file on each compute node. For example:
id: Edit file ``ovs_agent.ini`` atau ``linuxbridge_agent.ini`` pada setiap node komputasi. Sebagai contoh:
tr_tr: Her bir hesaplama düğümünde ``ovs_agent.ini`` veya ``linuxbridge_agent.ini`` dosyasını düzenleyin. Örneğin:

source: Edit the ``sriov_agent.ini`` file on each compute node. For example:
id: Edit file ``sriov_agent.ini`` pada setiap node komputasi. Sebagai contoh:
tr_tr: Her hesaplama düğümü üzerinde ``sriov_agent.ini`` dosyasını düzenleyin. Örneğin:

source: Effectively the ``ipv6_gateway`` flag takes precedence over an RA that is received from the upstream router. If it is desired to use a GUA next hop that is accomplished by allocating a subnet to the external router port and assigning the upstream routers GUA address as the gateway for the subnet.
id: Secra efektif flag ``ipv6_gateway`` diutamakan melalui RA yang diterima dari router hulu. Jika ini diinginkan untuk menggunakan GUA next hop yang dicapai dengan mengalokasikan subnet ke port router eksternal dan menempatkan alamat GUA router hulu sebagai gateway untuk subnet.
tr_tr: Etkili olarak "ipv6_gateway" bayrağı, üst yönlendiriciden gelen bir RA'dan önceliklidir. Harici yönlendirici bağlantı noktasına bir alt ağ atayarak ve alt ağ için ağ geçidi olarak GUA adresini üst yönlendiricileri atayarak gerçekleştirilen bir GUA sonraki atlamayı kullanmak isteniyorsa.

source: Egress instance traffic flows similar to north-south scenario 1, except SNAT changes the source IP address of the packet to the floating IPv4 address rather than the router IP address on the provider network.
id: Egress instance traffic mengalir mirip dengan north-south scenario 1, kecuali SNAT perubahan alamat IP sumber dari paket ke alamat IPv4 mengambang bukannya alamat IP router pada jaringan provider.
tr_tr: Çıkış sunucu trafiği, kuzey-güney senaryosu 1'e benzer, ancak SNAT, paketin kaynak IP adresini sağlayıcı ağı üzerindeki yönlendirici IP adresinden ziyade kayan IPv4 adresine değiştirir.

source: Egress traffic follows similar steps in reverse, except SNAT changes the source IPv4 address of the packet to the floating IPv4 address.
id: Egress traffic mengikuti langkah-langkah serupa secara terbalik, kecuali SNAT mengubah alamat IPv4 sumber paket ke alamat IPv4 mengambang.
tr_tr: Çıkış trafiği benzer adımları tersine çevirir, ancak SNAT, paketin kaynak IPv4 adresini kayan IPv4 adresine değiştirir.

source: Enable FWaaS v1
tr_tr: FWaaS v1'i etkinleştir

source: Enable FWaaS v2
id: Aktifkan FWaaS v2
tr_tr: FWaaS v2'yi etkinleştir

source: Enable IOMMU in Linux by adding ``intel_iommu=on`` to the kernel parameters, for example, using GRUB.
id: Aktifkan IOMMU di Linux dengan menambahkan ``intel_iommu = on`` dengan parameter kernel, misalnya, menggunakan GRUB.
tr_tr: Çekirdek parametrelerine, örneğin GRUB kullanarak, ``intel_iommu=on`` ekleyerek Linux'ta IOMMU'yu etkinleştirin.

source: Enable VRRP.
id: Aktifkan VRRP.
tr_tr: VRRP'yi etkinleştir.

source: Enable a nova-api proxy that recreates internal Compute objects from Networking information (via the Networking REST API).
id: Aktifkan proxy nova-api yang menciptakan objek Compute internal dari informasi Networking (melalui Networking REST API).
tr_tr: Dahili Hesap nesnelerini Ağ Bilgisi bilgilerinden (Ağ REST API'sı aracılığıyla) yeniden oluşturan bir nova-api vekili etkinleştirin.

source: Enable distributed routing by default for all routers.
id: Aktifkan routing terdistribusikan dengan default untuk semua router.
tr_tr: Tüm yönlendiriciler için varsayılan olarak dağıtılmış yönlendirmeyi etkinleştirin.
