Repository: 25hours/openstack-manuals
Catalog: doc/networking-guide/source/locale/*/LC_MESSAGES/networking-guide.po
Languages: id, tr_tr

source: Start by creating a listener, attaching a pool, and then adding members:
id: Mulailah dengan membuat pendengar, melekatkan kolam, dan kemudian menambahkan anggota:
tr_tr: Bir dinleyici oluşturup bir havuz ekleyerek ve ardından üyeler ekleyerek başlayın:

source: Start by creating a load balancer on a network. In this example, the ``private`` network is an isolated network with two web server instances:
id: Mulailah dengan pembuatan penyeimbang beban pada jaringan. Dalam contoh ini, jaringan ``private`` merupakan jaringan terisolasi dengan dua instance web server:
tr_tr: Bir ağda bir yük dengeleyicisi oluşturarak başlayın. Bu örnekte, ``private`` ağ, iki web sunucusuna sahip izole bir ağdır:

source: Start neutron-server in intended final config, except with REST API restricted to read-write only by nova-api.
id: Mulailah neutron-server di config akhir yang ditujukan, kecuali dengan REST API yang terbatas untuk hanya read-write dengan nova-api.
tr_tr: neutron sunucusunu nihai yapılandırmada başlatın; ancak, yalnızca nova-api tarafından okuma-yazma için sınırlandırılmış REST API dışında.

source: Start the LBaaS v2 agent:
id: Mulai agen LBaaS v2:
tr_tr: LBaaS v2 ajanını başlat:

source: Start the following services:
id: Mulai layanan berikut:
tr_tr: Aşağıdaki servisleri başlatın:

source: Starting with the Liberty release, OpenStack Networking includes a pluggable interface for the IP Address Management (IPAM) function. This interface creates a driver framework for the allocation and de-allocation of subnets and IP addresses, enabling the integration of alternate IPAM implementations or third-party IP Address Management systems.
id: Dimulai dari rilis Liberty, OpenStack Networking mencakup antarmuka pluggable untuk fungsi IP Address Manajemen (IPAM). Interface ini menciptakan kerangka kerja driver untuk alokasi dan de-alokasi subnet dan alamat IP, yang memungkinkan integrasi implementasi IPAM alternatif atau pihak ketiga sistem IP Address Manajemen.
tr_tr: Liberty sürümüyle başlayan OpenStack Networking, IP Adresi Yönetimi (IPAM) işlevi için takılabilir bir arabirim içerir. Bu arabirim, alt ağların ve IP adreslerinin tahsisi ve dağıtımı için bir sürücü çerçevesi oluşturarak alternatif IPAM uygulamalarının veya üçüncü taraf IP Adresi Yönetim sistemlerinin entegrasyonunu sağlar.

source: Stateless Address Auto Configuration (SLAAC)
tr_tr: Tabiyetsiz Adres Otomatik Yapılandırması (SLAAC)

source: Stop the DHCP agent on HostA. Besides stopping the ``neutron-dhcp-agent`` binary, you must stop the ``dnsmasq`` processes.
id: Hentikan agen DHCP pada HostA. Selain penghentian binary ``neutron-dhcp-agent``, Anda harus menghentikan proses ``dnsmasq``.
tr_tr: HostA üzerindeki DHCP ajanını durdurun. ``neutron-dhcp-agent`` çalıştırılabilir dosyasını durdurmanın dışında, ``dnsmasq`` işlemlerini de durdurmak zorundasınız.

source: Stop the DHCP agent on HostB too.
id: Hhentikan agen DHCP pada HostB juga.
tr_tr: HostB üzerinde de DHCP ajanını durdur.

source: Subnet pools
id: Subnet pools (kolam subnet)
tr_tr: Altağ havuzları

source: Subnet pools have a quota system which is a little bit different than other quotas in Neutron. Other quotas in Neutron count discrete instances of an object against a quota. Each time you create something like a router, network, or a port, it uses one from your total quota.
id: Kolam subnet memiliki sistem kuota yang sedikit berbeda dari kuota lainnya di Neutron. Kuota lainnya di Neutron menghitung instance diskrit suatu obyek terhadap kuota. Setiap kali Anda membuat sesuatu seperti router, jaringan, atau port, menggunakan salah satu dari jumlah kuota.
tr_tr: Alt ağ havuzlarının, Neutron'daki diğer kotalardan biraz farklı bir kota sistemi var. Neutron'daki diğer kotalar, kotaya karşı bir nesnenin ayrı örneklerini sayarlar. Bir yönlendirici, ağ veya port gibi bir şey oluşturduğunuzda, toplam kotanızdan bir tane kullanır.

source: Subnet pools have been made available since the Kilo release. It is a simple feature that has the potential to improve your workflow considerably. It also provides a building block from which other new features will be built in to OpenStack Networking.
id: Kolam subnet telah tersedia sejak rilis Kilo. Ini adalah fitur sederhana yang memiliki potensi untuk meningkatkan alur kerja Anda secara mencukupi. Ini juga menyediakan blok bangunan dimana fitur baru lainnya akan dibangun untuk OpenStack Networking.
tr_tr: Alt ağ havuzları, Kilo sürümünden bu yana kullanıma sunulmuştur. İş akışınızı önemli ölçüde geliştirme potansiyeline sahip basit bir özelliktir. Ayrıca, OpenStack Ağ'a yeni özelliklerin ekleneceği bir yapı bloğu da sunar.

source: Subnets
id: Subnet-subnet
tr_tr: Subnetler

source: Subnets and ARP
id: Subnets dan ARP
tr_tr: Altağlar ve ARP

source: Subports can be added to a trunk in two ways: creating the trunk with subports or adding subports to an existing trunk.
id: Subports dapat ditambahkan ke sebuah trunk dengan dua cara: menciptakan trunk dengan subports atau menambahkan subports ke trunk yang ada.
tr_tr: Subport'lar bir bilgi aktarım yoluna iki şekilde eklenebilir: altportlarla bilgi aktarım yolu oluşturma veya varolan bilgi aktarım yoluna altportlar ekleme.

source: Supported Ethernet controllers
id: Ethernet controller yang didukung
tr_tr: Desteklenen Eternet denetleyiciler

source: Supported QoS rule types
id: Tipe aturan Quality of Service (QoS) yang didukung
tr_tr: Desteklenen QoS kural türleri

source: Supported objects for sharing with specific projects
id: Objek yang didukung untuk berbagi dengan proyek tertentu
tr_tr: Belirli projeler ile paylaşmak için desteklenen nesneler

source: Supports L2 firewalling (VM ports)
id: Mendukung L2 firewall (port VM)
tr_tr: L2 güvenlik duvarını destekler (VM bağlantı noktaları)

source: Supports L3 firewalling for router ports
id: Mendukung L3 firewall untuk port router
tr_tr: Yönlendirici bağlantı noktaları için L3 güvenlik duvarı oluşturmayı destekler

source: Supports L3 firewalling for routers
id: Mendukung L3 firewall untuk router
tr_tr: Yönlendiriciler için L3 güvenlik duvarını destekler

source: Supports only instance ports. Ports for DHCP and layer-3 (routing) services must use another mechanism driver such as Linux bridge or Open vSwitch (OVS).
id: Hanya mendukung instance port. Port untuk layanan DHCP dan layer-3 (routing) harus menggunakan driver mekanisme lain seperti jembatan Linux atau Open vSwitch (OVS).
tr_tr: Yalnızca sunucu bağlantı noktalarını destekler. DHCP ve katman-3 (yönlendirme) servisleri için bağlantı noktaları Linux köprüsü veya Open vSwitch (OVS) gibi başka bir mekanizma sürücüsü kullanmalıdır.

source: Supports only untagged (flat) and tagged (VLAN) networks.
id: Hanya mendukung jaringan untagged (flat) dan tagged (VLAN).
tr_tr: Yalnızca etiketsiz (flat) ve etiketlenmiş (VLAN) ağları destekler.

source: Switches
tr_tr: Anahtarlar (Switch)

source: Switches are Multi-Input Multi-Output (MIMO) devices that enable packets to travel from one node to another. Switches connect hosts that belong to the same layer-2 network. Switches enable forwarding of the packet received on one port (input) to another port (output) so that they reach the desired destination node. Switches operate at layer-2 in the networking model. They forward the traffic based on the destination Ethernet address in the packet header.
id: Switch adalah perangkat Multi-Input Multi-Output (MIMO) yang mengaktifkan paket untuk perjalanan dari satu node ke yang lain. Switch menghubungkan host yang tergabung dalam jaringan lapisan-2 sama. Switch mengaktifkan penerusan paket yang diterima pada satu port (input) ke port lain (output) sehingga mereka mencapai node tujuan yang diinginkan. Switch beroperasi pada lapisan-2 dalam model jaringan. Mereka meneruskan lalu lintas berdasarkan alamat Ethernet tujuan dalam header paket.
tr_tr: Anahtarlar, paketlerin bir düğümden diğerine geçmesini sağlayan Çok Girişli Çok Çıkışlı (MIMO) cihazlardır. Anahtarlar, aynı katman-2 ağa ait ana makineleri birbirine bağlar. Anahtarlar, bir porttan (girdi) alınan paketin başka bir porta (çıktıya) yönlendirilmesini sağlar, böylece istenen hedef düğüme gelirler. Anahtarlar, ağ modeli katman-2 çalışır. Paket başlığındaki hedef Ethernet adresine dayalı olarak trafiği iletirler.

source: TODO
tr_tr: YAPILACAK

source: Term
tr_tr: Dönem

source: Test IPv4 and IPv6 connectivity to the Internet or other external network.
id: Lakukan uji konektivitas IPv4 dan IPv6 ke Internet atau jaringan eksternal lainnya.
tr_tr: Internet veya diğer harici ağlara IPv4 ve IPv6 bağlanılabilirliğini test edin.

source: The *Internet Control Message Protocol* (ICMP) is a protocol used for sending control messages over an IP network. For example, a router that receives an IP packet may send an ICMP packet back to the source if there is no route in the router's routing table that corresponds to the destination address (ICMP code 1, destination host unreachable) or if the IP packet is too large for the router to handle (ICMP code 4, fragmentation required and "don't fragment" flag is set).
id: *Internet Control Message Protocol* (ICMP) adalah protokol yang digunakan untuk mengirimkan pesan kontrol melintasi jaringan IP. Sebagai contoh, sebuah router yang menerima paket IP dapat mengirim paket ICMP kembali ke sumber jika tidak ada rute dalam tabel routing router yang sesuai dengan alamat tujuan (ICMP code 1, host tujuan tidak terjangkau) atau jika paket IP terlalu besar untuk router untuk menangani (ICMP code 4, fragmentasi dibutuhkan dan flag "don't fragment" diatur).
tr_tr: *İnternet Kontrol Mesajı Protokolü* (ICMP), bir IP ağı üzerinden kontrol mesajları göndermek için kullanılan bir protokoldür. Örneğin, bir IP paketi alan bir yönlendirici, yönelticinin yönlendirme tablosunda hedef adrese karşılık gelen bir yol yoksa (ICMP kodu 1, hedef ana bilgisayara erişilemiyor) veya IP paketi varsa, ICMP paketini kaynağa geri gönderebilir yönlendirici işlemek için çok büyük (ICMP kodu 4, parçalanma gerekli ve "parçası değil" bayrağı ayarlanıyor).

source: The *Transmission Control Protocol* (TCP) is the most commonly used layer 4 protocol in networked applications. TCP is a *connection-oriented* protocol: it uses a client-server model where a client connects to a server, where *server* refers to the application that receives connections. The typical interaction in a TCP-based application proceeds as follows:
id: *Transmission Control Protocol* (TCP) adalah protokol yang paling umum digunakan lapisan 4 dalam aplikasi jaringan. TCP adalah protokol *connection-oriented*: menggunakan model client-server dimana klien terhubung ke server, dimana *server * mengacu pada aplikasi yang menerima koneksi. Interaksi yang khas dalam aplikasi berbasis TCP mengikuti sebagai berikut:
tr_tr: *İletim Denetim Protokolü* (TCP), ağa bağlı uygulamalarda en yaygın kullanılan katman 4 protokolüdür. TCP, *bağlantı yönelimli* bir protokoldür: bir istemcinin bir sunucuya bağlandığı bir istemci-sunucu modeli kullanır; burada *sunucu*, bağlantıları alan uygulamayı belirtir. TCP tabanlı bir uygulamadaki tipik etkileşim şu şekildedir:

source: The *User Datagram Protocol* (UDP) is another layer 4 protocol that is the basis of several well-known networking protocols. UDP is a *connectionless* protocol: two applications that communicate over UDP do not need to establish a connection before exchanging data. UDP is also an *unreliable* protocol. The operating system does not attempt to retransmit or even detect lost UDP packets. The operating system also does not provide any guarantee that the receiving application sees the UDP packets in the same order that they were sent in.
id: *User Datagram Protocol* (UDP) adalah satu protokol lapisan 4 lain yang merupakan dasar dari beberapa protokol jaringan yang terkenal. UDP adalah protokol *connectionless*: dua aplikasi yang berkomunikasi melalui UDP tidak perlu membuat sambungan sebelum bertukar data. UDP juga protokol *unreliable*. Sistem operasi tidak melakukan pengiriman ulang atau bahkan mendeteksi paket UDP hilang. Sistem operasi juga tidak memberikan jaminan bahwa aplikasi penerima melihat paket UDP dalam urutan yang sama ketika mereka dikirim.
tr_tr: *Kullanıcı Datagram Protokolü* (UDP), birçok iyi bilinen ağ protokolünün temelini oluşturan başka bir katman 4 protokolüdür. UDP *bağlantısız* bir protokoldür: UDP üzerinden iletişim kuran iki uygulama, veri alışverişi yapmadan önce bir bağlantı kurmanıza gerek yoktur. UDP ayrıca *güvenilmez* bir protokoldür. İşletim sistemi, kaybolan UDP paketlerini yeniden iletmeye veya saptamaya bile çalışmaz. İşletim sistemi, alıcı uygulamanın UDP paketlerini, gönderildikleri sırayla görmesini garantilemektedir.

source: The *max_l3_agents_per_router* determine the number of backup DVR/SNAT routers which will be instantiated.
id: *max_l3_agents_per_router* menentukan jumlah cadangan router DVR/SNAT yang akan dipakai.
tr_tr: *max_l3_agents_per_router*, örneklendirilecek yedek DVR/SNAT yönlendiricilerinin sayısını belirler.

source: The :command:`ip route get` command outputs the route for a destination IP address. From the below example, destination IP address ``10.0.2.14`` is on the local network of eth0 and would be sent directly:
id: Perintah :command:`ip route get` memberi output rute untuk alamat IP tujuan. Dari contoh di bawah, alamat IP tujuan ``10.0.2.14`` berada pada jaringan lokal eth0 dan akan dikirim langsung:
tr_tr: :command:`ip route get` komutu bir hedef IP adresi için yönü verir. Aşağıdaki örnekten, ``10.0.2.14`` hedef IP adresi eth0'in yerel ağındadır ve doğrudan gönderilebilir:

source: The :command:`openstack network agent show` command shows details for a specified agent:
tr_tr: :command:`openstack network agent show` komutu belirtilen ajan için detayları gösterir:

source: The :command:`ping` and :command:`mtr` Linux command-line tools are two examples of network utilities that use ICMP.
id: Linux command-line tool :command:`ping` dan :command:`mtr` adalah dua contoh dari jaringan utilitas yang menggunakan ICMP.
tr_tr: :command:`ping` ve :command:`mtr` Linux komut satırı araçları, ICMP kullanan ağ programlarına iki örnektir.

source: The API allows searching/filtering of the ``GET /v2.0/networks`` API. The following query parameters are supported:
id: API mengizinkan searching/filtering dari ``GET /v2.0/networks`` API. Parameter permintaan berikut ini didukung:
tr_tr: API, ``GET /v2.0/networks`` API'sinin aranmasına/filtrelenmesine izin verir. Aşağıdaki sorgu parametreleri desteklenmektedir:

source: The BGP speaker advertises the next-hop IP address for eligible self-service networks and floating IP addresses for instances using those networks.
id: Speaker BGP menyiarkan update dan perubahan alamat IP next-hop untuk jaringan self-service yang memenuhi syarat dan alamat IP mengambang untuk instance menggunakan jaringan tersebut.
tr_tr: BGP yayıncı, uygun self-servis ağları için bir sonraki atlamalı IP adresini ve bu ağları kullanan örnekler için kayan IP adreslerini duyurur.

source: The BGP speaker associates with the external network that provides a gateway on the router.
id: BGP speaker berassosiasi dengan jaringan eksternal yang menyediakan gateway pada router.
tr_tr: BGP yayıncı, yönlendiricide bir ağ geçidi sağlayan harici ağ ile ilişkilendirir.

source: The BGP speaker has the ``advertise_floating_ip_host_routes`` attribute set to ``True``.
id: BGP speaker memiliki ``advertise_floating_ip_host_routes`` atribut diatur ke ``True``.
tr_tr: BGP yayıncı ``True`` olarak ayarlanan ``advertise_floating_ip_host_routes`` özelliğine sahiptir.

source: The BGP speaker has the ``advertise_tenant_networks`` attribute set to ``True``.
id: BGP speaker memiliki ``advertise_tenant_networks`` atribut diatur ke ``True``.
tr_tr: BGP yayıncıda ``advertise_tenant_networks`` özeliği ``True`` olarak ayarlanmıştır.

source: The Compute REST API is available throughout the entire process, although there is a brief period where it is made read-only during a database migration. The Networking REST API will need to expose (to nova-api) all details necessary for reconstructing the information previously held in the legacy networking database.
id: Compute REST API tersedia di sepnajang seluruh proses, meskipun ada periode singkat dimana itu dibuat read-only selama migrasi database. Networking REST API memerlukan untuk mengekspos (ke nova-api) semua rincian yang diperlukan untuk merekonstruksi informasi yang sebelumnya diadakan di database jaringan legacy.
tr_tr: Hesaplama REST API'sı tüm süreç boyunca kullanılabilir, ancak kısa bir süreyle bir veritabanı geçişi sırasında salt okunur hale getirilir. Ağ REST API'sı, daha önce eski ağ veri tabanında bulunan bilgileri yeniden yapılandırmak için gerekli olan tüm ayrıntıları (nova-api'ye) göstermelidir.

source: The Compute scheduler lacks awareness of IP address resources on a routed network. Thus, the scheduler could exhaust the IP addresses in one segment before assigning IP addresses from another segment. The Ocata release of the Compute scheduler should provide the capability of scheduling around segments without available IP addresses. In Newton, the Compute scheduler selects any compute node on the provider network. If the segment on that compute node lacks available IP addresses, port binding fails and the Compute scheduler chooses another compute node without regard to segments. Rescheduling continues up to the maximum number of retries. Operators should monitor IP usage and add subnets to segments prior to exhaustion of IP addresses. For more information, see the `blueprint <https://blueprints.launchpad.net/neutron/+spec/routed-networks>`__.
id: Compute scheduler kurang memiliki pengetahuan tentang sumber alamat IP pada jaringan dialihkan (routed). Dengan demikian, scheduler bisa menguras alamat IP dalam satu segmen sebelum menetapkan alamat IP dari segmen lain. Compute scheduler di Ocata rilis harus menyediakan kemampuan penjadwalan sekitar segmen tanpa alamat IP yang tersedia. Di Newton, Compute scheduler memilih node komputasi pada jaringan operator. Jika segmen pada node komputasi itu kurang tersedia alamat IP, port yang mengikat kegagalan dan Compute scheduler memilih node komputasi lain tanpa memperhatikan segmen. Penjadwalan ulang akan terus sampai jumlah maksimum percobaan ulang (retry). Operator harus memantau penggunaan IP dan menambahkan subnet untuk segmen sebelum kehabisan alamat IP. Untuk informasi lebih lanjut, lihat `blueprint <https://blueprints.launchpad.net/neutron/+spec/routed-networks>`__.
tr_tr: Hesaplama zamanlayıcısı, yönlendirilmiş bir ağdaki IP adresi kaynaklarının farkındalığından yoksundur. Böylece, zamanlayıcı, başka bir kesimden IP adresleri atamadan önce bir segmentteki IP adreslerini tüketebilir. Hesaplama zamanlayıcısının Ocata sürümü, kullanılabilir IP adresleri olmayan bölümler etrafında zamanlama yeteneği sağlamalıdır. Newton'da, Hesaplama zamanlayıcı, sağlayıcı ağı üzerinde herhangi bir hesaplama düğümü seçer. Bu hesaplama düğümündeki bölümde kullanılabilir IP adresleri yoksa, bağlantı noktası bağlaması başarısız olur ve Hesaplama zamanlayıcısı, segmentler dikkate alınmadan başka bir hesaplama düğümü seçer. Yeniden zamanlama, maksimum yeniden deneme sayısına kadar devam eder. Operatörler, IP kullanımını izlemeli ve IP adreslerinin tüketilmesinden önce segmentlere alt ağlar eklemelidir. Daha fazla bilgi için, bakınız `blueprint <https://blueprints.launchpad.net/neutron/+spec/routed-networks>`__.

source: The DHCP agent is responsible for :term:`DHCP <Dynamic Host Configuration Protocol (DHCP)>` and RADVD (Router Advertisement Daemon) services. It requires a running L2 agent on the same node.
id: Agen DHCP bertanggung jawab untuk :term:`DHCP <Dynamic Host Configuration Protocol (DHCP)>` dan layanan RADVD (Router Advertisement Daemon). Hal ini membutuhkan agen L2 berjalan pada node yang sama.
tr_tr: DHCP ajanı, :term:`DHCP <Dynamic Host Configuration Protocol (DHCP)>` ve RADVD (Yönlendirici Tanıtım Artalan işlemi) servislerinden sorumludur.

source: The DHCP agent provides an appropriate MTU value to instances using IPv4, while the L3 agent provides an appropriate MTU value to instances using IPv6. IPv6 uses RA via the L3 agent because the DHCP agent only supports IPv4. Instances using IPv4 and IPv6 should obtain the same MTU value regardless of method.
id: Agen DHCP memberikan nilai MTU yang tepat untuk instance penggunaan IPv4, sementara agen L3 memberikan nilai MTU yang tepat untuk instance penggunaan IPv6. IPv6 menggunakan RA melalui agen L3 karena agen DHCP hanya mendukung IPv4. Instance yang menggunakan IPv4 dan IPv6 harus mendapatkan nilai MTU yang sama terlepas dari metode.
tr_tr: DHCP ajanı IPv4 kullanan sunuculara uygun bir MTU değeri sağlarken, L3 ajanı IPv6 kullanarak sunuculara uygun bir MTU değeri sağlar. IPv6, L3 ajanı aracılığıyla RA kullanır; çünkü DHCP ajanı yalnızca IPv4'ü desteklemektedir. IPv4 ve IPv6 kullanan sunucular, yöntem ne olursa olsun aynı MTU değerini almalıdır.

source: The Dashboard panels for managing LBaaS v2 are available starting with the Mitaka release.
id: Panel Dashboard untuk mengelola LBaaS v2 tersedia mulai dari rilis Mitaka.
tr_tr: LBaaS v2 yönetim panosu, Mitaka sürümünden itibaren kullanılabilir.

source: The DevStack documentation offers a `simple method to deploy Octavia <https://docs.openstack.org/developer/devstack/guides/devstack-with-lbaas-v2.html>`_ and test the service with redundant load balancer instances. If you already have Octavia installed and configured within your environment, you can configure the Network service to use Octavia:
id: Dokumentasi DevStack menawarkan `simple method to deploy Octavia <https://docs.openstack.org/developer/devstack/guides/devstack-with-lbaas-v2.html>`_ dan menguji layanan dengan instance penyeimbang beban redundant (berlebihan). Jika Anda sudah memiliki Octavia terinstal dan dikonfigurasi dalam lingkungan Anda, Anda dapat mengkonfigurasi layanan jaringan untuk menggunakan Octavia:
tr_tr: DevStack belgeleme `Octavia'yı yüklemek için basit bir yöntem <https://docs.openstack.org/developer/devstack/guides/devstack-with-lbaas-v2.html>`_ sunar ve servisi birden fazla yük dengeleyici sunucuları ile test eder. Eğer ortamınızda Octavia zaten kurulu ise, Ağ servisini Octavia'yı kullanmak için yapılandırabilirsiniz:

source: The Firewall-as-a-Service (FWaaS) API is an experimental API that enables early adopters and vendors to test their networking implementations.
id: Firewall-as-a-Service (FWaaS) API adalah API eksperimental yang mengaktifkan pengadopsi awal dan vendor untuk menguji implementasi jaringan mereka.
tr_tr: Servis olarak Güvenlik Duvarı (FWaaS) API, erken benimseyenler ve bayilerin kendi ağ uygulamalarını test etmelerine olanak sağlayan deneysel bir API'dir.

source: The Firewall-as-a-Service (FWaaS) plug-in applies firewalls to OpenStack objects such as projects, routers, and router ports.
id: Firewall-as-a-Service (FWaaS) plug-in memberlakukan firewall untuk objek OpenStack seperti proyek, router, dan port router.
tr_tr: Hizmet Olarak Güvenlik Duvarı (FWaaS) eklentisi projeler, yönlendiriciler ve yönlendirici bağlantı noktaları gibi OpenStack nesnelerine güvenlik duvarını uygular.

source: The ID returned by this command is a network which can be used for booting a VM.
id: ID yang dikembalikan oleh perintah ini adalah jaringan yang dapat digunakan untuk booting VM.
tr_tr: Bu komut tarafından döndürülen kimlik, bir VM'yi önyüklemek için kullanılabilen bir ağdır.
