Repository: 25hours/openstack-manuals
Catalog: doc/networking-guide/source/locale/*/LC_MESSAGES/networking-guide.po
Languages: id, tr_tr

source: Router support
id: Dukungan router
tr_tr: Yönlendirici desteği

source: Routers are special devices that enable packets to travel from one layer-3 network to another. Routers enable communication between two nodes on different layer-3 networks that are not directly connected to each other. Routers operate at layer-3 in the networking model. They route the traffic based on the destination IP address in the packet header.
id: Router adalah perangkat khusus yang mengaktifkan paket untuk perjalanan dari satu jaringan lapisan-3 ke yang lain. Router mengaktifkan komunikasi antara dua node pada berbagai jaringan lapisan-3 yang tidak langsung terhubung satu sama lain. Router beroperasi pada lapisan-3 dalam model jaringan. Mereka me-rute lalu lintas berdasarkan alamat IP tujuan dalam header paket.
tr_tr: Yönlendiriciler paketlerin bir katman-3 ağından diğerine geçmesini sağlayan özel cihazlardır. Yönlendiriciler birbirlerine doğrudan bağlı olmayan farklı katman-3 ağlarındaki iki düğüm arasındaki iletişimi sağlar. Yönlendiriciler, ağ modeli katman-3'te çalışır. Trafiği paket üstbilgisindeki hedef IP adresine dayalı olarak yönlendirirler.

source: Routers provide virtual layer-3 services such as routing and NAT between self-service and provider networks or among self-service networks belonging to a project. The Networking service uses a layer-3 agent to manage routers via namespaces.
id: Router menyediakan layanan lapisan-3 virtual seperti routing dan NAT antara self-service dan jaringan provider atau antar jaringan self-service milik proyek. Layanan Networking menggunakan agen lapisan-3 untuk mengelola router melalui namespace.
tr_tr: Yönlendiriciler, self servis ve sağlayıcı ağları arasında veya bir projeye ait self servis ağlar arasında yönlendirme ve NAT gibi sanal katman-3 hizmetleri sağlar. Ağ hizmeti, yönlendiricileri ad alanları üzerinden yönetmek için bir katman 3 aracısını kullanır.

source: Routing between self-service networks occurs on the compute node containing the instance sending the packet. In this scenario, routing occurs on compute node 1 for packets from instance 1 to instance 2 and on compute node 2 for packets from instance 2 to instance 1.
id: Routing antara jaringan self-service terjadi pada node komputasi yang berisi instance yang sedang mengirim paket. Dalam skenario ini, routing terjadi pada komputasi node 1 untuk paket dari instance 1 ke instance 2 dan pada komputasi node 2 untuk paket dari instance 2 ke instance 1.
tr_tr: Self servis ağlar arasındaki yönlendirme, paket gönderen sunucuyu içeren hesaplama düğümünde gerçekleşir. Bu senaryoda, yönlendirme, sunucu 1'den sunucu 2'ye ve sunucu 2'den sunucu 1'e paketler için hesaplama düğümü 2'ndeki paketler için hesaplama düğümü 1'de gerçekleşir.

source: Routing directly to a project network from an external network.
id: Routing langsung ke jaringan proyek dari jaringan eksternal.
tr_tr: Harici bir ağdan doğrudan bir proje ağına yönlendirme.

source: Routing services
id: Layanan routing
tr_tr: Yönlendirme servisleri

source: Routing with address scopes for non-privileged users
id: Routing dengan lingkup alamat untuk pengguna non-istimewa
tr_tr: Ayrıcalığı olmayan kullanıcılar için adres alanları ile yönlendirme

source: Rule modification
id: Modifikasi aturan
tr_tr: Kural düzenlemesi

source: Run InfiniBand subnet managers to enable InfiniBand fabric.
id: Jalankan manajer subnet InfiniBand untuk mengaktifkan InfiniBand fabric.
tr_tr: InfiniBand çatısını etkinleştirmek için InfiniBand alt ağ yöneticilerini çalıştırın.

source: Run ``udhcpc`` in the VM; it cannot get the wanted IP.
id: Jalankan ``udhcpc`` di VM; ini tidak bisa mendapatkan IP yang diinginkan.
tr_tr: VM'de ``udhcpc``'yi çalıştır; istenilen IP'yi alamadı.

source: Run a DB dump/restore tool that creates Networking data structures representing current legacy networking config.
id: Jalankan alat dump/restore DB yang menciptakan struktur data Networking yang mewakili konfigurasi jaringan legacy saat ini.
tr_tr: Geçerli ağ yapılandırmasını temsil eden Ağ veri yapılarını oluşturan bir DB döküm/geri yükleme aracı çalıştırın.

source: Run a DHCP client in VM to see if it can get the wanted IP.
id: Jalankan klien DHCP di VM untuk melihat apakah ia bisa mendapatkan IP yang diinginkan.
tr_tr: VM üzerinde DHCP istemcisini istenilen IP'yi alabildiğini görmek için çalıştırın.

source: Run the ``neutron-lbaas`` database migration:
id: Jalankan migrasi database ``neutron-lbaas``:
tr_tr: ``neutron-lbaas`` veritabanı göçünü çalıştır:

source: Runs ``nova-compute``, the Neutron L2 agent and DHCP agent
id: Jakankan ``nova-compute``, agen Neutron L2 dan agen DHCP
tr_tr: Neutron L2 ajanı ve DHCP ajanı olan ``nova-compute`` komutunu çalıştırır

source: Runs the Networking, Identity, and Compute services that are required to deploy VMs. The node must have at least one network interface that is connected to the Management Network. Note that ``nova-network`` should not be running because it is replaced by Neutron.
id: Jalankan layanan Networking, Identity, dan Compute yang diperlukan untuk pengerahan VM. Node harus memiliki setidaknya satu antarmuka jaringan yang terhubung ke Management Network. Perhatikan bahwa `` nova-network`` tidak harus berjalan karena digantikan oleh Neutron.
tr_tr: VM'leri yayına almak için gerekli olan Ağ, Kimlik ve Hesaplama servislerini çalıştırır. Düğüm Yönetim Ağına bağlı en az bir ağ arayüzüne sahip olmak zorundadır. ``nova-network`` çalıştırılmamalıdır çünkü Neutron ile değiştirildi.

source: SFC performs load balancing/distribution over the additional service functions in the port pair group.
id: SFC melakukan load balancing/distribution terhadap fungsi layanan tambahan pada kelompok pasangan port.
tr_tr: SFC, bağlantı noktası çifti grubundaki ek hizmet işlevleri üzerinde yük dengeleme/dağıtma gerçekleştirir.

source: SFC steers traffic matching the additional flow classifier to the port pair groups in the port chain.
id: SFC mengarahkan lalu lintas yang cocok dengan klassifier aliran tambahan untuk kelompok pasangan port dalam rantai port.
tr_tr: SFC, ek akış sınıflandırıcısını bağlantı noktası zincirindeki bağlantı noktası çift gruplarıyla eşleşen trafiği yönlendirir.

source: SNAT high availability is implemented in a manner similar to the :ref:`deploy-lb-ha-vrrp` and :ref:`deploy-ovs-ha-vrrp` examples where ``keepalived`` uses VRRP to provide quick failover of SNAT services.
id: SNAT ketersediaan tinggi diimplementasikan dengan cara yang sama dengan contoh :ref:`deploy-lb-ha-vrrp` dan :ref:`deploy-ovs-ha-vrrp` dimana ``keepalived`` menggunakan VRRP untuk memberikan failover cepat layanan SNAT.
tr_tr: SNAT yüksek kullanılabilirliği, ``keepalived``ın SNAT servislerinin hızlı yerine geçme özelliğini sağlamak için VRRP kullandığı :ref:`deploy-lb-ha-vrrp` ve :ref:`deploy-ovs-ha-vrrp` örneklerine benzer şekilde gerçekleştirilir.

source: SNAT solves this problem by modifying the source IP address to an IP address that is routable on the public Internet. There are different variations of SNAT; in the form that OpenStack deployments use, a NAT router on the path between the sender and receiver replaces the packet's source IP address with the router's public IP address. The router also modifies the source TCP or UDP port to another value, and the router maintains a record of the sender's true IP address and port, as well as the modified IP address and port.
id: SNAT memecahkan masalah ini dengan memodifikasi alamat IP sumber ke alamat IP yang routable di Internet publik. Ada variasi yang berbeda dari SNAT; dalam bentuk dimana pengerahan OpenStack menggunakan, router NAT di path antara pengirim dan penerima menggantikan alamat IP sumber paket dengan alamat IP publik router. Router juga memodifikasi TCP sumber atau port UDP ke nilai lain, dan router memelihara catatan alamat IP yang benar dari pengirim dan port, serta alamat IP yang dimodifikasi dan port.
tr_tr: SNAT, kaynak IP adresini halka açık İnternette yönlendirilebilen bir IP adresine değiştirerek bu sorunu çözer. SNAT'ın farklı varyasyonları vardır; OpenStack dağıtımlarının kullandığı biçimde, gönderen ve alıcı arasındaki yolda bir NAT yönlendirici, paketin kaynak IP adresini yönlendiricinin ortak IP adresiyle değiştirir. Yöneltici ayrıca, kaynak TCP veya UDP bağlantı noktasını başka bir değere değiştirir ve yönlendirici, gönderenin gerçek IP adresini ve bağlantı noktasının yanı sıra değiştirilmiş IP adresini ve bağlantı noktasını da kaydeder.

source: SR-IOV agent
id: Agen SR-IOV
tr_tr: SR-IOV ajanı

source: SR-IOV features may require a specific NIC driver version, depending on the vendor. Intel NICs, for example, require ixgbe version 4.4.6 or greater, and ixgbevf version 3.2.2 or greater.
id: Fitur-IOV SR mungkin memerlukan versi driver NIC tertentu, tergantung pada vendor. Intel NIC, misalnya, memerlukan ixgbe versi 4.4.6 atau lebih besar, dan ixgbevf versi 3.2.2 atau lebih besar.
tr_tr: SR-IOV özellikleri satıcıya bağlı olarak belirli bir NIC sürücüsü sürümü gerektirebilir. Örneğin, Intel NIC'ler, ixgbe 4.4.6 veya daha üst sürümü ve ixgbevf 3.2.2 veya daha üst sürümü gerektirir.

source: SR-IOV is not integrated into the OpenStack Dashboard (horizon). Users must use the CLI or API to configure SR-IOV interfaces.
id: SR-IOV tidak terintegrasi ke dalam OpenStack Dashboard (horizon). Pengguna harus menggunakan CLI atau API untuk mengkonfigurasi antarmuka SR-IOV.
tr_tr: SR-IOV, OpenStack Panel'e (horizon) entegre edilmedi. Kullanıcılar, SR-IOV arabirimini yapılandırmak için CLI veya API kullanmak zorundadır.

source: SR-IOV with InfiniBand
id: SR-IOV dengan InfiniBand
tr_tr: InfiniBand ile SR-IOV

source: SRIOV & SRIOV nic switch agent
id: Agen SRIOV & SRIOV nic switch
tr_tr: SRIOV & SRIOV nic switch ajanı

source: SRIOV Nic Switch agent
id: Agen SRIOV Nic Switch
tr_tr: SRIOV Nic Switch ajanı

source: SRIOV mechanism driver and SRIOV NIC switch agent
id: Driver mekanisme SRIOV dan agen switch SRIOV NIC
tr_tr: SRIOV mekanizma sürücüsü ve SRIOV NIC switch ajanı

source: SRIOV nic switch agent
id: Agen SRIOV nic switch
tr_tr: SRIOV nic switch ajanı

source: Same as HostA
id: Sama dengan HostA
tr_tr: HostA ile aynı

source: Schedule BGP speaker to multiple agents.
id: Jadwalkan BGP speaker ke beberapa agen.
tr_tr: BGP yayıncıyı çoklu ajanlara zamanla.

source: Schedule the BGP speaker to an agent
id: Jadwalkan speaker BGP ke agen
tr_tr: BGP yayıncısını bir ajana zamanla

source: Search
tr_tr: Ara

source: Second, associate the created policy with an existing neutron port. In order to do this, user extracts the port id to be associated to the already created policy. In the next example, we will assign the ``bw-limiter`` policy to the VM with IP address ``192.0.2.1``.
id: Kedua, kaitkan kebijakan yang dibuat dengan port neutron yang ada. Untuk melakukan ini, pengguna mengekstrak id port yang akan dikaitkan dengan kebijakan yang sudah dibuat. Pada contoh berikut, kita akan menetapkan kebijakan ``bb-limiter`` ke VM dengan alamat IP ``192.0.2.1``.
tr_tr: İkincisi, yaratılan politikayı mevcut bir neutron bağlantı noktasıyla ilişkilendirin. Bunu yapmak için kullanıcı, önceden oluşturulan ilkeyle ilişkilendirilecek bağlantı noktası kimliği bilgilerini ayıklar. Bir sonraki örnekte, IP adresi ``192.0.2.1`` olan VM'ye ``bw-limiter`` politikasını atayacağız.

source: Second, subnet pools can manage addresses across projects. The addresses are guaranteed not to overlap. If the addresses come from an externally routable pool then you know that all of the projects have addresses which are *routable* and unique. This can be useful in the following scenarios.
id: Kedua, kolam subnet dapat mengelola alamat di seluruh proyek. Alamat dijamin tidak tumpang tindih. Jika alamat berasal dari kolam eksternal routable maka Anda tahu bahwa semua proyek memiliki alamat yang *routable * dan unik. Hal ini dapat berguna dalam skenario berikut.
tr_tr: İkincisi, alt ağ havuzları projelerdeki adresleri yönetebilir. Adreslerin örtüşmemesi garanti edilir. Adresler harici olarak yönlendirilebilir bir havuzdan geliyorsa, tüm projelerin *yönlendirilebilir* ve benzersiz adresleri olduğunu biliyorsunuzdur. Bu, aşağıdaki senaryolarda yararlı olabilir.

source: Second, the router floating IP agent gateway external port:
id: Kedua, port eksternal gerbang agen IP mengambang router :
tr_tr: İkincisi, yönlendirici yüzen IP ajan geçidi harici bağlantı noktası:

source: Security
id: Keamanan
tr_tr: Güvenlik

source: Security Groups
id: Grup keamanan
tr_tr: Güvenlik Grupları

source: Security considerations
id: Pertimbangan keamanan
tr_tr: Güvenlik değerlendirmeleri

source: Security group rules (10) on the provider bridge handle firewalling and connection tracking for the packet.
id: Aturan kelompok keamanan (10) pada provider bridge menangani firewall dan pelacakan koneksi untuk paket.
tr_tr: Sağlayıcı köprüsündeki güvenlik grubu kuralları (10), paket için güvenlik duvarı ve bağlantı izlemeyi ele alır.

source: Security group rules (13) on the self-service bridge handle firewalling and connection tracking for the packet.
id: Aturan kelompok keamanan (13) pada self-service bridge menangani firewall dan pelacakan koneksi untuk paket.
tr_tr: Self servis köprü üzerindeki güvenlik grubu kuralları (13), paket için güvenlik duvarı ve bağlantı izlemeyi ele alır.

source: Security group rules (14) on the provider bridge handle firewalling and connection tracking for the packet.
id: Aturan kelompok keamanan (14) dari provider bridge menangani firewall dan pelacakan koneksi untuk paket.
tr_tr: Sağlayıcı köprüsü üzerindeki güvenlik grubu kuralları (14), paket için güvenlik duvarını ve bağlantı izlemeyi ele alır.

source: Security group rules (14) on the security group bridge handle firewalling and connection tracking for the packet.
id: Security group rules (14) pada security group bridge menangani firewall dan pelacakan koneksi paket.
tr_tr: Güvenlik grubu köprüsündeki güvenlik grubu kuralları (14), paket için güvenlik duvarını ve bağlantı izlemeyi ele alır.

source: Security group rules (17) on the security group bridge handle firewalling and connection tracking for the packet.
id: Security group rules (17) pada security group bridge menangani firewall dan pelacakan koneksi paket.
tr_tr: Güvenlik grubu köprüsündeki güvenlik grubu kuralları (17), paket için güvenlik duvarını ve bağlantı izlemeyi ele alır.

source: Security group rules (18) on the security group bridge handle firewalling and connection tracking for the packet.
id: Security group rules (18) pada security group bridge menangani firewall dan koneksi pelacakan paket.
tr_tr: Güvenlik grubu köprüsündeki güvenlik grubu kuralları (18), paket için güvenlik duvarını ve bağlantı izlemeyi ele alır.

source: Security group rules (18) on the self-service bridge handle firewalling and connection tracking for the packet.
id: Aturan kelompok keamanan (18) pada self-service bridge menangani firewall dan pelacakan koneksi untuk paket.
tr_tr: Self servis köprü üzerindeki güvenlik grubu kuralları (18), paket için güvenlik duvarı ve bağlantı izlemeyi ele alır.

source: Security group rules (21) on the security group bridge handle firewalling and connection tracking for the packet.
id: Security group rules (21) dari security group bridge menangani firewall dan pelacakan koneksi paket.
tr_tr: Güvenlik grubu köprüsündeki güvenlik grubu kuralları (21), paket için güvenlik duvarını ve bağlantı izlemeyi ele alır.

source: Security group rules (22) on the security group bridge handle firewalling and connection tracking for the packet.
id: Security group rules (22) pada security group bridge menangani firewall dan pelacakan koneksi paket.
tr_tr: Güvenlik grubu köprüsündeki güvenlik grubu kuralları (22), paket için güvenlik duvarını ve bağlantı izlemeyi ele alır.

source: Security group rules (3) on the provider bridge handle firewalling and connection tracking for the packet.
id: Aturan kelompok keamanan (3) dari jembatan provider menangani firewall dan pelacakan koneksi untuk paket.
tr_tr: Sağlayıcı köprüde güvenlik grup rolleri (3) paket için güvenlik duvarı işlerini ve bağlantı kaydını halleder.

source: Security group rules (3) on the security group bridge handle firewalling and connection tracking for the packet.
id: Security group rules (3) pada security group bridge menangani firewall dan pelacakan koneksi paket.
tr_tr: Güvenlik grubu köprüsündeki güvenlik grubu kuralları (3), paket için güvenlik duvarını ve bağlantı izlemeyi ele alır.

source: Security group rules (3) on the self-service bridge handle firewalling and connection tracking for the packet.
id: Aturan kelompok keamanan (3) pada self-service bridge menangani firewall dan pelacakan koneksi untuk paket.
tr_tr: Self servis köprü üzerindeki güvenlik grubu kuralları (3), paket için güvenlik duvarını ve bağlantı izlemeyi ele alır.

source: Security group rules (30) on the security group bridge handle firewalling and connection tracking for the packet.
id: Security group rules (30) pada security group bridge menangani firewall dan pelacakan koneksi paket.
tr_tr: Güvenlik grubu köprüsündeki güvenlik grubu kuralları (30), paket için güvenlik duvarını ve bağlantı izlemeyi ele alır.

source: Security group rules (9) on the self-service bridge handle firewalling and connection tracking for the packet.
id: Aturan kelompok keamanan (9) pada self-service bridge menangani firewall dan pelacakan koneksi untuk paket.
tr_tr: Self-servis köprü üzerindeki güvenlik grubu kuralları (9), paket için güvenlik duvarını ve bağlantı izlemeyi ele alır.

source: Security group rules are stateful. Thus, allowing ingress TCP port 22 for secure shell automatically creates rules that allow return egress traffic and ICMP error messages involving those TCP connections.
id: Aturan kelompok keamanan menjadi stateful (tegas). Dengan demikian, mengizinkan ingress TCP port 22 untuk secure shell secara otomatis membuat aturan yang mengizinkan lalu lintas egress kembali dan pesan kesalahan ICMP yang melibatkan koneksi TCP.
tr_tr: Güvenlik grubu kuralları durum denetlemelidir. Böylece, güvenli kabuk için giriş TCP port 22'ye izin vermek, çıkış trafiği ve bu TCP bağlantılarını içeren ICMP hata mesajlarına izin veren kuralları otomatik olarak oluşturur.

source: Security groups
id: Kelompok keamanan
tr_tr: Güvenlik Grupları

source: Security groups are not supported when using SR-IOV, thus, the firewall driver must be disabled. This can be done in the ``neutron.conf`` file.
id: Kelompok keamanan tidak didukung saat penggunaa SR-IOV, dengan demikian, driver firewall harus dinonaktifkan. Hal ini dapat dilakukan dalam file ``neutron.conf``.
tr_tr: Güvenlik grupları SR-IOV kullanılırken desteklenmez, bu nedenle güvenlik duvarı sürücüsü devre dışı bırakılmış olmalıdır. Bu, ``neutron.conf`` dosyasında yapılabilir.

source: Security groups provide a container for virtual firewall rules that control ingress (inbound to instances) and egress (outbound from instances) network traffic at the port level. Security groups use a default deny policy and only contain rules that allow specific traffic. Each port can reference one or more security groups in an additive fashion. The firewall driver translates security group rules to a configuration for the underlying packet filtering technology such as ``iptables``.
id: Kelompok keamanan menyediakan kontainer untuk aturan virtual firewall yang mengontrol ingress (inbound ke instance) dan egress (outbound dari instance) lalu lintas jaringan di tingkat port. Kelompok keamanan menggunakan default menyangkal kebijakan dan hanya berisi aturan yang mengizinkan lalu lintas tertentu. Setiap port dapat referensi satu atau lebih kelompok keamanan dalam mode aditif. Driver firewall menerjemahkan aturan kelompok keamanan untuk konfigurasi teknologi penyaringan paket yang mendasarinya seperti ``iptables``.
tr_tr: Güvenlik grupları, girişi (örneklere gelen) ve çıkış (örneklerden giden) ağ trafiğini port seviyesinde kontrol eden sanal güvenlik duvarı kuralları için bir kapsayıcı sağlar. Güvenlik grupları, varsayılan bir reddetme politikası kullanır ve yalnızca belirli trafiğe izin veren kuralları içerir. Her bağlantı noktası, bir veya daha fazla güvenlik grubuna ek bir şekilde referans verebilir. Güvenlik duvarı sürücüsü, güvenlik grubu kurallarını ``iptables`` gibi temel paket filtreleme teknolojisi için bir yapılandırmaya çevirir.

source: See :ref:`config-dns-int-ext-serv` for detailed instructions on how to create the externally accessible network.
id: Lihat :ref:`config-dns-int-ext-serv` untuk petunjuk rinci tentang cara membuat jaringan yang dapat diakses secara eksternal.
tr_tr: Nasıl dışarıdan erişilebilir ağ oluşturulacağına dair detaylı komutlar için :ref:`config-dns-int-ext-serv` bakınız.

source: See :ref:`config-dns-performance-considerations` for an explanation of the potential performance impact associated with this use case.
id: Lihat :ref:`config-dns-performance-considerations` untuk penjelasan potensi dampak kinerja yang terkait dengan kasus ini digunakan.
tr_tr: Bu kullanım durumu ile ilişkili olası performans etkisinin bir açıklaması için :ref:`config-dns-performance-considerations` sayfasına bakın.

source: See :ref:`config-routed-provider-networks` for more information.
id: Lihat :ref:`config-routed-provider-networks` untuk informasi lebih lanjut.
tr_tr: Daha fazla bilgi için bakınız :ref:`config-routed-provider-networks`.

source: See :ref:`config-subnet-pools` for more information.
id: Lihat :ref:`config-subnet-pools` untuk informasi lebih lanjut.
tr_tr: Daha fazla bilgi için bakınız :ref:`config-subnet-pools`

source: See `bugs <https://bugs.launchpad.net/neutron/+bugs?field.tag=trunk>`__ for more information.
id: Lihat `bugs <https://bugs.launchpad.net/neutron/+bugs?field.tag=trunk>`__ untuk informasi lebih lanjut.
tr_tr: Daha fazla bilgi için bakınız `hatalar <https://bugs.launchpad.net/neutron/+bugs?field.tag=trunk>`__.

source: See the `Installation Tutorials and Guides <https://docs.openstack.org>`_ and `Configuration Reference <https://docs.openstack.org>`_ for your OpenStack release to obtain the appropriate additional configuration for the ``[DEFAULT]``, ``[database]``, ``[keystone_authtoken]``, ``[nova]``, and ``[agent]`` sections.
id: Lihat `Installation Tutorials and Guides <https://docs.openstack.org>`_ dan `Configuration Reference <https://docs.openstack.org>`_ untuk rilis OpenStack Anda untuk mendapatkan konfigurasi tambahan yang sesuai untuk bagian ``[DEFAULT]``, ``[database]``, ``[keystone_authtoken]``, ``[nova]``, and ``[agent]``.
tr_tr: ``[DEFAULT]``, ``[database]``, ``[keystone_authtoken]``, ``[nova]``, ve ``[agent]`` bölümleri için uygun ek yapılandırmaları bulmak için OpenStack sürümünüze göre `Kurulum Dökümanları ve Kılavuzları <https://docs.openstack.org>`_ ve `Yapılandırma Kılavuzu <https://docs.openstack.org>`_ belgelerine bakın.

source: See the `developer documentation <https://docs.openstack.org/developer/networking-sfc/>`_ for more information.
id: Lihat `developer documentation <https://docs.openstack.org/developer/networking-sfc/>`_ untuk informasi lebih lanjut.
tr_tr: Daha fazla bilgi için `geliştirici belgesi <https://docs.openstack.org/developer/networking-sfc/>`_ne bakınız.

source: Segment
id: Segment (segmen)
tr_tr: Dilim

source: Segmentation ID
id: Segmentation ID (ID segmentasi)
tr_tr: Dilim ID

source: Segmentation type
id: Segmentation type (tipe segmentasi)
tr_tr: Dilim türü

source: Select the driver that manages virtual interfaces in ``/etc/neutron/lbaas_agent.ini``:
id: Pilih driver yang mengelola antarmuka virtual dalam ``/etc/neutron/lbaas_agent.ini``:
tr_tr: ``/etc/neutron/lbaas_agent.ini`` içindeki sanal arabirimleri yöneten sürücüyü seçin:
