Repository: 25hours/openstack-manuals
Catalog: doc/networking-guide/source/locale/*/LC_MESSAGES/networking-guide.po
Languages: id, tr_tr

source: OpenStack can be setup such that OpenStack Networking directly provides RA, DHCP relay and DHCPv6 address and optional information for their networks or this can be delegated to external routers and services based on the drivers that are in use. There are two neutron subnet attributes - ``ipv6_ra_mode`` and ``ipv6_address_mode`` – that determine how IPv6 addressing and network information is provided to project instances:
id: OpenStack bisa diatur sedemikian rupa sehingga OpenStack Networking langsung memberikan RA, penyiaran DHCP dan alamat DHCPv6 dan informasi opsional untuk jaringan mereka atau hal ini dapat didelegasikan kepada router dan layanan eksternal didasarkan pada driver yang sedang digunakan. Ada atribut dua subnet neutron - `` ipv6_ra_mode`` dan `` ipv6_address_mode`` - yang menentukan bagaimana IPv6 dan informasi jaringan disediakan untuk instance proyek:
tr_tr: OpenStack, OpenStack Networking'in kendi ağları için doğrudan RA, DHCP geçiş ve DHCPv6 adresi ve isteğe bağlı bilgi sağlaması için kurulabilir veya bu, kullanılan yönlendiricilere dayanan harici yönlendiriciler ve servislere devredilebilir. IPv6 adresleme ve ağ bilgilerinin proje sunucuları nasıl sağlandığını belirleyen - ``ipv6_ra_mode`` ve ``ipv6_address_mode`` – iki neutron alt ağ niteliği vardır:

source: OpenStack control & management network considerations
id: Pertimbangan jaringan manajemen dan kontrol OpenStack
tr_tr: OpenStack kontrol & yönetim ağı değerlendirmeleri

source: OpenStack control communication between servers and services over an IPv6 network.
id: OpenStack mengkontrol komunikasi antara server dan layanan melalui jaringan IPv6.
tr_tr: OpenStack, bir IPv6 ağı üzerinden sunucular ve hizmetler arasındaki iletişimi kontrol eder.

source: OpenStack controller host - controlnode
tr_tr: OpenStack denetim sunucusu - controlnode

source: OpenStack currently doesn't support the privacy extensions defined by RFC 4941. The interface identifier and DUID used must be directly derived from the MAC as described in RFC 2373. The compute hosts must not be setup to utilize the privacy extensions when generating their interface identifier.
id: OpenStack saat ini tidak mendukung ekstensi privasi yang didefinisikan oleh RFC 4941. Interface identifier dan DUID yang digunakan harus langsung berasal dari MAC seperti yang dijelaskan dalam RFC 2373. Host komputasi tidak harus mengatur untuk memanfaatkan ekstensi privasi saat membuat identifier interface identifier mereka .
tr_tr: OpenStack, şu anda RFC 4941 tarafından tanımlanan gizlilik uzantılarını desteklemiyor. Arayüz tanımlayıcısı ve kullanılan DUID, doğrudan RFC 2373'te açıklandığı şekilde MAC'den türetilmelidir. Hesaplama ana makinelerinin, arabirim tanımlayıcılarını oluştururken gizlilik uzantılarını kullanacak şekilde ayarlanmaması gerekir.

source: OpenStack uses DNAT to route packets from instances to the OpenStack metadata service. Applications running inside of instances access the OpenStack metadata service by making HTTP GET requests to a web server with IP address 169.254.169.254. In an OpenStack deployment, there is no host with this IP address. Instead, OpenStack uses DNAT to change the destination IP of these packets so they reach the network interface that a metadata service is listening on.
id: OpenStack menggunakan DNAT untuk me-rute paket dari instance ke layanan metadata OpenStack. Aplikasi yang berjalan di dalam instance mengakses layanan metadata OpenStack dengan membuat permintaan HTTP GET ke server web dengan alamat IP 169.254.169.254. Dalam pengerahan OpenStack, tidak ada host dengan alamat IP ini. Sebaliknya, OpenStack menggunakan DNAT untuk mengubah IP tujuan dari paket tersebut sehingga mereka mencapai antarmuka jaringan dimana layanan metadata mendengarkannya.
tr_tr: OpenStack örneklerden gelen paketleri OpenStack metadata servisine yönlendirmek için DNAT kullanıyor. Örneklerin içinde çalışan uygulamalar, HTTP GET isteklerini IP adresi 169.254.169.254 olan bir web sunucusuna yaparak OpenStack meta veri servisine erişir. Bir OpenStack dağıtımında, bu IP adresine sahip herhangi bir bilgisayar yok. Bunun yerine OpenStack, bu paketlerin hedef IP'sini değiştirmek için DNAT kullanır, böylece bir meta veri hizmetinin dinlediği ağ arabirimine ulaşırlar.

source: OpenStack uses SNAT to enable applications running inside of instances to connect out to the public Internet.
id: OpenStack menggunakan SNAT untuk mengaktifkan aplikasi yang berjalan dalam instance untuk menghubungkan ke Internet publik.
tr_tr: OpenStack, örneklerin içinde çalışan uygulamaların halka açık İnternet'e bağlanmasını sağlamak için SNAT kullanır.

source: OpenStack uses a third-party program called `dnsmasq <http://www.thekelleys.org.uk/dnsmasq/doc.html>`_ to implement the DHCP server. Dnsmasq writes to the syslog, where you can observe the DHCP request and replies::
id: OpenStack menggunakan program pihak ketiga yang disebut `dnsmasq <http://www.thekelleys.org.uk/dnsmasq/doc.html>`_ untuk menjalankan server DHCP. Dnsmasq menulis ke syslog, dimana Anda dapat mengamati permintaan dan balasan DHCP::
tr_tr: OpenStack, DHCP sunucuyu gerçekleştirmek için `dnsmasq <http://www.thekelleys.org.uk/dnsmasq/doc.html>`_ üçüncü parti programını kullanır. Dnsmasq, DHCP isteklerini ve cevaplarını gözlemleyebileceğiniz syslog'a yazar.

source: Operation
id: Operation (operasi)
tr_tr: İşlem

source: Operation with Distributed Virtual Routers (DVR)
id: Operasi dengan Distributed Virtual Routers (DVR)
tr_tr: Dağıtık Sanal Yönlendiriciler (DVR) ile İşlem

source: Operational OpenStack Identity (keystone) service.
id: Layanan OpenStack Identity (keystone) operasional.
tr_tr: Operasyonel OpenStack Kimlik (keystone) hizmeti.

source: Operational OpenStack Image Service (glance).
id: Layanan OpenStack Image (glance) operasional.
tr_tr: Operasyonel OpenStack İmaj Servisi (glance).

source: Operational SQL server with databases necessary for each OpenStack service.
id: Server SQL operasional dengan database yang diperlukan untuk setiap layanan OpenStack.
tr_tr: Her OpenStack hizmeti için gerekli veritabanları ile operasyonel SQL sunucusu.

source: Operational hypervisor components of the OpenStack Compute (nova) service with appropriate configuration to use the Networking service.
id: Komponen hypervisor operasional dari layanan OpenStack Compute (nova) dengan konfigurasi yang sesuai untuk menggunakan layanan Networking.
tr_tr: OpenStack Hesaplama (nova) Operasyonel hypervisor bileşenleri, Ağ hizmetini kullanmak için uygun yapılandırmayla birlikte hizmet verir.

source: Operational management components of the OpenStack Compute (nova) service with appropriate configuration to use the Networking service.
id: Komponen manajemen operasional dari layanan OpenStack Compute (nova) dengan konfigurasi yang sesuai untuk menggunakan layanan Networking.
tr_tr: Ağ hizmetini kullanmak için uygun yapılandırmayla birlikte OpenStack Hesaplama (nova) hizmetinin Operasyonel yönetim bileşenleri.

source: Operational message queue service.
id: Layanan antrian pesan operasional.
tr_tr: İşlem mesaj kuyruğu servisi.

source: Operations
id: Operations (operasi)
tr_tr: Işlemler

source: Operations impact
id: Dampak operasi
tr_tr: İşlemlerin etkisi

source: Operators (and users with admin role) can get the auto-allocated topology for a project by specifying the project ID:
id: Operator (dan pengguna dengan peran admin) bisa mendapatkan topologi auto-allocated untuk proyek dengan menentukan ID proyek:
tr_tr: Operatörler (ve yönetici rolüne sahip kullanıcılar), proje kimliği belirterek bir proje için otomatik olarak ayrılmış topolojiyi elde edebilirler:

source: Optionally, create another subnet on the network with a different service type. For example, the ``compute:foo`` arbitrary service type.
id: Secara opsional, buat subnet lain di jaringan dengan tipe layanan yang berbeda. Sebagai contoh, tipe layanan apapun ``compute:foo``
tr_tr: İsteğe bağlı olarak, ağda farklı bir hizmet türü olan başka bir alt ağ oluşturun. Örneğin, ``compute:foo`` keyfi hizmet tipi.

source: Optionally, enable IPv4 access from external networks such as the Internet to the instance.
id: Secara opsional, aktifkan akses IPv4 dari jaringan eksternal seperti Internet untuk instance.
tr_tr: İsteğe bağlı olarak, İnternet gibi sunucuya harici ağlardan IPv4 erişimini etkinleştirin.

source: Optionally, set the needed ``notification_drivers`` in the ``[qos]`` section in ``/etc/neutron/neutron.conf`` (``message_queue`` is the default).
id: Secara opsional, atur yang dibutuhkan ``notification_drivers`` dalam bagian ``[qos]`` dalam ``/etc/neutron/neutron.conf`` (``message_queue`` menjadi default).
tr_tr: Seçimli olarak, ``/etc/neutron/neutron.conf`` dosyasında ``[qos]`` bölümünde gerekli ``notification_drivers`` ayarlayın (``message_queue`` varsayılandır).

source: Or to run in headless mode:
id: Atau untuk berjalan dalam modus tanpa kepala (headless mode):
tr_tr: Veya kafasız kipte çalıştırmak için:

source: Other Configuration Flag = 0
tr_tr: Diğer Yapılandırma Bayrağı = 0

source: Other Configuration Flag = 1
tr_tr: Diğer Yapılandırma Bayrağı = 1

source: Other features such as BGP dynamic routing
id: Fitur lainnya seperti routing dinamis BGP
tr_tr: BGP dinamik yönlendirme gibi diğer özellikler

source: Other networks including provider networks and flat or VLAN self-service networks assume the value of the ``global_physnet_mtu`` option.
id: Jaringan lain termasuk jaringan penyedia dan jaringan datar atau self-service VLAN yang mengasumsikan nilai opsi ``global_physnet_mtu``.
tr_tr: Sağlayıcı ağları ve flat veya VLAN self-servis ağları da dahil olmak üzere diğer ağlar ``global_physnet_mtu`` seçeneğinin değerini varsaymaktadır.

source: Otherwise if you are running OpenStack Mitaka, make this change:
id: Sebaliknya jika Anda menjalankan OpenStack Mitaka, buatlah perubahan ini:
tr_tr: OpenStack Mitaka'yi çalıştırıyorsanız, bu değişikliği yapın:

source: Overlay (tunnel) network: 10.0.1.0/24
tr_tr: Yer paylaşımı (tünel ağı): 10.0.1.0/24

source: Overlay (tunnel) protocols
id: Protokol overlay (tunnel)
tr_tr: Yer paylaşımlı (tünel) protokoller

source: Overlay: Handles self-service networks using an overlay protocol such as VXLAN or GRE.
id: Overlay: Menangani jaringan self-service menggunakan protokol overlay seperti VXLAN atau GRE.
tr_tr: Yer paylaşımı: Self-servis ağlarını VXLAN veya GRE gibi bir yer paylaşımlı protokol kullanarak ele alır.

source: Overview
id: Iktisar
tr_tr: Önizleme

source: PCI ``vendor_id`` and ``product_id`` as displayed by the Linux utility ``lspci``.
id: PCI ``vendor_id`` dan ``product_id`` seperti yang ditampilkan oleh utilitas Linux ``lspci``.
tr_tr: PCI ``vendor_id`` ve ``product_id`` Linux yardımcı programı ``lspci`` tarafından görüntülenir.

source: PCI address: The address uses the same syntax as in ``lspci`` and an asterisk (*) can be used to match anything.
id: Alamat PCI: alamat menggunakan sintaks yang sama seperti dalam ``lspci`` dan tanda bintang (*) dapat digunakan untuk mencocokkan apa pun.
tr_tr: PCI adresi: Adres, ``lspci`` ile aynı sözdizimini kullanır ve herhangi bir şey eşleştirmek için bir yıldız (*) kullanılabilir.

source: PCI-SIG Single Root I/O Virtualization and Sharing (SR-IOV) functionality is available in OpenStack since the Juno release. The SR-IOV specification defines a standardized mechanism to virtualize PCIe devices. This mechanism can virtualize a single PCIe Ethernet controller to appear as multiple PCIe devices. Each device can be directly assigned to an instance, bypassing the hypervisor and virtual switch layer. As a result, users are able to achieve low latency and near-line wire speed.
id: PCI-SIG Single Root I/O Virtualization dan Sharing (SR-IOV) secara fungsional tersedia dalam OpenStack sejak rilis Juno. Spesifikasi SR-IOV mendefinisikan mekanisme standar untuk virtualisasi perangkat PCIe. Mekanisme ini dapat virtualisasi PCIe Ethernet controller tunggal akan terlihat sebagai beberapa perangkat PCIe. Setiap perangkat dapat langsung ditugaskan ke sebuah instance, denganmelewati hypervisor dan virtual switch layer. Akibatnya, pengguna dapat mencapai latency rendah dan kecepatan kawat near-line.
tr_tr: Juno'dan bu yana OpenStack'de PCI-SIG Tek Kök G / Ç Sanallaştırma ve Paylaşım (SR-IOV) işlevi bulunmaktadır. SR-IOV belirtimi, PCIe aygıtlarını sanallaştırmak için standartlaştırılmış bir mekanizmayı tanımlar. Bu mekanizma, tek bir PCIe Ethernet denetleyicisini birden çok PCIe aygıtı olarak görünecek şekilde sanal hale getirebilir. Her cihaz, bir sunucuya hipervizör ve sanal anahtar katmanını atlayarak doğrudan atanabilir. Sonuç olarak, kullanıcılar düşük gecikmeli ve yakın hat tel hızı elde edebiliyorlar.

source: Performance considerations
id: Pertimbangan kinerja
tr_tr: Performans değerlendirmeleri

source: Performance impact
id: Dampak kinerja
tr_tr: Permans etkisi

source: Persist created VFs on reboot:
id: Pertahankan VF yang dibuat ketika reboot:
tr_tr: Yeniden başlatıldığında kalıcı olacak şekilde oluşturulan VFler:

source: Physical Function. The physical Ethernet controller that supports SR-IOV.
id: Physical Function. Physical Ethernet controller yang mendukung SR-IOV.
tr_tr: Fiziksel İşlev. SR-IOV'i destekleyen fiziksel Eternet denetleyicisi.

source: Physical Network
id: Physical Network (jaringan fisik)
tr_tr: Fiziksel Ağ

source: Placement API: 1.1
tr_tr: Yerleştirme API: 1.1

source: Plug-ins
tr_tr: Eklentiler

source: Plugs and unplugs ports, creates networks or subnets, and provides IP addressing. The chosen plug-in and agents differ depending on the vendor and technologies used in the particular cloud. It is important to mention that only one plug-in can be used at a time.
id: Port plugs dan unplugs, menciptakan jaringan atau subnet, dan menyediakan alamat IP. Plug-in dan agen yang dipilih berbeda tergantung pada vendor dan teknologi yang digunakan di cloud tertentu. Hal ini penting untuk menyebutkan bahwa hanya satu plug-in dapat digunakan pada satu waktu.
tr_tr: Bağlantı noktalarını takar ve çıkarır, ağlar veya alt ağlar oluşturur ve IP adresleme sağlar. Seçilen eklenti ve aracılar, belirli bulutta kullanılan satıcılara ve teknolojilere göre farklılık gösterir. Aynı anda yalnızca bir eklentinin kullanılabileceğini söylemek önemlidir.

source: Pool
tr_tr: Havuz

source: Populate the database.
id: Mengisi database.
tr_tr: Veritabanı oluştur.

source: Port chain
id: Port chain (rantai port)
tr_tr: Bağlantı noktası zinciri

source: Port pair
id: Port pair (pasangan port)
tr_tr: Bağlantı noktası çifti

source: Port pair group
id: Port pair group (kelompok pasangan port)
tr_tr: Bağlantı noktası çifti grubu

source: Port pair: [p1, p2]
tr_tr: Bağlantı noktası çifti: [p1, p2]

source: Port pair: [p3, p4]
tr_tr: Bağlantı noktası çifti: [p3, p4]

source: Port pair: [p5, p6]
tr_tr: Bağlantı noktası çifti: [p5, p6]

source: Ports
id: Port-Port
tr_tr: Portlar

source: Ports can be created with a policy attached to them too.
id: Port dapat dibuat dengan kebijakan yang menyertainya juga.
tr_tr: Bağlantı noktaları, kendilerine bağlı bir politika ile de oluşturulabilir.

source: Ports with the device owner ``network:dhcp`` are exempt from the above IPAM logic for subnets with ``dhcp_enabled`` set to ``True``. This preserves the existing automatic DHCP port creation behaviour for DHCP-enabled subnets.
id: Port dengan pemilik perangkat ``network:dhcp`` dibebaskan dari logika IPAM di atas untuk subnet dengan ``dhcp_enabled`` diatur ke `` True``. Ini mempertahankan perilaku penciptaan port DHCP otomatis yang ada untuk subnet DHCP-enabled.
tr_tr: ``network:dhcp`` aygıt sahibine sahip bağlantı noktaları, ``dhcp_enabled`` değeri ``True`` olarak ayarlanmış alt ağlar için IPAM mantığından muaftır. Bu, DHCP'nin etkin olduğu alt ağlar için mevcut otomatik DHCP bağlantı noktası oluşturma davranışını korur.

source: Pre-Mitaka address scopes are not visible through the API. You cannot list address scopes or show details. Scopes exist implicitly as a catch-all for addresses that are not explicitly scoped.
id: Pre-Mitaka lingkup alamat tidak terlihat melalui API. Anda tidak bisa mendaftar lingkup alamat atau menunjukkan detail. Lingkup ada secara implisit sebagai catch-all untuk alamat yang tidak secara eksplisit terlingkup.
tr_tr: Mitaka öncesi adres alanları, API aracılığıyla görünmez. Adres alanlarını listeleyemez veya ayrıntıları gösteremezsiniz. Alanlar açıkça alanı olmayan adresler için örtük olarak mevcuttur.

source: Prefix advertisement
id: Penyiaran update dan perubahan awal
tr_tr: Ön ek ilanı

source: Prefix delegation
id: Penyerahan awalan (prefix delegation)
tr_tr: Önek yetkilendirme

source: Prefix delegation became available in the Liberty release, it is not available in the Kilo release. HA and DVR routers are not currently supported by this feature.
id: Prefix delegation menjadi tersedia dalam rilis Liberty, tidak tersedia dalam rilis Kilo. Router HA dan DVR saat ini tidak didukung oleh fitur ini.
tr_tr: Önek yetkilendirme Liberty sürümünde mevcuttu, Kilo sürümünde mevcut değildir. HA ve DVR yönlendiricileri şu anda bu özellik tarafından desteklenmiyor.

source: Prerequisites
id: Prasyarat
tr_tr: Önkoşullar

source: Prerequisites for demonstration
id: Prasyarat untuk demonstrasi
tr_tr: Gösterim için ön gereklilikler

source: Prerequisites, typically hardware requirements, generally increase with each building block. Each building block depends on proper deployment and operation of prior building blocks. For example, the first building block (provider networks) only requires one controller and two compute nodes, the second building block (self-service networks) adds a network node, and the high-availability building blocks typically add a second network node for a total of five nodes. Each building block could also require additional infrastructure or changes to existing infrastructure such as networks.
id: Prasyarat, biasanya kebutuhan hardware, umumnya meningkat dengan setiap blok bangunan. Setiap blok bangunan tergantung pada pengerahan yang tepat dan pengoperasian blok bangunan sebelumnya. Misalnya, blok bangunan pertama (jaringan provider) hanya membutuhkan satu controller dan dua node komputasi, blok bangunan kedua (jaringan self-service) menambahkan node jaringan, dan blok bangunan ketersediaan tinggi secara khusus menambahkan node jaringan kedua untuk sebanyak lima node. Setiap blok bangunan juga bisa memerlukan infrastruktur tambahan atau perubahan infrastruktur yang ada seperti jaringan.
tr_tr: Önkoşullar, genellikle donanım gereksinimleri, her bir yapı taşıyla birlikte artar. Her bir yapı taşı, önceki yapı taşlarının düzgün yerleştirilmesi ve çalıştırılmasına bağlıdır. Örneğin, ilk yapı bloğu (sağlayıcı ağları) yalnızca bir denetleyici ve iki hesaplama düğümü gerektirir; ikinci yapı bloğu (self-servis ağları) bir ağ düğümü ekler ve yüksek kullanılabilirlik yapı taşları normal olarak toplam beş düğüm. Her bir yapı bloğu, ağlar gibi mevcut altyapı değişiklikleri veya ilave altyapı da gerektirebilir.

source: Preventing regular users from sharing objects with each other
id: Pencegahan pengguna biasa berbagi objek dengan pengguna lainnya
tr_tr: Normal kullanıcıların nesneleri birbirleriyle paylaşmalarını önleme

source: Previously, a user had to configure a range of networking resources to boot a server and get access to the Internet. For example, the following steps are required:
id: Sebelumnya, pengguna harus mengkonfigurasi berbagai sumber daya jaringan untuk boot server dan mendapatkan akses ke Internet. Misalnya, langkah berikut ini diperlukan:
tr_tr: Daha önce, bir kullanıcının bir sunucuyu önyüklemesi ve İnternet'e erişmesi için bir dizi ağ kaynağı yapılandırması gerekiyordu. Örneğin, aşağıdaki adımlar gereklidir:

source: Project ``b87b2fc13e0248a4a031d38e06dc191d`` will now be able to see the network when running :command:`openstack network list` and :command:`openstack network show` and will also be able to create ports on that network. No other users (other than admins and the owner) will be able to see the network.
id: Proyek ``b87b2fc13e0248a4a031d38e06dc191d`` sekarang akan dapat melihat jaringan ketika menjalankan :command:`openstack network list` dan :command:`openstack network show` dan juga akan dapat membuat port pada jaringan itu. Tidak ada pengguna lain (selain admin dan pemilik) akan dapat melihat jaringan.
tr_tr: ``b87b2fc13e0248a4a031d38e06dc191d`` projesi :command:`openstack network list` ve :command:`openstack network show` komutlarını çalıştırırken ağları görebilir ve bu ağda bağlantı noktası oluşturabilir. Diğer kullanıcılar (yöneticiler ve sahiplerin dışındakiler) ağı görebileceklerdir.

source: Project ``be98b82f8fdf46b696e9e01cebc33fd9`` will now be able to see the QoS policy when running :command:`openstack network qos policy list` and :command:`openstack network qos policy show` and will also be able to bind it to its ports or networks. No other users (other than admins and the owner) will be able to see the QoS policy.
id: Proyek ``be98b82f8fdf46b696e9e01cebc33fd9`` sekarang akan dapat melihat kebijakan QoS ketika menjalankan :command:`openstack network qos policy list` dan :command:`openstack network qos policy show` dan juga akan dapat mengikat ke port atau jaringan. Tidak ada pengguna lain (selain admin dan pemilik) akan dapat melihat kebijakan QoS.
tr_tr: ``be98b82f8fdf46b696e9e01cebc33fd9`` projesi, :command:`openstack network qos policy list` ve :command:`openstack network qos policy show` komutları çalıştırılırken QoS politikalarını görebilecektir, ayrıca bağlantı noktalarına ve ağa bağlanabilir. Hiç bir kullanıcı (yöneticiler ve sahipler hariç) QoS politikalarını göremeyecektir.

source: Project network configurations are made in the ``/etc/neutron/plugins/ml2/ml2_conf.ini`` configuration file on the neutron server:
id: Konfigurasi jaringan proyek dibuat di file konfigurasi ``/etc/neutron/plugins/ml2/ml2_conf.ini`` pada server neutron:
tr_tr: Proje ağ yapılandırmaları, neutron sunucu üzerinde ``/etc/neutron/plugins/ml2/ml2_conf.ini`` yapılandırma dosyasında yapılır:

source: Project network considerations
id: Pertimbangan jaringan proyek
tr_tr: Proje ağı ile ilgili değerlendirmeler

source: Project network types
id: Tipe jaringan proyek
tr_tr: Proje ağ türleri

source: Project networks provide connectivity to instances for a particular project. Regular (non-privileged) users can manage project networks within the allocation that an administrator or operator defines for them. More information about project and provider networks see :doc:`intro-os-networking` or the `OpenStack Administrator Guide <https://docs.openstack.org/admin-guide/networking-adv-features.html#provider-networks>`__.
id: Jaringan proyek menyediakan konektivitas untuk instance untuk proyek tertentu. Pengguna reguler (non-istimewa) dapat mengelola jaringan proyek dalam alokasi dimana administrator atau operator mendefinisikan untuk mereka. Informasi lebih lanjut tentang proyek dan jaringan provider lihat :doc:`intro-os-networking` atau `OpenStack Administrator Guide <https://docs.openstack.org/admin-guide/networking-adv-features.html#provider-networks>`__.
tr_tr: Proje ağları, belirli bir proje için sunuculara bağlantı sağlar. Normal (ayrıcalıklı olmayan) kullanıcılar, bir yöneticinin veya operatörün kendileri için tanımladığı alanda proje ağlarını yönetebilir. Proje ve sağlayıcı ağlar ile ilgili daha fazla bilgi için bnz. :doc:`intro-os-networking` or `OpenStack Yönetim Kılavuzu <https://docs.openstack.org/admin-guide/networking-adv-features.html#provider-networks>`__.

source: Project resources created by auto-allocation
id: Sumber daya proyek yang dibuat oleh auto-allocation
tr_tr: Otomatik tahsis tarafından oluşturulan proje kaynakları
