Repository: 25hours/openstack-manuals
Catalog: doc/networking-guide/source/locale/*/LC_MESSAGES/networking-guide.po
Languages: id, tr_tr

source: Verify that host aggregates were created for each segment in the Compute service (for the sake of brevity, only one of the segments is shown in this example).
id: Pastikan bahwa kumpulan host diciptakan untuk setiap segmen dalam pelayanan Compute (untuk singkatnya, hanya salah satu segmen yang ditunjukkan dalam contoh ini).
tr_tr: Ana bilgisayar toplamlarının Hesaplama hizmetindeki her bölüm için oluşturulduğunu doğrulayın (kısalık uğruna dilimlerden yalnızca biri bu örnekte gösterilmiştir).

source: Verify that inventories were created for each segment IPv4 subnet in the Compute service placement API (for the sake of brevity, only one of the segments is shown in this example).
id: Lakukan verifikasi dimana persediaan yang diciptakan untuk setiap subnet IPv4 segment dalam placement API di layanan Compute (untuk singkatnya, hanya salah satu segmen yang ditunjukkan dalam contoh ini).
tr_tr: Stokların, Hesaplama hizmeti yerleşimi API'sindeki her bir dilim IPv4 alt ağında oluşturulduğunu doğrulayın (kısalık uğruna, dilimlerden yalnızca biri bu örnekte gösterilmiştir).

source: Verify that the VFs have been created and are in ``up`` state:
id: Pastikan bahwa VF telah dibuat dan dalam keadaan ``up``:
tr_tr: VF'lerin oluşturulduğunu ve ``ayakta`` durumda olduğunu doğrulayın:

source: Verify that the load balancer is responding to pings before moving further:
id: Pastikan bahwa penyeimbang beban merespon ping sebelum bergerak lebih lanjut:
tr_tr: Yük dengeleyicisinin ilerlemeden önce ping komutuna yanıt verdiğini doğrulayın:

source: Verify that the network contains the ``segment1`` and ``segment2`` segments.
id: Pastikan jaringan berisi segmen `` segment1`` dan ``segment2``.
tr_tr: Ağın ``segment1`` ve ``segment2`` dilimlerini içerdiğini doğrulayın.

source: Verify the prefixes and next-hop IP addresses that the BGP speaker advertises.
id: Lakukan verifikasi prefiks dan alamat IP next-hop dimana speaker BGP menyiarkan update dan perubahan.
tr_tr: BGP yayıncının önerdiği önekleri ve sonraki IP adres zıplamalarını doğrula.

source: Version
id: Version (versi)
tr_tr: Sürüm

source: Virtual Function. The virtual PCIe device created from a physical Ethernet controller.
id: Virtual Function. Perangkat PCIe virtual yang terbuat dari physical Ethernet controller.
tr_tr: Sanal Fonksiyon. Fiziksel Eternet denetleyiciden oluşturulmuş sanal PCIe aygıtı.

source: Virtual extensible local area network (VXLAN)
tr_tr: Sanal genişletilebilir yerel alan ağı (VXLAN)

source: Virtual routing and forwarding (VRF)
tr_tr: Sanal yönlendirme ve iletim (VRF)

source: Virtual routing and forwarding is an IP technology that allows multiple instances of a routing table to coexist on the same router at the same time. It is another name for the network namespace functionality described above.
id: Virtual routing and forwarding adalah sebuah teknologi IP yang mengizinkan beberapa instance dari tabel routing untuk hidup berdampingan pada router yang sama pada waktu yang sama. VRF ini adalah nama lain untuk fungsi jaringan namespace yang dijelaskan di atas.
tr_tr: Sanal yönlendirme ve iletim, bir yönlendirme tablosunun birden çok örneğini aynı anda aynı yönlendiricide mevcut hale getiren bir IP teknolojisidir. Yukarıda açıklanan ağ ad alanı işlevselliği için başka bir addır.

source: We anticipate this to expand to VM ports in the Ocata cycle.
id: Kami mengantisipasi ini untuk memperluas ke port VM dalam siklus Ocata.
tr_tr: Bunun, Ocata döngüsünde VM bağlantı noktalarına genişletilmesini bekliyoruz.

source: We recommend using Open vSwitch version 2.4 or higher. Optional features may require a higher minimum version.
id: Sebaiknya menggunakan Open vSwitch versi 2.4 atau lebih tinggi. Fitur opsional mungkin memerlukan versi minimum yang lebih tinggi.
tr_tr: Open vSwitch sürüm 2.4 veya daha yenisini kullanmanızı öneririz. İsteğe bağlı özellikler için daha yüksek bir minimum sürüm gerekebilir.

source: We recommend using VLAN provider networks for segregation. This way you can combine instances without SR-IOV ports and instances with SR-IOV ports on a single network.
id: Kami merekomendasikan penggunaan jaringan provider VLAN untuk pemisahan. Dengan cara ini Anda dapat menggabungkan instance tanpa port SR-IOV dan instance dengan port SR-IOV pada jaringan tunggal.
tr_tr: Ayrım için VLAN sağlayıcı ağları kullanmanızı öneririz. Böylece, SR-IOV bağlantı noktaları olmayan sunucuları ve SR-IOV portlu sunucuları tek bir ağda birleştirebilirsiniz.

source: When ``admin_state`` is set to ``DOWN``, the user is blocked from performing operations on the trunk. ``admin_state`` is set by the user and should not be used to monitor the health of the trunk.
id: Ketika ``admin_state`` diatur ke ``DOWN``, pengguna akan diblokir untuk melakukan operasi di trunk. ``admin_state`` diatur oleh pengguna dan tidak boleh digunakan untuk memantau kesehatan trunk.
tr_tr: ``admin_state`` ayarı ``KAPALI`` olarak ayarlandığında, kullanıcı bilgi aktarım yolu üzerinde işlem yapması engellenir. ``admin_state`` kullanıcı tarafından ayarlanır ve bilgi aktarım yolunun sağlığını izlemek için kullanılmamalıdır.

source: When a NIC receives an Ethernet frame, by default the NIC checks to see if the destination MAC address matches the address of the NIC (or the broadcast address), and the Ethernet frame is discarded if the MAC address does not match. For a compute host, this behavior is undesirable because the frame may be intended for one of the instances. NICs can be configured for *promiscuous mode*, where they pass all Ethernet frames to the operating system, even if the MAC address does not match. Compute hosts should always have the appropriate NICs configured for promiscuous mode.
id: Ketika NIC menerima frame Ethernet, secara default NIC memeriksa untuk melihat apakah tujuan alamat MAC sesuai dengan alamat NIC (atau alamat broadcast), dan frame Ethernet dibuang jika alamat MAC tidak cocok. Untuk host komputasi, perilaku ini tidak diinginkan karena frame mungkin dimaksudkan untuk salah satu instance. NIC dapat dikonfigurasi untuk *promiscuous mode*, dimana mereka melewatkan semua frame Ethernet ke sistem operasi, bahkan jika alamat MAC tidak cocok. Host komputasi harus selalu memiliki NIC yang tepat dikonfigurasi untuk promiscuous mode.
tr_tr: Bir NIC bir Ethernet çerçevesi aldığında varsayılan olarak NIC, hedef MAC adresinin NIC'nin (veya yayın adresi) adresiyle eşleşip eşleşmediğini kontrol eder ve MAC adresi eşleşmiyorsa Ethernet çerçevesi atılır. Bir hesaplama sunucusu için, çerçeve örneklerden biri için tasarlanmış olabileceğinden, bu davranış istenmemektedir. NIC'ler, MAC adresi eşleşmese bile, tüm Ethernet çerçevelerini işletim sistemine ilettikleri *karışık mod* için yapılandırılabilir. Hesap ana bilgisayarlarında, karışık mod için yapılandırılmış uygun NIC'ler olmalıdır.

source: When configuring instances to use a subport, ensure that the interface on the instance is set to use the MAC address assigned to the port by the Networking service. Instances are not made aware of changes made to the trunk after they are active. For example, when a subport with a ``segmentation-type`` of ``vlan`` is added to a trunk, any operations specific to the instance operating system that allow the instance to send and receive traffic on the new VLAN must be handled outside of the Networking service.
id: Ketika mengkonfigurasi instance untuk menggunakan subport, pastikan bahwa antarmuka pada instance diatur untuk menggunakan alamat MAC yang ditugaskan (assigned) ke port oleh layanan Networking. Instance tidak menyadarai perubahan yang dibuat trunk setelah mereka aktif. Misalnya, ketika subport dengan ``segmentasi-type`` dari ``vlan`` ditambahkan ke trunk, setiap operasi akan menspesifikasi untuk sistem operasi instance yang mengizinkan instance mengirim dan menerima lalu lintas pada VLAN baru harus ditangani di luar layanan Networking.
tr_tr: Sunucuları bir altport kullanacak şekilde yapılandırırken, sunucunun arabiriminin, Ağ hizmeti tarafından bağlantı noktasına atanan MAC adresini kullanacak şekilde ayarlandığından emin olun. Sunucu, etkin olduktan sonra bilgi aktarım yolunda yapılan değişikliklerin farkında değildir. Örneğin, ``segmentation-type`` `vlan`` olan bir altport, bir bilgi aktarım yoluna eklendiğinde, sunucuya işletim sistemine özgü, örneğin yeni VLAN'da trafik gönderip almasını sağlayan herhangi bir işlem olmalıdır. Ağ hizmetinin dışında ele alınır.

source: When creating subports, the MAC address of the trunk parent port can be set on the subport. This will allow VLAN subinterfaces inside an instance launched on a trunk to be configured without explicitly setting a MAC address. Although unique MAC addresses can be used for subports, this can present issues with ARP spoof protections and the native OVS firewall driver. If the native OVS firewall driver is to be used, we recommend that the MAC address of the parent port be re-used on all subports.
id: Ketika pembuatan subports, alamat MAC dari port tua induk dapat diatur pada subport tersebut. Hal ini akan mengizinkan subinterfaces VLAN dalam sebuah instance yang diluncurkan pada trunk yang akan dikonfigurasi tanpa secara eksplisit menetapkan alamat MAC. Meskipun alamat MAC yang unik dapat digunakan untuk subports, ini dapat menimbulkan masalah dengan perlindungan spoof ARP dan driver firewall OVS asli (native). Jika driver firewall OVS asli akan digunakan, kami menyarankan bahwa alamat MAC dari port induk akan digunakan kembali pada semua subports.
tr_tr: Altportlar oluştururken, alt ana portun MAC adresi alt portta ayarlanabilir. Bu, bilgi aktarım yolu üzerinde başlatılan bir sunucu içindeki VLAN alt arabirimlerinin, açıkça bir MAC adresi ayarlamadan yapılandırılmasını sağlayacaktır. Altportlar için benzersiz MAC adresleri kullanılabilir, ancak bu ARP sahteciliği koruması ve yerli OVS güvenlik duvarı sürücüsü ile ilgili sorunlar ortaya koyabilir. Yerel OVS güvenlik duvarı sürücüsü kullanılacaksa, üst bağlantı noktasının MAC adresinin tüm altportlarda yeniden kullanılması önerilir.

source: When libvirt boots a virtual machine, it places the machine's VIF in the bridge ``virbr0`` unless explicitly told not to.
id: Ketika libvirt boot mesin virtual, ia menempatkan VIF mesin di jembatan ``virbr0`` kecuali secara eksplisit mengatakan tidak.
tr_tr: Libvirt sanal bir makineyi önyüklendiğinde, açıkça belirtilmediği sürece makinenin VIF'sini ``virbr0`` köprüsüne yerleştirir.

source: When the ``router_distributed = True`` flag is configured, routers created by all users are distributed. Without it, only privileged users can create distributed routers by using ``--distributed True``.
id: Ketika flag ``router_distributed = True`` dikonfigurasi, router yang dibuat oleh semua pengguna didistribusikan. Tanpa itu, hanya pengguna istimewa dapat menciptakan didistribusikan router dengan menggunakan ``--distributed True``.
tr_tr: ``router_distributed = True`` bayrağı yapılandırıldığında, tüm kullanıcılar tarafından oluşturulan yönlendiriciler dağıtılır. O olmadan, sadece ayrıcalıklı kullanıcılar ``--distributed True`` kullanarak dağıtılmış yönlendiriciler oluşturabilirler.

source: When the router receives a packet with the matching IP address and port, it translates these back to the private IP address and port, and forwards the packet along.
id: Ketika router menerima paket dengan alamat IP dan port yang cocok , router itu menterjemahkan kembali paket ke alamat IP private dan port, dan meneruskan paket secara bersama.
tr_tr: Yönlendirici, eşleşen IP adresi ve bağlantı noktası olan bir paket aldığında, bunları geri özel IP adresine ve bağlantı noktasına çevirir ve paketi birlikte iletir.

source: When the source or destination IP address are not of the same IP version (for example, IPv6), the command returns an error.
id: Ketika sumber atau alamat IP tujuan adalah bukan dari versi IP yang sama (misalnya, IPv6), perintah akan mengembalikan suatu kesalahan.
tr_tr: Kaynak veya hedef IP adresi aynı IP sürümünden (örneğin, IPv6) değilse, komut bir hata döndürür.

source: When this functionality is enabled, it is leveraged by the Compute service when creating instances. When allocating ports for an instance during boot, the Compute service populates the ``dns_name`` attributes of these ports with the ``hostname`` attribute of the instance, which is a DNS sanitized version of its display name. As a consequence, at the end of the boot process, the allocated ports will be known in the dnsmasq associated to their networks by their instance ``hostname``.
id: Ketika fungsi ini diaktifkan, terjadi pengungkitkan oleh layanan Compute saat membuat instance. Ketika mengalokasikan port untuk instance saat boot, layanan Compute akan mengisi atribut port ``dns_name`` ini dengan atribut instance ``hostname``, yang merupakan versi DNS yang dibersihkan dari nama tampilan nya. Akibatnya, pada akhir proses booting, port dialokasikan akan diketahui dalam dnsmasq terkait ke jaringan mereka dengan instance `` hostname``mereka.
tr_tr: Bu işlev etkinleştirildiğinde, sunucu oluştururken Hesaplama hizmeti tarafından etkindir. Önyükleme sırasında bir sunucuya bağlantı noktaları atarken, Hesaplama servisi, bu bağlantı noktalarının ``dns_name`` özniteliklerini, ekran adının DNS tarafından sanitize edilmiş bir versiyonu olan sunucunun ``hostname`` özniteliğiyle doldurur. Sonuç olarak, önyükleme işleminin sonunda, tahsis edilen bağlantı noktaları kendi ağlarına bağlı dnsmasq'da sunucu ``hostname``ine göre bilinir.

source: When troubleshooting an instance that is not reachable over the network, it can be helpful to examine this log to verify that all four steps of the DHCP protocol were carried out for the instance in question.
id: Ketika ada masalah sebuah instance yang tidak dapat dijangkau melalui jaringan, ada bantuan untuk memeriksa log ini untuk memverifikasi bahwa semua empat langkah dari protokol DHCP dilakukan untuk instance yang dipermasalahkan.
tr_tr: Ağ üzerinden erişilemeyen bir sorunun sorunlarını gidermek için söz konusu sunucu için DHCP protokolünün dört adımının da hepsinin gerçekleştirildiğini doğrulamak için bu günlüğün incelenmesi yararlı olabilir.

source: When using DevStack, it is important to start your server after the ``stack.sh`` script has finished to ensure that the required network interfaces have been created.
id: Bila menggunakan DevStack, Hal ini penting untuk memulai server Anda setelah skrip ``stack.sh`` telah selesai untuk memastikan bahwa antarmuka jaringan yang diperlukan telah dibuat.
tr_tr: DevStack'i kullanırken, gerekli ağ arabirimlerinin oluşturulduğundan emin olmak için ``stack.sh`` komut dosyası bittikten sonra sunucunuzu başlatmanız önemlidir.

source: When using Quality of Service (QoS), ``max_burst_kbps`` (burst over ``max_kbps``) is not supported. In addition, ``max_kbps`` is rounded to Mbps.
id: Ketika penggunaan Quality of Service (QoS), ``max_burst_kbps`` (meledak lebih ``max_kbps``) tidak didukung. Sebagai tambahan, ``max_kbps`` dibulatkan ke Mbps.
tr_tr: Hizmet Kalitesi'ni (QoS) kullanırken, ``max_burst_kbps`` (``max_kbps`` üzerinde patlama) desteklenmez. Buna ek olarak, ``max_kbps``, Mbps'ye yuvarlanır.

source: When using SLAAC, the currently supported combinations for ``ipv6_ra_mode`` and ``ipv6_address_mode`` are as follows.
id: Bila menggunakan SLAAC, kombinasi didukung saat ini untuk ``ipv6_ra_mode`` dan ``ipv6_address_mode`` adalah sebagai berikut.
tr_tr: SLAAC kullanılırken, şu anda desteklenen ``ipv6_ra_mode`` ve ``ipv6_address_mode`` kombinasyonları aşağıdaki gibidir.

source: When using a ``segmentation-type`` of ``vlan``, the OVS and Linux bridge drivers present the network of the parent port as the untagged VLAN and all subports as tagged VLANs.
id: Bila menggunakan ``segmentasi-type`` dari ` vlan``, driver OVS dan Linux bridge menyajikan jaringan port induk sebagai VLAN untagged dan semua subports sebagai VLAN taged.
tr_tr: `` vlan``ın ``segmentation-type``ını kullanırken, OVS ve Linux köprü sürücüleri, üst bağlantı noktasının ağını etiketsiz VLAN olarak, tüm alt sınıfları etiketli VLAN'lar olarak sunar.

source: When using the Open vSwitch or Linux bridge drivers, new MTU calculations will be propogated automatically after restarting the ``l3-agent`` service.
id: Bila menggunakan Open vSwitch atau driver jembatan Linux, perhitungan MTU baru akan diperbanyak secara otomatis setelah restart layanan ``l3-agent``.
tr_tr: Open vSwitch ve Linux köprü sürücülerini kullanırken, yeni MTU hesaplamaları `l3-agent`` servisini yeniden başlattıktan sonra otomatik olarak yayılır.

source: When using the neutron L3 agent in a configuration where it is auto-configuring an IPv6 address via SLAAC, and the agent is learning its default IPv6 route from the ICMPv6 Router Advertisement, it may be necessary to set the ``net.ipv6.conf.<physical_interface>.accept_ra`` sysctl to the value ``2`` in order for routing to function correctly. For a more detailed description, please see the `bug <https://bugs.launchpad.net/neutron/+bug/1616282>`__.
id: Bila menggunakan neutron L3 agent dalam konfigurasi dimana itu adalah auto-configuring alamat IPv6 melalui SLAAC, dan agen sedang mempelajari rute IPv6 defaultnya dari ICMPv6 Router Advertisement, itu mungkin perlu untuk mengatur sysctl ``net.ipv6.conf . <physical_interface> .accept_ra`` dengan nilai ``2`` agar routing berfungsi dengan benar. Untuk penjelasan lebih rinci, silakan lihat `bug <https://bugs.launchpad.net/neutron/+bug/1616282>` __.
tr_tr: Neutron L3 ajanını, bir IPv6 adresini otomatik olarak SLAAC vasıtasıyla yapılandıran bir yapılandırmada kullanırken ve ajan, varsayılan IPv6 rotasını ICMPv6 Yönlendirici Tanıtımından öğreniyorsa, ``net.ipv6.conf.<physical_interface>.accept_ra`` dosyasını ayarlamanız gerekebilir. sysctl değerini "2`` değerine ayarlayın. Daha detaylı bir açıklama için `bug <https://bugs.launchpad.net/neutron/+bug/1616282>`__ ye bakın.

source: When using the reference implementation of the OpenStack Networking prefix delegation driver, Dibbler must also be installed on your OpenStack Networking node(s) to serve as a DHCPv6 client. Version 1.0.1 or higher is required.
id: Bila menggunakan implementasi referensi dari driver prefix delegation OpenStack Networking, Dibbler juga harus diinstal pada node OpenStack Networking Anda untuk melayani sebagai klien DHCPv6. Versi 1.0.1 atau lebih tinggi diperlukan.
tr_tr: OpenStack Ağ önek yetkilendirme sürücüsünün referans uygulamasını kullanırken, DHCPv6 istemcisi olarak hizmet vermek için Dibbler OpenStack Networking düğümlerinize de kurulmalıdır. Sürüm 1.0.1 veya üstü gereklidir.

source: When you create a network with one port, the network will be scheduled to an active DHCP agent. If many active DHCP agents are running, select one randomly. You can design more sophisticated scheduling algorithms in the same way as nova-schedule later on.
id: Bila Anda membuat jaringan dengan satu port, jaringan akan dijadwalkan untuk agen DHCP aktif. Jika banyak agen DHCP aktif berjalan, pilih salah satu secara acak. Anda dapat merancang algoritma penjadwalan yang lebih canggih dalam cara yang sama seperti nova-schedule nanti.
tr_tr: Bir bağlantı noktasına sahip bir ağ oluşturduğunuzda, ağ etkin bir DHCP aracısı için zamanlanır. Birçok etkin DHCP aracı çalışıyorsa, birini rasgele seçin. Daha gelişmiş zamanlama algoritmaları, daha sonra nova-schedule ile aynı şekilde tasarlayabilirsiniz.

source: When you run :command:`openstack network list` or :command:`openstack network show`, the ``shared`` flag is calculated by the server based on the calling project and the RBAC entries for each network. For QoS objects use :command:`openstack network qos policy list` or :command:`openstack network qos policy show` respectively. If there is a wildcard entry, the ``shared`` flag is always set to ``True``. If there are only entries that share with specific projects, only the projects the object is shared to will see the flag as ``True`` and the rest will see the flag as ``False``.
id: Ketika Anda menjalankan :command:`openstack network list` atau :command:`openstack network show`, flag ``shared`` dihitung oleh server berdasarkan proyek panggilan dan entri RBAC untuk setiap jaringan. Untuk objek QoS gunakan :command:`openstack network qos policy list` atau :command:`openstack network qos policy show` masing-masing. Jika ada entri wildcard, flag ``shared`` selalu diatur ke ``True``. Jika hanya ada entri yang berbagi dengan proyek tertentu, hanya proyek yang objeknya berbagi akan melihat flag sebagai `` True`` dan sisanya akan melihat bendera sebagai ``False``.
tr_tr: :command:`openstack network list` veya :command:`openstack network show` komutunu çalıştırdığınızda, `` shared`` bayrağı, çağıran projeye ve her ağ için RBAC girdilerine dayalı olarak sunucu tarafından hesaplanır. QoS nesneleri için sırasıyla :command:`openstack network qos policy list` veya :command:`openstack network qos policy show` komutlarını kullanın. Bir joker karakter girişi varsa, ``shared`` bayrağı her zaman ``True`` olarak ayarlanır. Yalnızca belirli projelerle paylaşılan girdiler varsa, yalnızca nesnenin paylaştığı projeler bayrağı ``True`` olarak görür ve gerisi bayrağı ``False`` olarak görecektir.

source: Where ``ha_vrrp_health_check_interval`` indicates how often in seconds the health check should run. The default value is ``0``, which indicates that the check should not run at all.
id: Dimana ``ha_vrrp_health_check_interval`` menunjukkan seberapa sering dalam detik dimana pengecekan kesehatan harus dijalankan. Nilai default adalah ``0``, yang menunjukkan bahwa pengecekan tidak berjalan sama sekali.
tr_tr: ``ha_vrrp_health_check_interval`` sağlık kontrolünün kaç saniye içinde kaç sıklıkta çalışması gerektiğinin gösterildiği yer. Varsayılan değer `` 0`` olup, bu kontrolün hiç çalışmaması gerektiğini gösterir.

source: While NICs use MAC addresses to address network hosts, TCP/IP applications use IP addresses. The Address Resolution Protocol (ARP) bridges the gap between Ethernet and IP by translating IP addresses into MAC addresses.
id: Sementara NIC menggunakan alamat MAC untuk mengatasi host jaringan, aplikasi TCP/IP menggunakan alamat IP. Address Resolution Protocol (ARP) menjembatani kesenjangan antara Ethernet dan IP dengan menerjemahkan alamat IP ke alamat MAC.
tr_tr: NIC'ler, ağ ana bilgisayarlarına adres bulmak için MAC adresleri kullanırken, TCP/IP uygulamaları IP adreslerini kullanır. Adres Çözümleme Protokolü (ARP), IP adreslerini MAC adreslerine çevirerek Ethernet ve IP arasındaki boşluğu kapatır.

source: Whitelist PCI devices in nova-compute (Compute)
id: Daftarlah (whitelist) perangkat PCI di nova-compute (Compute)
tr_tr: Nova-compute'de PCI aygıtlarını beyaz listeye al (Hesaplama)

source: Whitelist PCI devices nova-compute (Compute)
id: Daftarlah (whitelist) perangkat PCI nova-compute (Compute)
tr_tr: Beyaz liste PCI aygıtları nova-compute (Hesaplama)

source: Why you need them
id: Mengapa Anda membutuhkan mereka
tr_tr: Bunlara neden ihtiyacınız var
