Repository: 25hours/openstack-manuals
Catalog: doc/networking-guide/source/locale/*/LC_MESSAGES/networking-guide.po
Languages: id, tr_tr

source: In *Source Network Address Translation* (SNAT), the NAT router modifies the IP address of the sender in IP packets. SNAT is commonly used to enable hosts with *private addresses* to communicate with servers on the public Internet.
id: Dalam *Source Network Address Translation* (SNAT), router NAT memodifikasi alamat IP dari pengirim di paket IP. SNAT umumnya digunakan untuk mengaktifkan host dengan *private addresses* untuk berkomunikasi dengan server di Internet publik.
tr_tr: *Kaynak Ağ Adresi Çevirisi* (SNAT) içinde, NAT yönlendirici, göndericinin IP adresini IP paketlerinde değiştirir. SNAT, *özel adresleri* olan ana bilgisayarların, genel İnternet'teki sunucularla iletişim kurmasını sağlamak için sıklıkla kullanılır.

source: In *one-to-one NAT*, the NAT router maintains a one-to-one mapping between private IP addresses and public IP addresses. OpenStack uses one-to-one NAT to implement floating IP addresses.
id: Dalam *one-to-one NAT*, router NAT memelihara pemetaan one-to-one antara alamat IP private dan alamat IP publik. OpenStack menggunakan one-to-one NAT untuk menerapkan alamat IP mengambang.
tr_tr: *Bire bir NAT*'da, NAT yönlendiricisi, özel IP adresleri ve genel IP adresleri arasında birebir eşlemeyi sürdürür. OpenStack kayan IP adreslerini uygulamak için bire bir NAT kullanır.

source: In :ref:`config-dns-use-case-1`, the externally accessible network must meet the following requirements:
id: Dalam :ref:`config-dns-use-case-1`, jaringan yang dapat diakses secara eksternal harus memenuhi persyaratan sebagai berikut:
tr_tr: :ref:`config-dns-use-case-1`de, harici olarak erişilebilir ağ aşağıdaki gereksinimleri karşılamalıdır:

source: In Liberty and Mitaka, the IPAM implementation within OpenStack Networking provided a pluggable and non-pluggable flavor. As of Newton, the non-pluggable flavor is no longer available. Instead, it is completely replaced with a reference driver implementation of the pluggable framework. All data will be automatically migrated during the upgrade process, unless you have previously configured a pluggable IPAM driver. In that case, no migration is necessary.
id: Di Liberty dan Mitaka, pelaksanaan IPAM dalam OpenStack Networking tersedia flavor pluggable dan non-pluggable. Pada Newton, rasa non-pluggable tidak lagi tersedia. Sebaliknya, itu benar-benar diganti dengan implementasi driver referensi dari kerangka pluggable. Semua data akan dipindahkan secara otomatis selama proses upgrade, kecuali jika Anda sebelumnya telah dikonfigurasi driver IPAM pluggable. Dalam hal ini, tidak ada migrasi diperlukan.
tr_tr: Liberty ve Mitaka'da, OpenStack Networking içindeki IPAM uygulaması, takılabilir ve takılmayan bir flavor sağladı. Newton'dan beri takılmayan flavor artık mevcut değildir. Bunun yerine, tamamen değiştirilebilir çerçevenin bir referans sürücüsü uygulamasıyla değiştirilir. Takılabilir bir IPAM sürücüsü önceden yapılandırmadıysanız, tüm veriler otomatik olarak yükseltme işlemi sırasında taşınacaktır. Bu durumda göç gerekmez.

source: In ``/etc/neutron/plugins/ml2/ml2_conf.ini``, add ``qos`` to ``extension_drivers`` in the ``[ml2]`` section. For example:
id: Dalam ``/etc/neutron/plugins/ml2/ml2_conf.ini``, tambahkan ``qos`` ke ``extension_drivers`` dalam bagian ``[ml2]``. Sebagi contoh:
tr_tr: ``/etc/neutron/plugins/ml2/ml2_conf.ini`` dosyasında, ``[ml2]`` bölümünde ``extension_drivers``a ``qos`` ekle. Örneğin:

source: In ``/etc/neutron/plugins/ml2/openvswitch_agent.ini``, add ``qos`` to the ``extensions`` setting in the ``[agent]`` section. For example:
id: Dalam ``/etc/neutron/plugins/ml2/openvswitch_agent.ini``, tambahkan ``qos`` ke pengaturan ``extensions`` dalam bagian ``[agent]``. Sebagai contoh:
tr_tr: ``/etc/neutron/plugins/ml2/openvswitch_agent.ini``de ``[agent]`` bölümünde ``extensions`` ayarına ``qos`` ekleyin. Örneğin:

source: In a deployment where the operator has set up the resources as described above, validate that users can get their auto-allocated network topology as follows:
tr_tr: Operatörün yukarıda açıklandığı gibi kaynakları kurduğu bir dağıtımda, kullanıcıların otomatik olarak tahsis edilen ağ topolojisini aşağıdaki gibi alınabileceğini doğrulayın:

source: In a network namespace, the scoped 'identifiers' are network devices; so a given network device, such as ``eth0``, exists in a particular namespace. Linux starts up with a default network namespace, so if your operating system does not do anything special, that is where all the network devices will be located. But it is also possible to create further non-default namespaces, and create new devices in those namespaces, or to move an existing device from one namespace to another.
id: Dalam namespace jaringan, scoped 'identifiers' adalah perangkat jaringan; sehingga perangkat jaringan tertentu, seperti ``eth0``, ada dalam namespace tertentu. Linux memulai dengan namespace jaringan default, jadi jika sistem operasi Anda tidak melakukan sesuatu yang istimewa, itulah namespace tempat semua perangkat jaringan akan berlokasi. Tetapi juga namespace itu mungkin membuat non-default namespace lebih lanjut, dan menciptakan perangkat baru pada namespace itu, atau memindahkan perangkat yang ada dari satu namespace ke namespace yang lain.
tr_tr: Bir ağ ad alanında, kapsamlandırılmış 'tanımlayıcılar' ağ aygıtlarıdır; bu nedenle belirli bir ad alanına ``eth0`` gibi belirli bir ağ cihazı var. Linux, varsayılan bir ağ ad alanıyla başlar, bu nedenle işletim sisteminiz özel bir şey yapmazsa tüm ağ aygıtlarının bulunduğu yer budur. Ancak, varsayılan olmayan diğer ad alanlarını oluşturmak ve bu ad alanlarında yeni aygıtlar oluşturmak veya mevcut bir aygıtı bir ad alanından diğerine taşımak da mümkündür.

source: In an Ethernet network, every host on the network can send a frame directly to every other host. An Ethernet network also supports broadcasts so that one host can send a frame to every host on the network by sending to the special MAC address ``ff:ff:ff:ff:ff:ff``. ARP_ and DHCP_ are two notable protocols that use Ethernet broadcasts. Because Ethernet networks support broadcasts, you will sometimes hear an Ethernet network referred to as a *broadcast domain*.
id: Dalam sebuah jaringan Ethernet, setiap host pada jaringan dapat mengirim frame langsung ke setiap host lainnya. Jaringan Ethernet juga mendukung siaran sehingga satu host dapat mengirim frame untuk setiap host pada jaringan dengan mengirimkan ke alamat MAC khusus ``ff:ff:ff:ff:ff:ff``. ARP_ dan DHCP_ adalah dua protokol penting yang menggunakan siaran Ethernet. Karena jaringan Ethernet mendukung siaran, Anda kadang-kadang akan mendengar jaringan Ethernet disebut sebagai *broadcast domain*.
tr_tr: Bir Ethernet ağında, ağdaki her ana bilgisayar doğrudan diğer her ana bilgisayara bir çerçeve gönderebilir. Bir Ethernet ağı, yayınları da destekleyerek bir ana bilgisayarın, ağdaki her ana bilgisayara ``ff:ff:ff:ff:ff:ff`` yazan özel MAC adresine bir çerçeve gönderebilmesi için destek verir. ARP_ ve DHCP_, Ethernet yayınlarını kullanan iki önemli protokoldür. Ethernet ağları yayınları desteklediğinden bazen *yayın alanı* olarak adlandırılan bir Ethernet ağı duyarsınız.

source: In an Ethernet network, the hosts connected to the network communicate by exchanging *frames*. Every host on an Ethernet network is uniquely identified by an address called the media access control (MAC) address. In particular, every virtual machine instance in an OpenStack environment has a unique MAC address, which is different from the MAC address of the compute host. A MAC address has 48 bits and is typically represented as a hexadecimal string, such as ``08:00:27:b9:88:74``. The MAC address is hard-coded into the NIC by the manufacturer, although modern NICs allow you to change the MAC address programmatically. In Linux, you can retrieve the MAC address of a NIC using the :command:`ip` command:
id: Dalam sebuah jaringan Ethernet, host terhubung ke jaringan berkomunikasi dengan bertukar * frame *. Setiap host di jaringan Ethernet secara unik diidentifikasi oleh alamat yang disebut media access control (MAC). Secara khusus, setiap instance mesin virtual di lingkungan OpenStack memiliki alamat MAC yang unik, yang berbeda dari alamat MAC dari host komputasi. Sebuah alamat MAC memiliki 48 bit dan biasanya direpresentasikan sebagai string heksadesimal, seperti ``08:00:27:b9:88:74``. Alamat MAC adalah hard-coded ke dalam NIC oleh manufacturer, meskipun NIC modern memungkinkan Anda untuk mengubah alamat MAC secara pemrograman. Di Linux, Anda dapat mengambil alamat MAC dari NIC menggunakan perintah :command:`ip`
tr_tr: Ethernet ağında, ağa bağlı ana bilgisayarlar *çerçeveler* alışverişiyle iletişim kurar. Ethernet ağındaki her ana bilgisayar, ortam erişim denetimi (MAC) adresi adı verilen bir adresle benzersiz şekilde tanımlanır. Özellikle, OpenStack ortamındaki her sanal makine örneği, hesaplama ana bilgisayarının MAC adresinden farklı olan benzersiz bir MAC adresine sahiptir. Bir MAC adresi 48 bittir ve tipik olarak ``08:00:27:b9:88:74`` gibi onaltılı bir dize olarak temsil edilir. Modern NIC'ler MAC adresini programlı olarak değiştirmenize izin vermekle birlikte, MAC adresi üreticiden NIC'ye sabit kodlanmıştır. Linux'ta, bir NIC'nin MAC adresini :command:`ip` komutunu kullanarak alabilirsiniz:

source: In both cases, install and configure Open vSwitch with DPDK support for each node. For more information, see the `OVS-DPDK <https://github.com/openvswitch/ovs/blob/v2.5.0/INSTALL.DPDK.md>`__ installation guide.
id: Dalam kedua kasus, menginstal dan mengkonfigurasi Open vSwitch dengan dukungan DPDK untuk setiap node. Untuk informasi lebih lanjut, lihat petunjuk pemasangan `OVS-DPDK <https://github.com/openvswitch/ovs/blob/v2.5.0/INSTALL.DPDK.md>`__
tr_tr: Her iki durumda, her düğüm için DPDK desteği ile Open vSwitch kurun ve yapılandırın. Daha fazla bilgi için, `OVS-DPDK <https://github.com/openvswitch/ovs/blob/v2.5.0/INSTALL.DPDK.md>`__ kurulum kılavuzuna bakınız.

source: In deployments using DVR, the BGP speaker advertises floating IP addresses and self-service networks differently. For floating IP addresses, the BGP speaker advertises the floating IP agent gateway on the corresponding compute node as the next-hop IP address. For self-service networks using SNAT, the BGP speaker advertises the DVR SNAT node as the next-hop IP address.
id: Dalam pengerahan penggunaan DVR, BGP speaker menyiaran update dan perubahan alamat IP mengambang dan jaringan self-service yang berbeda. Untuk alamat IP mengambang, BGP speaker menyiaran update dan perubahan gateway agen IP mengambang pada node komputasi yang sesuai sebagai alamat IP next-hop. Untuk jaringan self-service menggunakan SNAT, BGP speaker menyiaran update dan perubahan node DVR SNAT sebagai alamat IP next-hop.
tr_tr: DVR kullanan dağıtımlarda, BGP yayıncı yüzen IP adreslerini ve self-servis ağlarını farklı şekilde duyurur. Yüzen IP adresleri için, BGP yayıncı karşılık gelen hesaplama düğümünde yüzen IP aracı ağ geçidini bir sonraki atlamalı IP adresi olarak bildirir. SNAT kullanan self servis ağlar için, BGP yayıncısı DVR SNAT düğümünü sonraki atlamalı IP adresi olarak bildirir.

source: In existing deployments, check the current database version using the following command:
id: Dalam pengerahan yang ada, periksa versi database saat menggunakan perintah berikut:
tr_tr: Varolan dağıtımlarda şu komutu kullanarak geçerli veritabanı sürümünü kontrol edin:

source: In future releases, the Networking service may support setting tags for additional resources.
id: Dalam rilis mendatang, layanan Networking dapat mendukung pengaturan tag untuk sumber daya tambahan.
tr_tr: Gelecekteki sürümlerde, Ağ hizmeti, ek kaynaklar için etiketleri ayarlamayı destekleyebilir.

source: In general, the OpenStack Networking software components that handle layer-3 operations impact performance and reliability the most. To improve performance and reliability, provider networks move layer-3 operations to the physical network infrastructure.
id: Secara umum, komponen software OpenStack Networking yang menangani operasi lapisan-3 berdampak secara nysta pada kinerja dan kehandalan. Untuk meningkatkan kinerja dan kehandalan, jaringan provider memindahkan operasi lapisan-3 untuk infrastruktur jaringan fisik.
tr_tr: Genel olarak, katman-3 işlemlerini yürüten OpenStack Ağ yazılım bileşenleri performans ve güvenilirliği en fazla etkiler. Performans ve güvenilirliği artırmak için sağlayıcı ağları, katman-3 operasyonlarını fiziksel ağ altyapısına taşır.

source: In many cases, operators who are already familiar with virtual networking architectures that rely on physical network infrastructure for layer-2, layer-3, or other services can seamlessly deploy the OpenStack Networking service. In particular, provider networks appeal to operators looking to migrate from the Compute networking service (nova-network) to the OpenStack Networking service. Over time, operators can build on this minimal architecture to enable more cloud networking features.
id: Dalam banyak kasus, operator yang sudah akrab dengan arsitektur jaringan virtual yang mengandalkan infrastruktur jaringan fisik untuk lapisan-2, lapisan-3, atau layanan lainnya dapat secara mulus mnegerahkan layanan OpenStack Networking. Secara khusus, jaringan provider menarik bagi operator yang ingin bermigrasi dari layanan jaringan Compute (nova-network) ke layanan OpenStack Networking. Seiring waktu, operator dapat membangun arsitektur minimal ini untuk mengaktifkan fitur jaringan cloud.
tr_tr: Pek çok durumda, katman-2, katman-3 ya da diğer hizmetler için fiziksel ağ altyapısına dayanan sanal ağ mimarilerini zaten bilen operatörler, OpenStack Ağ hizmetini sorunsuz bir şekilde kurabilirler. Özellikle, sağlayıcı ağları, Hesaplama ağ hizmetinden (nova-network) OpenStack Ağ hizmetine geçiş yapmak isteyen operatörler için caziptir. Operatörler, zamanla daha fazla bulut ağ oluşturma özelliğini etkinleştirmek için bu minimal mimariyi inşa edebilir.

source: In most cases, self-service networks use overlay protocols such as VXLAN or GRE because they can support many more networks than layer-2 segmentation using VLAN tagging (802.1q). Furthermore, VLANs typically require additional configuration of physical network infrastructure.
id: Dalam kebanyakan kasus, jaringan self-service menggunakan protokol overlay seperti VXLAN atau GRE karena mereka dapat mendukung lebih banyak jaringan dari segmentasi lapisan-2 menggunakan VLAN tagging (802.1q). Selanjutnya, VLAN biasanya membutuhkan konfigurasi infrastruktur jaringan fisik tambahan.
tr_tr: Çoğu durumda, self servis ağlar VXLAN veya GRE gibi yer paylaşımı protokolleri kullanır, çünkü VLAN etiketleme (802.1q) kullanarak katman-2 bölümlemesinden çok daha fazla ağ destekleyebilir. Ayrıca, VLAN'ler tipik olarak fiziksel ağ altyapısının ek yapılandırılmasını gerektirir.

source: In new deployments, you start with an empty database and then upgrade to the latest database version using the following command:
id: Dalam pengerahan baru, Anda mulai dengan database kosong dan kemudian meng-upgrade ke versi terbaru database menggunakan perintah berikut:
tr_tr: Yeni kurulumlarda, boş bir veritabanıyla başlar ve sonra aşağıdaki komutu kullanarak en yeni veritabanı sürümüne geçersiniz:

source: In one particular use case, the OpenStack deployment resides in a mixed environment with conventional virtualization and bare-metal hosts that use a sizable physical network infrastructure. Applications that run inside the OpenStack deployment might require direct layer-2 access, typically using VLANs, to applications outside of the deployment.
id: Dalam satu kasus penggunaan tertentu, pengerahan OpenStack berada di lingkungan campuran conventional virtualization dengan bare-metal host yang menggunakan infrastruktur jaringan fisik yang cukup besar. Aplikasi yang berjalan di dalam penyebaran OpenStack mungkin memerlukan lapisan-2 akses langsung, biasanya menggunakan VLAN, untuk aplikasi di luar pengerahan.
tr_tr: Belirli bir kullanım durumunda, OpenStack dağıtımı, geleneksel sanallaştırma ve oldukça büyük bir fiziksel ağ altyapısı kullanan bare metal barındıran karışık bir ortama sahiptir. OpenStack dağıtımında çalışan uygulamalar, dağıtımın dışındaki uygulamalar için genellikle VLAN'lar kullanan doğrudan katman-2 erişimi gerektirebilir.

source: In order to attach a QoS policy to a network, update an existing network, or initially create the network attached to the policy.
id: Dalam rangka untuk melekatkan kebijakan QoS untuk jaringan, perbarui jaringan yang ada, atau buat secara awal jaringan yang melekat pada kebijakan.
tr_tr: Bir ağa bir QoS politikası eklemek için mevcut bir ağı güncelleyin veya başlangıçta ilkeye bağlı ağ oluşturun.

source: In order to detach a port from the QoS policy, simply update again the port configuration.
id: Dalam rangka untuk melepaskan port dari kebijakan QoS, hanya update lagi konfigurasi port.
tr_tr: Bir bağlantı noktasını QoS politikasından çıkarmak için, basitçe bağlantı noktası yapılandırmasını güncelleyin.

source: In order to enable SR-IOV, the following steps are required:
id: Untuk mengaktifkan SR-IOV, langkah-langkah berikut ini diperlukan:
tr_tr: SR-IOV'i etkinleştirmek için aşağıdaki adımlar gereklidir:

source: In order to support a wide range of deployment options, the migration process described here requires a rolling restart of hypervisors. The rate and timing of specific hypervisor restarts is under the control of the operator.
id: Dalam rangka mendukung berbagai opsi pengerahan, proses migrasi dijelaskan disini membutuhkan restart hypervisors rolling. Tingkat dan waktu restart hypervisor tertentu berada di bawah kendali operator.
tr_tr: Geniş bir dağıtım seçeneklerini desteklemek için, burada açıklanan geçiş işlemi, devralınan bir üst denetleyiciyi gerektirir. Belirli bir hypervisor yeniden başlatma oran ve zamanlaması operatörün kontrolü altındadır.

source: In order to support the widest range of deployer needs, the process described here is easy to automate but is not already automated. Deployers should expect to perform multiple manual steps or write some simple scripts in order to perform this migration.
id: Dalam rangka mendukung jangkauan terluas kebutuhan deployer, proses yang dijelaskan di sini adalah mudah untuk mengotomatisasi tetapi belum otomatis. Deployers harus berharap untuk melakukan beberapa langkah-langkah manual atau menulis beberapa script sederhana untuk melakukan migrasi ini.
tr_tr: Geniş kapsamlı dağıtımcı gereksinimlerini desteklemek için, burada açıklanan işlemin otomatikleştirilmesi kolay olmakla birlikte henüz otomatik hale getirilmemiştir. Dağıtımcılar, bu taşıma işlemini gerçekleştirmek için birden fazla manuel adım gerçekleştirmeyi veya bazı basit komut dosyaları yazmayı beklemeliler.

source: In the OSI model of networking protocols IP occupies the third layer, known as the network layer. When discussing IP, you will often hear terms such as *layer 3*, *L3*, and *network layer*.
id: Dalam model OSI, IP protokol jaringan menempati lapisan ketiga, yang dikenal sebagai lapisan jaringan. Ketika mendiskusikan IP, Anda akan sering mendengar istilah-istilah seperti *layer 3*, *L3*, dan *network layer*.
tr_tr: Ağ protokollerinin OSI modelinde IP, ağ katmanı olarak bilinen üçüncü katmanı kaplar. IP tartışırken genellikle *katman 3*, *L3* ve *ağ katmanı* gibi terimleri duyarsınız.

source: In the `OSI model <https://en.wikipedia.org/wiki/OSI_model>`_ of networking protocols, Ethernet occupies the second layer, which is known as the data link layer. When discussing Ethernet, you will often hear terms such as *local network*, *layer 2*, *L2*, *link layer* and *data link layer*.
id: Dalam `OSI model <https://en.wikipedia.org/wiki/OSI_model>`_ untuk protokol jaringan, Ethernet menempati lapisan kedua, yang dikenal sebagai lapisan data link. Ketika membahas Ethernet, Anda akan sering mendengar istilah-istilah seperti *local network*, *layer 2*, *L2*, *link layer* dan *data link layer*.
tr_tr: Ağ protokollerinin `OSI model <https://en.wikipedia.org/wiki/OSI_model>`_'inde, Eternet veri bağlantı katmanı olarak bilinen ikinci katmanda yer alır. Eterneti tartışırken, sıklıkla *yerel ağ*, *katman 2*, *L2*, *bağlantı katmanı* ve *veri bağlantı katmanı* gibi terimler duyacaksınız.

source: In the ``AGENT`` section of ``l3_agent.ini``, make sure the FWaaS extension is loaded:
id: Dalam bagian ``AGENT`` dari ``l3_agent.ini``, pastikan ekstensi FWaaS dimuat:
tr_tr: ``l3_agent.ini`` dosyasının ``AGENT`` bölümünde, FWaaS uzantısının yüklenmiş olduğundan emin olun:

source: In the ``bgp_dragent.ini`` file:
id: Dalam file ``bgp_dragent.ini``:
tr_tr: ``bgp_dragent.ini`` dosyasında:

source: In the ``dhcp_agent.ini`` file, configure one or more DNS resolvers. To configure more than one DNS resolver, use a comma between each value.
id: Dalam file ``dhcp_agent.ini``, lakukan konfigurasi satu atau lebih DNS resolvers. Untuk mengkonfigurasi lebih dari satu DNS resolver, gunakan koma di antara setiap nilai.
tr_tr: ``dhcp_agent.ini`` dosyasında, bir veya birden fazla DNS çözümleyici yapılandırın. Bir DNS çözümleyiciden fazlasını yapılandırmak için her değerin arasına bir virgül koyun.

source: In the ``dhcp_agent.ini`` file, configure the DHCP agent:
id: Dalam file ``dhcp_agent.ini``, lakukan konfigurasi agen DHCP:
tr_tr: ``dhcp_agent.ini`` dosyasında, DHCP ajanını yapılandırın:

source: In the ``dhcp_agent.ini`` file, enable advertisement of the DNS resolver(s) on the host.
id: Dalam file ``dhcp_agent.ini``, memungkinkan penyiaran update dan perubahan DNS resolver pada host.
tr_tr: ``dhcp_agent.ini`` dosyasında, ana bilgisayarda DNS çözümleyicisinin tanıtımını etkinleştirin.

source: In the ``l3_agent.ini`` file, configure the layer-3 agent to provide SNAT services.
id: Dalam file ``l3_agent.ini``, lakukan konfigurasi agen lapisan-3 untuk memberikan layanan SNAT
tr_tr: ``l3_agent.ini`` dosyasında, SNAT servislerini sağlamak için katman-3 ajanını yapılandırın.

source: In the ``l3_agent.ini`` file, configure the layer-3 agent.
id: Dalam file ``l3_agent.ini``, lakukan konfigurasi layer-3 agent.
tr_tr: ``l3_agent.ini`` dosyasında, katman-3 ajanını yapılandır.

source: In the ``linuxbridge_agent.ini`` file, configure the Linux bridge agent:
id: Dalam file ``linuxbridge_agent.ini``, lakukan konfigurasi Linux bridge agent:
tr_tr: ``linuxbridge_agent.ini`` dosyasında, Linux köprü ajanını yapılandırın:

source: In the ``linuxbridge_agent.ini`` file, configure the layer-2 agent.
id: Dalam file ``linuxbridge_agent.ini``, lakukan konfigurasi layer-2 agent.
tr_tr: ``linuxbridge_agent.ini`` dosyasında, katman-2 ajanını yapılandır.

source: In the ``linuxbridge_agent.ini`` file, enable VXLAN support including layer-2 population.
id: Dalam file ``linuxbridge_agent.ini`` , aktifkan dukungan VXLAN termasuk populasi lapisan-2.
tr_tr: ``linuxbridge_agent.ini`` dosyasında, katman-2 nüfusu da dahil olmak üzere VXLAN desteğini etkinleştirin.

source: In the ``macvtap_agent.ini`` file, configure the layer-2 agent.
id: Dalam file ``macvtap_agent.ini``, lakukan konfigurasi agen layer-2.
tr_tr: ``macvtap_agent.ini`` dosyasında, layer-2 ajanını yapılandır.

source: In the ``metadata_agent.ini`` file, configure the metadata agent:
id: Dalam file ``metadata_agent.ini``, lakukan konfigurasi agen metadata:
tr_tr: ``metadata_agent.ini`` dosyasında, metadata ajanını yapılandır:

source: In the ``ml2_conf.ini`` file:
id: Dalam file ``ml2_conf.ini``:
tr_tr: ``ml2_conf.ini`` dosyasında:

source: In the ``neutron.conf`` file, configure common options:
id: Dalam file ``neutron.conf``, lakukan konfigurasi opsi umum:
tr_tr: ``neutron.conf`` dosyasında, genel seçenekleri yapılandırın:
