Repository: 25hours/openstack-manuals
Catalog: doc/networking-guide/source/locale/*/LC_MESSAGES/networking-guide.po
Languages: id, tr_tr

source: (Optional) FDB L2 agent extension
tr_tr: (Seçimli) FDB L2 ajan uzantısı

source: **HostA and HostB: DHCP agent**
tr_tr: **HostA ve HostB: DHCP ajanı**

source: **HostA and HostB: L2 agent**
tr_tr: **HostA ve HostB: L2 ajanı**

source: *Invalid combination.*
tr_tr: *Geçersiz kombinasyon.*

source: *Network Address Translation* (NAT) is a process for modifying the source or destination addresses in the headers of an IP packet while the packet is in transit. In general, the sender and receiver applications are not aware that the IP packets are being manipulated.
id: *Network Address Translation* (NAT) adalah proses untuk memodifikasi sumber atau alamat tujuan dalam header paket IP saat paket sedang dalam transit. Secara umum, pengirim dan penerima aplikasi tidak menyadari bahwa paket IP sedang dimanipulasi.
tr_tr: *Ağ Adresi Çevirisi* (NAT), paket transit durumdayken bir IP paketinin başlıklarındaki kaynak veya hedef adresleri değiştirmek için kullanılan bir işlemdir. Genel olarak, gönderen ve alıcı uygulamaları, IP paketlerinin manipüle edildiğinin farkında değildir.

source: *To: everybody (ff:ff:ff:ff:ff:ff). I am looking for the computer who has IP address 192.168.1.7. Signed: MAC address fc:99:47:49:d4:a0*.
id: * Kepada: semuanya (ff:ff:ff:ff:ff:ff). Saya sedang mencari komputer yang memiliki alamat IP 192.168.1.7. Tertanda: Alamat MAC fc:99:47:49:d4:a0*.
tr_tr: *Herkese: (ff:ff:ff:ff:ff:ff). IP adresi 192.168.1.7 olan bilgisayarı arıyorum. İmza: MAC adresi fc:99:47:49:d4:a0*.

source: *To: fc:99:47:49:d4:a0. I have IP address 192.168.1.7. Signed: MAC address 54:78:1a:86:00:a5.*
id: *Kepada: fc:99:47:49:d4:a0. Saya memiliki alamat IP 192.168.1.7. Tertanda: Alamat MAC 54:78:1a:86:00:a5.*
tr_tr: *Kime: fc:99:47:49:d4:a0. 192.168.1.7 IP adresine sahibim. İmza: MAC adresi 54:78:1a:86:00:a5.*

source: 192.0.2.0/24 for instance floating IP addresses
id: 192.0.2.0/24 untuk alamat IP mengambang instance.
tr_tr: Sunucu yüzen IP adresleri için 192.0.2.0/24

source: 198.51.100.0/24 for floating IP agent gateway IPs configured on compute nodes
id: 198.51.100.0/24 untuk IP mengambang dimana IP gerbang agen dikonfigurasi pada node komputasi
tr_tr: Hesaplama düğümlerinde yapılandırılmış yüzen IP ajan ağ geçidi IP'leri için 198.51.100.0/24

source: 203.0.113.0/25 for all other IP allocations on the external network
id: 203.0.113.0/25 untuk semua alokasi IP lainnya pada jaringan eksternal
tr_tr: Harici ağdaki diğer tüm IP tahsisi için 203.0.113.0/25

source: :ref:`deploy-ovs-ha-dvr` supports augmentation using Virtual Router Redundancy Protocol (VRRP). Using this configuration, virtual routers support both the ``--distributed`` and ``--ha`` options.
id: :ref:`deploy-ovs-ha-dvr` mendukung pembesaran menggunakan Virtual Router Redundancy Protocol (VRRP). Menggunakan konfigurasi ini, router virtual mendukung kedua opsi ``--distributed`` dan ``--ha``.
tr_tr: :ref:`deploy-ovs-ha-dvr` Sanal Yönlendirici Yedekleme Protokolü (VRRP) kullanarak eklemeyi destekler. Bu yapılandırmayı kullanarak, sanal yönlendiriciler ``--distributed`` ve ``--ha``nin her ikisini de destekler.

source: :ref:`search`
tr_tr: :ref:`ara`

source: :term:`Service function chain (SFC)` essentially refers to the :term:`software-defined networking (SDN)` version of :term:`policy-based routing (PBR)`. In many cases, SFC involves security, although it can include a variety of other features.
id: :term:`Service function chain (SFC)` pada dasarnya mengacu pada versi:term:`software-defined networking (SDN)` dari :term:`policy-based routing (PBR)`. Dalam banyak kasus, SFC melibatkan keamanan, meskipun dapat mencakup berbagai fitur lainnya.
tr_tr: :term:`Servis işlev zinciri (SFC)` temel olarak :term:`politika tabanlı yönlendirme (PBR)`nin :term:`yazılım-tanımlı ağ (SDN)` sürümü olarak adlandırılır. Bir çok durumda, SFC güvenliği içerir, ancak diğer çeşitli özellikleri de içerebilir.

source: A BGP speaker requires association with a provider network to determine eligible prefixes. The association builds a list of all virtual routers with gateways on provider and self-service networks in the same address scope so the BGP speaker can advertise self-service network prefixes with the corresponding router as the next-hop IP address. Associate the BGP speaker with the provider network.
id: Speaker BGP memerlukan hubungan dengan jaringan provider untuk menentukan prefixe yang memenuhi syarat. Asosiasi membangun daftar semua router virtual dengan gateway pada jaringan provider dan self-service di lingkup alamat yang sama sehingga speaker BGP dapat menyiarkan update dan perubahan awalan jaringan self-service dengan sesuai router sebagai alamat IP next-hop. Mengasosiasikan speaker BGP dengan jaringan provider.
tr_tr: Bir BGP yayıncı uygun önekleri belirlemek için bir sağlayıcı ağı ile bağlantıya girmeyi gerektirir. Bu ilişki, aynı adres alanındaki sağlayıcı ve self-servis ağlarındaki ağ geçitleriyle tüm sanal yönlendiricilerin bir listesini oluşturur; böylece BGP yayınlayıcı, sonraki hop IP adresi olarak karşılık gelen yönlendirici ile self-servis ağ önekleri ilan edebilir. BGP hoparlörünü sağlayıcı ağı ile ilişkilendirin.

source: A TCP server is said to *listen* on a port. For example, an SSH server typically listens on port 22. For a client to connect to a server using TCP, the client must know both the IP address of a server's host and the server's TCP port.
id: Sebuah server TCP dikatakan *listen* pada port. Sebagai contoh, server SSH biasanya mendengarkan pada port 22. Untuk klien supaya terhubung ke server yang menggunakan TCP, klien harus tahu kedua alamat IP dari host server dan port TCP server.
tr_tr: Bir TCP sunucusunun bir bağlantı noktasında *dinlediği* söylenir. Örneğin, bir SSH sunucusu genellikle 22 numaralı bağlantı noktasını dinler. İstemci, TCP kullanarak bir sunucuya bağlanmak için, bir sunucunun ana bilgisayarının IP adresini ve sunucunun TCP bağlantı noktasını bilmelidir.

source: A basic example of SFC involves routing packets from one location to another through a firewall that lacks a "next hop" IP address from a conventional routing perspective. A more complex example involves an ordered series of service functions, each implemented using multiple instances (VMs). Packets must flow through one instance and a hashing algorithm distributes flows across multiple instances at each hop.
id: Sebuah contoh dasar dari SFC melibatkan routing paket dari satu lokasi ke lokasi lain melalui firewall yang tidak memiliki alamat IP "next hop" dari perspektif routing yang konvensional. Sebuah contoh yang lebih kompleks melibatkan serangkaian memerintahkan fungsi layanan, masing-masing dilaksanakan dengan menggunakan beberapa instance (VMs). Paket harus mengalir melalui satu instance dan algoritma hashing mendistribusikan arus di beberapa instance pada setiap hop.
tr_tr: SFC'nin temel bir örneği, klasik bir yönlendirme perspektifinden "bir sonraki durak" IP adresinden yoksun bir güvenlik duvarı vasıtasıyla paketleri bir konumdan diğerine yönlendirmeyi içerir. Daha karmaşık bir örnek, her biri birden çok örneği (VM'ler) kullanarak uygulanan sıralı bir dizi hizmet işlevini içerir. Paketler bir örnek vasıtasıyla akmalıdır ve bir karma algoritması, akışları her duraktaki birden fazla sunucuya dağıtır.

source: A block of IP addresses and associated configuration state. This is also known as the native IPAM (IP Address Management) provided by the networking service for both project and provider networks. Subnets are used to allocate IP addresses when new ports are created on a network.
id: Sebuah blok alamat IP dan terkait keadaan konfigurasi. Hal ini juga dikenal sebagai native IPAM (IP Address Management) yang disediakan oleh layanan jaringan untuk proyek dan jaringan provider. Subnet digunakan untuk mengalokasikan alamat IP ketika port baru diciptakan pada jaringan.
tr_tr: Bir blok IP adresleri ve ilişkili konfigürasyon durumu. Buna hem proje hem de sağlayıcı ağları için ağ hizmeti tarafından sağlanan yerli IPAM (IP Adres Yönetimi) adı da verilir. Alt ağlar, bir ağda yeni portlar oluşturulduğunda IP adreslerini tahsis etmek için kullanılır.

source: A combination of the source attributes defines the source of the flow. A combination of the destination attributes defines the destination of the flow. The ``l7_parameters`` attribute is a place holder that may be used to support flow classification using layer 7 fields, such as a URL. If unspecified, the ``logical_source_port`` and ``logical_destination_port`` attributes default to ``none``, the ``ethertype`` attribute defaults to ``IPv4``, and all other attributes default to a wildcard value.
id: Kombinasi atribut sumber mendefinisikan sumber aliran. Kombinasi atribut tujuan mendefinisikan tujuan aliran. Atribut `` l7_parameters`` adalah tempat dudukan yang dapat digunakan untuk mendukung klasifikasi aliran menggunakan layer 7 field, seperti URL. Jika tidak ditentukan, atribut ``logical_source_port`` dan ``logical_destination_port`` defaultnya ke ``none``, atribut ``ethertype`` defaultnya ke ``IPv4``, dan semua atribut lainnya defaultnya nilai wildcard.
tr_tr: Kaynak argümanlarının birleşimi, akışın kaynağını tanımlar. Hedef argümanlarının birleşimi, akışın varış yerini tanımlar. ``l7_parameters`` özniteliği, bir URL gibi katman 7 alanları kullanarak akış sınıflandırmasını desteklemek için kullanılabilen bir yer tutucudur. Belirtilmemişse, ``logical_source_port`` ve ``logical_destination_port`` öznitelikleri ``none``, ``ethertype`` öznitelikleri varsayılan olarak ``IPv4`` ve diğer tüm öznitelikler bir joker karakter değeri varsayılanıdır.

source: A database management command-line tool uses the Alembic library to manage the migration.
id: Sebuah alat command-line pengelolaan database menggunakan perpustakaan Alembic untuk mengelola migrasi.
tr_tr: Bir veritabanı yönetimi komut satırı aracı, taşıma işlemini yönetmek için Alembic kitaplığını kullanır.

source: A flow classifier can only belong to one port chain to prevent ambiguity as to which chain should handle packets in the flow. A check prevents such ambiguity. However, you can associate multiple flow classifiers with a port chain because multiple flows can request the same service function path.
id: Sebuah classifier aliran hanya bisa memilik salah satu rantai port untuk mencegah ambiguitas dimana rantai harus menangani paket dalam aliran. Sebuah cek mencegah ambiguitas tersebut. Namun, Anda dapat mengaitkan beberapa pengklasifikasi aliran dengan rantai port karena beberapa arus dapat meminta jalur fungsi pelayanan yang sama.
tr_tr: Bir akış sınıflandırıcısı, hangi zincirin akıştaki paketleri işleyeceği konusunda belirsizliği önlemek için yalnızca bir bağlantı noktasına ait olabilir. Bir kontrol bu belirsizliği engelliyor. Bununla birlikte, çoklu akış sınıflandırıcılarını bir bağlantı noktası zinciriyle ilişkilendirebilirsiniz, çünkü çoklu akışlar aynı hizmet işlev yolunu isteyebilir.

source: A flow classifier identifies a flow. A port chain can contain multiple flow classifiers. Omitting the flow classifier effectively prevents steering of traffic through the port chain.
id: Sebuah klassifier aliran mengidentifikasi aliran. Sebuah rantai port dapat berisi beberapa pengklasifikasi aliran. Menghilangkan klassifier aliran efektif mencegah pengendalian lalu lintas melalui rantai port.
tr_tr: Akış sınıflandırıcısı bir akışı tanımlar. Bir bağlantı zinciri, çoklu akış sınıflandırıcıları içerebilir. Akış sınıflandırıcısının atlanması etkili bir şekilde bağlantı noktası zinciri boyunca trafik yönlendirilmesini engeller.

source: A host on the Internet sends a packet to the instance.
id: Sebuah host di Internet mengirimkan sebuah paket ke instance.
tr_tr: Internet üzerindeki bir ana makine sunucuya bir paket gönderir.

source: A host sending a packet to an IP address consults its *routing table* to determine which machine on the local network(s) the packet should be sent to. The routing table maintains a list of the subnets associated with each local network that the host is directly connected to, as well as a list of routers that are on these local networks.
id: Sebuah host mengirimkan paket ke alamat IP berkonsultasi dengan *routing table* nya untuk menentukan dimana mesin pada jaringan lokal dimana paket harus dikirim. Tabel routing menyimpan daftar subnet yang terkait dengan setiap jaringan lokal dimana host terhubung langsung, serta daftar router yang ada di jaringan lokal.
tr_tr: Bir IP adresi için bir paket gönderen bir ana bilgisayar, kendi yerel ağlarındaki (paketlerindeki) hangi makinenin gönderileceğini belirlemek için *yönlendirme tablosundan* yararlanır. Yönlendirme tablosu, ana makinenin doğrudan bağlı olduğu her yerel ağa ait alt ağların bir listesini ve bu yerel ağlarda bulunan yönlendiricilerin bir listesini tutar.

source: A namespace is a way of scoping a particular set of identifiers. Using a namespace, you can use the same identifier multiple times in different namespaces. You can also restrict an identifier set visible to particular processes.
id: Sebuah namespace adalah cara pelingkupan (scoping) sekumpulan pengenal (identifier) tertentu. Dengan menggunakan namespace, Anda dapat menggunakan identifier yang sama beberapa kali dalam namespace yang berbeda. Anda juga dapat membatasi sekumpulan identifier terlihat pada proses tertentu.
tr_tr: Bir ad alanı belirli bir tanımlayıcı kümesini kapsayan bir yöntemdir. Bir isim alanını kullanarak, aynı tanımlayıcıyı farklı ad alanlarında birden çok kez kullanabilirsiniz. Belirli işlemler için görünür bir tanımlayıcı kümesini de kısıtlayabilirsiniz.

source: A policy with a minimum bandwidth ensures best efforts are made to provide no less than the specified bandwidth to each port on which the rule is applied. However, as this feature is not yet integrated with the Compute scheduler, minimum bandwidth cannot be guaranteed.
tr_tr: Minimum bant genişliği ile bir politika, kuralın uygulandığı her bir bağlantı noktasında belirtilen bant genişliğinden az olmamak için en iyi çabayı gösterilmesini sağlar. Ancak, bu özellik Hesaplama zamanlayıcısı ile henüz bütünleşmediğinden minimum bant genişliği garanti edilemez.

source: A pool holds a list of members that serve content through the load balancer.
id: Sebuah kolam memegang daftar anggota yang melayani konten melalui penyeimbang beban.
tr_tr: Bir havuz, yük dengeleyicisi aracılığıyla içerik sunan üye listelerini tutar.

source: A port chain consists of a sequence of port pair groups. Each port pair group is a hop in the port chain. A group of port pairs represents service functions providing equivalent functionality. For example, a group of firewall service functions.
id: Sebuah rantai port terdiri dari urutan kelompok pasangan port. Setiap kelompok pasangan port adalah hop dalam rantai port. Sekelompok pasang port merupakan fungsi layanan yang menyediakan fungsi setara. Misalnya, sekelompok fungsi layanan firewall.
tr_tr: Bir bağlantı zinciri, bir dizi bağlantı noktası çifti grubundan oluşur. Her bir bağlantı noktası çifti grubu, bağlantı noktası zincirinde bir atlamadır. Bir grup bağlantı noktası çifti, eş değer işlevsellik sağlayan servis işlevlerini temsil eder. Örneğin, bir grup güvenlik duvarı servis fonksiyonları.

source: A port chain is a unidirectional service chain. The first port acts as the head of the service function chain and the second port acts as the tail of the service function chain. A bidirectional service function chain consists of two unidirectional port chains.
id: Sebuah rantai port merupakan rantai layanan searah. Port pertama bertindak sebagai kepala rantai fungsi pelayanan dan port tindakan kedua sebagai ekor rantai fungsi pelayanan. Sebuah rantai fungsi pelayanan dua arah terdiri dari dua rantai port searah.
tr_tr: Bir bağlantı noktası zinciri tek yönlü bir hizmet zinciridir. İlk bağlantı noktası servis fonksiyon zincirinin başı ve ikinci bağlantı noktası servis fonksiyon zincirinin kuyruğu gibi davranır. İki yönlü hizmet işlev zinciri, iki tek yönlü bağlantı zincirinden oluşur.

source: A port chain, or service function path, consists of the following:
id: Sebuah rantai port, atau jalur fungsi pelayanan, terdiri dari:
tr_tr: Bir bağlantı noktası zinciri veya servis fonksiyon yolu aşağıdakini içerir:

source: A port is a connection point for attaching a single device, such as the NIC of a virtual server, to a virtual network. The port also describes the associated network configuration, such as the MAC and IP addresses to be used on that port.
id: Sebuah port adalah titik koneksi untuk menghubungkan satu perangkat, seperti NIC dari server virtual, untuk jaringan virtual. Port juga menjelaskan konfigurasi jaringan yang terkait, seperti MAC dan alamat IP yang akan digunakan pada port tersebut.
tr_tr: Bağlantı noktası, sanal bir sunucunun NIC'si gibi tek bir aygıtı sanal bir ağa bağlamak için kullanılan bir bağlantı noktasıdır. Bağlantı noktası ayrıca, ilgili ağ yapılandırmasını, bu bağlantı noktasında kullanılacak MAC ve IP adresleri gibi tanımlar.

source: A port pair group may contain one or more port pairs. Multiple port pairs enable load balancing/distribution over a set of functionally equivalent service functions.
id: Sekelompok pasangan port mungkin berisi satu atau lebih pasangan port. Beberapa pasangan port mengaktifkan load balancing/distribution lebih dari satu set fungsi layanan setara (equivalent) secara fungsional.
tr_tr: Bir bağlantı noktası çifti grubu bir veya daha fazla bağlantı noktası çifti içerebilir. Çoklu port çiftleri, işlevsel olarak eşdeğer bir servis fonksiyonları seti üzerinden yük dengeleme/dağıtma imkanı sağlar.

source: A port pair represents a service function instance that includes an ingress and egress port. A service function containing a bidirectional port uses the same ingress and egress port.
id: Sepasang port merupakan fungsi pelayanan instance yang mencakup ingress and egress port. Sebuah fungsi pelayanan yang berisi port dua arah menggunakan ingress and egress port yang sama.
tr_tr: Bir bağlantı noktası çifti, bir giriş ve çıkış bağlantı noktası içeren bir servis fonksiyonu örneğini temsil eder. Çift yönlü bir bağlantı noktası içeren bir servis fonksiyonu, aynı giriş ve çıkış bağlantı noktasını kullanır.

source: A provider network using IP address range 203.0.113.0/24, and supporting floating IP addresses 203.0.113.101, 203.0.113.102, and 203.0.113.103.
id: Sebuah jaringan operator menggunakan kisaran alamat IP 203.0.113.0/24, dan mendukung alamat IP mengambang 203.0.113.101, 203.0.113.102, dan 203.0.113.103.
tr_tr: 203.0.113.0/24 IP adres aralığını kullanan ve kayan 203.0.113.101, 203.0.113.102, ve 203.0.113.103 IP adreslerini destekleyen bir sağlayıcı ağ.

source: A routed provider network cannot also function as a ``router:external`` networks which prevents compatibility with floating IPv4 addresses. Additional routing, possibly using :ref:`config-bgp-dynamic-routing`, could address this issue in the future.
id: Sebuah jaringan operator dialihkann (routed) tidak bisa juga berfungsi sebagai jaringan ``router: external`` yang mencegah kompatibilitas dengan alamat IPv4 mengambang. Routing tambahan, mungkin menggunakan :ref:`config-bgp-dynamic-routing`, bisa mengatasi masalah ini di masa depan.
tr_tr: Yönlendirilmiş bir sağlayıcı ağı, kayan IPv4 adresleri ile uyumluluğu engelleyen bir ``router:external`` ağ olarak da işlev göremez. İlave yönlendirme, muhtemelen :ref:`config-bgp-dynamic-routing` kullanarak gelecekte bu sorunu çözebilir.

source: A routed provider network enables a single provider network to represent multiple layer-2 networks (broadcast domains) or segments and enables the operator to present one network to users. However, the particular IP addresses available to an instance depend on the segment of the network available on the particular compute node.
id: Sebuah jaringan operator yang diarahkan mengaktifkan jaringan penyedia tunggal untuk mewakili beberapa jaringan lapisan-2 (broadcast domains) atau segmen dan mengaktifkan operator untuk menyajikan satu jaringan ke pengguna. Namun, alamat IP tertentu tersedia untuk sebuah instance bergantung pada segmen jaringan yang tersedia pada node komputasi tertentu.
tr_tr: Yönlendirilmiş bir sağlayıcı ağı, tek bir sağlayıcı ağı ile birden fazla katman 2 ağını (yayın alanları) veya kesimleri temsil etmeyi ve operatöre kullanıcılara bir ağ sunmasını sağlar. Bununla birlikte, bir sunucuya ait belirli IP adresleri, belirli hesaplama düğümünde bulunan ağın bölümüne bağlıdır.

source: A self-service network using IP address range 10.0.1.0/24.
tr_tr: IP adres aralığı 10.0.1.0/24 olan bir self-servis ağı.

source: A set of flow classifiers that specify the classified traffic flows entering the chain.
id: Satu set pengklasifikasi aliran yang menspesifikasikan arus lalu lintas yang terklasifikasikan memasuki rantai.
tr_tr: Zincire giren sınıflandırılmış trafik akışlarını belirten bir akış sınıflandırıcıları kümesi.

source: A set of ports that define the sequence of service functions.
id: Satu set port yang menentukan urutan fungsi layanan.
tr_tr: Hizmet işlevlerinin sırasını tanımlayan bir dizi bağlantı noktası.

source: A setting of ``-1`` disables the quota for a tenant.
id: Pengaturan ``-1`` menonaktifkan kuota untuk penyewa (tenant).
tr_tr: ``-1`` ayarı, kiracı için kotayı devre dışı bırakır.

source: A single network can be assigned to more than one DHCP agents and one DHCP agent can host more than one network. You can add a network to a DHCP agent and remove one from it.
id: Sebuah jaringan tunggal dapat ditugaskan untuk lebih dari satu agen DHCP dan satu agen DHCP dapat host lebih dari satu jaringan. Anda dapat menambahkan jaringan ke agen DHCP dan menghapus satu dari itu.
tr_tr: Tek bir ağ birden fazla DHCP aracısına atanabilir ve bir DHCP aracı birden fazla ağa ev sahipliği yapabilir. DHCP aracısına bir ağ ekleyebilir ve bunlardan birisini kaldırabilirsiniz.

source: A subnet pool manages a pool of addresses from which subnets can be allocated. It ensures that there is no overlap between any two subnets allocated from the same pool.
id: Sebuah kolam subnet mengelola kolam alamat dimana subnet dapat dialokasikan. Ini memastikan bahwa tidak ada tumpang tindih antara dua subnet yang dialokasikan dari kolam yang sama.
tr_tr: Bir alt ağ havuzu, alt ağların tahsis edilebileceği bir adres havuzu yönetir. Aynı havuzdan tahsis edilen herhangi bir iki alt ağ arasında çakışma olmamasını sağlar.

source: A switchport that is configured to pass frames from all VLANs and tag them with the VLAN IDs is called a *trunk port*. IEEE 802.1Q is the network standard that describes how VLAN tags are encoded in Ethernet frames when trunking is being used.
id: Sebuah switchport yang dikonfigurasi untuk melewatkan frame dari semua VLAN dan menandai (tag) mereka dengan ID VLAN disebut *port trunk *. IEEE 802.1Q adalah standar jaringan yang menggambarkan bagaimana VLAN tag dikodekan dalam frame Ethernet ketika trunking (pengindukan) sedang dijalankan.
tr_tr: Tüm VLAN'lardan çerçeveler iletmek ve onları VLAN kimlikleri ile etiketlemek için yapılandırılmış bir switchport *trunk port* olarak adlandırılır. IEEE 802.1Q, bilgi aktarma yolu kullanılırken VLAN çerçevelerinin Ethernet çerçevelerinde nasıl kodlandığını açıklayan ağ standardıdır.
