Repository: 25hours/openstack-manuals
Catalog: doc/networking-guide/source/locale/*/LC_MESSAGES/networking-guide.po
Languages: id, tr_tr

source: On each network node, show the IP address of interfaces in the ``qrouter`` namespace. With the exception of the VRRP interface, only one namespace belonging to the master router instance contains IP addresses on the interfaces.
id: Pada setiap node jaringan, tampilkan alamat IP dari antarmuka dalam namespace ``qrouter``. Dengan pengecualian dari interface VRRP, hanya satu namespace yang menjadi milik instance router utama berisi alamat IP pada antarmuka.
tr_tr: Her ağ düğümünde, arayüzlerin IP adresini ``qrouter`` ad alanına gösterin. VRRP arabirimi hariç, ana yönlendirici sunucusuna ait yalnızca bir ad alanı arabirimlerdeki IP adreslerini içerir.

source: On each network node, verify creation of a ``qrouter`` namespace with the same ID.
id: Pada setiap node jaringan, lakukan verifikasi penciptaan namespace ``qrouter`` dengan ID yang sama.
tr_tr: Her ağ düğümünde, aynı ID ile ``qrouter`` ad alanının oluşumunu doğrulayın.

source: On every controller node running the ``nova-scheduler`` service, add ``PciPassthroughFilter`` to ``scheduler_default_filters`` to enable ``PciPassthroughFilter`` by default. Also ensure ``scheduler_available_filters`` parameter under the ``[DEFAULT]`` section in ``nova.conf`` is set to ``all_filters`` to enable all filters provided by the Compute service.
id: Pada setiap controller node yang menjalankan layanan ``nova-scheduler``, tambahkan ``PciPassthroughFilter`` ke ``scheduler_default_filters`` untuk mengaktifkan ``PciPassthroughFilter`` secara default. Juga memastikan parameter ``scheduler_available_filters`` bawah bagian ``[DEFAULT] `` dalam ``nova.conf`` diatur ke ``all_filters`` untuk mengaktifkan semua filter yang disediakan oleh layanan Compute.
tr_tr: Varsayılan olarak ``PciPassthroughFilter`` işlevini etkinleştirmek için ``nova-scheduler`` hizmetini çalıştıran her denetleyici düğümünde, ``scheduler_default_filters``e ``PciPassthroughFilter`` ekleyin. Ayrıca, Hesaplama servisi tarafından sağlanan tüm filtreleri etkinleştirmek için, ``nova.conf`` içindeki `` [DEFAULT] `` bölümünün ``scheduler_available_filters`` parametresinin ``all_filters`` olarak ayarlanmasını sağlayın.

source: On network nodes:
id: Pada node jaringan:
tr_tr: Ağ düğümleri üzerinde:

source: On nodes running the Open vSwitch agent, edit the ``openvswitch_agent.ini`` file and enable the firewall driver.
id: Pada node yang menjalankan agen Open vSwitch, edit file ``openvswitch_agent.ini`` dan aktifkan driver firewall.
tr_tr: Open vSwitch ajanını çalıştıran düğümlerde, ``openvswitch_agent.ini`` dosyasını düzenleyin ve güvenlik duvarı sürücüsünü etkinleştirin.

source: On some PCI devices, observe that when changing the amount of VFs you receive the error ``Device or resource busy``. In this case, you must first set ``sriov_numvfs`` to ``0``, then set it to your new value.
id: Pada beberapa perangkat PCI, amati bahwa ketika mengubah jumlah VF dimana Anda menerima kesalahan ``Device or resource busy``. Dalam hal ini, Anda harus terlebih dahulu menetapkan ``sriov_numvfs`` ke ``0``, kemudian set ke nilai baru Anda.
tr_tr: Bazı PCI aygıtlarında, VF miktarını değiştirirken ``Cihaz veya kaynak meşgul`` hatası alırsınız. Bu durumda, öncelikle ``sriov_numvfs`` ``0`` olarak ayarlamanız ve daha sonra yeni değerinize ayarlamanız gerekir.

source: On the compute node containing the instance, verify creation of the ``fip`` namespace with the same ID as the provider network.
id: Pada node komputasi yang berisi instance, lakukan verifikasi penciptaan namespace ``fip`` dengan ID yang sama dengan jaringan provider.
tr_tr: Sunucuyu içeren hesaplama düğümü üzerinde, ``fip`` ad alanının aynı ID ile sağlayıcı ağ olarak oluşturulduğunu doğrulayın.

source: On the controller node or any host with access to the provider network, ``ping`` the IPv4 and IPv6 addresses of the instance.
id: Pada controller node atau host dengan akses ke jaringan provider, lakukan ``ping`` IPv4 dan alamat IPv6 instance.
tr_tr: Denetleyici düğümde veya sağlayıcı ağa erişimi olan herhangi bir ana bilgisayarda, sunucunun IPv4 ve IPv6 adreslerine ``ping`` atın.

source: On the controller node or any host with access to the provider network, ``ping`` the IPv6 address of the instance.
id: Pada controller node atau host dengan akses ke jaringan provider, lakukan ``ping`` alamat IPv6 dari instance.
tr_tr: Denetleyici düğümünde veya sağlayıcı ağına erişimi olan herhangi bir ana bilgisayarda, sunucunun IPv6 adresine ``ping`` atın.

source: On the controller node or any host with access to the provider network, ``ping`` the floating IPv4 address of the instance.
id: Pada controller node atau host dengan akses ke jaringan provider, lakukan ``ping`` alamat IPv4 dari instance.
tr_tr: Denetleyici düğümünde veya sağlayıcının ağına erişimi olan herhangi bir ana bilgisayarda, sunucunun kayan IPv4 adresine ``ping`` atın.

source: On the network node with the master router, administratively disable the overlay network interface.
id: Pada node jaringan dengan router utama, secara administratif menonaktifkan antarmuka jaringan overlay.
tr_tr: Ana yönlendirici bulunan ağ düğümünde yönetimsel olarak yer paylaşımlı ağ arabirimini devre dışı bırakın.

source: On the network node, verify creation of the ``qrouter`` namespace.
id: Pada node jaringan, lakukan verifikasi penciptaan namespace ``qrouter``.
tr_tr: Ağ düğümünde, ``qrouter`` ad alanının oluşturulmasını doğrulayın.

source: On the network node, verify creation of the ``snat`` and ``qrouter`` namespaces with the same ID.
id: Pada node jaringan, lakukan verifikasi penciptaan ``snat`` dan namespace ``qrouter`` dengan ID yang sama.
tr_tr: Ağ düğümünde, aynı kimliğe sahip ``snat`` ve ``qrouter`` ad alanlarının oluşturulmasını doğrulayın.

source: On the original network node in step 2, administratively enable the overlay network interface. Note that the master router remains on the network node in step 3.
id: Pada node jaringan asli dalam langkah 2, secara administratif aktifkan antarmuka jaringan overlay. Perhatikan bahwa router utama tetap pada node jaringan dalam langkah 3.
tr_tr: Adım 2'deki özgün ağ düğümünde, yönetici olarak yer paylaşımlı ağ arabirimini etkinleştirin. Ana yönlendiricinin 3. adımda ağ düğümünde kalacağını unutmayın.

source: On the other network node, verify promotion of the backup router to master router by noting addition of IP addresses to the interfaces in the ``qrouter`` namespace.
id: Pada node jaringan lainnya, lakukan verifikasi promosi cadangan router untuk router utama dengan mencatat penambahan alamat IP ke interface dalam namespace ``qrouter``.
tr_tr: Diğer ağ düğümünde, ``qrouter`` ad alanındaki arayüzlere IP adreslerinin eklenmesine dikkat ederek, ana yönlendiriciye yedek yönlendiricinin yükseltilmesini doğrulayın.

source: Once OVS is correctly configured with DPDK support, ``vhost-user`` interfaces are completely transparent to the guest. However, guests must request large pages. This can be done through flavors. For example:
id: Setelah OVS benar dikonfigurasi dengan dukungan DPDK, interface ``vhost-user`` menjadi transparan benar kepada guest. Namun, guest harus meminta halaman besar (large page). Hal ini dapat dilakukan melalui flavor. Sebagai contoh:
tr_tr: OVS, DPDK desteğiyle doğru bir şekilde yapılandırıldıktan sonra, ``vhost-user`` arabirimleri misafirler için tamamen şeffaftır. Bununla birlikte, misafiler büyük sayfalar talep etmelidir. Bu flavorlar ile yapılabilir. Örneğin:

source: Once configuration is complete, you can launch instances with SR-IOV ports.
id: Setelah konfigurasi selesai, Anda dapat meluncurkan instance dengan port SR-IOV.
tr_tr: Yapılandırma tamamlandığında, SR-IOV bağlantı noktaları ile sunucuları başlatabilirsiniz.

source: Once starting the migration, south-north connections (instances to internet) will be severed. New connections will be able to start only when the migration is complete.
id: Setelah memulai migrasi, koneksi selatan-utara (instance ke internet) akan terputus. Koneksi baru akan dapat memulai hanya ketika migrasi selesai.
tr_tr: Göçe başladıktan sonra, güney-kuzey bağlantıları (sunucular internete) koparılır. Yeni bağlantılar, yalnızca taşıma işlemi tamamlandığında başlayabilecektir.

source: Once the ``neutron-server`` has been configured and restarted, users will have functionality that covers three use cases, described in the following sections. In each of the use cases described below:
id: Setelah ``neutron-server`` telah dikonfigurasi dan di-restart, pengguna akan memiliki fungsi yang mencakup tiga use case, dijelaskan di bagian berikut. Dalam setiap use case dijelaskan di bawah:
tr_tr: ``neutron-server`` yapılandırıldı ve yeniden çalıştırıldıktan sonra kullanıcılar, aşağıdaki bölümlerde açıklanan üç kullanım durumunu kapsayan işlevlere sahip olacaklar. Aşağıda açıklanan kullanım durumlarının her birinde:

source: Once these steps are executed, the port's DNS data will be published in the external DNS service. This is an example:
id: Setelah langkah-langkah ini dijalankan, data DNS milik port akan diterbitkan dalam layanan DNS eksternal. Ini adalah contohnya:
tr_tr: Bu adımlar yürütüldükten sonra, bağlantı noktasının DNS verileri harici DNS hizmetinde yayınlanacaktır. Bu bir örnektir:

source: Once you have stacked run the command below to start the neutron-pd-agent:
id: Setelah Anda menumpuknya, jalankan perintah di bawah ini untuk memulai neutron-pd-agent:
tr_tr: neutron-pd-agent ajanını başlatmak için aşağıdaki komutu ilk çalıştırma:

source: One BGP agent.
id: Satu agen BGP.
tr_tr: Bir BGP ajanı.

source: One address scope containing IP address range 203.0.113.0/24 for provider networks, and IP address ranges 10.0.1.0/24 and 10.0.2.0/24 for self-service networks.
tr_tr: Sağlayıcı ağları için IP adres aralığı 203.0.113.0/24 ve self servis ağlar için IP adresi aralıkları 10.0.1.0/24 ve 10.0.2.0/24 olan bir adres alanı.

source: One controller node with the following components:
id: Satu node controller dengan komponen-komponen berikut:
tr_tr: Aşağıdaki bileşenlere sahip bir denetleyici düğümü:

source: One provider network using IP address range 203.0.113.0/24.
id: Satu jaringan provider menggunakan kisaran alamat IP 203.0.113.0/24.
tr_tr: 203.0.113.0/24 IP adres aralığını kullanan bir sağlayıcı ağ.

source: One-to-one NAT
tr_tr: Birebir NAT

source: Only compute resources can be attached via macvtap. Attaching other resources like DHCP, Routers and others is not supported. Therefore run either OVS or linux bridge in VLAN or flat mode on the controller node.
id: Hanya sumber komputasi dapat dihubungkan melalui macvtap. Menghubungkan sumber lain seperti DHCP, Router dan lainnya tidak didukung. Oleh karena itu jalankan OVS ataupun jembatan linux di VLAN atau modus datar pada controller node.
tr_tr: Yalnızca hesaplama kaynakları macvtap ile eklenebilir. DHCP, Yönlendiriciler ve diğerleri gibi diğer kaynakları eklemek desteklenmiyor. Bu nedenle, denetleyici düğümünde VLAN veya düz modda OVS veya linux köprüsünü çalıştırın.

source: Only for :ref:`config-dns-use-case-1`, if the port binding extension is enabled in the Networking service, the Compute service will execute one additional port update operation when allocating the port for the instance during the boot process. This may have a noticeable adverse effect in the performance of the boot process that must be evaluated before adoption of this use case.
id: Hanya untuk :ref:`config-dns-use-case-1`, jika port yang mengikat ekstensi diaktifkan dalam layanan Networking, layanan Compute akan mengeksekusi operasi update satu tambahan port ketika pengalokasian port instance selama proses boot . Ini mungkin memiliki efek yang merugikan nyata dalam kinerja proses boot yang harus dievaluasi sebelum adopsi dari use case ini.
tr_tr: Yalnızca :ref:`config-dns-use-case-1` için, eğer Ağ bağlantısında eklenti uzantısı etkinse, Hesaplama servisi, önyükleme işlemi sırasında sunucuya bağlantı noktası atarken bir başka ek bağlantı noktası güncelleme işlemi yürütür. Bu, bu kullanım durumunun kabul edilmesinden önce değerlendirilmesi gereken önyükleme işleminin performansında belirgin bir olumsuz etki yaratabilir.

source: Only provides connectivity to an instance via the compute node on which the instance resides if the instance resides on a self-service network with a floating IPv4 address. Instances on self-service networks with only an IPv6 address or both IPv4 and IPv6 addresses rely on the network node for IPv6 connectivity.
id: Hanya menyediakan konektivitas ke sebuah instance melalui node komputasi dimana instance berada jika instance berada pada jaringan self-service dengan alamat IPv4 mengambang. Instance pada jaringan self-service dengan hanya alamat IPv6 atau kedua alamat IPv4 dan IPv6 tergantung pada node jaringan untuk konektivitas IPv6.
tr_tr: Örneğin, kayan bir IPv4 adresine sahip bir self-servis ağında bulunuyorsa, sunucunun bulunduğu hesaplama düğümü aracılığıyla bir sunucuya bir bağlantı sağlar. Yalnızca bir IPv6 adresi veya her ikisi de IPv4 ve IPv6 adresleri olan self servis ağlardaki sunucular, IPv6 bağlantısı için ağ düğümüne güvenir.

source: Only supports self-service networks using a router. Provider networks operate at layer-2 and rely on physical network infrastructure for redundancy.
id: Hanya mendukung jaringan self-service menggunakan router. Jaringan provider beroperasi pada lapisan-2 dan bergantung pada infrastruktur jaringan fisik untuk redundansi.
tr_tr: Yalnızca bir yönlendirici kullanarak self servis ağları destekler. Sağlayıcı ağları katman-2'de çalışır ve yedeklilik için fiziksel ağ altyapısına dayanır.

source: Open Virtual Network (OVN)
tr_tr: Açık Sanak Ağ (OVN)

source: Open source
tr_tr: Açık kaynak

source: Open vSwitch & Open vSwitch agent
id: Agen Open vSwitch & Open vSwitch
tr_tr: Open vSwitch & Open vSwitch ajanı

source: Open vSwitch (OVS) provides support for a Data Plane Development Kit (DPDK) datapath since OVS 2.2, and a DPDK-backed ``vhost-user`` virtual interface since OVS 2.4. The DPDK datapath provides lower latency and higher performance than the standard kernel OVS datapath, while DPDK-backed ``vhost-user`` interfaces can connect guests to this datapath. For more information on DPDK, refer to the `DPDK <http://dpdk.org/>`__ website.
id: Open vSwitch (OVS) menyediakan dukungan untuk Data Plane Development Kit (DPDK) datapath sejak OVS 2.2, dan antarmuka virtual ``vhost-user`` DPDK-backed sejak OVS 2.4. The DPDK datapath menyediakan latency rendah dan kinerja tinggi dari OVS datapath kernel standar, sementara interface ``vhost-user`` DPDK-backed dapat berhubungan guests untuk datapath ini. Untuk informasi lebih lanjut tentang DPDK, rujuk pada situs `DPDK <http://dpdk.org/>` __.
tr_tr: Open vSwitch (OVS), OVS 2.2'den bu yana bir Veri Düzlemi Geliştirme Seti (DPDK) veri yolu ve OVS 2.4'ten bu yana bir DPDK destekli ``vhost-user`` sanal arayüzü için destek sağlar. DPDK veri yolu standart çekirdek OVS veri yoluna göre daha düşük gecikme süresi ve daha yüksek performans sağlarken, DPDK destekli ``vhost-user`` arayüzü konukları bu veri alanına bağlayabilir. DPDK hakkında daha fazla bilgi için, `DPDK <http://dpdk.org/>`__ web sitesine bakın.

source: Open vSwitch agent
id: Agen Open vSwitch
tr_tr: Open vSwitch ajanı

source: Open vSwitch agent, Linux bridge agent
id: Agen Open vSwitch, Agen jembatan Linux
tr_tr: Open vSwitch ajanı, Linux köprü ajanı

source: Open vSwitch mechanism and Open vSwitch agent
id: Mekanisme Open vSwitch and agen Open vSwitch
tr_tr: Open vSwitch mekanizması ve Open vSwitch ajanı

source: Open vSwitch mechanism driver
id: Driver mekanisme Open vSwitch
tr_tr: Open vSwitch mekanizma sürücüsü

source: Open vSwitch with DPDK datapath
id: Open vSwitch dengan DPDK datapath
tr_tr: DPDK veri yolu ile Open vSwitch

source: Open vSwitch: High availability using DVR
id: Open vSwitch: High availability menggunakan DVR
tr_tr: Open vSwitch: DVR kullanarak yüksek kullanılabilirlik

source: Open vSwitch: High availability using VRRP
id: Open vSwitch: High availability menggunakan VRRP
tr_tr: Open vSwitch: VRRP kullanarak yüksek kullanılabilirlik

source: Open vSwitch: Provider networks
id: Open vSwitch: Jaringan provider
tr_tr: Open vSwitch: Sağlayıcı ağlar

source: Open vSwitch: Self-service networks
id: Open vSwitch: Jaringan self-service
tr_tr: Open vSwitch: Self-servis ağları

source: OpenStack :term:`Compute service (nova)` is used to plug each virtual NIC on the VM into a particular network.
id: OpenStack :term:`Compute service (nova)` digunakan untuk plug setiap NIC virtual pada VM dalam jaringan tertentu.
tr_tr: OpenStack :term:`Hesaplama servisi (nova)` VM üzerindeki her sanal NIC'yi belirli bir ağa bağlamak için kullanılır.

source: OpenStack :term:`Dashboard (horizon)` is used by administrators and project users to create and manage network services through a web-based graphical interface.
id: OpenStack :term:`Dashboard (horizon)` digunakan oleh administrator dan pengguna proyek untuk membuat dan mengelola layanan jaringan melalui antarmuka berbasis web grafis.
tr_tr: OpenStack :term:`Gösterge paneli (horizon)`, yöneticiler ve proje kullanıcıları tarafından, web tabanlı bir grafik arayüz aracılığıyla ağ servisleri oluşturmak ve yönetmek için kullanılır.

source: OpenStack :term:`Identity service (keystone)` is used for authentication and authorization of API requests.
id: OpenStack :term:`Identity service (keystone)` digunakan untuk otentikasi dan otorisasi permintaan API.
tr_tr: OpenStack :term:`Kimlik servisi (keystone)` API isteklerinin kimlik denetimi ve yetkilendirmesi için kullanılır

source: OpenStack Networking
id: OpenStack Networking (jaringan OpenStack)
tr_tr: OpenStack Ağ

source: OpenStack Networking (neutron) server service and ML2 plug-in.
id: Layanan server OpenStack Networking (neutron) dan ML2 plug-in.
tr_tr: OpenStack Ağ (neutron) sunucu hizmeti ve ML2 eklentisi.

source: OpenStack Networking Guide
id: Panduan OpenStack Networking
tr_tr: OpenStack Ağ Kılavuzu

source: OpenStack Networking Linux bridge layer-2 agent, DHCP agent, metadata agent, and any dependencies.
id: OpenStack Networking Linux bridge layer-2 agent, DHCP agent, metadata agent, dan dependensi.
tr_tr: OpenStack Ağ Linux köprü katmanı-2 aracı, DHCP aracı, meta veri ajanı ve herhangi bir bağımlılık.

source: OpenStack Networking Linux bridge layer-2 agent, layer-3 agent, and any
id: OpenStack Networking Linux bridge layer-2 agent, layer-3 agent, dan apapun
tr_tr: OpenStack Ağ Linux köprü katmanı-2 ajanı, katman-3 ajanı ve herhangi biri

source: OpenStack Networking Macvtap layer-2 agent and any dependencies.
id: Agen layer-2 Macvtap OpenStack Networking dan dependensi.
tr_tr: OpenStack Networking Macvtap layer-2 ajanı ve bağımlılıkları.

source: OpenStack Networking Open vSwitch (OVS) layer-2 agent, DHCP agent, metadata agent, and any dependencies including OVS.
id: OpenStack Networking Open vSwitch (OVS) layer-2 agent, DHCP agent, metadata agent, dan apapun dependensi termasuk OVS.
tr_tr: OpenStack Networking Open vSwitch (OVS) katmanı-2 aracı, DHCP aracı, meta veri aracı ve OVS de dahil olmak üzere tüm bağımlılıklar.

source: OpenStack Networking Open vSwitch (OVS) layer-2 agent, layer-3 agent, and any including OVS.
id: OpenStack Networking Open vSwitch (OVS) layer-2 agent, layer-3 agent, dan apapun termasuk OVS.
tr_tr: OpenStack Ağ Open vSwitch (OVS) katman-2 ajanı, katman-3 ajanı ve OVS de dahil olmak üzere herhangi biri.

source: OpenStack Networking allows you to create and manage network objects, such as networks, subnets, and ports, which other OpenStack services can use. Plug-ins can be implemented to accommodate different networking equipment and software, providing flexibility to OpenStack architecture and deployment.
id: OpenStack Networking mengizinkan Anda untuk membuat dan mengelola objek jaringan, seperti jaringan, subnet, dan port, dimana layanan OpenStack lainnya dapat menggunakan. Plug-in dapat diimplementasikan untuk mengakomodasi peralatan jaringan dan perangkat lunak yang berbeda, yang memberikan fleksibilitas untuk arsitektur dan pengerahan OpenStack.
tr_tr: OpenStack Ağ, diğer OpenStack hizmetlerinin kullanabileceği ağlar, alt ağlar ve bağlantı noktaları gibi ağ nesnelerini oluşturmanıza ve yönetmenize izin verir. Eklentiler, OpenStack mimarisi ve kurulumunda esneklik sağlayan farklı ağ donanımları ve yazılımları barındıracak şekilde uygulanabilir.

source: OpenStack Networking consists of the neutron-server, a database for persistent storage, and any number of plug-in agents, which provide other services such as interfacing with native Linux networking mechanisms, external devices, or SDN controllers.
id: OpenStack Networking terdiri dari neutron-server, database untuk penyimpanan persisten, dan sejumlah agen plug-in, yang menyediakan layanan lain seperti berinteraksi dengan mekanisme jaringan Linux native, perangkat eksternal, atau SDN controllers.
tr_tr: OpenStack Ağ, neutron-server, kalıcı depolama için bir veritabanı ve yerli Linux ağ mekanizmaları, harici aygıtlar veya SDN denetleyicileri ile arabirim yapma gibi diğer hizmetleri sağlayan herhangi bir sayıda eklenti aracısından oluşur.

source: OpenStack Networking integrates with various OpenStack components:
id: OpenStack Networking terintegrasi dengan berbagai komponen OpenStack:
tr_tr: OpenStack Ağ çeşitli OpenStack bileşenleri ile entegre edilir:

source: OpenStack Networking is entirely standalone and can be deployed to a dedicated host. If your deployment uses a controller host to run centralized Compute components, you can deploy the Networking server to that specific host instead.
id: OpenStack Networking dapat sepenuhnya mandiri dan dapat digunakan untuk host yang didedikasikan. Jika pengerahan Anda menggunakan host controller untuk menjalankan komponen Compute terpusat, Anda dapat mengerahkan server Networking bukan untuk host tertentu.
tr_tr: OpenStack Networking tamamen bağımsızdır ve özel bir bilgisayara yüklenebilir. Yüklemenizin merkezi Hesaplama bileşenlerini çalıştırmak için bir denetleyici ana bilgisayar kullanıyorsa, bunun yerine ağa bağlayan sunucuyu bu belirli ana bilgisayara yükleyebilirsiniz.

source: OpenStack Networking layer-2 (switching) agent, layer-3 agent, and any dependencies.
id: Agen OpenStack Networking layer-2 (switching), agen layer-3, dan dependensi.
tr_tr: OpenStack Ağ katmanı-2 (anahtarlama) aracı, katman-3 aracı ve herhangi bir bağımlılık.

source: OpenStack Networking layer-2 agent, DHCP agent, metadata agent, and any dependencies.
id: Agen OpenStack Networking layer-2, agen DHCP, agen metadata, dan dependensi
tr_tr: OpenStack Ağ katmanı-2 aracı, DHCP aracı, meta veri aracı ve herhangi bir bağımlılık.

source: OpenStack Networking layer-2 agent, layer-3 agent, and any dependencies.
id: OpenStack Networking layer-2 agent, layer-3 agent, dan dependensi.
tr_tr: OpenStack Ağ katmanı-2 aracı, katman-3 aracı ve herhangi bir bağımlılık.

source: OpenStack Networking plug-in and agents
id: Plug-in dan agen OpenStack Networking
tr_tr: OpenStack Ağ eklentisi ve ajanları

source: OpenStack Networking server service and ML2 plug-in.
id: Layanan server OpenStack Networking dan ML2 plug-in.
tr_tr: OpenStack Ağ sunucu hizmeti ve ML2 eklentisi.
