Repository: 25hours/openstack-manuals
Catalog: doc/networking-guide/source/locale/*/LC_MESSAGES/networking-guide.po
Languages: id, tr_tr

source: A trunk can be in a ``DEGRADED`` state when a temporary failure during the provisioning process is encountered. This includes situations where a subport add or remove operation fails. When in a degraded state, the trunk is still usable and some subports may be usable as well. Operations that cause the trunk to go into a ``DEGRADED`` state can be retried to fix temporary failures and move the trunk into an ``ACTIVE`` state.
id: Sebuah trunk dapat berada dalam keadaan ``DEGRADED`` ketika kegagalan sementara selama proses pengadaan terjadi. Degraded ini termasuk situasi dimana sebuah subport menambah atau menghapus kegagalan operasi. Ketika dalam keadaan rusak, trunk masih dapat digunakan dan beberapa subports mungkin masih dapat digunakan juga. Operasi yang menyebabkan trunk beralih ke keadaan ``DEGRADED`` dapat dicoba kembali untuk memperbaiki kegagalan sementara dan memindahkan trunk menjadi keadaan ``ACTIVE``.
tr_tr: Bir bilgi aktarım yolu, hazırlık işlemi sırasında geçici bir arıza ile karşılaşıldığında ``BOZULMUŞ`` duruma gelebilir. Bu, bir altport ekleme veya kaldırma işlemi başarısız olduğu durumları da içerir. Parçalara ayrılmış durumda bilgi aktarım yolu ve bazı subportlar da hala kullanılabilir. Bilgi aktarım yolunun ``BOZULMUŞ`` durumuna gelmesine neden olan işlemler, geçici arızaları düzeltmek ve bilgi aktarım yolunu bir ``AKTİF`` durumuna getirmek için tekrar denenebilir.

source: A trunk is ``DOWN`` when it is first created without an instance launched on it, or when the instance associated with the trunk has been deleted.
id: Sebuah trunk menjadi `` DOWN`` ketika trunk yang pertama kali dibuat tanpa sebuah instance yang diluncurkan di atasnya, atau ketika instance terkait dengan trunk telah dihapus.
tr_tr: Bir bilgi aktarım yolu, önce başlatılan bir sunucu olmadan oluşturulduğunda veya bilgi aktarım yolu ile ilişkili sunucu silindiğinde ``KAPALI``dır.

source: A trunk is in ``BUILD`` state while the resources associated with the trunk are in the process of being provisioned. Once the trunk and all of the subports have been provisioned successfully, the trunk transitions to ``ACTIVE``. If there was a partial failure, the trunk transitions to ``DEGRADED``.
id: Sebuah trunk berada dalam keadaan ``BUILD`` sedangkan sumber daya terkait dengan trunk berada dalam proses yang ditetapkan. Setelah trunk dan semua subports telah ditetapkan berhasil, transisi trunk akan berada ke ``ACTIVE``. Jika ada kegagalan parsial, transisi trank akan berada ke ``DEGRADED``.
tr_tr: Bilgi aktarım yolu ile ilişkili kaynaklar hazırlanma aşamasında iken bir bilgi aktarım yolu ``YAPIM`` durumundadır. Bilgi aktarım yolu ve bilgi aktarım yollarının tamamı başarıyla sağlandıktan sonra, bilgi aktarım yolu ``AKTİF``e geçer. Kısmi bir arıza olursa, bilgi aktarım yolu ``BOZULMUŞ`` durumuna geçer.

source: A trunk is in ``ERROR`` state if the request leads to a conflict or an error that cannot be fixed by retrying the request. The ``ERROR`` status can be encountered if the network is not compatible with the trunk configuration or the binding process leads to a persistent failure. When a trunk is in ``ERROR`` state, it must be brought to a sane state (``ACTIVE``), or else requests to add subports will be rejected.
id: Sebuah trunk dalam keadaan ``ERROR`` jika permintaan mengarah ke konflik atau kesalahan yang tidak dapat diperbaiki dengan permintaan ulang. Keadaan ``ERROR`` dapat ditemui jika jaringan tidak kompatibel dengan konfigurasi trunk atau proses pengikatan yang mengarah ke kegagalan terus-menerus. Ketika trunk dalam keadaan ``ERROR``, trunk itu harus dibawa ke keadaan sehat (``ACTIVE``), atau permintaan untuk penambahan subports akan ditolak.
tr_tr: İstek, çakışma veya talebi yeniden deneyerek düzeltilemeyen bir hataya neden oluyorsa, bilgi aktarım yolu ``HATA`` durumundadır. Eğer ağ, bilgi aktarım yolu yapılandırmasıyla uyumlu değilse veya bağlama işlemi kalıcı bir arızaya neden oluyorsa, ``HATA`` durumu ile karşılaşılabilir. Bir bilgi aktarım yolu ``HATA`` durumu içerisindeyken akıllıca bir duruma getirilmelidir (``AKTİF``), aksi takdirde altport ekleme talebi reddedilecektir.

source: A, AAAA and PTR records will be created in the DNS service.
id: Catatan A, AAAA and PTR akan dibuat di layanan DNS.
tr_tr: A, AAAA ve PTR kayıtları DNS hizmetinde oluşturulur.

source: API server
tr_tr: API sunucu

source: Ability to leverage tags by deployment tools.
id: Kemampuan untuk memanfaatkan tag oleh alat pengerahan.
tr_tr: Etiketleri kurulum araçları ile kaldırabilme.

source: Ability to map IDs from different management/orchestration systems to OpenStack networks in mixed environments. For example, in the Kuryr project, the Docker network ID is mapped to the Neutron network ID.
id: Kemampuan untuk memetakan ID dari sistem management/orchestration yang berbeda untuk jaringan OpenStack di lingkungan campuran. Misalnya, dalam proyek Kuryr, ID jaringan Docker dipetakan ke ID jaringan Neutron.
tr_tr: Karışık ortamlarda farklı yönetim/orkestrasyon sistemlerinden gelen kimlikleri OpenStack ağlarına eşleme olanağı. Örneğin, Kuryr projesinde Docker ağ kimliği Neutron ağ kimliğine eşlenir.

source: Ability to map different networks in different OpenStack locations to one logically same network (for multi-site OpenStack).
id: Kemampuan untuk memetakan jaringan yang berbeda di lokasi OpenStack yang berbeda ke satu jaringan logis yang sama (untuk OpenStack multi-situs).
tr_tr: Farklı OpenStack konumlarındaki farklı ağları mantıksal olarak aynı ağa (çoklu site OpenStack için) eşleme olanağı.

source: Ability to tag information about provider networks (for example, high-bandwidth, low-latency, and so on).
id: Kemampuan untuk menandai informasi tentang jaringan provider (misalnya, high-bandwidth, low-latency, dan sebagainya).
tr_tr: Sağlayıcı şebekeleri hakkındaki bilgileri etiketleme (örneğin yüksek bant genişliği, düşük gecikme süresi vb.).

source: Abstract
id: Abstrak
tr_tr: Özet

source: Accepts and routes RPC requests between agents to complete API operations. Message queue is used in the ML2 plug-in for RPC between the neutron server and neutron agents that run on each hypervisor, in the ML2 mechanism drivers for :term:`Open vSwitch` and :term:`Linux bridge`.
id: Menerima dan me-rute RPC request antara agen agen untuk menyelesaikan operasi API. Antrian pesan digunakan dalam ML2 plug-in untuk RPC antara server neutron dan agen neutron yang berjalan di setiap hypervisor, di driver mekanisme ML2 untuk :term:`Open vSwitch` and :term:`Linux bridge`.
tr_tr: API işlemlerini tamamlamak için ajanlar arasında RPC isteklerini kabul eder ve yönlendirir. Mesaj kuyruğu, :term:`Open vSwitch` ve :term:`Linux bridge` için ML2 mekanizma sürücülerinde her hypervisor üzerinde çalışan neutron sunucusu ve neutron ajanları arasında RPC için ML2 eklentisinde kullanılır.

source: Access
tr_tr: Erişim

source: Access to addresses in a scope are managed through subnet pools. Subnet pools can either be created in an address scope, or updated to belong to an address scope.
id: Akses ke alamat di lingkup dikelola melalui kolam subnet. Kolam subnet baik dapat dibuat dalam lingkup alamat, ataupun diperbarui milik lingkup alamat.
tr_tr: Bir alandaki adreslere erişim, alt ağ havuzları aracılığıyla yönetilir. Alt ağ havuzları bir adres alanında oluşturulabilir veya bir adres alanına ait olacak şekilde güncellenebilir.

source: Accessing address scopes
id: Mengakses lingkup alamat
tr_tr: Adres alanlarına erişim

source: Achieving high availability with availability zone
id: Pencapaian ketersediaan tinggi dengan zona ketersediaan
tr_tr: Kullanılabilirlik bölgesi ile yüksek kullanılabilirlik sağlama

source: Add LBaaS panels to Dashboard
id: Tambahkan panel LBaaS ke Dashboard
tr_tr: LBaaS panellerini Dashboard'a ekleyin

source: Add VRRP to an existing router
id: Tambahkan VRRP ke router yang ada
tr_tr: Mevcut bir yönlendiriciye VRRP ekle

source: Add ``dns`` to ``extension_drivers`` in the ``[ml2]`` section of ``/etc/neutron/plugins/ml2/ml2_conf.ini``. The following is an example:
id: Tambahkan ``dns`` ke ``extension_drivers`` dalam bagian ``[ml2]`` dari ``/etc/neutron/plugins/ml2/ml2_conf.ini``. Berikut ini adalah contoh:
tr_tr: ``/etc/neutron/plugins/ml2/ml2_conf.ini`` dosyasının ``[ml2]`` bölümünde ``extension_drivers``a ``dns``i ekleyin. Aşağıdaki bir örnektir:

source: Add ``macvtap`` to mechanism drivers.
id: Tambahkan ``macvtap`` untuk driver mekanisme.
tr_tr: ``macvtap``i mekanizma sürücülerine ekle.

source: Add ``sriovnicswitch`` as mechanism driver. Edit the ``ml2_conf.ini`` file on each controller:
id: Tambahkan ``sriovnicswitch`` sebagai driver mekanisme. Edit file ``ml2_conf.ini`` pada setiap controller:
tr_tr: ``sriovnicswitch``i mekanizma sürücüsü olarak ekleyin. Her denetleyicide ``ml2_conf.ini`` dosyasını düzenleyin:

source: Add ``vxlan`` to type drivers and project network types.
id: Tambahkan ``vxlan`` untuk tipe driver dan tipe jaringan proyek.
tr_tr: Sürücüleri ve proje ağ türlerini yazmak için ``vxlan`` ekleyin.

source: Add a BGP peer to the BGP speaker.
id: Tambahkan rekan BGP ke BGP speaker.
tr_tr: BGP yayıncısına BGP eşi ekle.

source: Add a ``placement`` section to the ``neutron.conf`` file with authentication credentials for the Compute service placement API:
id: Tambahkan bagian ``placement`` ke file ``neutron.conf`` dengan kredential otentikasi untuk placement API di layanan Compute:
tr_tr: Hesaplama servisi yerleşim API'si için kimlik doğrulama kimlik bilgileriyle birlikte ``neutron.conf`` dosyasına bir ``placement`` bölümü ekleyin:

source: Add a tag to a resource:
id: Tambahkan tag ke sumber daya:
tr_tr: Kaynağa bir etikey ekle:

source: Add an interface to the router on demo-subnet1:
id: Tambahkan antarmuka ke router pada demo-subnet1:
tr_tr: demo-subnet1 üzerinde yönlendiriciye bir arabirim ekle:

source: Add one network interface: overlay.
id: Tambahkan satu antarmuka jaringan: overlay.
tr_tr: Bir ağ arabirimi ekleyin: yer paylaşımı.

source: Add one network node with the following components:
id: Tambahkan satu node jaringan dengan komponen-komponen berikut:
tr_tr: Aşağıdaki bileşenleri içeren bir ağ düğümü ekleyin:

source: Add one or more compute nodes with the following components:
id: Tambahkan satu atau lebih node komputasi dengan komponen-komponen berikut:
tr_tr: Aşağıdaki bileşenlerle bir veya daha fazla hesaplama düğümü ekleyin:

source: Add subports to an existing trunk:
id: Tambahkan subports ke trunk yang sudah ada:
tr_tr: Mevcut bir bilgi aktarım yoluna altportlar ekle:

source: Add subports to the trunk
id: Tambahkan subport dan trunk
tr_tr: Bilgi aktarım yoluna alt bağlantı noktaları ekle

source: Add the FDB section and the ``shared_physical_device_mappings`` parameter. This parameter maps each physical port to its physical network name. Each physical network can be mapped to several ports:
id: Tambahkan bagian FDB dan parameter ``shared_physical_device_mappings``. Parameter ini memetakan setiap port fisik untuk nama jaringan fisik. Setiap jaringan fisik dapat dipetakan ke beberapa port:
tr_tr: FDB bölümünü ve ``shared_physical_device_mappings`` parametresini ekleyin. Bu parametre, her fiziksel bağlantı noktasını fiziksel ağ adına eşler. Her fiziksel ağ birkaç bağlantı noktasına eşlenebilir:

source: Add the IPv4 and IPv6 subnets as interfaces on the router.
id: Tambahkan subnet IPv4 dan IPv6 sebagai interface pada router.
tr_tr: Yönlendirici üzerinde arabirim olarak IPv4 ve IPv6 alt ağları ekle.

source: Add the LBaaS v2 service plug-in to the ``service_plugins`` configuration directive in ``/etc/neutron/neutron.conf``. The plug-in list is comma-separated:
id: Tambahkan plug-in layanan LBaaS v2 ke perintah konfigurasi ``service_plugins`` dalam ``/etc/neutron/neutron.conf``. Daftar plug-in dipisahkan dengan koma:
tr_tr: LBaaS v2 servis eklentisini ``/etc/neutron/neutron.conf``dosyasındaki ``service_plugins`` yapılandırma yönergesine ekleyin:

source: Add the LBaaS v2 service provider to the ``service_provider`` configuration directive within the ``[service_providers]`` section in ``/etc/neutron/neutron_lbaas.conf``:
id: Tambahkan penyedia layanan LBaaS v2 ke direktif konfigurasi ``service_provider`` dalam bagian ``[service_providers]`` dalam ``/etc/neutron/neutron_lbaas.conf``:
tr_tr: LBaaS v2 servis sağlayıcıyı ``/etc/neutron/neutron_lbaas.conf`` dosyasındaki ``[service_providers]`` bölümünde ``service_provider`` yapılandırma yönergesine ekleyin:

source: Add the Octavia service provider to the ``service_provider`` configuration directive within the ``[service_providers]`` section in ``/etc/neutron/neutron_lbaas.conf``:
id: Tambahkan provider layanan Octavia ke konfigurasi direktif ``service_provider`` dalam bagian ``[service_providers]`` dalam ``/etc/neutron/neutron_lbaas.conf``:
tr_tr: Octavia servisini ``/etc/neutron/neutron_lbaas.conf`` dosyasındaki ``[service_providers]`` bölümde ``service_provider`` yapılandırma yönergesine ekle:

source: Add the QoS service to the ``service_plugins`` setting in ``/etc/neutron/neutron.conf``. For example:
id: Menambahkan layanan QoS ke pengaturan ``service_plugins`` dalam ``/etc/neutron/neutron.conf``. Sebagi contoh:
tr_tr: QoS servisini ``/etc/neutron/neutron.conf`` dosyasında ``service_plugins`` ayarına ekleyin. Örneğin:

source: Add the ``ml2_conf_sriov.ini`` file as parameter to the ``neutron-server`` service. Edit the appropriate initialization script to configure the ``neutron-server`` service to load the SR-IOV configuration file:
id: Tambahkan file ``ml2_conf_sriov.ini`` sebagai parameter untuk layanan ``neutron-server``. Edit script inisialisasi yang tepat untuk mengkonfigurasi layanan ``neutron-server`` untuk memuat file konfigurasi SR-IOV:
tr_tr: ``neutron-server`` servisine parametre olarak ``ml2_conf_sriov.ini`` dosyasını ekleyin. SR-IOV yapılandırma dosyasını yüklemek için ``neutron-server`` servisini yapılandırmak için uygun başlatma komut dosyasını düzenleyin:

source: Add the following to ``/etc/neutron/neutron.conf``:
id: Tambahkan hal berikut ke ``/etc/neutron/neutron.conf``:
tr_tr: Aşağıdakini ``/etc/neutron/neutron.conf`` dosyasına ekle:

source: Add the following to ``/etc/neutron/plugins/ml2/ml2_conf.ini``:
id: Tambahkan berikut ke ``/etc/neutron/plugins/ml2/ml2_conf.ini``:
tr_tr: Aşağıdakini ``/etc/neutron/plugins/ml2/ml2_conf.ini`` dosyasına ekleyin:

source: Add the provider network as a gateway on each router.
id: Tambahkan jaringan provider sebagai gateway pada masing-masing router.
tr_tr: Her yönlendiriciye bir sağlayıcı ağı geçit olarak ekleyin.

source: Add the provider network as a gateway on the router.
id: Tambahkan jaringan provider sebagai gateway pada router.
tr_tr: Yönlendirici üzerine bir sağlayıcı ağı geçit olarak ekleyin.

source: Add the provider network as the gateway on the router.
id: Tambahkan jaringan provider sebagai gateway pada router.
tr_tr: Yönlendirici ağ sağlayıcısını ağ geçidi olarak ekleyin.

source: Add the provider network interface as a port on the OVS provider bridge ``br-provider``:
id: Tambahkan antarmuka jaringan operator sebagai port pada OVS provider bridge ``br-provider``:
tr_tr: OVS sağlayıcı köprü ``br-provider`` üzerinde sağlayıcı ağ arabirimini bağlantı noktası olarak ekle:

source: Adding an HTTP listener
id: Tambahkan pendengar HTTP
tr_tr: HTTP dinleyici ekleme

source: Adding an HTTPS listener
id: Menambahkan pendengar HTTPS
tr_tr: HTTPS dinleyici ekleme

source: Address are assigned using EUI-64, and OpenStack Networking provides routing.
id: Alamat ditugaskan penggunaan EUI-64, dan OpenStack Networking menyediakan routing.
tr_tr: Adres, EUI-64 kullanılarak atanır ve OpenStack Networking yönlendirme sağlar.

source: Address configuration and optional information using DHCPv6.
id: Konfigurasi alamat dan informasi opsional menggunakan DHCPv6.
tr_tr: Yapılandırma ve isteğe bağlı bilgileri DHCPv6 kullanarak adresleyin.

source: Address configuration using RA and optional information using DHCPv6.
id: Konfigurasi alamat menggunakan RA dan informasi opsional menggunakan DHCPv6.
tr_tr: RA'ı kullanarak adres yapılandırmasını ve isteğe bağlı bilgileri DHCPv6 kullanarak adresleyin.

source: Address configuration using Router Advertisement (RA).
id: Konfigurasi alamat menggunakan Router Advertisement (RA).
tr_tr: Yönlendirici Tanıtımı kullanarak adres yapılandırması (RA).

source: Address modes for ports
id: Mode alamat untuk port
tr_tr: Bağlantı noktaları için adres kipleri

source: Address scopes
id: Lingkup alamat (address scopes)
tr_tr: Adres alanları

source: Address scopes build from subnet pools. While subnet pools provide a mechanism for controlling the allocation of addresses to subnets, address scopes show where addresses can be routed between networks, preventing the use of overlapping addresses in any two subnets. Because all addresses allocated in the address scope do not overlap, neutron routers do not NAT between your projects' network and your external network. As long as the addresses within an address scope match, the Networking service performs simple routing between networks.
id: Lingkup alamat membangun kolam subnet. Sementara kolam subnet menyediakan mekanisme untuk mengendalikan alokasi alamat untuk subnet, lingkup alamat menunjukkan dimana alamat dapat dialihkan antara jaringan, mencegah penggunaan tumpang tindih alamat dalam dua subnet. Karena semua alamat dialokasikan dalam lingkup alamat tidak tumpang tindih, router neutron tidak men-NAT (Network Address Translation) antara jaringan proyek Anda dan jaringan eksternal Anda. Selama alamat dalam suatu kecocokan lingkup alamat, layanan Networking melakukan routing sederhana antar jaringan.
tr_tr: Adres alanları alt ağ havuzlarından oluşturulur. Alt ağ havuzları, adreslerin alt ağlara ayrılmasını denetleyen bir mekanizma sağlarken, adres alanları, adreslerin ağlar arasında nereye yönlendirilebileceğini ve herhangi bir iki alt ağda üst üste gelen adreslerin kullanılmasını engellediğini gösterir. Adres alanında ayrılan tüm adresler çakışmadığından, neutron yönlendiricileri, projelerinizin ağıyla harici ağ arasında NAT yapmazlar. Bir adres alanındaki adresler eşleştiği sürece, Ağ hizmeti, ağlar arasında basit bir yönlendirme gerçekleştirir.

source: Addresses
id: Addresses (alamat)
tr_tr: Adresler

source: Addresses and optional information are assigned using DHCPv6.
id: Alamat dan informasi opsional ditugaskan untuk penggunaan DHCPv6.
tr_tr: Adresler ve isteğe bağlı bilgiler, DHCPv6 kullanılarak atanır.

source: Addresses are assigned through RAs (see SLAAC above) and optional information is delivered through DHCPv6.
tr_tr: Adresler, RA'lar vasıtasıyla atanır (bkz. yukarıdaki SLAAC) ve isteğe bağlı bilgiler DHCPv6 aracılığıyla teslim edilir.

source: Addresses are assigned using EUI-64, and an external router will be used for routing.
id: Alamat ditugaskan penggunaan EUI-64, dan router eksternal akan digunakan untuk routing.
tr_tr: Adresler EUI-64 kullanılarak atanır ve yönlendirme için harici bir yönlendirici kullanılacaktır.

source: Addresses for subnets
id: Alamat untuk subnet
tr_tr: Alt ağlar için adresler

source: Adjust security groups to allow pings and SSH (both IPv4 and IPv6):
id: Atur kelompok keamanan untuk mengizinkan ping dan SSH (IPv4 dan IPv6):
tr_tr: Ping'lere ve SSH'a (hem IPv4 hem de IPv6) izin vermek için güvenlik gruplarını ayarlayın:

source: Admin role is required to use the agent management and scheduler extensions. Ensure you run the following commands under a project with an admin role.
id: Peran admin diperlukan untuk menggunakan manajemen agen dan ekstensi scheduler. Pastikan Anda menjalankan perintah berikut di bawah sebuah proyek dengan peran admin.
tr_tr: Aracı yönetimi ve zamanlayıcı uzantılarını kullanmak için yönetici rolü gereklidir. Bir yönetici rolüne sahip bir proje kapsamında aşağıdaki komutları çalıştırdığınızdan emin olun.

source: Administrator enforcement
id: Penegakan administrator
tr_tr: Yönetici yaptırımları

source: Administrators are able to enforce policies on project ports or networks. As long as the policy is not shared, the project is not be able to detach any policy attached to a network or port.
id: Administrator dapat menegakkan kebijakan pada port proyek atau jaringan. Selama kebijakan tersebut tidak dibagi, proyek ini tidak dapat melepaskan kebijakan apa saja yang melekat ke jaringan atau port.
tr_tr: Yöneticiler, proje bağlantı noktaları veya ağlar üzerinde ilkeler uygulayabilir. Politika paylaşılmadığı sürece, proje bir ağa veya bağlantı noktasına eklenen herhangi bir politikayı ayırabilecek durumda değildir.

source: Advanced services
id: Layanan canggih
tr_tr: Gelişmiş servisler

source: Advertisement of a floating IP address requires satisfying the following conditions:
id: Penyiaran update dan perubahan alamat IP mengambang membutuhkan terpenuhinya kondisi berikut:
tr_tr: Yüzen IP adresinin tanıtımı aşağıdaki koşulların sağlanmasını gerektirir:

source: Advertisement of a self-service network requires satisfying the following conditions:
id: Penyiaran update dan perubahan jaringan self-service membutuhkan memenuhi kondisi berikut:
tr_tr: Bir self-servis ağının tanıtımı aşağıdaki koşulların sağlanmasını gerektirir:

source: After choosing a :ref:`mechanism driver <deploy-mechanism-drivers>`, the deployment examples generally include the following building blocks:
id: Setelah pemilihan :ref:`mechanism driver <deploy-mechanism-drivers>`, contoh pengerahan umumnya memasukan blok bangunan berikut:
tr_tr: :ref:`mekanizma sürücüsü <deploy-mechanism-drivers>`nü seçtikten sonra, devreye alma özellikleri genellikle aşağıdaki yapı taşlarını içerir:

source: After creating a peering session, you cannot change the local or remote autonomous system numbers.
id: Setelah membuat sesi peering, Anda tidak dapat mengubah nomor sistem otonomi lokal atau remote.
tr_tr: Eşleme oturumu oluşturduktan sonra yerel veya uzak özerk sistem numaralarını değiştiremezsiniz.

source: After deletion, if you restart the DHCP agent, it appears on the agent list again.
id: Setelah penghapusan, jika Anda me-restart agen DHCP, akan muncul pada daftar agen lagi.
tr_tr: Silme işleminden sonra, DHCP ajanını yeniden başlatırsanız, ajan listesinde yeniden görünür.

source: After installing Dibbler, edit the ``/etc/dibbler/server.conf`` file:
id: Setelah menginstal Dibbler, edit file ``/etc/dibbler/server.conf``:
tr_tr: Dibbler'i kurduktan sonra ``/etc/dibbler/server.conf`` dosyasını düzenleme:

source: After installing a new version of the Neutron server, upgrade the database using the following command:
id: Setelah menginstal versi baru dari server Neutron, meng-upgrade database kemudian gunakan perintah berikut:
tr_tr: Neutron sunucusunun yeni bir sürümünü yükledikten sonra, aşağıdaki komutu kullanarak veritabanını yükseltin:

source: After re-starting the ``neutron-server``, users will be able to assign a ``dns_name`` attribute to their ports.
id: Setelah memulai kembali ``neutron-server``, pengguna akan dapat menetapkan atribut ``dns_name`` ke portnya.
tr_tr: Kullanıcılar, ``neutron-server``nu tekrar başlattıktan sonra, bağlantı noktalarına ``dns_name`` özniteliği atayabilecekler.
