Repository: 25hours/openstack-manuals
Catalog: doc/networking-guide/source/locale/*/LC_MESSAGES/networking-guide.po
Languages: id, tr_tr

source: The self-service bridge instance port (19) forwards the packet to the instance 2 interface (20) via ``veth`` pair.
id: Self-service bridge instance port (19 meneruskan paket ke instance 2 interface (20) melalui pasangan ``veth``.
tr_tr: Self servis köprü sunucu bağlantı noktası (19) paketi ``veth`` çifti vasıtasıyla sunucu 2 arayüzüne (20) iletir.

source: The self-service bridge router port (9) forwards the packet to the self-service network 1 interface (10) in the router namespace.
id: Self-service bridge router port (9) meneruskan paket ke self-service network 1 interface (10) ) dalam router namespace.
tr_tr: Self servis köprü yönlendirici bağlantı noktası (9), paketin yönlendirici ad alanındaki self servis ağ 1 arabirimine (10) iletilmesini sağlar.

source: The self-service bridge router port (9) forwards the packet to the self-service network interface (10) in the router namespace.
id: self-service bridge router port (9) meneruskan paket ke interface jaringan self-service (10) dalam namespace router.
tr_tr: Self servis köprü yönlendirici bağlantı noktası (9), paketin yönlendirici alanındaki self servis ağ arabirimine (10) iletilmesini sağlar.

source: The self-service network 2 bridge forwards the packet to the VXLAN interface (13) which wraps the packet using VNI 102.
id: Self-service network 2 bridge meneruskan paket ke VXLAN interface (13) yang membungkus paket menggunakan VNI 102.
tr_tr: Self-servis ağı 2 köprüsü, paketi VNI 102'yi kullanarak paketini saran VXLAN arabirimine (13) iletir.

source: The self-service network 2 interface in the distributed router namespace (8) forwards the packet to the OVS integration bridge port for self-service network 2 (9).
id: Self-service network 2 interface dalam distributed router namespace (8) meneruskan paket ke OVS integration bridge port pada self-service network 2 (9).
tr_tr: Dağıtılmış yönlendirici ad alanındaki self-servis ağı 2 arabirimi (8) paketi, self-servis ağı 2 (9) için OVS entegrasyon köprü portuna iletir.

source: The server sends an acknowledgement ("OK ``08:00:27:b9:88:74``, IP ``10.10.0.112`` is yours")
id: Server akan mengirimkan sebuah pengakuan ("OK ``08:00:27:b9:88:74``, IP ``10.10.0.112`` is yours")
tr_tr: Sunucu bir iletildi mesajı gönderir ("Tamam ``08:00:27:b9:88:74``, ``10.10.0.112`` IP adresi senindir")

source: The server sends an offer ("OK ``08:00:27:b9:88:74``, I’m offering IP address ``10.10.0.112``")
id: Server akan mengirimkan tawaran ("OK ``08:00:27:b9:88:74``, I’m offering IP address ``10.10.0.112``")
tr_tr: Sunucu bir teklif gönderir ("Tamam ``08:00:27:b9:88:74``, ``10.10.0.112`` IP adresini gönderiyorum")

source: The sriov nic switch agent configures PCI virtual functions to realize L2 networks for OpenStack instances. Network attachments for other resources like routers, DHCP, and so on are not supported.
id: Sriov nic switch agent mengkonfigurasi fungsi virtual PCI untuk mewujudkan jaringan L2 untuk instance OpenStack. Network attachment untuk sumber daya lain seperti router, DHCP, dan sebagainya tidak didukung.
tr_tr: Sriov nic switch ajanı, OpenStack sunucuları için L2 ağlarını gerçekleştirmek için PCI sanal fonksiyonlarını yapılandırır. Yönlendiriciler, DHCP ve benzeri diğer kaynaklar için ağ ekleri desteklenmez.

source: The steps detail how to create VFs using Mellanox ConnectX-4 and newer/Intel SR-IOV Ethernet cards on an Intel system. Steps may differ for different hardware configurations.
id: Langkah-langkah rinci bagaimana untuk membuat VF menggunakan kartu Mellanox ConnectX-4 dan kartu Intel SR-IOV Ethernet atau yang lebih baru pada sistem Intel. Langkah inimungkin berbeda untuk konfigurasi hardware yang berbeda.
tr_tr: Adımlar, bir Intel sisteminde Mellanox ConnectX-4 ve daha yeni/Intel SR-IOV Ethernet kartlarını kullanarak VF'lerin nasıl oluşturulacağını açıklar. Adımlar, farklı donanım yapılandırmaları için farklılık gösterebilir.

source: The subnet is initially created with a temporary CIDR before one can be assigned by prefix delegation. Any number of subnets with this temporary CIDR can exist without raising an overlap error. The subnetpool_id is automatically set to ``prefix_delegation``.
id: Subnet pada awalnya dibuat dengan CIDR sementara sebelum subnet dapat diberikan oleh prefix delegation. Jumlah subnet dengan CIDR sementara ini bisa eksis tanpa menimbulkan error tumpang tindih. subnetpool_id secara otomatis diatur untuk ``prefix_delegation``.
tr_tr: Alt ağ, önek yetkilendirme tarafından atanmadan önce başlangıçta geçici bir CIDR ile oluşturulur. Bu geçici CIDR'ye sahip herhangi bir sayıda alt ağ, örtüşme hatası oluşturmadan mevcut olabilir. subnetpool_id otomatik olarak ``prefix_delegation`` olarak ayarlanır.

source: The suggested way of making PCI SYS settings persistent is through the ``sysfsutils`` tool. However, this is not available by default on many major distributions.
id: Cara yang disarankan untuk membuat pengaturan PCI SYS persisten adalah melalui alat ``sysfsutils``. Namun, ini tidak tersedia secara default pada banyak distribusi utama.
tr_tr: PCI SYS ayarlarını kalıcı kılmak için önerilen yol ``sysfsutils`` aracıdır. Ancak, bu, birçok ana dağıtımda varsayılan olarak kullanılamaz.

source: The support for SR-IOV with InfiniBand allows a Virtual PCI device (VF) to be directly mapped to the guest, allowing higher performance and advanced features such as RDMA (remote direct memory access). To use this feature, you must:
id: Dukungan untuk SR-IOV dengan InfiniBand memungkinkan perangkat Virtual PCI (VF) untuk langsung dipetakan ke guest, yang memungkinkan kinerja yang lebih tinggi dan fitur-fitur canggih seperti RDMA (remote direct memory access). Untuk menggunakan fitur ini, Anda harus:
tr_tr: InfiniBand ile SR-IOV desteği, bir Virtual PCI aygıtının (VF) doğrudan konukla eşleştirilmesini sağlar ve böylece RDMA (uzaktan doğrudan bellek erişimi) gibi daha gelişmiş performans ve gelişmiş özellikler elde edilebilir. Bu özelliği kullanmak için şunları yapmanız gerekir:

source: The switch adds VLAN tag 102 to the packet and forwards it to compute node 1 (11).
id: Switch menambahkan VLAN tag 102 untuk paket dan meneruskannya ke compute node 1 (11).
tr_tr: Switch pakete 102 VLAN etiketi ekler ve onu hesaplama düğümü 1'e (11) iletir.

source: The switch adds VLAN tag 102 to the packet and forwards it to compute node 1 (15).
id: Switch menambahkan VLAN tag 102 ke paket dan meneruskannya ke komputasi node 1 (15).
tr_tr: Switch pakete VLAN 102 etiketini ekler ve hesaplama düğümü 1'e iletir (15).

source: The switch forwards the packet from compute node 1 to compute node 2 (11).
id: Switch meneruskan paket dari komputasi node 1 ke komputasi node 2 (11).
tr_tr: Switch paketi hesaplama düğümü 1'den hesaplama düğümü 2'ye (11) iletir.

source: The switch forwards the packet from compute node 1 to compute node 2 (7).
id: Switch meneruskan paket dari komputasi node 1 ke komputasi node 2 (7).
tr_tr: Switch, paketi hesaplama düğümü 1'den hesaplama düğümü 2'ye (7) paketi yönlendirir.

source: The switch forwards the packet to the external network (11).
id: Switch meneruskan paket ke jaringan eksternal (11).
tr_tr: Switch paketi harici ağa (11) yönlendirir.

source: The switch forwards the packet to the external network (15).
id: Switch meneruskan paket ke external network (15).
tr_tr: Switch paketi harici ağa iletir (15).

source: The switch removes VLAN tag 101 from the packet and forwards it to the router (11).
id: Switch menghapus VLAN tag 101 dari paket dan meneruskannya ke router (11).
tr_tr: Anahtar, VLAN 101 etiketini paketten kaldırır ve yönlendiriciye (11) iletir.

source: The switch removes VLAN tag 101 from the packet and forwards it to the router (7).
id: Switch menghapus VLAN tag 101 dari paket dan meneruskannya ke router (7).
tr_tr: Anahtar, VLAN etiketi 101'i paketten çıkarır ve onu yönlendiriciye (7) iletir.

source: The tool needs to access the database connection string, which is provided in the ``neutron.conf`` configuration file in an installation. The tool automatically reads from ``/etc/neutron/neutron.conf`` if it is present. If the configuration is in a different location, use the following command:
id: Alat ini perlu mengakses string koneksi database, yang disediakan dalam file konfigurasi ``neutron.conf`` dalam instalasi. Alat ini secara otomatis membaca dari ``/etc/neutron/neutron.conf`` jika ada. Jika konfigurasi ini ada di lokasi yang berbeda, gunakan perintah berikut:
tr_tr: Araç, bir kurulumda ``neutron.conf`` yapılandırma dosyasında sağlanan veritabanı bağlantı dizesine erişmek zorundadır. Araç, varsa otomatik olarak ``/etc/neutron/neutron.conf`` dan okur. Yapılandırma farklı bir konumdaysa, aşağıdaki komutu kullanın:

source: The tool takes some options followed by some commands:
id: Alat ini mengambil beberapa pilihan yang diikuti oleh beberapa perintah:
tr_tr: Araç, bazı komutları takiben bazı seçenekler alıyor:

source: The tool usage examples below do not show the options. It is assumed that you use the options that you need for your environment.
id: Contoh penggunaan alat di bawah ini tidak menunjukkan pilihan. Hal ini diasumsikan bahwa Anda menggunakan pilihan yang Anda butuhkan untuk lingkungan Anda.
tr_tr: Aşağıdaki araç kullanımı örneklerinde seçenekleri gösterilmez. Ortamınız için ihtiyaç duyduğunuz seçenekleri kullandığınız varsayılmıştır.

source: The trunk is ``ACTIVE`` when both the logical and physical resources have been created. This means that all operations within the Networking and Compute services have completed and the trunk is ready for use.
id: Trunk menjadi ``ACTIVE`` ketika kedua sumber logis dan fisik telah diciptakan. Ini berarti bahwa semua operasi dalam layanan Networking dan Compute telah selesai dan trunk siap digunakan.
tr_tr: Mantıksal ve fiziksel kaynaklar oluşturulduğunda bilgi aktarım yolu ``AKTİF`` olur. Bu, Ağ ve Hesaplama hizmetleri içindeki tüm operasyonların tamamlanmış olduğu ve bilgi aktarım yolunun kullanıma hazır olduğu anlamına gelir.

source: The underlying physical interface (11) for overlay networks forwards the packet to the OVS tunnel bridge (12).
id: Underlying physical interface (11) untuk overlay network meneruskan paket ke OVS tunnel bridge (12).
tr_tr: Yerleşim ağları için altta yatan fiziksel arabirim (11) paketi OVS tünel köprüsüne (12) iletir.

source: The underlying physical interface (11) for the VXLAN interface forwards the packet to the VXLAN interface (12) which unwraps the packet.
id: Antarmuka fisik yang mendasari (11) untuk antarmuka VXLAN meneruskan paket ke interface VXLAN (12) yang membuka paket.
tr_tr: VXLAN arabirimi için altta yatan fiziksel arabirim (11), paketi, paketi açan VXLAN arabirimine (12) iletir.

source: The underlying physical interface (13) for overlay networks forwards the packet to compute node 2 via the overlay network (14).
id: Underlying physical interface (13) untuk overlay network meneruskan paket ke compute node 2 melalui overlay network (14).
tr_tr: Yer paylaşımlı ağlar için altta yatan fiziksel arabirim (13), yer paylaşım ağı (14) vasıtasıyla hesaplama düğümü 2'ye paketi iletir.

source: The underlying physical interface (13) for overlay networks forwards the packet to the network node via the overlay network (14).
id: Underlying physical interface (13) untuk overlay network meneruskan paket ke network node melalui overlay network (14).
tr_tr: Yer paylaşımlı ağlar için altta yatan fiziksel arabirim (13), paketin yer paylaşımlı ağ (14) üzerinden ağ düğümüne iletilmesini sağlar.

source: The underlying physical interface (15) for overlay networks forwards the packet to the OVS tunnel bridge (16).
id: underlying physical interface (15) untuk jaringan overlay meneruskan paket ke OVS tunnel bridge (16).
tr_tr: Yerleşim ağları için alttaki fiziksel arabirim (15) paketi OVS tünel köprüsüne (16) iletir.

source: The underlying physical interface (16) for the VXLAN interface sends the packet to the VXLAN interface (17) which unwraps the packet.
id: Antarmuka fisik yang mendasari (16) untuk antarmuka VXLAN mengirimkan paket ke interface VXLAN (17) yang membuka paket.
tr_tr: VXLAN arabirimi için altta yatan fiziksel arabirim (16), paketi paketin açmasını sağlayan VXLAN arabirimine (17) gönderir.

source: The underlying physical interface (22) for overlay networks forwards the packet to the compute node via the overlay network (23).
id: Antarmuka fisik yang mendasari (22) untuk jaringan overlay meneruskan paket ke node komputasi melalui jaringan overlay (23).
tr_tr: Yer paylaşımlı ağlar için altta yatan fiziksel arabirim (22), paketin yer paylaşım ağı (23) üzerinden hesaplama düğümüne iletilmesini sağlar.

source: The underlying physical interface (24) for overlay networks forwards the packet to the OVS tunnel bridge (25).
id: Antarmuka fisik yang mendasari (24) untuk jaringan overlay meneruskan paket ke OVS tunnel bridge (25).
tr_tr: Yerleşim ağları için alttaki fiziksel arabirim (24), paketi OVS tünel köprüsüne (25) iletir.

source: The underlying physical interface (5) for the VXLAN interface forwards the packet to compute node 2 via the overlay network (6).
id: Antarmuka fisik yang mendasari (5) untuk antarmuka VXLAN meneruskan paket ke compute node 2 melalui jaringan overlay (6).
tr_tr: VXLAN arabirimi için alttaki fiziksel arabirim (5), yer paylaşım ağı (6) üzerinden hesaplama düğümü 2'ye paketi iletir.

source: The underlying physical interface (5) for the VXLAN interface forwards the packet to the network node via the overlay network (6).
id: Antarmuka fisik yang mendasari (5) untuk antarmuka VXLAN meneruskan paket ke node jaringan melalui jaringan overlay (6).
tr_tr: VXLAN arabirimi için altta yatan fiziksel arabirim (5), paketin yer paylaşımlı ağ üzerinden (6) ağ düğümüne iletilmesini sağlar.

source: The underlying physical interface (7) for the VXLAN interface forwards the packet to the VXLAN interface (8) which unwraps the packet.
id: Antarmuka fisik yang mendasari (7) untuk antarmuka VXLAN meneruskan paket ke interface VXLAN (8) yang membuka paket.
tr_tr: VXLAN arabirimi için altta yatan fiziksel arabirim (7), paketi paketin açmasını sağlayan VXLAN arabirimine (8) iletir

source: The underlying physical interface (9) for overlay networks forwards the packet to compute node 2 via the overlay network (10).
id: Underlying physical interface (9) untuk overlay networks meneruskan paket ke komputasi node 2 melalui jaringan overlay (10).
tr_tr: Yer paylaşımlı ağlar için altta yatan fiziksel arabirim (9), düğüm 2'yi yer paylaşım ağı (10) üzerinden hesaplamak için paketi iletir.

source: The underlying physical interface (9) for overlay networks forwards the packet to the network node via the overlay network (10).
id: Underlying physical interface (9) untuk overlay network meneruskan paket ke network node melalui overlay network (10).
tr_tr: Yer paylaşımlı ağlar için altta yatan fiziksel arabirim (9), paketin yer paylaşım ağı (10) vasıtasıyla ağ düğümüne iletilmesini sağlar.

source: The underlying physical interface (9) for the VXLAN interface forwards the packet to the network node via the overlay network (10).
id: Antarmuka fisik yang mendasari (9) untuk antarmuka VXLAN meneruskan paket ke node jaringan melalui jaringan overlay (10).
tr_tr: VXLAN arabirimi için altta yatan fiziksel arabirim (9), paketin üst katman ağı (10) üzerinden ağ düğümüne iletilmesini sağlar.

source: The upgrade of the Networking service database is implemented with Alembic migration chains. The migrations in the ``alembic/versions`` contain the changes needed to migrate from older Networking service releases to newer ones.
id: Upgrade dari database layanan Networking diimplementasikan dengan rantai migrasi Alembic. Migrasi di ``alembic /versions`` berisi perubahan yang dibutuhkan untuk bermigrasi dari rilis layanan Networking tua ke yang lebih baru.
tr_tr: Ağ servisi veritabanının yükseltilmesi Alembic geçiş zincirleriyle gerçekleştirildi.``alembic/versions``in geçişlerinde eski Ağ Hizmeti sürümlerinden yeni sürümlere geçiş yapmak için gereken değişiklikler var.

source: The upstream router can send an RA and the neutron router will automatically learn the next-hop LLA, provided again that no subnet is assigned and the ``ipv6_gateway`` flag is not set.
id: Router hulu dapat mengirim RA dan router neutron otomatis akan mempelajari LLA next-hop, tersedia lagi bahwa tidak ada subnet ditugaskan dan flag ``ipv6_gateway`` tidak diatur.
tr_tr: Üst akış yönlendirici bir RA gönderebilir ve neutron yönlendirici, hiçbir alt ağın atanmadığını ve ``ipv6_gateway`` bayrağı ayarlanmadığından, sonraki atlama LLA'sını otomatik olarak öğrenecektir.

source: The validation option behaves identically for all users. However, it is considered primarily an admin or service utility since it is the operator who must set up the requirements.
id: Opsi validasi berperilaku identik untuk semua pengguna. Namun, validasi itu dianggap utama bagi admin atau utilitas layanan karena merupakan operator yang harus menyiapkan dan memenuhi persyaratan itu.
tr_tr: Doğrulama seçeneği tüm kullanıcılar için aynı davranır. Bununla birlikte, gereksinimleri ayarlamanız gereken operatör olduğundan, öncelikle bir yönetici veya hizmet aracı olarak düşünülür.

source: The value of ``METADATA_SECRET`` must match the value of the same option in the ``[neutron]`` section of the ``nova.conf`` file.
id: Nilai ``METADATA_SECRET`` harus sesuai dengan nilai opsi yang sama dalam bagian ``[neutron] `` dari file ``nova.conf``.
tr_tr: ``METADATA_SECRET`` değeri, ``nova.conf`` dosyasının ``[neutron]`` bölümündeki aynı seçeneğin değeriyle eşleşmelidir.

source: The variables used in the script file above are:
id: Variabel yang digunakan dalam file script di atas adalah:
tr_tr: Yukarıdaki komut dosyasında kullanılan değişkenler şunlardır:

source: There are certain scenarios where l2pop and distributed HA routers do not interact in an expected manner. These situations are the same that affect HA only routers and l2pop.
id: Ada skenario tertentu di mana l2pop dan router HA didistribusikan tidak berinteraksi dengan cara yang diharapkan. Situasi ini adalah sama yang mempengaruhi router hanya HA dan l2pop.
tr_tr: L2pop ve dağıtılmış HA yönlendiricilerinin beklenen bir şekilde etkileşime girmediği bazı senaryolar vardır. Bu durumlar yalnızca HA yönlendiricilerini ve l2pop'u etkileyen durumlarla aynıdır.

source: There are multiple variations of NAT, and here we describe three kinds commonly found in OpenStack deployments.
id: Ada beberapa variasi dari NAT, dan disini kami menjelaskan tiga jenis umum yang ditemukan dalam pengerahan OpenStack.
tr_tr: Birden fazla NAT varyasyonu vardır ve burada OpenStack dağıtımlarında yaygın olarak bulunan üç çeşit açıklanmaktadır.

source: There are three methods currently implemented for a subnet to get its ``cidr`` in OpenStack:
tr_tr: Şu anda bir alt ağ için OpenStack'te ``cidr`` almak için uygulanan üç yöntem vardır:

source: There are two IPv6 attributes:
id: Ada dua atribut IPv6:
tr_tr: İki tane IPv6 özniteliği vardır:

source: There are two reference implementations of LBaaS v2. The one is an agent based implementation with HAProxy. The agents handle the HAProxy configuration and manage the HAProxy daemon. Another LBaaS v2 implementation, `Octavia <https://docs.openstack.org/developer/octavia/>`_, has a separate API and separate worker processes that build load balancers within virtual machines on hypervisors that are managed by the Compute service. You do not need an agent for Octavia.
id: Ada dua implementasi referensi dari LBaaS v2. Yang satu adalah implementasi berdasarkan agen dengan HAProxy. Para agen menangani konfigurasi HAProxy dan mengelola daemon HAProxy. Implementasi LBaaS v2 lain, `Octavia <https://docs.openstack.org/developer/octavia/>`_, memiliki API terpisah dan proses pekerja terpisah yang membangun penyeimbang beban dalam mesin virtual pada hypervisors yang dikelola oleh layanan Compute. Anda tidak perlu agen untuk Octavia.
tr_tr: LBaaS v2'nin iki referans gerçekleştirimi var. Bunlardan biri, HAProxy ile ajan tabanlı bir uygulamadır. Ajanlar HAProxy yapılandırmasını ele alır ve HAProxy arka plan programını yönetir. Başka bir LBaaS v2 gerçekleştirimi, `Octavia <https://docs.openstack.org/developer/octavia/>`_, ayrı bir API'ya ve Hesaplama hizmeti tarafından yönetilen sanal makinelerde yük dengeleyicileri oluşturan ayrı bir çalışan süreçlere sahiptir. Octavia için bir ajan gerekmiyor.

source: There are two syntaxes for expressing a netmask:
id: Ada dua sintaks untuk mengekspresikan netmask:
tr_tr: Bir netmask'ı tanımlamak için iki söz dizimi vardır:

source: There are two ways to attach VFs to an instance. You can create an SR-IOV port or use the ``pci_alias`` in the Compute service. For more information about using ``pci_alias``, refer to `nova-api configuration <https://docs.openstack.org/admin-guide/compute-pci-passthrough.html#configure-nova-api-controller>`__.
id: Ada dua cara untuk menghubungkan VFS ke sebuah instance. Anda dapat membuat port SR-IOV atau menggunakan ``pci_alias`` dalam pelayanan Compute. Untuk informasi lebih lanjut tentang menggunakan ``pci_alias``, mengacu pada `nova-api configuration <https://docs.openstack.org/admin-guide/compute-pci-passthrough.html#configure-nova-api-controller>`__.
tr_tr: VF'leri bir sunucuya bağlamak için iki yol vardır. Bir SR-IOV bağlantı noktası oluşturabilir veya Hesaplama servisindeki ``pci_alias`` ı kullanabilirsiniz. ``pci_alias``ın kullanımı hakkında daha fazla bilgi için `nova-api yapılandırması <https://docs.openstack.org/admin-guide/compute-pci-passthrough.html#configure-nova-api-controller>` __.

source: There is a known bug with ``keepalived`` v1.2.15 and earlier which can cause packet loss when ``max_l3_agents_per_router`` is set to 3 or more. Therefore, we recommend that you upgrade to ``keepalived`` v1.2.16 or greater when using this feature.
id: Ada bug yang dikenal dengan ``keepalived`` v1.2.15 dan sebelumnya yang dapat menyebabkan kehilangan paket (packet loss) ketika `` max_l3_agents_per_router`` diatur ke 3 atau lebih. Oleh karena itu, kami menyarankan Anda meng-upgrade ke ``keepalived`` v1.2.16 atau lebih besar saat penggunaan fitur ini.
tr_tr: ``keepalived`` v1.2.15 ve daha öncesinde ``max_l3_agents_per_router`` değeri 3 veya daha fazla olarak ayarlandığında paket kaybına neden olabileceği bilinen bir hata var. Bu nedenle, bu özelliği kullanırken ``keepalived`` v1.2.16 veya daha üst sürüme yükseltmenizi öneririz.

source: There is no need to specify any value if you wish to use the reference driver, though specifying ``internal`` will explicitly choose the reference driver. The documentation for any alternate drivers will include the value to use when specifying that driver.
id: Tidak perlu untuk menentukan nilai apapun jika Anda ingin menggunakan driver referensi, meskipun menentukan ``internal`` secara eksplisit akan memilih driver referensi. Dokumentasi untuk setiap driver alternatif akan mencakup nilai untuk digunakan saat menentukan driver tersebut.
tr_tr: Referans sürücüsünü kullanmak isterseniz herhangi bir değeri belirtmenize gerek yoktur, ancak ``internal`` belirtildiğinde açıkça referans sürücüsü seçilecektir. Herhangi bir alternatif sürücü belgesi, o sürücüyü belirlerken kullanılacak değeri içerecektir.

source: There is no provisions for an IPv6-based metadata service similar to what is provided for IPv4. In the case of dual stacked guests though it is always possible to use the IPv4 metadata service instead.
tr_tr: IPv4 için sağlanana benzer bir IPv6 tabanlı metadata hizmeti için herhangi bir hüküm yoktur. Çift yığınlı konuklar olması durumunda bunun yerine IPv4 metadata servisini kullanmak her zaman mümkündür.
