Repository: 25hours/openstack-manuals
Catalog: doc/networking-guide/source/locale/*/LC_MESSAGES/networking-guide.po
Languages: id, tr_tr

source: The output shows information for four agents. The ``alive`` field shows ``:-)`` if the agent reported its state within the period defined by the ``agent_down_time`` option in the ``neutron.conf`` file. Otherwise the ``alive`` is ``xxx``.
tr_tr: Çıktı, dört ajan için bilgileri gösterir. ``neutron.conf`` dosyasında ``agent_down_time`` seçeneği ile tanımlanmış zaman dilimi içerisinde ajan durumunu raporlarsa ``alive`` alanı ``:-)`` gösterir. Diğer türlü ``alive``, ``xxx``dir.

source: The output shows that the entry allows the action ``access_as_shared`` on object ``84a7e627-573b-49da-af66-c9a65244f3ce`` of type ``network`` to target_tenant ``*``, which is a wildcard that represents all projects.
id: Output menunjukkan bahwa entri menizinkan tindakan ``access_as_shared`` on object ``84a7e627-573b-49da-af66-c9a65244f3ce`` dari tipe ``network`` ke target_tenant ``*``, merupakan wildcard yang mewakili semua proyek.
tr_tr: Çıktı, tüm projeleri gösteren simge olan target_tenant ``*``a ``network`` türünün ``84a7e627-573b-49da-af66-c9a65244f3ce`` nesnesi üzerinde ``access_as_shared`` hareketine izin veren girdiyi gösterir.

source: The physical network infrastructure (1) forwards the packet to the provider physical network interface (2).
id: Infrastruktur jaringan fisik (1) meneruskan paket ke provider physical network interface (2).
tr_tr: Fiziksel ağ altyapısı (1) paketi sağlayıcı fiziksel ağ arayüzüne iletir (2).

source: The physical network interface (12) forwards the packet to the OVS provider bridge provider network port (13).
id: Physical network interface (12) meneruskan paket ke OVS provider bridge provider network port (13).
tr_tr: Fiziksel ağ arabirimi (12) pakeri OVS sağlayıcı köprü sağlayıcı ağı bağlantı noktasına (13) iletir.

source: The physical network interface (12) removes VLAN tag 102 from the packet and forwards it to the VLAN sub-interface port (13) on the provider bridge.
id: Physical network interface (12) menghapus VLAN tag 102 dari paket dan meneruskannya ke VLAN sub-interface port (13) di provider bridge.
tr_tr: Fiziksel ağ arabirimi (12), VLAN etiketini (102) paketten kaldırır ve onu sağlayıcı köprüsündeki VLAN alt arabirim bağlantı noktasına (13) iletir.

source: The physical network interface (14) for the VXLAN interface sends the packet to the compute node via the overlay network (15).
id: Antarmuka jaringan fisik (14) untuk antarmuka VXLAN mengirimkan paket ke node komputasi melalui jaringan overlay (15).
tr_tr: VXLAN arabirimi için fiziksel ağ arabirimi (14), paketin yer paylaşım ağı (15) üzerinden hesaplama düğümüne gönderir.

source: The physical network interface (16) forwards the packet to the OVS provider bridge provider network port (17).
id: Physical network interface (16) meneruskan paket ke OVS provider bridge provider network port (17).
tr_tr: Fiziksel ağ arabirimi (16) paketi OVS sağlayıcı köprü sağlayıcı ağ bağlantı noktasına (17) iletir .

source: The physical network interface (5) adds VLAN tag 101 to the packet and forwards it to the physical network infrastructure switch (6).
id: Antarmuka jaringan fisik (5) menambahkan VLAN tag 101 untuk paket dan meneruskannya ke switch infrastruktur jaringan fisik (6).
tr_tr: Fiziksel ağ arabirimi (5) pakete VLAN etiketi 101 ekler ve onu fiziksel ağ altyapısı anahtarına (6) iletir.

source: The physical network interface (8) removes VLAN tag 101 from the packet and forwards it to the VLAN sub-interface port (9) on the provider bridge.
id: Antarmuka jaringan fisik (8) menghapus VLAN tag 101 dari paket dan meneruskannya ke VLAN sub-interface port (9) pada provider bridge.
tr_tr: Fiziksel ağ arabirimi (8) VLAN 101 etiketini paketten kaldırır ve onu sağlayıcı köprüsündeki VLAN alt arabirim bağlantı noktasına (9) iletir.

source: The physical network interface forwards the packet to the Internet via physical network infrastructure (23).
id: Physical network interface meneruskan paket ke Internet melalui physical network infrastructure (23).
tr_tr: Fiziksel ağ arabirimi paketi fiziksel ağı altyapısıyla Internet'e iletir (23).

source: The physical network interface forwards the packet to the physical network infrastructure switch (10).
id: Physical network interface meneruskan paket ke physical network infrastructure switch (10).
tr_tr: Fiziksel ağ arabirimi paketi fiziksel ağ altyapısı anahtarına iletir (10).

source: The port chain plug-in supports backing service providers including the OVS driver and a variety of SDN controller drivers. The common driver API enables different drivers to provide different implementations for the service chain path rendering.
id: Plug-in rantai port mendukung penyokong penyedia layanan termasuk driver OVS dan berbagai driver kontroler SDN. Driver umum API mengaktifkan driver yang lain untuk memberikan implementasi yang berbeda untuk rantai layanan path rendering.
tr_tr: Bağlantı zinciri eklentisi, OVS sürücüsü ve çeşitli SDN kontrolör sürücüleri de dahil olmak üzere destek hizmetleri sağlayıcılarını desteklemektedir. Ortak sürücü API'sı, farklı sürücülerin servis zinciri yolu işleme için farklı uygulamaları sunmalarını sağlar.

source: The port's ``dns_assignment`` attribute shows that its FQDN is ``my-vm.example.org.`` in the Networking service internal DNS, which is the result of concatenating the port's ``dns_name`` with the value configured in the ``dns_domain`` parameter in ``neutron.conf``, as explained previously.
id: Atribut ``dns_assignment`` port menunjukkan bahwa FQDN nya adalah ``my-vm.example.org.`` dalam layanan Jaringan DNS internal, yang merupakan hasil dari penggabungan ``dns_name`` port dengan nilai yang dikonfigurasi dalam yang parameter ``dns_domain`` di ``neutron.conf``, seperti yang dijelaskan sebelumnya.
tr_tr: Bağlantı noktasının ``dns_assignment`` özniteliği, bağlantı noktasının ``dns_name`` değerini yapılandırılmış değerle birleştirmenin sonucu olan Ağ Hizmeti iç DNS'sinde, onun FQDN'sinin ``my-vm.example.org.`` olduğunu gösterir. Daha önce açıklandığı gibi, ``neutron.conf``'daki ``dns_domain`` parametresi.

source: The port's data was visible in the DNS service as soon as it was created.
id: Data milk port terlihat di layanan DNS segera setelah dibuat.
tr_tr: Bağlantı noktası verileri, oluşturulduğu anda DNS hizmetinde görülebilir.

source: The prefix delegation mechanism then sends a request via the external network to your prefix delegation server, which replies with the delegated prefix. The subnet is then updated with the new prefix, including issuing new IP addresses to all ports:
id: Mekanisme prefix delegation kemudian mengirimkan permintaan melalui jaringan eksternal ke server prefix delegation Anda, yang menjawab dengan delegated prefix. Subnet tersebut kemudian diperbarui dengan prefix baru, termasuk menerbitkan alamat IP baru untuk semua port:
tr_tr: Önek temsilci mekanizması, dış ağ üzerinden, temsilci öneki ile yanıt veren önek temsilci sunucusuna bir istek gönderir. Alt ağ, daha sonra, tüm bağlantı noktalarına yeni IP adresleri verilmesi de dahil olmak üzere yeni önek ile güncellenir:

source: The provider bridge forwards the packet to the self-service router gateway port on the provider network (5).
id: Provider bridge meneruskan paket ke self-service router gateway port pada jaringan provider (5).
tr_tr: Sağlayıcı köprüsü paketi sağlayıcı ağı üzerindeki self servis yönlendirici ağ geçidi bağlantı noktasına iletir (5).

source: The provider bridge instance port (11) forwards the packet to the instance 2 interface (12) via ``veth`` pair.
id: Provider bridge instance port (11) meneruskan paket ke instance 2 interface (12) melalui pasangan ``veth``.
tr_tr: Sağlayıcı köprü, sunucu bağlantı noktası (11), paketi ``veth`` çifti aracılığıyla sunucu 2 arabirimine (12) iletir.

source: The provider bridge instance port (15) forwards the packet to the instance 2 interface (16) via ``veth`` pair.
id: Provider bridge instance port (15) meneruskan paket ke instance 2 interface (16) melalui pasangan ``veth``.
tr_tr: Sağlayıcı köprü sunucu bağlantı noktası (15), paketi "veth" çifti aracılığıyla sunucu 2 arabirimine (16) iletir.

source: The provider networks architecture example provides layer-2 connectivity between instances and the physical network infrastructure using VLAN (802.1q) tagging. It supports one untagged (flat) network and and up to 4095 tagged (VLAN) networks. The actual quantity of VLAN networks depends on the physical network infrastructure. For more information on provider networks, see :ref:`intro-os-networking-provider`.
id: Contoh arsitektur jaringan provider memberikan konektivitas lapisan-2 antar instance dan infrastruktur jaringan fisik dengan menggunakan VLAN (802.1q) tagging. Arsitektur ini mendukung satu jaringan untagged (flat) dan dan jaringan tagged (VLAN) sampai 4095. Jumlah sebenarnya dari jaringan VLAN tergantung pada infrastruktur jaringan fisik. Untuk informasi lebih lanjut tentang jaringan provider, lihat :ref:`intro-os-networking-provider`.
tr_tr: Sağlayıcı ağı mimarisi örneği, VLAN (802.1q) etiketleme kullanarak sunucular ve fiziksel ağ altyapısı arasında katman-2 bağlantısı sağlar. Bir etiketsiz (düz) ağı ve 4095 etiketli (VLAN) ağı destekler. Gerçek VLAN ağlarının miktarı fiziksel ağ altyapısına bağlıdır. Sağlayıcı ağları hakkında daha fazla bilgi için :ref:`intro-os-networking-provider`.

source: The provider physical network interface (14) adds VLAN tag 101 to the packet and forwards it to the Internet via physical network infrastructure (15).
id: Provider physical network interface (14) menambahkan VLAN tag 101 untuk paket dan meneruskannya ke Internet melalui infrastruktur jaringan fisik (15).
tr_tr: Sağlayıcı fiziksel ağ arabirimi (14) pakete VLAN 101 etiketi ekler ve bunu fiziksel ağ altyapısı (15) yoluyla İnternet'e iletir.

source: The provider physical network interface forwards the packet to the OVS provider bridge provider network port (3).
id: Provider physical network interface meneruskan paket ke OVS provider bridge provider network port (3).
tr_tr: Sağlayıcı fiziksel ağ arabirimi paketi OVS sağlayıcı köprü sağlayıcısı ağ bağlantı noktasına iletir (3).

source: The provider physical network interface removes VLAN tag 101 and forwards the packet to the VLAN sub-interface on the provider bridge.
id: Antarmuka jaringan fisik provider menghapus VLAN tag 101 dan meneruskan paket ke sub-interface VLAN pada provider bridge.
tr_tr: Sağlayıcı fiziksel ağ arabirimi VLAN etiketi 101'i kaldırır ve paketi sağlayıcı köprüsündeki VLAN alt arabirimine iletir.

source: The purpose of VXLAN is to provide scalable network isolation. VXLAN is a Layer 2 overlay scheme on a Layer 3 network. It allows an overlay layer-2 network to spread across multiple underlay layer-3 network domains. Each overlay is termed a VXLAN segment. Only VMs within the same VXLAN segment can communicate.
id: Tujuan dari VXLAN adalah untuk memberikan isolasi jaringan scalable. VXLAN adalah skema overlay Layer 2 pada jaringan Layer 3. Hal ini mengizinkan jaringan lapisan-2 overlay untuk tersebar di beberapa domain jaringan lapisan-3 yang mendasarinya. Setiap overlay disebut segmen VXLAN. Hanya VM dalam segmen VXLAN yang sama dapat berkomunikasi.
tr_tr: VXLAN'ın amacı ölçeklenebilir ağ izolasyonu sağlamaktır. VXLAN, Katman 3 ağında Katman 2 yer paylaşım şemasıdır. Bir yer paylaşımlı katman-2 ağının birden fazla destek katman-3 ağ alanına yayılmasına izin verir. Her bir yer paylaşımı bir VXLAN segmenti olarak adlandırılır. Yalnızca aynı VXLAN segmentindeki VM'ler iletişim kurabilir.

source: The purpose of this page is to describe how to enable SR-IOV functionality available in OpenStack (using OpenStack Networking). This functionality was first introduced in the OpenStack Juno release. This page intends to serve as a guide for how to configure OpenStack Networking and OpenStack Compute to create SR-IOV ports.
id: Tujuan dari halaman ini adalah untuk menjelaskan cara mengaktifkan fungsi SR-IOV yang tersedia di OpenStack (menggunakan OpenStack Networking). Fungsi ini pertama kali diperkenalkan di rilis OpenStack Juno. Halaman ini bermaksud untuk membantu sebagai panduan untuk mengetahui cara bagaimana mengkonfigurasi OpenStack Networking dan OpenStack Compute untuk membuat port SR-IOV.
tr_tr: Bu sayfanın amacı, OpenStack'da (OpenStack Ağ Kullanımı) kullanılabilen SR-IOV işlevselliğini nasıl etkinleştireceğinizi açıklamaktır. Bu işlevsellik ilk olarak OpenStack Juno sürümünde tanıtıldı. Bu sayfa, SR-IOV portları oluşturmak için OpenStack Networking ve OpenStack Compute'yi nasıl yapılandıracağınız konusunda bir rehber görevi görmeyi amaçlamaktadır.

source: The router contains an interface on the self-service subnet and a gateway on the external network.
id: Router berisi sebuah antarmuka pada subnet self-service dan gateway pada jaringan eksternal.
tr_tr: Yönlendirici, self servis alt ağda bir arabirim ve harici ağda bir ağ geçidi içerir.

source: The router forwards the packet to the OVS integration bridge port for self-service network 2 (18).
id: Router meneruskan paket ke OVS integration bridge port untuk self-service network 2 (18).
tr_tr: Yöneltici, paketin self servis ağı 2 için OVS entegrasyon köprü portuna iletilmesini sağlar (18).

source: The router forwards the packet to the OVS integration bridge port for the provider network (18).
id: Router meneruskan paket ke OVS integration bridge port untuk jaringan provider (18).
tr_tr: Yöneltici paketi sağlayıcı ağı için OVS entegrasyon köprü portuna iletir (18).

source: The router forwards the packet to the OVS integration bridge port for the self-service network (11).
id: Router meneruskan paket ke OVS integration bridge port untuk jaringan self-service (11).
tr_tr: Yöneltici, paketi kendi kendine hizmet ağı için OVS entegrasyon köprüsü portuna iletir (11).

source: The router forwards the packet to the OVS integration bridge port for the self-service network (9).
id: Router meneruskan paket ke OVS integration bridge port untuk jaringan self-service (9).
tr_tr: Yöneltici, paketi kendi kendine hizmet ağı için OVS entegrasyon köprü portuna iletir (9).

source: The router forwards the packet to the provider bridge router port (12).
id: Router meneruskan paket ke provider bridge router port (12).
tr_tr: Yönlendirici, paketi, sağlayıcı köprü yönlendiricisi bağlantı noktasına iletir (12).

source: The router forwards the packet to the self-service bridge router port (7).
id: Router meneruskan paket ke self-service bridge router port (7).
tr_tr: Yöneltici, paketi self-servis köprü yönlendirici bağlantı noktasına iletir (7).

source: The router forwards the packet to the self-service network 2 bridge router port (12).
id: Router meneruskan paket ke self-service network 2 bridge router port (12).
tr_tr: Yöneltici, paketin self-servis ağı 2 köprü yönlendirici bağlantı noktasına iletilmesini sağlar (12).

source: The router forwards the packet to the switch (10).
id: Router meneruskan paket ke switch (10).
tr_tr: Yönlendirici paketi switch'e (10) yönlendirir.

source: The router forwards the packet to the switch (14).
id: Router meneruskan paket ke switch (14).
tr_tr: Yönlendirici paketi switch'e yönlendirir (14).

source: The router performs DNAT on the packet which changes the destination IP address to the instance IP address on the self-service network via the self-service network interface (10).
id: Router melakukan DNAT pada paket yang mengubah alamat IP tujuan ke alamat IP instance di jaringan self-service melalui antarmuka jaringan self-service (10).
tr_tr: Yöneltici paket üzerinde hedef IP adresini self servis ağ arabirimi (10) üzerinden self servis ağdaki örnek IP adresine değiştiren DNAT'yi gerçekleştirir.

source: The router routes the packet from provider network 1 (12) to provider network 2 (13).
id: Router me-rute paket dari provider network 1 (12) ke provider network 2 (13).
tr_tr: Yöneltici, paketi, sağlayıcı ağı 1'den (12) sağlayıcı ağı 2'ye (13) yönlendirir.

source: The router routes the packet from provider network 1 (8) to provider network 2 (9).
id: Router me-rute paket dari provider network 1 (8) ke provider network 2 (9).
tr_tr: Yöneltici paketi sağlayıcı ağı 1'den (8) sağlayıcı ağı 2'ye (9) yönlendirir.

source: The router routes the packet from the provider network (12) to the external network (13) and forwards the packet to the switch (14).
id: Router me-rute paket dari provider network (12) ke external network (13) dan meneruskan paket ke switch (14).
tr_tr: Yönlendirci, pakeri sağlayıcı ağdan (12) harici ağa (13) gönderir ve paketi switch'e (14) gönderir.

source: The router routes the packet from the provider network (8) to the external network (9) and forwards the packet to the switch (10).
id: Router me-rute paket dari jaringan operator (8) ke jaringan eksternal (9) dan meneruskan paket ke switch (10).
tr_tr: Yönlendirici, paketin sağlayıcı ağından (8) harici ağı (9) yönlendirir ve paketi switch'e (10) iletir.

source: The router sends the packet to the next-hop IP address, typically the gateway IP address on self-service network 2, via the self-service network 2 interface (11).
id: Router mengirimkan paket ke alamat IP hop berikutnya (next-hop), biasanya alamat IP gateway pada self-service network 2, melalui self-service network 2 interface (11).
tr_tr: Yöneltici paketi, self-servis ağı 2 arabirimi (11) üzerinden bir sonraki atlamalı IP adresine, genelde self-servis ağı 2'deki ağ geçidi IP adresine gönderir.

source: The router sends the packet to the next-hop IP address, typically the gateway IP address on self-service network 2, via the self-service network 2 interface (17).
id: Router mengirimkan paket ke alamat IP next-hop, biasanya alamat IP gateway pada self-service network 2, melalui self-service network 2 interface (17).
tr_tr: Yöneltici paketi, self-servis ağı 2 arabirimi (17) üzerinden bir sonraki durak IP adresine, genelde self servis ağı 2 üzerindeki ağ geçidi IP adresine gönderir.

source: The router with the floating IP address binding contains a gateway on an external network with the BGP speaker association.
id: Router dengan alamat IP mengambang yang terikat berisi gateway pada jaringan eksternal dengan asosiasi BGP speaker.
tr_tr: Yüzen IP adres bağlama özelliğine sahip yönlendirici, harici bir ağda BGP tanıtımı birliği bulunan bir ağ geçidi içerir.

source: The same can explicitly be accomplished by a user with administrative credentials setting the flags in the :command:`neutron router-create` command:
id: Hal yang sama dapat secara eksplisit dicapai oleh pengguna dengan kredensial administratif pengaturan flag di perintah :command:`neutron router-create`:
tr_tr: Aynı şey, açıkça, şu komutu çalıştıran yönetici kimlik bilgileri olan bir kullanıcı tarafından gerçekleştirilebilir :command:`neutron router-create` command:

source: The same neutron commands are used for LBaaS v2 with an agent or with Octavia.
id: Perintah neutron yang sama digunakan untuk LBaaS v2 dengan agen atau dengan Octavia.
tr_tr: LBaaS v2 için bir ajan veya Octavia ile aynı neutron komutları kullanılır.

source: The second branch is called contract and is used to store those migration rules that are not safe to apply while Neutron server is running.
id: Cabang kedua disebut kontrak dan digunakan untuk menyimpan aturan-aturan migrasi yang tidak aman untuk menerapkannya ketika Neutron server berjalan.
tr_tr: İkinci dala sözleşme denir ve Neutron sunucusu çalışırken uygulanması güvenli olmayan bu geçiş kurallarını saklamaya yarar.

source: The security group bridge OVS port (4) forwards the packet to the OVS integration bridge security group port (5) via ``veth`` pair.
id: Security group bridge OVS port (4) meneruskan paket ke OVS integration bridge security group port (5) melalui pasangan ``veth``.
tr_tr: Güvenlik grubu köprüsü OVS portu (4), paketin ``veth`` çifti aracılığıyla OVS entegrasyon köprü güvenlik grubu portuna (5) iletilmesini sağlar.

source: The security group bridge instance port (15) forwards the packet to the instance interface (16) via ``veth`` pair.
id: Security group bridge instance port (15) meneruskan paket ke instance interface (16) melalui pasangan ``veth``.
tr_tr: Güvenlik grubu köprü örneği bağlantı noktası (15), paketi ``veth`` çifti aracılığıyla sunucu arabirimine (16) iletir.

source: The security group bridge instance port (18) forwards the packet to the instance 2 interface (19) via ``veth`` pair.
id: Security group bridge instance port (18) meneruskan paket ke instance 2 interface (19) melalui pasangan ``veth``.
tr_tr: Güvenlik grubu köprü sunucu portu (18) paketi ``veth`` çifti vasıtasıyla sunucu 2 arabirimine (19) iletir.

source: The security group bridge instance port (19) forwards the packet to the instance 2 interface (20) via ``veth`` pair.
id: Security group bridge instance port (19) meneruskan paket ke instance 2 interface (20) melalui pasangan ``veth``.
tr_tr: Güvenlik grubu köprü sunucu portu (19) paketi ``veth`` çifti vasıtasıyla sunucu 2 arabirimine (20) iletir.

source: The security group bridge instance port (22) forwards the packet to the instance 2 interface (23) via ``veth`` pair.
id: Security group bridge instance port (22) meneruskan paket ke instance 2 interface (23 melalui pasangan ``veth``.
tr_tr: Güvenlik grubu köprü örneği bağlantı noktası (22), paketi ``veth`` çifti vasıtasıyla örnek 2 arabirimine (23) iletir.

source: The security group bridge instance port (22) forwards the packet to the instance interface (23) via ``veth`` pair.
id: Security group bridge instance port (22) meneruskan paket ke instance interface (23) melalui pasangan ``veth``.
tr_tr: Güvenlik grubu köprü sunucu portu (22) paketi ``veth`` çifti aracılığıyla sunucu arabirimine (23) iletir.

source: The security group bridge instance port (23) forwards the packet to the instance 2 interface (24) via ``veth`` pair.
id: Security group bridge instance port (23) meneruskan paket ke instance 2 interface (24) melalui pasangan ``veth``.
tr_tr: Güvenlik grubu köprü sunucu bağlantı noktası (23), paketi ``veth`` çifti aracılığıyla sunucu 2 arabirimine (24) iletir.

source: The security group bridge instance port (31) forwards the packet to the instance interface (32) via ``veth`` pair.
id: Security group bridge instance port (31) meneruskan paket ke instance interface (32) melalui pasangan ``veth``.
tr_tr: Güvenlik grubu köprü sunucusu bağlantı noktası (31), paketi ``veth`` çifti aracılığıyla sunucu arabirimine (32) iletir.

source: The self-service bridge forwards the packet to the VXLAN interface (4) which wraps the packet using VNI 101.
id: Self-service bridge meneruskan paket ke antarmuka VXLAN (4) yang membungkus paket menggunakan VNI 101.
tr_tr: Self servis köprü, paketi VNI 101'i kullanarak paketini saran VXLAN arabirimine (4) iletir.

source: The self-service bridge forwards the packet to the VXLAN interface (8) which wraps the packet using VNI 101.
id: Jembatan self-service meneruskan paket ke interface VXLAN (8) yang membungkus paket menggunakan VNI 101.
tr_tr: Self servis köprü, paketi VNI 101 kullanarak paketi saran VXLAN arabirimine iletir (8).

source: The self-service bridge instance port (10) forwards the packet to the instance 1 interface (11) via ``veth`` pair.
id: Self-service bridge instance port (10) meneruskan paket ke instance 1 interface (11) melalui pasangan ``veth``.
tr_tr: Self servis köprü sunucu portu (10), paketi ``veth` çifti vasıtasıyla sunucu 1 arabirimine (11) iletir.

source: The self-service bridge instance port (14) forwards the packet to the instance interface (15) via ``veth`` pair.
id: Self-service bridge instance port (14) meneruskan paket ke instance interface (15) melalui pasangan ``veth``.
tr_tr: Self servis köprü sunucu bağlantı noktası (14) paketi ``veth`` çifti aracılığıyla örnek arabirimine (15) iletir.
