Repository: 25hours/openstack-manuals
Catalog: doc/networking-guide/source/locale/*/LC_MESSAGES/networking-guide.po
Languages: id, tr_tr

source: ``admin_auth_url``: the Identity service admin authorization endpoint url. This endpoint will be used by the Networking service to authenticate as an admin user to create and update reverse lookup (PTR) zones.
id: ``admin_auth_url``: admin authorization endpoint url layanan Identity. Endpoint ini akan digunakan oleh layanan Networking untuk mengotentikasi sebagai user admin membuat dan memperbarui zona reverse lookup (PTR).
tr_tr: ``admin_auth_url``: Kimlik hizmeti yönetici yetkilendirme uç nokta url'i. Bu uç nokta, geriye dönük arama (PTR) bölgelerini oluşturmak ve güncellemek için bir yönetici kullanıcısı olarak kimlik doğrulaması yapmak için Ağ Hizmeti tarafından kullanılacaktır.

source: ``admin_password``: the password of the admin user to be used by Networking service to create and update reverse lookup (PTR) zones.
id: ``admin_password``: password dari user admin untuk digunakan oleh layanan Networking membuat dan memperbarui zona reverse lookup (PTR).
tr_tr: ``admin_password``: Geriye doğru arama (PTR) bölgelerini oluşturmak ve güncellemek için Ağ hizmeti tarafından kullanılacak yönetici kullanıcısının parolası.

source: ``admin_tenant_name``: the project of the admin user to be used by the Networking service to create and update reverse lookup (PTR) zones.
id: ``admin_tenant_name``: proyek user admin untuk digunakan oleh layanan Networking membuat dan memperbarui zona reverse lookup (PTR).
tr_tr: ``admin_tenant_name``: Geriye dönük arama (PTR) bölgelerini oluşturmak ve güncellemek için Ağ servisi tarafından kullanılacak yönetici kullanıcısının projesi.

source: ``admin_username``: the admin user to be used by the Networking service to create and update reverse lookup (PTR) zones.
id: ``admin_username``: user admin yang digunakan oleh layanan Networking membuat dan memperbarui reverse zona lookup (PTR).
tr_tr: ``admin_username``: geriye doğru arama (PTR) bölgelerini oluşturmak ve güncellemek için Ağ hizmeti tarafından kullanılacak yönetici kullanıcısı.

source: ``allow_reverse_dns_lookup``: a boolean value specifying whether to enable or not the creation of reverse lookup (PTR) records.
id: ``allow_reverse_dns_lookup``: nilai boolean yang menspesifikasi apakah mengaktifkan atau tidak mengaktifkan pembuatan reverse lookup (PTR) record.
tr_tr: ``allow_reverse_dns_lookup``: Geriye doğru arama (PTR) kayıtlarının oluşturulup oluşturulmayacağını belirten bir ikilik değer.

source: ``cafile``: Path to a valid Certificate Authority (CA) certificate.
tr_tr: ``cafile``: Geçerli bir Sertifika Otoritesi (CA) sertifikasına giden yol.

source: ``chain_parameters`` - Dictionary of chain parameters
tr_tr: ``chain_parameters`` - Zincir parametreleri sözlüğü

source: ``description`` - Readable description
tr_tr: ``açıklama`` - Okunabilir açıklama

source: ``destination_ip_prefix`` - Destination IP address or prefix
tr_tr: ``destination_ip_prefix`` - Hedef IP adres veya önek

source: ``destination_port_range_max`` - Maximum destination protocol port
tr_tr: ``destination_port_range_max`` - En fazla hedef protokol bağlantı noktası

source: ``destination_port_range_min`` - Minimum destination protocol port
tr_tr: ``destination_port_range_min`` - En küçük hedef protokol bağlantı noktası

source: ``egress`` - Egress port
tr_tr: ``egress`` - Çıktı bağlantı noktası

source: ``ethertype`` - Ethertype (IPv4/IPv6)
tr_tr: ``ethertype`` - Eternet türü (IPv4/IPv6)

source: ``flow_classifiers`` - List of flow classifier IDs
tr_tr: ``flow_classifiers`` - Akış sınıflandırıcı IDler listesi

source: ``id`` - Flow classifier ID
tr_tr: ``id`` - Akış sınıflandırıcı ID

source: ``id`` - Port chain ID
tr_tr: ``id`` - Bağlantı noktası zinciri ID'si

source: ``id`` - Port pair ID
tr_tr: ``id`` - Bağlantı noktası çifti ID'si

source: ``id`` - Port pair group ID
tr_tr: ``id`` - Bağlantı noktası çifti grup ID'si

source: ``iface`` The name of the network interface on which to listen for prefix delegation messages.
id: `` Iface``, nama antarmuka jaringan untuk mendengarkan pesan awalan delegasi.
tr_tr: ``iface`` önek yetkilendirme mesajlarının dinlenildiği ağ arabiriminin adı.

source: ``ingress`` - Ingress port
tr_tr: ``ingress`` - Giriş bağlantı noktası

source: ``insecure``: Disable SSL certificate validation. By default, certificates are validated.
id: ``insecure``: Menonaktifkan validasi sertifikat SSL. Secara default, sertifikat divalidasi.
tr_tr: ``insecure``: SSL sertifikası doğrulamasını devre dışı bırakın. Varsayılan olarak, sertifikalar doğrulanır.

source: ``ipv4_ptr_zone_prefix_size``: the size in bits of the prefix for the IPv4 reverse lookup (PTR) zones.
id: ``ipv4_ptr_zone_prefix_size``: ukuran dalam bit dari awalan (prefix) untuk zona IPv4 reverse lookup (PTR).
tr_tr: ``ipv4_ptr_zone_prefix_size``: IPv4 geriye doğru arama (PTR) bölgeleri için önekin bit büyüklüğü.

source: ``ipv6_address_mode``: Determines how instances obtain IPv6 address, default gateway, or optional information.
id: ``Ipv6_address_mode``: Menentukan bagaimana instance mendapatkan alamat IPv6, gateway default, atau informasi opsional.
tr_tr: ``ipv6_address_mode``: Örneklerin IPv6 adresini, varsayılan ağ geçidi veya isteğe bağlı bilgileri nasıl elde ettiğini belirler.

source: ``ipv6_ptr_zone_prefix_size``: the size in bits of the prefix for the IPv6 reverse lookup (PTR) zones.
id: ``ipv6_ptr_zone_prefix_size``: ukuran dalam bit dari awalan (prefix) untuk zona IPv6 reverse lookup (PTR).
tr_tr: ``ipv6_ptr_zone_prefix_size``: IPv6 ters arama (PTR) bölgeleri için önekin bit cinsinden boyutu.

source: ``ipv6_ra_mode``: Determines who sends RA.
id: `` Ipv6_ra_mode``: Menentukan siapa yang mengirimkan RA.
tr_tr: ``ipv6_ra_mode``: RA'yi kimin gönderdiğini belirler.

source: ``l7_parameters`` - Dictionary of L7 parameters
tr_tr: ``l7_parameters`` - L7 parametreleri sözlüğü

source: ``logical_destination_port`` - Destination port
tr_tr: ``logical_destination_port`` - Hedef bağlantı noktası

source: ``logical_source_port`` - Source port
tr_tr: ``logical_source_port`` - Kaynak bağlantı noktası

source: ``name`` - Readable name
tr_tr: ``isim`` - Okunabilir isim

source: ``pd-length`` The length that delegated prefixes will be. This must be 64 to work with the current OpenStack Networking reference implementation.
id: `` Pd-length`` Panjang dimana prefiks akan mendelegasikan. Ini harus menjadi 64 untuk bekerja dengan implementasi referensi OpenStack Networking saat ini.
tr_tr: ``pd-length`` Temsil edilen öneklerin uzunluğu. Mevcut OpenStack Networking referans uygulamasıyla çalışmak için bu 64 olmalıdır.

source: ``pd-pool`` The larger prefix from which you want your delegated prefixes to come. The example given is sufficient if you do not need external network access, otherwise a unique globally routable prefix is necessary.
id: ``pd-pool``, prefiks yang lebih besar dari mana Anda ingin prefiks Anda didelegasikan untuk datang. Contoh yang diberikan ini sudah cukup jika Anda tidak memerlukan akses jaringan eksternal, jika tidak prefix routable global yang unik ini diperlukan.
tr_tr: ``pd-pool`` Temsilci öneklerinizin gelmesini istediğiniz daha büyük önek. Verilen örnek, harici ağ erişimine ihtiyacınız yoksa yeterlidir, aksi takdirde benzersiz bir genel yönlendirilebilir önek gereklidir.

source: ``port_pair_groups`` - List of port pair group IDs
tr_tr: ``port_pair_groups`` - Bağlantı noktası çifti grup IDleri listesi

source: ``port_pairs`` - List of service function port pairs
tr_tr: ``port_pairs`` - Servis fonksiyonu bağlantı noktası çifti listesi

source: ``protocol`` - IP protocol
tr_tr: ``protokol`` - IP protokolü

source: ``script`` Points to a script to be run when a prefix is delegated or released. This is only needed if you want instances on your subnets to have external network access. More on this below.
id: ``script``, poin untuk script untuk dijalankan ketika awalan didelegasikan atau dilepaskan. Ini hanya diperlukan jika Anda ingin instance pada subnet Anda untuk memiliki akses jaringan eksternal. Lebih di bawah ini.
tr_tr: ``script`` Bir önek devredildiğinde veya serbest bırakıldığında çalıştırılacak bir betiğe işaret eder. Bu yalnızca, alt ağlarınızdaki örneklerin harici ağ erişimine sahip olmasını istiyorsanız gereklidir. Bu konuda daha fazlası aşağıda.

source: ``service_function_parameters`` - Dictionary of service function parameters
tr_tr: ``service_function_parameters`` - Servis fonksiyon parametreleri sözlüğü

source: ``source_ip_prefix`` - Source IP address or prefix
tr_tr: ``source_ip_prefix`` - Kaynak IP adres veya önek

source: ``source_port_range_max`` - Maximum source protocol port
tr_tr: ``source_port_range_max`` - En büyük kaynak protokol bağlantı noktası

source: ``source_port_range_min`` - Minimum source protocol port
tr_tr: ``source_port_range_min`` - En küçük kaynak protokol bağlantı noktası

source: ``tenant_id`` - Project ID
tr_tr: ``tenant_id`` - Proje ID

source: ``url``: the OpenStack DNS service public endpoint URL.
id: ``url``: URL endpoint publik layanan DNS OpenStack.
tr_tr: ``url``: OpenStack DNS hizmeti genele açık uç nokta URL'i.

source: ``vhost-user`` requires file descriptor-backed shared memory. Currently, the only way to request this is by requesting large pages. This is why instances spawned on hosts with OVS-DPDK must request large pages. The aggregate flavor affinity filter can be used to associate flavors with large page support to hosts with OVS-DPDK support.
id: ``vhost-user`` membutuhkan memori bersama descriptor-backed file. Saat ini, satu-satunya cara untuk meminta ini dengan meminta halaman besar. Inilah sebabnya mengapa instance melahirkan pada host dengan OVS-DPDK harus meminta halaman besar. Filter afinitas flavor agregat dapat digunakan untuk mengasosiasikan flavor dengan dukungan halaman besar untuk host dengan dukungan OVS-DPDK.
tr_tr: ``vhost-user``, dosya tanımlayıcı-destekli paylaşımlı belleğe ihtiyaç duyar. Şimdilik, bunu talep etmenin tek yolu büyük sayfalar talep etmektir. OVS-DPDK'ya sahip ana makinelerde üretilen örneklerin büyük sayfalar talep etmeleri nedenidir. Toplu flavor afinite filtresi flavorları büyük sayfa desteği ile OVS-DPDK desteği olan ana makinelerle ilişkilendirmek için kullanılabilir.

source: a Linux bridge named ``virbr0`` with an IP address of ``192.0.2.1/24``
tr_tr: Bir ``192.0.2.1/24`` IP adresli ``virbr0`` isimli Linux köprüsü

source: a dnsmasq process that listens on the ``virbr0`` interface and hands out IP addresses in the range ``192.0.2.2-192.0.2.254``
tr_tr: ``virbr0`` arayüzünü dinleyen ve ``192.0.2.2-192.0.2.254`` aralığındaki IP adreslerini veren bir dnsmasq işlemi.

source: a set of iptables rules
id: Seperangkat aturan iptables
tr_tr: Bir grup iptables kuralı

source: availability zone candidates for the resource
id: Calon zona ketersediaan untuk sumber
tr_tr: kaynak için kullanılabilirlik bölgesi adayları

source: availability zones for the resource
id: Zona ketersediaan untuk sumber
tr_tr: kaynak için kullanılabilirlik alanları

source: classless inter-domain routing (CIDR)
tr_tr: sınıfsız alanlar arası yönlendirme (CIDR)

source: dependencies.
id: ketergantungan.
tr_tr: bağımlılıklar.

source: dnsmasq for providing IP addresses to virtual machines using DHCP
id: dnsmasq untuk menyediakan alamat IP untuk mesin virtual menggunakan DHCP
tr_tr: DHCP kullanarak sanal makinelere IP adresi sağlamak için dnsmasq

source: dotted quad
tr_tr: noktalı dörtlü

source: iptables to implement SNAT so instances can connect out to the public internet, and to ensure that virtual machines are permitted to communicate with dnsmasq using DHCP
id: iptables untuk melaksanakan SNAT sehingga instance dapat terhubung ke internet publik, dan untuk memastikan bahwa mesin virtual diizinkan untuk berkomunikasi dengan dnsmasq menggunakan DHCP
tr_tr: Sunucuların halka açık internete bağlanabilmesi ve sanal makinelerin dnsmasq ile DHCP ile iletişim kurmasına izin verilmesini sağlamak için SNAT uygulamak için iptables

source: ipv6 address mode
tr_tr: ipv6 adres kipi

source: ipv6 ra mode
tr_tr: ipv6 ra kipi

source: ipv6_ra_mode and ipv6_address_mode combinations
id: Kombinasi ipv6_ra_mode dan ipv6_address_mode
tr_tr: ipv6_ra_mode ve ipv6_address_mode kombinasyonları

source: libvirt network implementation
id: Implementasi jaringan libvirt
tr_tr: libvirt ağ uygulaması

source: list of string
id: daftar string
tr_tr: karakter dizisi listesi

source: network
tr_tr: ağ

source: networks
id: network (jaringan)
tr_tr: ağlar

source: neutron, networking, OpenStack
tr_tr: neutron, ağ, OpenStack

source: neutron-linuxbridge-cleanup utility
id: Utilitas neutron-linuxbridge-cleanup.
tr_tr: neutron-linuxbridge-cleanup yardımcı uygulaması

source: no
tr_tr: hayır

source: ports
id: port
tr_tr: bağlantı noktaları

source: rack 1
tr_tr: raf 1

source: rack 2
tr_tr: raf 2

source: router
tr_tr: yönlendirici

source: routers
id: router
tr_tr: yönlendiriciler

source: segment 1
tr_tr: dilim 1

source: subnet (IPv4)
tr_tr: altağ (IPv4)

source: subnet (IPv6)
tr_tr: altağ (IPv6)

source: subnetpools
id: subnetpool
tr_tr: altağ havuzları

source: subnets
id: subnet
tr_tr: altağlar

source: type driver / mech driver
tr_tr: tür sürücüsü / mekanik sürücü

source: yes
tr_tr: evet

source: Apply the settings by restarting the web server.
id: Terapkan pengaturan dengan me-restart web server.

source: By default, ``enable_firewall`` option value is ``True`` in ``local_settings.py`` file.
id: Secara default, nilai opsi ``enable_firewall`` adalah ``True`` dalam file ``local_settings.py``.

source: Enable the option in the ``local_settings.py`` file, which is typically located on the controller node:
id: Aktifkan opsi dalam file ``local_settings.py``, yang biasanya terletak pada controller node:

source: Firewalls are implemented in various ways, depending on the driver used. For example, an iptables driver implements firewalls using iptable rules. An OpenVSwitch driver implements firewall rules using flow entries in flow tables. A Cisco firewall driver manipulates NSX devices.
id: Firewall diimplementasikan dalam berbagai cara, tergantung pada driver yang digunakan. Sebagai contoh, driver iptables menerapkan firewall menggunakan aturan iptable. Driver OpenVSwitch menerapkan aturan firewall menggunakan entri aliran dalam flow table. Driver firewall Cisco memanipulasi perangkat NSX.

source: For example, ``provider1``, ``VLAN``, and ``2016``. See the `API reference <https://developer.openstack.org/api-ref/networking/v2/#id57>`__ for more information.
id: Sebagai contoh, ``provider1``, ``VLAN``, dan ``2016``. Lihat `API reference <https://developer.openstack.org/api-ref/networking/v2/#id57>`__ untuk informasi lebih lanjut.

source: Setting up an external network is described in `OpenStack Administrator Guide <https://docs.openstack.org/admin-guide/networking-adv-features.html>`_. Assuming the external network to be used for the auto-allocation feature is named ``public``, make it the default external network with the following command:
id: Siapkan jaringan eksternal dijelaskan dalam `OpenStack Administrator Guide <https://docs.openstack.org/admin-guide/networking-adv-features.html>`_. Dengan asumsi jaringan eksternal yang akan digunakan untuk fitur auto-allocation diberi nama ``public``, buat jaringan eksternal default dengan perintah berikut:
