Repository: 25hours/openstack-manuals
Catalog: doc/networking-guide/source/locale/*/LC_MESSAGES/networking-guide.po
Languages: id, tr_tr

source: Begin a continuous ``ping`` of both the floating IPv4 address and IPv6 address of the instance. While performing the next three steps, you should see a minimal, if any, interruption of connectivity to the instance.
id: Mulailah terus menerus ``ping`` dari alamat IPv4 mengambang dan alamat IPv6 dari instance. Sambil melakukan tiga langkah selanjutnya, Anda akan melihat minimal, jika ada, gangguan konektivitas untuk instance.
tr_tr: Sunucudaki değişken IPv4 adresine ve IPv6 adresine sürekli bir ``ping`` atmaya baslayın. Sonraki üç basamağı yerine getirirken, sunucunun bağlantısının kesilmesi gerektiğini görürsünüz.

source: Begin with segments. The Networking service defines a segment using the following components:
id: Mulailah dengan segmen. Layanan Networking mendefinisikan segmen menggunakan komponen berikut:
tr_tr: Segmentlerle başlayın. Ağ hizmeti, aşağıdaki bileşenleri kullanarak bir segment tanımlar:

source: Beginning with Mitaka, a subnet pool can be marked as the default. This is handled with a new extension.
id: Dimulai dengan Mitaka, kolam subnet dapat ditandai sebagai default. Hal ini ditangani dengan ekstensi baru.
tr_tr: Mitaka ile başlayarak, bir alt ağ havuzu varsayılan olarak işaretlenebilir. Bu, yeni bir uzantıyla ele alınır.

source: Binding QoS policies permissions to networks or ports (since Mitaka).
id: Pengikatan izin kebijakan QoS ke jaringan atau port (sejak Mitaka).
tr_tr: Ağlara veya bağlantı noktalarına QoS politikaları izinleri bağlama (Mitaka'dan beri).

source: Boot a VM on ``net2``. Let both DHCP agents host ``net2``. Fail the agents in turn to see if the VM can still get the desired IP.
id: Boot VM pada ``net2``. Biarkan kedua agen DHCP menjadi host ``net2``. Gagal agen pada gilirannya untuk melihat apakah VM masih bisa mendapatkan IP yang diinginkan.
tr_tr: Bir VM'yi ``net2`` üzerinde önyükleyin. Her iki DHCP ajanı da ``net2`` dosyasını barındıracaktır. Aracılar, VM'nin yine de istenen IP'yi alıp alamayacaklarını görmek için başarısız olurlar.

source: Boot a VM on ``net2``:
id: Boot VM pada ``net2``:
tr_tr: Bir VM'yi ``net2`` üzerinden önyükleyin:

source: Boot an instance or alternatively, create a port specifying a valid value to its ``dns_name`` attribute. If the port is going to be used for an instance boot, the value assigned to ``dns_name`` must be equal to the ``hostname`` that the Compute service will assign to the instance. Otherwise, the boot will fail.
id: Boot instance atau alternatifnya, buatlah port yang menetapkan nilai valid untuk atribut ``dns_name``. Jika port tersebut akan digunakan untuk boot instance, nilai yang ditetapkan untuk ``dns_name`` harus sama dengan ``hostname`` dimana layanan Compute akan menetapkan ke instance. Jika tidak, boot akan gagal.
tr_tr: Bir sunucuyu önyükleyin veya alternatif olarak, ``dns_name`` özniteliğinde geçerli bir değer belirten bir bağlantı noktası oluşturun. Bağlantı noktası bir sunucu önyüklemesi için kullanılacaksa, ``dns_name`` öğesine atanan değer, Hesaplama hizmetinin örneğe atadığı ``hostname``e eşit olmalıdır. Aksi takdirde önyükleme başarısız olur.

source: Boot an instance specifying the externally accessible network. Alternatively, create a port on the externally accessible network specifying a valid value to its ``dns_name`` attribute. If the port is going to be used for an instance boot, the value assigned to ``dns_name`` must be equal to the ``hostname`` that the Compute service will assign to the instance. Otherwise, the boot will fail.
id: Boot instance yang menentukan jaringan accessible secara eksternal. Atau, buatlah port pada jaringan accessible secara eksternal yang menentukan nilai yang valid untuk atribut ``dns_name`` nya. Jika port tersebut akan digunakan untuk instance boot, nilai yang diberikan untuk ``dns_name`` harus sama dengan ``hostname`` dimana layanan Compute akan menetapkan ke instance. Jika tidak, boot akan gagal.
tr_tr: Harici olarak erişilebilir ağ belirten bir sunucuyu önyükleyin. Alternatif olarak, harici olarak erişilebilen ağ üzerinde, ``dns_name`` özniteliği için geçerli bir değer belirten bir bağlantı noktası oluşturun. Bağlantı noktası bir sunucu önyüklemesi için kullanılacaksa, ``dns_name`` öğesine atanan değer, Hesaplama hizmetinin sunucuya atadığı ``hostname``ine eşit olmalıdır. Aksi takdirde ön yükleme başarısız olur.

source: Both DHCP agents host the ``net2`` network.
id: Kedua agen DHCP menjadi host jaringan ``net2``.
tr_tr: Her iki DHCP ajanı ``net2`` ağını sunar.

source: Both instances reside on the same compute node to illustrate how VLAN tagging enables multiple logical layer-2 networks to use the same physical layer-2 network.
id: Kedua instance berada pada node komputasi yang sama untuk menggambarkan bagaimana VLAN tagging mengaktifkan beberapa jaringan lapisan-2 logis menggunakan jaringan lapisan-2 fisik yang sama.
tr_tr: Her iki sunucu da aynı hesaplama düğümünde bulunur ve VLAN etiketlemesinin, birden fazla mantıksal katman-2 ağının aynı fiziksel katman-2 ağını nasıl kullanabileceğini açıklamak için kullanılır.

source: Both instances reside on the same compute node to illustrate how VXLAN enables multiple overlays to use the same layer-3 network.
id: Kedua instance berada pada node komputasi yang sama untuk menggambarkan bagaimana VXLAN mengaktifkan beberapa overlays menggunakan jaringanlapisan-3 yang sama.
tr_tr: Her iki sunucu da aynı hesaplama düğümünde bulunur ve VXLAN'ın aynı katman-3 ağını nasıl kullanabileceğini gösterir.

source: Both the Linux bridge and the Open vSwitch dataplane modules support forwarding IPv6 packets amongst the guests and router ports. Similar to IPv4, there is no special configuration or setup required to enable the dataplane to properly forward packets from the source to the destination using IPv6. Note that these dataplanes will forward Link-local Address (LLA) packets between hosts on the same network just fine without any participation or setup by OpenStack components after the ports are all connected and MAC addresses learned.
id: Jembatan Linux dan modul dataplane Open vSwitch mendukung penerusan paket IPv6 di antara guest dan port router. Mirip dengan IPv4, tidak ada konfigurasi khusus atau pengaturan diperlukan untuk mengaktifkan dataplane untuk meneruskan paket dari sumber ke tujuan menggunakan IPv6. Perhatikan bahwa dataplanes ini akan meneruskan paket Link-local Address (LLA) antara host pada jaringan yang sama saja tanpa partisipasi atau setup oleh komponen OpenStack setelah port terhubung semua dan alamat MAC dipelajari.
tr_tr: Hem Linux köprüsü hem de Open vSwitch dataplane modülleri, misafirler ve yönlendirici bağlantı noktaları arasında IPv6 paketlerini iletmeyi desteklemektedir. IPv4'e benzer şekilde, dataplane'nin, IPv6'yı kullanarak kaynaktan hedefe doğru paketleri doğru şekilde iletmesini sağlamak için özel bir yapılandırma veya kurulum gerekli değildir. Bu dataplane'lerin bağlantı noktaları birbirine bağlı olduktan ve MAC adresleri öğrenildikten sonra OpenStack bileşenleri tarafından herhangi bir katılım veya kurulum olmaksızın aynı ağdaki ana bilgisayarlar arasında Bağlantı Yerel Adres (LLA) paketlerini iletirler.

source: Bring up the Networking (l3) nodes. The new routers will have identical MAC+IPs as old Compute gateways so some sort of immediate cutover is possible, except for stateful connections issues such as NAT.
id: Munculkan Networking (l3) node. Router baru akan memiliki MAC+IP identik seperti gateway Compute tua dan juga beberapa jenis immediate cutover memungkinkan, kecuali untuk masalah koneksi stateful seperti NAT.
tr_tr: Ağ (l3) düğümlerini açın. Yeni yönlendiriciler, eski Hesaplama ağ geçitleri ile aynı MAC+IP'lere sahip olacak, bu nedenle NAT gibi durum bilgisi olan bağlantı sorunları hariç, bir tür acil kesim mümkündür.

source: Building an LBaaS v2 load balancer
id: Membangun penyeimbang beban LBaaS v2
tr_tr: LBaaS v2 yük dengeleyici oluşturma

source: Buying guide
id: Panduan membeli
tr_tr: Satın alma rehberi

source: By creating subnets from scoped subnet pools, the network is associated with the address scope.
id: Dengan pembuatan subnet dari kolam subnet terlingkup (scoped), jaringan dikaitkan dengan lingkup alamat.
tr_tr: Kapsamlı alt ağ havuzlarından alt ağlar oluşturarak, ağ adres alanıyla ilişkilendirilir.

source: By default, IPv6 subnets on provider networks rely on physical network infrastructure for stateless address autoconfiguration (SLAAC) and router advertisement.
id: Secara default, subnet IPv6 pada jaringan penyedia bergantung pada infrastruktur jaringan fisik untuk stateless address autoconfiguration (SLAAC) dan router advertisement.
tr_tr: Varsayılan olarak, sağlayıcı ağlarındaki IPv6 alt ağları, stateless adres otomatik yapılandırması (SLAAC) ve yönlendirici reklamı için fiziksel ağ altyapısına dayalıdır.

source: By default, all security groups contain a series of basic (sanity) and anti-spoofing rules that perform the following actions:
id: Secara default, semua kelompok keamanan berisi serangkaian aturan dasar (sanity) dan anti-spoofing yang melakukan tindakan berikut:
tr_tr: Varsayılan olarak, tüm güvenlik grupları, aşağıdaki eylemleri gerçekleştiren bir dizi temel (sanity) ve anti-spoofing kuralları içerir:

source: By default, libvirt creates a network named *default*. The details of this network may vary by distribution; on Ubuntu this network involves:
id: Secara default, libvirt menciptakan jaringan bernama *default*. Rincian jaringan ini mungkin berbeda dengan distribusi; pada Ubuntu jaringan ini melibatkan:
tr_tr: Varsayılan olarak, libvirt *default* adlı bir ağ oluşturur. Bu ağın ayrıntıları dağıtıma göre değişebilir; Ubuntu'da bu ağ şunları içerir:

source: By default, libvirt's networking functionality is enabled, and libvirt creates a network when the system boots. To implement this network, libvirt leverages some of the same technologies that OpenStack Network does. In particular, libvirt uses:
id: Secara default, fungsi jaringan libvirt ini diaktifkan, dan libvirt menciptakan jaringan saat booting. Untuk mengimplementasikan jaringan ini, libvirt memanfaatkan beberapa teknologi yang sama dimana OpenStack Network menggunakannya. Secara khusus, libvirt menggunakan:
tr_tr: Varsayılan olarak, libvirt'in ağ oluşturma işlevi etkindir ve sistem önyüklenirken libvirt bir ağ oluşturur. Bu ağın uygulanması için libvirt, OpenStack Ağ'in yaptığı teknolojilerin bir kısmından yararlanır. Özellikle, libvirt şunları kullanır:

source: By default, the VXLAN protocol lacks knowledge of target location and uses multicast to discover it. After discovery, it stores the location in the local forwarding database. In large deployments, the discovery process can generate a significant amount of network that all nodes must process. To eliminate the latter and generally increase efficiency, the Networking service includes the layer-2 population mechanism driver that automatically populates the forwarding database for VXLAN interfaces. The example configuration enables this driver. For more information, see :ref:`config-plugin-ml2`.
id: Secara default, protokol VXLAN tidak memiliki pengetahuan tentang lokasi target dan menggunakan multicast untuk menemukan itu. Setelah ada penemuan, protokol menyimpan lokasi di database forwarding lokal. Dalam pengerahan besar, proses penemuan dapat menghasilkan sejumlah besar jaringan dimana semua node harus memproses. Untuk menghilangkan terakhir ini dan umumnya meningkatkan efisiensi, layanan Networking meliputi layer-2 population mechanism driver yang secara otomatis mengisi database forwarding untuk antarmuka VXLAN. Contoh konfigurasi mengaktifkan driver ini. Untuk informasi lebih lanjut, lihat: ref: `config-plugin-ml2`.
tr_tr: Varsayılan olarak, VXLAN protokolü hedef konum bilgisi yetersizdir ve keşfetmek için çok noktaya yayın kullanır. Keşif sonrasında konumu yerel yönlendirme veritabanında depolar. Büyük dağıtımlarda, keşif işlemi, tüm düğümlerin işlemesi gereken önemli miktarda ağ oluşturabilir. Bunları ortadan kaldırmak ve genel olarak verimliliği artırmak için, Ağ hizmeti, VXLAN arabirimleri için yönlendirme veritabanını otomatik olarak dolduran katman-2 nüfus şeması sürücüsünü içerir. Örnek yapılandırma, bu sürücüyü etkinleştirir. Daha fazla bilgi için bkz :ref:`config-plugin-ml2`.

source: By default, the ``enable_firewall`` option value is ``True`` in the local settings file.
tr_tr: Varsayılan olarak, ``enable_firewall`` seçenek değeri yerel ayarlar dosyasında ``True``dir.

source: CLI support
id: Dukungan CLI (command-line interface)
tr_tr: CLI desteği

source: Can be used for instance network attachments as well as for attachments of other network resources like routers, DHCP, and so on.
id: Dapat digunakan untuk attachment jaringan instance serta untuk attachment dari sumber daya jaringan lain seperti router, DHCP, dan sebagainya.
tr_tr: Yönlendiriciler, DHCP vb. diğer ağ kaynakları ekleri için olduğu gibi sunucu ağ ekleri için de kullanılabilir.

source: Can only be used for instance network attachments (device_owner = compute) and not for attachment of other resources like routers, DHCP, and so on.
id: Hanya dapat digunakan untuk attachment jaringan instance (device_owner = compute) dan bukan untuk attachment dari sumber lain seperti router, DHCP, dan sebagainya.
tr_tr: Yalnızca, sunucunun ağ ekleri (device_owner = compute) için kullanılabilir; yönlendiriciler, DHCP ve benzeri diğer kaynakların eklenmesi için kullanılamaz.

source: Can only be used for instance network attachments (device_owner = compute).
id: Hanya dapat digunakan untuk attachment jaringan instance (device_owner = compute).
tr_tr: Sadece sunucu ağ ekleri için kullanılabilir (device_owner = compute).

source: Case 1
tr_tr: Durum 1

source: Case 1: Each virtual network uses unique DNS resolver(s)
id: Case 1: Setiap jaringan virtual menggunakan DNS resolver unik
tr_tr: Durum 1: Her sanal ağ benzersiz DNS çözümleyici kullanır

source: Case 2
tr_tr: Durum 2

source: Case 2: All virtual networks use same DNS resolver(s)
id: Case 2: Semua jaringan virtual menggunakan DNS resolver yang sama
tr_tr: Durum 2: Tüm sanal ağlar aynı DNS çözümleyicisini kullanır

source: Case 3
tr_tr: Durum 3

source: Case 3: All virtual networks use DNS resolver(s) on the host
id: Case 3: Semua jaringan virtual menggunakan DNS resolver pada host
tr_tr: Durum 3: Tüm sanal ağlar, ana bilgisayarda DNS çözümleyici(ler/y)i kullanır

source: Check that ``ebrctl`` is listed somewhere in ``/etc/nova/rootwrap.d/*``:
id: Cek bahwa ``ebrctl`` terdaftar di suatu tempat di ``/etc/nova/rootwrap.d/*``:
tr_tr: ``ebrctl``nin ``/etc/nova/rootwrap.d/*`` dizininde bir yerde listelendiğini kontrol edin:

source: Check the instance status. The ``Networks`` field contains an IP address from the subnet having the ``compute:nova`` service type.
id: Periksa status instance. Field ``Networks`` berisi alamat IP dari subnet memiliki tipe layanan ``compute:nova``
tr_tr: Sunucu durumunu kontrol edin. ``Ağlar`` alanına, ``compute:nova`` hizmet türüne sahip olan bir alt ağa ait bir IP adresi bulunur.

source: Checking connectivity
id: Pemeriksaan konektivitas
tr_tr: Bağlanabilirlik kontrolü

source: Clear tags from a resource:
id: Hapus tag dari sumber daya:
tr_tr: Bir kaynaktan etiketleri temizle:

source: Client and server exchange data.
id: Klien dan pertukaran data server.
tr_tr: İstemci ve sunucu veri alışverişi yapar.

source: Client connects to server.
id: Klien terhubung ke server.
tr_tr: İstemci sunucuya bağlanır.

source: Client or server disconnects.
id: Klien atau server terputus.
tr_tr: İstemci veya sunucu bağlantıyı bitirir.

source: Clone the `neutron-lbaas-dashboard repository <https://git.openstack.org/cgit/openstack/neutron-lbaas-dashboard/>`__ and check out the release branch that matches the installed version of Dashboard:
id: Lakukan cloning `neutron-lbaas-dashboard repository <https://git.openstack.org/cgit/openstack/neutron-lbaas-dashboard/>`__ dan periksa cabang rilis yang cocok dengan versi Dashboard terpasang:
tr_tr: `neutron-lbaas-dashboard deposu <https://git.openstack.org/cgit/openstack/neutron-lbaas-dashboard/>`__nu kopyalayın ve kurulu Dashboard'un sürümü ile eşleşen sürüm dalını çekin:

source: Compatibility notes
id: Catatan kompatibilitas
tr_tr: Uyumluluk notları

source: Complex queries may have contradictory parameters. Example::
id: Query yang kompleks mungkin memiliki parameter bertentangan. Contoh::
tr_tr: Karmaşık sorgular çelişkili parametrelere sahip olabilir. Örnek::

source: Compute needs a per-hypervisor "has_transitioned" boolean change in the data model to be used during the migration process. This flag is no longer required once the process is complete.
id: Komputasi kebutuhan per-hypervisor "has_transitioned" perubahan boolean dalam model data yang akan digunakan selama proses migrasi. Flag ini tidak lagi diperlukan setelah proses selesai.
tr_tr: Hesaplama işlemi, geçiş işlemi sırasında kullanılacak veri modelinde hipervizör başına "has_transitioned" ikili değişikliği gerektiriyor. Bu bayrak, işlem tamamlandıktan sonra artık gerekli değildir.

source: Compute node 1:
id: Compute node 1 (node komputasi 1):
tr_tr: Hesaplama düğümü 1:

source: Compute node 2:
id: Compute node 2 (node komputasi 2):
tr_tr: Hesaplama düğümü 2:

source: Compute nodes
id: Compute nodes (simpul komputasi)
tr_tr: Hesaplama düğümleri

source: Compute service API: 2.41
id: Layanan Compute API: 2.41
tr_tr: Hesaplama servisi API: 2.41

source: Compute: Contains the hypervisor component of the OpenStack Compute service and the OpenStack Networking layer-2, DHCP, and metadata components. High-availability options may include additional components.
id: Compute: Mengandung komponen hypervisor layanan OpenStack Compute dan OpenStack Networking layer-2, DHCP, dan komponen metadata. Opsi ketersediaan tinggi (high-availability) mungkin termasuk komponen tambahan.
tr_tr: Hesaplama: OpenStack Hesaplama hizmetinin hypervisor bileşenini ve OpenStack Ağ katmanı-2, DHCP ve meta veri bileşenlerini içerir. Yüksek kullanılabilirlik seçenekleri ek bileşenler içerebilir.

source: Concepts
id: Konsep
tr_tr: Kavramlar

source: Conceptually, you can think of an Ethernet network as a single bus that each of the network hosts connects to. In early implementations, an Ethernet network consisted of a single coaxial cable that hosts would tap into to connect to the network. However, network hosts in modern Ethernet networks connect directly to a network device called a *switch*. Still, this conceptual model is useful, and in network diagrams (including those generated by the OpenStack dashboard) an Ethernet network is often depicted as if it was a single bus. You'll sometimes hear an Ethernet network referred to as a *layer 2 segment*.
id: Secara konseptual, Anda bisa memikirkan jaringan Ethernet sebagai bus tunggal dimana masing-masing host jaringan menghubungkannya. Dalam implementasi awal, jaringan Ethernet terdiri dari kabel koaksial tunggal dimana host akan memanfaatkan hubungan ke jaringan. Namun, host jaringan dalam jaringan Ethernet modern yang terhubung langsung ke perangkat jaringan yang disebut *switch*. Namun, model konseptual ini berguna, dan dalam diagram jaringan (termasuk jaringan yang dihasilkan oleh dashboard OpenStack), jaringan Ethernet sering digambarkan seolah-olah itu adalah bus tunggal. Kadang-kadang Anda akan mendengar bahwa jaringan Ethernet disebut sebagai *layer 2 segment*.
tr_tr: Kavramsal olarak, bir Ethernet ağını, ağ bilgisayarlarının her birinin bağlandığı tek bir veri yolu olarak düşünebilirsiniz. İlk uygulamalarda bir Ethernet ağı, ana makinelerin ağa bağlanmak için girdikleri tek bir koaksiyal kablo içeriyordu. Bununla birlikte, modern Ethernet ağlarındaki ağ ana makineleri doğrudan *switch* adlı bir ağ cihazına bağlanırlar. Yine de bu kavramsal model kullanışlıdır ve ağ diyagramlarında (OpenStack gösterge paneli tarafından üretilenler dahil) bir Ethernet ağı genellikle tek bir veri yolu olarak tasvir edilmiştir. Bazen *katman 2 segment* olarak anılan bir Ethernet ağı duyarsınız.

source: Configuration
id: Konfigurasi
tr_tr: Yapılandırma

source: Configuration example
id: Contoh konfigurasi
tr_tr: Yapılandırma örneği

source: Configuration for the DHCP agent is typically done in the ``dhcp_agent.ini`` configuration file. Make sure that on agent start you pass this configuration file as argument.
id: Konfigurasi untuk agen DHCP biasanya dilakukan dalam file konfigurasi ``dhcp_agent.ini``. Pastikan bahwa pada agent start Anda melewati file konfigurasi ini sebagai argumen.
tr_tr: DHCP ajanı için yapılandırma, tipil olarak ``dhcp_agent.ini`` yapılandırma dosyasında yapılır. Ajan başlatılırken bu yapılandırma dosyasının parametre olarak verildiğinden emin olun.

source: Configuration for the L3 agent is typically done in the ``l3_agent.ini`` configuration file. Make sure that on agent start you pass this configuration file as argument.
id: Konfigurasi untuk agen L3 biasanya dilakukan dalam file konfigurasi ``l3_agent.ini``. Pastikan bahwa pada agent start Anda melewati file konfigurasi ini sebagai argumen.
tr_tr: L3 ajanı için yapılandırma, tipik olarak ``l3_agent.ini`` yapılandırma dosyasında yapılır. Ajanı başlattığınızda bu yapılandırma dosyasını argüman olarak verdiğinizden emin olun.

source: Configuration for the L3 metering agent is typically done in the ``metering_agent.ini`` configuration file. Make sure that on agent start you pass this configuration file as argument.
id: Konfigurasi untuk agen metering L3 biasanya dilakukan di file konfigurasi ``metering_agent.ini``. Pastikan bahwa pada agent start Anda melewati file konfigurasi ini sebagai argumen.
tr_tr: L3 ölçüm ajanı için yapılandırma, ``metering_agent.ini`` yapılandırma dosyasında yapılır. Ajanı başlatırken bu yapılandırma dosyasını değişken olarak verdiğinizden emin olun.

source: Configuration for the Linux bridge agent is typically done in the ``linuxbridge_agent.ini`` configuration file. Make sure that on agent start you pass this configuration file as argument.
id: Konfigurasi untuk agen jembatan Linux biasanya dilakukan di file konfigurasi ``linuxbridge_agent.ini``. Pastikan bahwa pada agent starti Anda melewati file konfigurasi ini sebagai argumen.
tr_tr: Linux köprü ajanı için yapılandırma tipik olarak ``linuxbridge_agent.ini`` yapılandırma dosyasında yapılır. Ajan başlatılırken bu yapılandırma dosyasını argüman olarak verildiğinden emin olun.

source: Configuration for the MacVTap agent is typically done in the ``macvtap_agent.ini`` configuration file. Make sure that on agent start you pass this configuration file as argument.
id: Konfigurasi untuk agen MacVTap biasanya dilakukan di file konfigurasi ``macvtap_agent.ini``. Pastikan bahwa pada agent start Anda melewati file konfigurasi ini sebagai argumen.
tr_tr: MacVTap aracısı için yapılandırma, tipik olarak ``macvtap_agent.ini`` yapılandırma dosyasında yapılır. Ajanı başlattığınızda bu yapılandırma dosyasını argüman olarak verdiğinizden emin olun.

source: Configuration for the Metadata agent is typically done in the ``metadata_agent.ini`` configuration file. Make sure that on agent start you pass this configuration file as argument.
id: Konfigurasi untuk agen Metadata biasanya dilakukan di file konfigurasi ``metadata_agent.ini`` . Pastikan bahwa pada agent start Anda melewati file konfigurasi ini sebagai argumen.
tr_tr: Metadata ajanı için yapılandırma, tipik olarak ``metadata_agent.ini`` yapılandırma dosyasında yapılır. Ajan başlatılırken bu yapılandırma dosyasının parametre olarak verildiğinden emin olun.
