Repository: 25hours/openstack-manuals
Catalog: doc/networking-guide/source/locale/*/LC_MESSAGES/networking-guide.po
Languages: id, tr_tr

source: In the ``neutron.conf`` file, enable the conventional layer-3 and BGP dynamic routing service plug-ins:
id: Dalam file ``neutron.conf``, mengaktifkan lapisan-3 konvensional dan BGP layanan routing dinamis plug-in:
tr_tr: ``neutron.conf`` dosyasında, bilinen katman-3 ve BGP dinamik yönlendirme servis eklentilerini etkinleştir:

source: In the ``neutron.conf`` file, enable the trunk service plug-in:
id: Dalam file ``neutron.conf``, aktifkan trunk service plug-in:
tr_tr: ``neutron.conf`` dosyasında, bilgi aktarma yolu servis eklentisini etkinleştirin:

source: In the ``neutron.conf`` file:
id: Dalam file ``neutron.conf``:
tr_tr: ``neutron.conf`` dosyasında:

source: In the ``openswitch_agent.ini`` file, enable distributed routing.
id: Dalam file ``openswitch_agent.ini``, aktifkan didistribusikan routing.
tr_tr: ``openswitch_agent.ini`` dosyasında, dağıtık yönlendirmeyi etkinleştir.

source: In the ``openvswitch_agent.ini`` file, configure the OVS agent:
id: Dalam file ``openvswitch_agent.ini``, lakukan konfigurasi agen OVS:
tr_tr: ``openvswitch_agent.ini`` dosyasında OVS ajanını yapılandır:

source: In the ``openvswitch_agent.ini`` file, configure the layer-2 agent.
id: Dalam file ``openvswitch_agent.ini``, lakukan konfigurasi layer-2 agent.
tr_tr: ``openvswitch_agent.ini`` dosyasında, katman-2 ajanını yapılandır.

source: In the ``openvswitch_agent.ini`` file, enable VXLAN support including layer-2 population.
id: Dalam file ``openvswitch_agent.ini``, aktifkan dukungan VXLAN termasuk layer-2 population.
tr_tr: ``openvswitch_agent.ini`` dosyasında, katman-2 nüfusunu içeren VXLAN desteğini etkinleştirin.

source: In the ``openvswitch_agent.ini`` file:
id: Dalam file ``openvswitch_agent.ini``:
tr_tr: ``openvswitch_agent.ini`` dosyası içinde:

source: In the above configuration, we use ``dhcp_agents_per_network = 1`` for this demonstration. In usual deployments, we suggest setting ``dhcp_agents_per_network`` to more than one to match the number of DHCP agents in your deployment. See :ref:`conf-dhcp-agents-per-network`.
id: Dalam konfigurasi di atas, kita menggunakan ``dhcp_agents_per_network = 1`` untuk demonstrasi ini. Dalam pengerahan biasa, kami sarankan pengaturan ``dhcp_agents_per_network`` untuk lebih dari satu untuk mencocokkan jumlah agen DHCP dalam pengerahan Anda. Lihat :ref:`conf-dhcp-agents-per-network`.
tr_tr: Yukarıdaki yapılandırmada, bu gösterim için ``dhcp_agents_per_network = 1`` kullanıyoruz. Normal kurulumlarda, dağıtımınızdaki DHCP aracılarının sayısıyla eşleştirmek için ``dhcp_agents_per_network`` ayarını birden fazla yapmanızı öneririz. :ref:`conf-dhcp-agents-per-network` referansına bakınız.

source: In the above example notice that:
id: Dalam contoh di atas perhatikan bahwa:
tr_tr: Yukarıdaki örnekte aşağıdakilere dikkat edin:

source: In the absence of an upstream RA support, ``ipv6_gateway`` flag can be set with the external router gateway LLA in the neutron L3 agent configuration file. This also requires that no subnet is associated with that port.
id: Dengan tidak adanya dukungan RA hulu, ``ilag ipv6_gateway`` dapat diatur dengan LLA router gerbang eksternal dalam file konfigurasi neutron-l3-agent. Ini juga mensyaratkan bahwa tidak ada subnet dikaitkan dengan port tersebut.
tr_tr: Bir upstream RA desteğinin bulunmaması durumunda, ``ipv6_gateway`` bayrağı, neutron L3 ajan yapılandırma dosyasında harici yönlendirici ağ geçidi LLA ile ayarlanabilir. Bu, aynı zamanda, bu bağlantı noktasına herhangi bir alt ağın ilişkilendirilmemesini gerektirir.

source: In the future, additional techniques could be used to allocate subnets to projects, for example, use of an external IPAM module.
tr_tr: Gelecekte, alt ağları projelere tahsis etmek için ek teknikler kullanılabilir, örneğin, harici bir IPAM modülünün kullanılması.

source: In the most simple case, the property can be represented by a simple Python list defined on the class.
id: Dalam kasus yang paling sederhana, properti dapat diwakili oleh daftar Python sederhana yang didefinisikan di kelas.
tr_tr: En basit durumda, özellik sınıf üzerinde tanımlanmış basit bir Python listesi ile temsil edilebilir.

source: In the output above the standard ``router:external`` attribute is ``External`` as expected. Now a wildcard policy is visible in the RBAC policy listings:
id: Pada contoh di atas atribut ``router:external`` standar adalah `` External`` seperti yang diharapkan. Sekarang kebijakan wildcard terlihat dalam daftar kebijakan RBAC:
tr_tr: Yukarıdaki çıktıda standart ``router:external`` özniteliği beklendiği gibi ``External`` dır. Artık bir jokerlik politikası RBAC politika listelerinde görünür:

source: In this case, the DHCP agent offers one or more unique DNS resolvers to instances via DHCP on each virtual network. You can configure a DNS resolver when creating or updating a subnet. To configure more than one DNS resolver, use a comma between each value.
id: Dalam case ini, agen DHCP menawarkan satu atau lebih DNS resolver unik untuk instance melalui DHCP pada setiap jaringan virtual. Anda dapat mengkonfigurasi DNS resolver saat membuat atau memperbarui subnet. Untuk mengkonfigurasi lebih dari satu DNS resolver, gunakan koma di antara setiap nilai.
tr_tr: Bu durumda, DHCP aracı her sanal ağda DHCP vasıtasıyla sunuculara bir veya daha fazla benzersiz DNS çözümleyici sunar. Bir alt ağı oluştururken veya güncelleştirirken DNS çözümleyicisini yapılandırabilirsiniz. Birden fazla DNS çözümleyici yapılandırmak için her değer arasında virgül kullanın.

source: In this case, the DHCP agent offers the DNS resolver(s) in the ``resolv.conf`` file on the host running the DHCP agent via DHCP to instances on all virtual networks.
id: Dalam case ini, agen DHCP menawarkan DNS resolver dalam file ``resolv.conf`` pada host yang sedang menjalankan agen DHCP melalui DHCP untuk instance di semua jaringan virtual.
tr_tr: Bu durumda, DHCP aracı, DHCP aracısını DHCP aracılığıyla çalıştıran ana makinenin ``resolv.conf`` dosyasındaki DNS çözümleyicilerini tüm sanal ağlarda bulunan sunuculara sunar.

source: In this case, the DHCP agent offers the same DNS resolver(s) to instances via DHCP on all virtual networks.
id: Dalam case ini, agen DHCP menawarkan DNS resolver yang sama untuk instance melalui DHCP di semua jaringan virtual.
tr_tr: Bu durumda DHCP aracı, tüm sanal ağlarda DHCP yoluyla sunucularla aynı DNS çözümleyicisini sunar.

source: In this case, the user is creating ports or booting instances on a network that is accessible externally. The steps to publish the port in the external DNS service are the following:
id: Dalam hal ini, pengguna menciptakan port atau booting instance pada jaringan yang dapat diakses secara eksternal. Langkah-langkah untuk menerbitkan port di layanan DNS eksternal adalah sebagai berikut:
tr_tr: Bu durumda, kullanıcı harici olarak erişilebilen bir ağda bağlantı noktaları veya önyükleme sunucuları oluşturuyor. Bağlantı noktasını harici DNS hizmetinde yayınlama adımları şunlardır:

source: In this case, we should let the Networking service find these networks. Obviously, there are no such networks and the service will return an empty list.
id: Dalam hal ini, kita harus membiarkan layanan Networking menemukan jaringan ini. Jelas, tidak ada jaringan tersebut dan layanan akan kembali daftar kosong.
tr_tr: Bu durumda, Ağ hizmetinin bu ağları bulmasına izin vermeliyiz. Açıkçası, böyle bir ağ yok ve hizmet boş bir liste döndürecektir.

source: In this example the port is created manually by the user and then used to boot an instance. Notice that:
id: Dalam contoh ini port dibuat secara manual oleh pengguna dan kemudian digunakan untuk boot sebuah instance. Perhatikan bahwa:
tr_tr: Bu örnekte, bağlantı noktası kullanıcı tarafından el ile oluşturulur ve daha sonra bir sunucuyu ön yüklemek için kullanılır. Dikkat et:

source: In this example, notice that the data is published in the DNS service when the floating IP is associated to the port.
id: Dalam contoh ini, perhatikan bahwa data yang diterbitkan dalam layanan DNS ketika IP mengambang dikaitkan ke port.
tr_tr: Bu örnekte, kayan IP, bağlantı noktasına ilişkilendirildiğinde verilerin DNS hizmetinde yayımlandığına dikkat edin.

source: In this example, the health monitor removes the server from the pool if it fails a health check at two five-second intervals. When the server recovers and begins responding to health checks again, it is added to the pool once again.
id: Dalam contoh ini, monitor kesehatan menghapus server dari kolam jika gagal cek kesehatan di dua interval lima detik. Ketika server pulih dan mulai menanggapi pemeriksaan kesehatan lagi, itu akan ditambahkan ke kolam sekali lagi.
tr_tr: Bu örnekte, sağlık denetleyicisi, iki beş saniyelik aralıklarla bir sağlık denetiminde başarısız olursa sunucuyu havuzdan kaldırır. Sunucu onarılır ve sağlık kontrollerine tekrar yanıt vermeye başladığında, havuza bir kez daha eklenir.

source: In this example, the load balancer uses the round robin algorithm and the traffic alternates between the web servers on the backend.
id: Dalam contoh ini, beban penyeimbang menggunakan algoritma round robin dan pergantian lalu lintas antara server web pada backend.
tr_tr: Bu örnekte, yük dengeleyici, round robin algoritması kullanır ve trafik, arka uçtaki web sunucuları arasında değişir.

source: In this output, ``heartbeat_timestamp`` is the time on the neutron server. You do not need to synchronize all agents to this time for this extension to run correctly. ``configurations`` describes the static configuration for the agent or run time data. This agent is a DHCP agent and it hosts one network, one subnet, and three ports.
tr_tr: Bu çıktıda, ``heartbeat_timestamp`` neutron sunucudaki zamandır. Bu uzantının doğru çalışması için tüm ajanları bu saatte senkronize etmeniz gerekmez. ``configurations``, ajanı veya çalışma zamanı verisi için statik yapılandırmayı tanımlar. Bu aracı bir DHCP ajanıdır ve bir ağ, bir alt ağ ve üç bağlantı noktasına ev sahipliği yapar.

source: In this section, the combination of a mechanism driver and an L2 agent is called 'reference implementation'. The following table lists these implementations:
id: Pada bagian ini, kombinasi dari driver mekanisme dan agen L2 disebut 'reference implementation'. Tabel berikut berisi implementasi tersebut:
tr_tr: Bu bölümde, bir mekanizma sürücüsü ile bir L2 aracı arasındaki kombinasyon 'referans uygulaması' olarak adlandırılır. Aşağıdaki tabloda bu uygulamaları listelemektedir:

source: In this use case, the address of a floating IP is published in the external DNS service in conjunction with the ``dns_name`` of its associated port and the ``dns_domain`` of the port's network. The steps to execute in this use case are the following:
id: Dalam use case ini, alamat IP mengambang diterbitkan dalam layanan DNS eksternal dalam hubungannya dengan ``dns_name`` port yang terkait dan ``dns_domain`` jaringan port. Langkah untuk mengeksekusi use case ini adalah sebagai berikut:
tr_tr: Bu kullanım durumunda, kayan IP'nin adresi ilişkili bağlantı noktasının ``dns_name`` ve bağlantı noktasının ağının ``dns_domain`` ile birlikte harici DNS hizmetinde yayınlanır. Bu kullanım durumunda yürütülecek adımlar şunlardır:

source: In this use case, the user assigns ``dns_name`` and ``dns_domain`` attributes to a floating IP when it is created. The floating IP data becomes visible in the external DNS service as soon as it is created. The floating IP can be associated with a port on creation or later on. The following example shows a user booting an instance and then creating a floating IP associated to the port allocated for the instance:
id: Dalam use case ini, pengguna memberikan atribut ``dns_name`` dan ``dns_domain`` ke IP mengambang ketika dibuat. Data IP mengambang akan terlihat dalam layanan DNS eksternal segera setelah itu dibuat. IP mengambang dapat dikaitkan dengan port ketika pembuatan atau nanti. Contoh berikut menunjukkan bagaimana pengguna booting instance dan kemudian membuat IP mengambang terkait ke port yang dialokasikan untuk instance:
tr_tr: Bu kullanım durumunda kullanıcı, oluşturulduğunda, kayan bir IP'ye ``dns_name`` ve ``dns_domain`` öznitelikleri atar. Yüzen IP verileri harici DNS hizmetinde oluşturulduğu anda görünür hale gelir. Yüzen IP, bir bağlantı noktası ile ilişkilendirilebilir veya daha sonra oluşturulabilir. Aşağıdaki örnek, bir sunucuyu önyükleyen bir kullanıcıyı ve ardından sunucu için ayrılan bağlantı noktasına ilişkili bir kayan IP oluşturmayı gösterir:

source: Input type
id: Input type (tipe masukan )
tr_tr: Giriş Tipi

source: Install OVS.
id: Instal OVS.
tr_tr: OVS kurun.

source: Install the Dashboard panel plug-in:
id: Instal plug-in panel Dashboard:
tr_tr: Dashboard panosu eklentisini kur:

source: Install the Networking service Linux bridge layer-2 agent and layer-3 agent.
id: Instal layanan Networking, Linux bridge layer-2 agent dan layer-3 agent.
tr_tr: Ağ servisi Linux köprü katman-2 ajanı ve katman-3 ajanı kur.

source: Install the Networking service Linux bridge layer-2 agent.
id: Instal layanan Networking, Linux bridge layer-2 agent.
tr_tr: Ağ servisi Linux köprü katman-2 ajanını kurun.

source: Install the Networking service Macvtap layer-2 agent.
id: Instal agen ayer-2 Macvtap layanan Networking
tr_tr: Ağ hizmeti Macvtap katman-2 ajanını yükleyin.

source: Install the Networking service OVS layer-2 agent and layer-3 agent.
id: Install OVS layer-2 agent dan layer-3 agent layanan Networking.
tr_tr: Ağ hizmeti OVS katmanı-2 aracı ve katman-3 aracısını yükleyin.

source: Install the Networking service OVS layer-2 agent, DHCP agent, and metadata agent.
id: Instal Networking service OVS layer-2 agent, DHCP agent, dan metadata agent.
tr_tr: Ağ hizmeti OVS katmanı-2 ajanı, DHCP ajanı ve meta veri ajanını yükleyin.

source: Install the Networking service components that provide the ``neutron-server`` service and ML2 plug-in.
id: Menginstal komponen layanan Networking yang menyediakan layanan ``neutron-server`` dan ML2 plug-in.
tr_tr: ``neutron-server`` hizmeti ve ML2 eklentisini sağlayan Ağ hizmet bileşenlerini kurun.

source: Install the Networking service components that provides the ``neutron-server`` service and ML2 plug-in.
id: Instal komponen layanan Networking yang menyediakan layanan ``neutron-server`` dan ML2 plug-in.
tr_tr: ``neutron-server`` servisini ve ML2 eklentisini sağlayan Ağ hizmet bileşenlerini kurun.

source: Install the Networking service layer-3 agent.
id: Instal agen lapisan-3 layanan Networking
tr_tr: Ağ hizmeti katman-3 aracısını yükleyin.

source: Install the OpenStack Networking layer-3 agent.
id: Instal agen lapisan-3 OpenStack Networking.
tr_tr: OpenStack Ağ katman-3 aracısını kurun.

source: Install the SR-IOV agent.
id: Instal agen SR-IOV.
tr_tr: SR-IOV ajanını kurun.

source: Install the ``ebrctl`` utility on the compute nodes.
id: Instal utilitas ``ebrctl`` pada node komputasi.
tr_tr: Hesap düğümlerine ``ebrctl`` yardımcı programını kurun.

source: Instance 1
tr_tr: Sunucu 1

source: Instance 1 resides on compute node 1 and uses provider network 1.
id: Instance 1 berada pada komputasi node 1 dan menggunakan jaringan operator 1.
tr_tr: Sunucu 1, hesap düğümü 1'de bulunur ve sağlayıcı ağı 1'i kullanır.

source: Instance 1 resides on compute node 1 and uses self-service network 1.
id: Instance 1 berada pada compute node 1 dan menggunakan self-service network 1.
tr_tr: Sunucu 1, hesap düğümü 1'de bulunur ve self-servis ağı 1'i kullanır.

source: Instance 1 sends a packet to instance 2.
id: Instance 1 mengirimkan sebuah paket ke instance 2.
tr_tr: Sunucu 1, sunucu 2'ye bir paket gönderir.

source: Instance 2
tr_tr: Sunucu 2

source: Instance 2 resides on compute node 1 and uses provider network 2.
id: Instance 2 berada pada komputasi node 1 dan menggunakan provider network 2.
tr_tr: Sunucu 2, hesap düğümü 1'de bulunur ve sağlayıcı ağı 2'yi kullanır.

source: Instance 2 resides on compute node 1 and uses self-service network 2.
id: Instance 2 berada pad compute node 1dan menggunakan self-service network 2.
tr_tr: Sunucu 2, hesaplama düğümü 1'de bulunur ve kendi kendine hizmet ağı 2'yi kullanır.

source: Instance 2 resides on compute node 2 and uses provider network 1.
id: Instance 2 berada pada komputasi node 2 dan menggunakan jaringan operator 1.
tr_tr: Sunucu 2, düğüm 2 üzerindedir ve sağlayıcı ağ 2'yi kullanır.

source: Instance 2 resides on compute node 2 and uses self-service network 1.
id: Instance 2 berada pada compute node 2 dan menggunakan self-service network 1.
tr_tr: Sunucu 2, hesaplama düğümü 2'de bulunur ve self-servis hizmet ağı 1'i kullanır.

source: Instance 3
tr_tr: Sunucu 3

source: Instance migration requires the same values for the ``physical_interface_mapping`` configuration option on each compute node. For more information, see `<https://bugs.launchpad.net/neutron/+bug/1550400>`_.
id: Migrasi instance membutuhkan nilai yang sama untuk opsi konfigurasi ``physical_interface_mapping`` pada setiap node komputasi. Untuk informasi lebih lanjut, lihat `<https://bugs.launchpad.net/neutron/+bug/1550400>`_.
tr_tr: Sunucu göçü, her hesaplama düğümü üzerindeki ``physical_interface_mapping`` yapılandırma seçeneği için aynı değeri gerektirir. Daha fazla bilgi için, bknz `<https://bugs.launchpad.net/neutron/+bug/1550400>`_.

source: Instance network interfaces (VIFs)
id: Instance network interfaces (VIF)
tr_tr: Sunucu ağ arabirimleri (VIFs)

source: Instance network traffic on self-service networks using a particular router only traverses the master instance of that router. Thus, resource limitations of a particular network node can impact all master instances of routers on that network node without triggering failover to another network node. However, you can configure the scheduler to distribute the master instance of each router uniformly across a pool of network nodes to reduce the chance of resource contention on any particular network node.
id: Lalu lintas jaringan instance di jaringan self-service menggunakan router tertentu saja melintasi instance master router itu. Dengan demikian, keterbatasan sumber daya dari node jaringan tertentu dapat berdampak pada semua instance master router pada jaringan node tanpa memicu failover ke node jaringan lain. Namun, Anda dapat mengkonfigurasi scheduler untuk mendistribusikan instance master setiap router merata di kolam node jaringan untuk mengurangi kemungkinan pertentangan sumber daya pada setiap simpul jaringan tertentu.
tr_tr: Belirli bir yönlendirici kullanan self-servis ağlarındaki sunucu ağ trafiği, yalnızca o yönlendiricinin ana sunucuya geçmektedir. Böylece, belirli bir ağ düğümünün kaynak sınırlamaları, yerine çalışma için başka bir ağ düğümüne tetikleme yapmadan bu ağ düğümündeki yönlendiricilerin tüm ana sunucularını etkileyebilir. Bununla birlikte, herhangi bir ağ düğümünde kaynak çekişme olasılığını azaltmak için zamanlayıcıyı, her bir yönlendiricinin ana ana sunucusunu ağ düğümleri havuzunda eşit olarak dağıtacak şekilde yapılandırabilirsiniz.

source: Instances communicate via router on the physical network infrastructure.
id: Instance berkomunikasi melalui router pada infrastruktur jaringan fisik.
tr_tr: Sunucular, yönlendirici aracılığıyla fiziksel ağ altyapısında iletişim kurar.

source: Instances on the same network communicate directly between compute nodes containing those instances.
id: Instance pada jaringan yang sama berkomunikasi secara langsung antara node komputasi yang berisi instance.
tr_tr: Aynı ağdaki sunucular, doğrudan bu sunucuları içeren hesaplama düğümleri arasında iletişim kurar.

source: Instances using a fixed IPv4/IPv6 address or floating IPv4 address communicate via router on the network node. The self-service networks must reside on the same router.
id: Instance menggunakan alamat IPv4/IPv6 tetap atau alamat IPv4 mengambang berkomunikasi melalui router pada node jaringan. Jaringan self-service harus berada pada router yang sama.
tr_tr: Sabit bir IPv4 / IPv6 adresi veya kayan IPv4 adresi kullanan sunucular ağ düğümünde yönlendirici üzerinden iletişim kurar. Self servis ağları aynı yönlendiricide bulunmalıdır.

source: Instances with a fixed IPv4/IPv6 address or floating IPv4 address on the same network communicate directly between compute nodes containing those instances.
id: Instance dengan alamat IPv4/IPv6 tetap atau alamat IPv4 mengambang pada jaringan yang sama berkomunikasi secara langsung antara node komputasi yang berisi instance.
tr_tr: Aynı ağdaki sabit IPv4/IPv6 adresi veya kayan IPv4 adresine sahip sunucular, bu sunucuları içeren hesaplama düğümleri arasında doğrudan iletişim kurar.

source: Instances with a fixed IPv4/IPv6 or floating IPv4 address on the same network communicate directly between compute nodes containing those instances.
id: Instance dengan alamat IPv4 / IPv6 tetap atau alamat IPv4 mengambang pada jaringan yang sama berkomunikasi secara langsung antara node komputasi yang berisi instance
tr_tr: Aynı ağdaki sabit bir IPv4/IPv6 veya kayan IPv4 adresine sahip olan örnekler, bu örnekleri içeren hesaplama düğümleri arasında doğrudan iletişim kurar.

source: Instances with fixed IPv4/IPv6 address or floating IPv4 address on the same compute node communicate via router on the compute node. Instances on different compute nodes communicate via an instance of the router on each compute node.
id: Instance dengan alamat IPv4/IPv6 tetap atau alamat IPv4 mengambang pada node komputasi yang sama berkomunikasi melalui router pada node komputasi. Instance pada node komputasi yang berbeda berkomunikasi melalui sebuah instance dari router pada setiap node komputasi.
tr_tr: Aynı hesaplama düğümünde sabit IPv4/IPv6 adresi veya kayan IPv4 adresine sahip sunucular, hesaplama düğümünde yönlendirici yoluyla iletişim kurar. Farklı hesaplama düğümleri üzerindeki sunucular, her hesaplama düğümünde yönlendiricinin bir örneği aracılığıyla iletişim kurar.

source: Instead of having the Compute service create the port for the instance, the user might have created it and assigned a value to its ``dns_name`` attribute. In this case, the value assigned to the ``dns_name`` attribute must be equal to the value that Compute service will assign to the instance's ``hostname``, in this example ``my-vm``. Otherwise, the instance boot will fail.
id: Dari pada memiliki layanan Compute membuat port untuk instance, pengguna mungkin telah membuatnya dan menugaskan nilai untuk atribut ``dns_name`` nya. Dalam hal ini, nilai yang diberikan kepada atribut ``dns_name`` harus sama dengan nilai dimana layanan Compute akan menetapkan ke ``hostname`` instance nya, dalam contoh ini ``my-vm``. Jika tidak, booting instance akan gagal.
tr_tr: Hesaplama servisinin, sunucu için bağlantı noktası oluşturması yerine, kullanıcı onu oluşturmuş ve ``dns_name`` özniteliğine bir değer atamış olabilir. Bu durumda, ``dns_name`` özniteliğine atanan değer, Hesaplama hizmetinin sunucunun ``hostname``ne (bu örnekte ``my-vm``) atadığı değere eşit olmalıdır. Aksi takdirde, örnek önyüklemesi başarısız olur.

source: Instead of reading the DB connection from the configuration file(s), you can use the ``--database-connection`` option:
id: Dari pada membaca koneksi DB dari file konfigurasi, Anda dapat menggunakan opsi ``--database-connection``:
tr_tr: DB bağlantısını yapılandırma dosyalarından okumak yerine ``--database-connection`` seçeneğini kullanabilirsiniz:

source: Integration of the Compute service and the Networking service with an external DNSaaS (DNS-as-a-Service).
id: Integrasi layanan Compute dan layanan Networking dengan DNSaaS (DNS-as-a-Service) eksternal.
tr_tr: Hesaplama servisinin ve Ağ servisinin harici bir DNSaaS (Hizmet olarak DNS) ile entegrasyonu.
