Repository: 25hours/openstack-manuals
Catalog: doc/networking-guide/source/locale/*/LC_MESSAGES/networking-guide.po
Languages: id, tr_tr

source: After the agent is disabled, you can safely remove the agent. Even after disabling the agent, resources on the agent are kept assigned. Ensure you remove the resources on the agent before you delete the agent.
id: Setelah agen dinonaktifkan, Anda dapat dengan aman menghapus agen. Bahkan setelah menonaktifkan agen, sumber daya pada agen terus ditugaskan. Pastikan Anda menghapus sumber daya pada agen sebelum Anda menghapus agen.
tr_tr: Ajan devre dışı bırakıldıktan sonra ajanı güvenli bir şekilde kaldırabilirsiniz. Ajanı devre dışı bıraktıktan sonra bile, ajandaki kaynaklar atanır. Ajan silmeden önce ajandaki kaynakları kaldırdığınızdan emin olun.

source: After you stop the DHCP agent on HostA, you can delete it by the following command:
id: Setelah Anda berhenti agen DHCP pada HostA, Anda dapat menghapusnya dengan perintah berikut:
tr_tr: HostA'daki DHCP ajanını durdurduktan sonra, aşağıdaki komutu kullanarak silebilirsiniz:

source: Agent nodes
tr_tr: Ajan düğümleri

source: Agents
tr_tr: Ajanlar

source: All InfiniBand networks must have a subnet manager running for the network to function. This is true even when doing a simple network of two machines with no switch and the cards are plugged in back-to-back. A subnet manager is required for the link on the cards to come up. It is possible to have more than one subnet manager. In this case, one of them will act as the master, and any other will act as a slave that will take over when the master subnet manager fails.
id: Semua jaringan InfiniBand harus memiliki manajer subnet yang menjalankan jaringan supaya berfungsi. Hal ini berlaku bahkan ketika melakukan jaringan sederhana dari dua mesin tanpa switch dan kartu terpasang (plugged) di back-to-back. Seorang manajer subnet diperlukan untuk link di kartu untuk bangkit. Hal ini dimungkinkan untuk memiliki lebih dari satu manajer subnet. Dalam hal ini, salah satu dari mereka akan bertindak sebagai master, dan lain akan bertindak sebagai slave yang akan mengambil alih ketika manajer subnet master gagal.
tr_tr: Tüm InfiniBand ağlarının, ağın çalışması için çalışan bir alt ağ yöneticisi olmalıdır. Bu anahtarsız iki makine basit bir ağ yaparken bile gerçeğe uygundur ve kartlar sırt sırta takılıdır. Kartlardaki bağlantıların ortaya çıkması için bir alt ağ yöneticisi gerekiyor. Birden fazla alt ağ yöneticisine sahip olmak mümkündür. Bu durumda, bunlardan biri efendi, diğerleri ise ana alt ağ yöneticisi başarısız olduğunda devralacak bir köle gibi davranır.

source: All OpenStack Networking services and OpenStack Compute instances connect to a virtual network via ports making it possible to create a traffic steering model for service chaining using only ports. Including these ports in a port chain enables steering of traffic through one or more instances providing service functions.
id: Semua layanan OpenStack Jaringan dan instance OpenStack Compute menghubungkan ke jaringan virtual melalui port sehingga hal itu memungkinkan untuk membuat model kemudi lalu lintas (traffic steering model) untuk layanan chaining hanya menggunakan port. Termasuk port ini dalam rantai port mengaktifkan kemudi lalu lintas melalui satu atau lebih instance yang menyediakan fungsi layanan.
tr_tr: Tüm OpenStack Ağ hizmetleri ve OpenStack Hesaplama sunucuları, bağlantı noktaları kullanarak sanal bir ağa bağlanır; sadece bağlantı noktaları kullanarak servis zincirleme için bir trafik direksiyon modeli oluşturmayı mümkün kılar. Bu bağlantı noktalarını bir bağlantı zincirine dahil etmek, servis işlevleri sağlayan bir veya daha fazla örnek aracılığıyla trafiğin yönlendirilmesini sağlar.

source: All instances reside on the same network, which can also be shared with the hosts. No VLAN tagging or other network segregation takes place.
id: Semua instance berada pada jaringan yang sama, yang juga dapat dibagi dengan host. Tidak ada VLAN tagging atau pemisahan jaringan lainnya berlangsung.
tr_tr: Tüm sunucular, ana bilgisayarlarla paylaşılabilen aynı ağda bulunur. Hiçbir VLAN etiketleme veya başka bir ağ ayrımı yapılmaz.

source: Allow egress DHCP discovery and request messages that use the source MAC address of the port for the instance and the unspecified IPv4 address (0.0.0.0).
id: Izinkan egress DHCP discovery and request messages yang menggunakan sumber alamat MAC dari port untuk instance dan alamat IPv4 yang tidak ditentukan (0.0.0.0).
tr_tr: Çıkış için DHCP bulma ve örnek için bağlantı noktasının MAC adresini ve belirtilmemiş IPv4 adresini (0.0.0.0) kullanan istek iletilerine izin verin.

source: Allow egress ICMPv6 MLD reports (v1 and v2) and neighbor solicitation messages that use the source MAC address of a particular instance and the unspecified IPv6 address (::). Duplicate address detection (DAD) relies on these messages.
id: Izinkan egress ICMPv6 MLD reports (v1 dan v2) dan neighbor solicitation messages yang menggunakan sumber alamat MAC dari instance khusus dan alamat IPv6 tidak ditentukan (: :). Duplicate address detection (DAD) tergantung pada pesan ini.
tr_tr: Çıkan ICMPv6 MLD raporlarını (v1 ve v2) ve belirli bir sunucunun kaynak MAC adresini ve belirtilmemiş IPv6 adresini (::) kullanan komşu talep mesajlarına izin verin. Yinelenen adres tespiti (DAD) bu mesajlara dayanır.

source: Allow egress non-IP traffic from the MAC address of the port for the instance and any additional MAC addresses in ``allowed-address-pairs`` on the port for the instance.
id: Izinkan egress non-IP traffic dari alamat MAC dari port instance dan setiap alamat MAC tambahan dalam ``allowed-address-pairs`` pada port instance.
tr_tr: Sunucu için portun MAC adresinden ve sunucu için porttaki ``allowed-address-pairs``daki diğer MAC adreslerinden gelen IP dışı trafik çıkışına izin verin.

source: Allow egress traffic only if it uses the source MAC and IP addresses of the port for the instance, source MAC and IP combination in ``allowed-address-pairs``, or valid MAC address (port or ``allowed-address-pairs``) and associated EUI64 link-local IPv6 address.
id: Izinkan lalu lintas egress hanya jika menggunakan sumber alamat MAC dan IP dari port untuk instance, sumber kombinasi MAC dan IP dalam ``allowed-address-pairs``, atau alamat MAC valid (port or ``allowed-address-pairs``) dan alamat IPv6 llink-local EUI64 terkait.
tr_tr: Çıkış trafiğine yalnızca sunucu için bağlantı noktasının kaynak MAC ve IP adreslerini, ``allowed-address-pairs``deki kaynak MAC ve IP kombinasyonları veya geçerli MAC adresi (bağlantı noktası veya ``allowed-address-pairs``) ve ilgili EUI64 link-local IPv6 adresi kullanıyorsa izin verin.

source: Allow ingress DHCP and DHCPv6 responses from the DHCP server on the subnet so instances can acquire IP addresses.
id: Izinkan ingress DHCP and DHCPv6 responses dari server DHCP di subnet sehingga kasus dapat memperoleh alamat IP.
tr_tr: Sunucuların IP adresleri alabilmesi için alt ağdaki DHCP sunucusundan giriş DHCP ve DHCPv6 yanıtlarına izin verin.

source: Allow ingress/egress ICMPv6 MLD, neighbor solicitation, and neighbor discovery messages so instances can discover neighbors and join multicast groups.
id: Izinkan ingress/egress ICMPv6 MLD, neighbor solicitation, dan pesan penemuan tetangga sehingga instance dapat menemukan neighbors dan bergabung dengan multicast groups.
tr_tr: Sunucuların komşuları keşfedebilmesi ve çok noktaya yayın gruplarına katılabilmesi için ICMPv6 MLD girişi/çıkışı, komşu talep ve komşu bulma iletilerine izin verin.

source: Allowing a network to be used as an external network
id: Membiarkan jaringan untuk digunakan sebagai jaringan eksternal
tr_tr: Bir ağın harici bir ağ olarak kullanılmasına izin verilmesi

source: Also, provider networks only handle layer-2 connectivity for instances, thus lacking support for features such as routers and floating IP addresses.
id: Juga, jaringan provider hanya menangani layer-2 connectivity untik instance, sehingga kurang dukungan untuk fitur seperti router dan alamat IP mengambang.
tr_tr: Ayrıca, sağlayıcı ağları yalnızca sunucular için katman-2 bağlantısını işlemektedir, bu nedenle yönlendiriciler ve kayan IP adresleri gibi özellikler için destek bulunmamaktadır.

source: Alternatively the ``pci_passthrough_whitelist`` parameter also supports whitelisting by:
id: Atau dengan parameter ``pci_passthrough_whitelist`` juga mendukung daftar putih (whitelisting):
tr_tr: Alternatif olarak, ``pci_passthrough_whitelist`` parametresi de beyaz listeyi şu şekilde desteklemektedir:

source: Alternatively, you can create VFs by passing the ``max_vfs`` to the kernel module of your network interface. However, the ``max_vfs`` parameter has been deprecated, so the PCI SYS interface is the preferred method.
id: Atau, Anda dapat membuat VF dengan melewatkan ``max_vfs`` ke modul kernel dari antarmuka jaringan Anda. Namun, parameter ``max_vfs`` telah usang, sehingga interface PCI SYS menjadi metode yang disukai.
tr_tr: Alternatif olarak, ağ arabiriminizin çekirdek modülüne `` max_vfs`` vererek VF'ler oluşturabilirsiniz. Bununla birlikte, ``max_vfs`` parametresi kullanımdan kaldırılmıştır, bu nedenle PCI SYS arayüzü tercih edilen yöntemdir.

source: Alternatively, you can launch each instance with one network interface and attach additional ports later.
id: Atau, Anda dapat memulai setiap instance dengan satu antarmuka jaringan dan menghubungkan port tambahan nanti.
tr_tr: Alternatif olarak, her bir sunucuyu bir ağ arabirimi ile başlatabilir ve daha sonra ek bağlantı noktaları takabilirsiniz.

source: Although OpenStack does not make use of libvirt's networking, this networking will not interfere with OpenStack's behavior, and can be safely left enabled. However, libvirt's networking can be a nuisance when debugging OpenStack networking issues. Because libvirt creates an additional bridge, dnsmasq process, and iptables ruleset, these may distract an operator engaged in network troubleshooting. Unless you need to start up virtual machines using libvirt directly, you can safely disable libvirt's network.
id: Meskipun OpenStack tidak memanfaatkan jaringan libvirt ini, jaringan ini tidak akan mengganggu perilaku OpenStack, dan dapat dengan aman ditinggalkan diaktifkan. Namun, jaringan libvirt bisa menjadi gangguan ketika debugging masalah jaringan OpenStack. Karena Libvirt menciptakan jembatan tambahan, proses dnsmasq, dan iptables ruleset, ini mungkin mengalihkan perhatian operator terlibat dalam pemecahan masalah jaringan. Kecuali Anda perlu untuk memulai mesin virtual menggunakan libvirt langsung, Anda dapat dengan aman menonaktifkan jaringan libvirt ini.
tr_tr: OpenStack, libvirt'in ağını kullanmasa da, bu ağ OpenStack'ın davranışını etkilemeyecektir ve güvenle açık olarak bırakılabilir. Bununla birlikte, libvirt'in ağları OpenStack ağ sorunlarını gidermekte sıkıntı olabilir. Libvirt ek bir köprü, dnsmasq süreci ve iptables kural seti oluşturduğundan, bu ağ sorunlarını giderme ile uğraşan bir operatoru rahatsız edebilir. Sanal makineleri libvirt'i doğrudan başlatmak zorunda değilseniz, libvirt'in ağını güvenle devre dışı bırakabilirsiniz.

source: Although non-IP traffic, security groups do not implicitly allow all ARP traffic. Separate ARP filtering rules prevent instances from using ARP to intercept traffic for another instance. You cannot disable or remove these rules.
id: Meskipun lalu lintas non-IP, kelompok keamanan tidak secara implisit mengizinkan semua lalu lintas ARP. Pisahkan aturan penyaringan ARP untuk mencegah instance menggunakan ARP untuk menghadang lalu lintas instance lain. Anda tidak dapat menonaktifkan atau menghapus aturan ini.
tr_tr: IP dışı trafiğe rağmen, güvenlik grupları tüm ARP trafiğine örtük olarak izin vermez. Ayrı ARP filtreleme kuralları, sunucuların, trafiği başka bir sunucuyu engellemek için ARP kullanmasını engeller. Bu kuralları devre dışı bırakamaz veya kaldıramazsınız.

source: Although self-service networks generally use private IP address ranges (RFC1918) for IPv4 subnets, BGP dynamic routing can advertise any IPv4 address ranges.
id: Meskipun jaringan self-service umumnya menggunakan rentang alamat IP private (RFC1918) untuk subnet IPv4, BGP routing dinamis dapat menyiarkan upadate dan perubahan rentang alamat IPv4.
tr_tr: Self-servis ağlar IPv4 alt ağları için genellikle özel IP adres aralığı (RFC1918) kullanmalarına rağmen, BGP dinamik yönlendirme herhangi bir IPv4 adres aralığını ilan edebilir.

source: Although, the Networking service provides high availability for routers and high availability and fault tolerance for networks' DHCP services, availability zones provide an extra layer of protection by segmenting a Networking service deployment in isolated failure domains. By deploying HA nodes across different availability zones, it is guaranteed that network services remain available in face of zone-wide failures that affect the deployment.
id: Meskipun, layanan Networking menyediakan ketersediaan tinggi untuk router dan dan toleransi kesalahan untuk layanan DHCP jaringan ', zona ketersediaan memberikan lapisan tambahan perlindungan dengan segmentasi pengerahan layanan jaringan di daerah kegagalan terisolasi (isolated failure domain). Dengan mengerahkan HA node (High Availability node) di zona ketersediaan yang berbeda, dijamin bahwa layanan jaringan tetap tersedia dalam menghadapi kegagalan zone-wide yang mempengaruhi pengerahan.
tr_tr: Ağ hizmetleri, yönlendiriciler için yüksek kullanılabilirlik ve ağların DHCP hizmetleri için yüksek kullanılabilirlik ve hata toleransı sağlamakla birlikte, izole edilmiş başarısız etki alanlarında bir Ağ hizmeti dağıtımını segmentize ederek ek bir koruma katmanı sağlar. Farklı kullanılabilirlik bölgeleri arasında HA düğümleri dağıtarak, dağıtımın uygulanmasını etkileyen bölge çapında başarısızlıklar karşısında ağ hizmetlerinin kullanılabilirliğini garantiler.

source: An L2 agent serves layer 2 (Ethernet) network connectivity to OpenStack resources. It typically runs on each Network Node and on each Compute Node.
id: Agen L2 membantu konektivitas jaringan layer 2 (Ethernet) untuk sumber OpenStack. Ini biasanya berjalan pada setiap Network Node dan pada setiap Compute Node.
tr_tr: Bir L2 aracı, OpenStack kaynaklarına katman 2 (Ethernet) ağ bağlantısına hizmet eder. Genellikle her Ağ Düğümünde ve her Hesaplama Düğümünde çalışır.

source: An administrator can mark a pool as default. Only one pool from each address family can be marked default.
id: Administrator dapat menandai kolam sebagai default. Hanya satu kolam dari masing-masing keluarga alamat dapat ditandai default.
tr_tr: Bir yönetici havuzu varsayılan olarak işaretleyebilir. Her bir adres ailesinden yalnızca bir havuz varsayılan olarak işaretlenebilir.

source: An administrator might want to disable an agent if a system hardware or software upgrade is planned. Some agents that support scheduling also support disabling and enabling agents, such as L3 and DHCP agents. After the agent is disabled, the scheduler does not schedule new resources to the agent.
id: Administrator mungkin ingin menonaktifkan agen jika sistem perangkat keras atau upgrade perangkat lunak direncanakan. Beberapa agen yang mendukung penjadwalan juga mendukung penonaktifan dan pengaktifan agen, seperti L3 dan DHCP agen. Setelah agen dinonaktifkan, scheduler tidak menjadwalkan sumber daya baru untuk agen.
tr_tr: Bir yönetici, bir sistem donanımının veya yazılım yükseltmesinin planlanması durumunda bir ajanı devre dışı bırakmak isteyebilir. Zamanlama'yı destekleyen bazı ajanlar, L3 ve DHCP ajanları gibi ajanların devre dışı bırakılmasını ve etkinleştirilmesini de desteklemektedir. Ajan devre dışı bırakıldıktan sonra, zamanlayıcı ajana yeni kaynaklar zamanlamaz.

source: An availability zone groups network nodes that run services like DHCP, L3, FW, and others. It is defined as an agent's attribute on the network node. This allows users to associate an availability zone with their resources so that the resources get high availability.
id: Sebuah node ketersediaan kelompok zona jaringan yang menjalankan layanan seperti DHCP, L3, FW, dan lain-lain. Hal ini didefinisikan sebagai atribut agen pada node jaringan. Hal ini memungkinkan pengguna untuk menghubungkan zona ketersediaan sumber daya mereka sehingga sumber daya mendapatkan ketersediaan tinggi.
tr_tr: Bir kullanılabilirlik bölgesi, DHCP, L3, FW ve diğerleri gibi hizmetleri çalıştıran ağ düğümlerini gruplar. Ağ düğümünde bir aracının özniteliği olarak tanımlanır. Bu, kullanıcıların bir kullanılabilirlik bölgesi ile kaynaklarını ilişkilendirmesini, böylece kaynakların yüksek kullanılabilirlik kazanmasını sağlar.

source: An availability zone is used to make network resources highly available. The operators group the nodes that are attached to different power sources under separate availability zones and configure scheduling for resources with high availability so that they are scheduled on different availability zones.
id: Zona ketersediaan digunakan untuk membuat sumber daya jaringan sangat tersedia. Operator mengelompokan node yang melekat pada sumber daya yang berbeda di bawah zona ketersediaan terpisah dan mengkonfigurasi penjadwalan sumber daya dengan ketersediaan tinggi sehingga mereka dijadwalkan pada zona ketersediaan yang berbeda.
tr_tr: Ağ kaynakları yüksek kullanılabilirliğe getirmek için bir kullanılabilirlik bölgesi kullanılır. Operatörler, ayrı ayrı kullanılabilirlik bölgeleri altında farklı güç kaynaklarına bağlı düğümleri gruplar ve farklı kullanılabilirlik bölgeleri üzerinde planlanacak şekilde yüksek kullanılabilirlikli kaynaklar için zamanlama yapılandırır.

source: An external DHCPv6 server in theory could override the full address OpenStack assigns based on the EUI-64 address, but that would not be wise as it would not be consistent through the system.
tr_tr: Teoride harici bir DHCPv6 sunucusu, OpenStack'ın EUI-64 adresine dayanan tam adresini geçersiz kılabilir, ancak sistem ile tutarlı olmayacağı için akıllıca olmayacaktır.

source: An instance with an interface with an IPv4 address in a routed provider network must be placed by the Compute scheduler in a host that has access to a segment with available IPv4 addresses. To make this possible, the Networking service communicates to the Compute scheduler the inventory of IPv4 addresses associated with each segment of a routed provider network. The operator must configure the authentication credentials that the Networking service will use to communicate with the Compute scheduler's placement API. Please see below an example configuration.
id: Sebuah instance dengan sebuah antarmuka dengan alamat IPv4 dalam jaringan provider yang diarahkan harus ditempatkan oleh Compute scheduler di host yang memiliki akses ke segmen dengan alamat IPv4 yang tersedia. Untuk membuat ini mungkin terjadi, layanan Networking berkomunikasi dengan Compute scheduler persediaan alamat IPv4 yang terkait dengan setiap segmen jaringan provider yang diarahkan. Operator harus mengkonfigurasi kredensial otentikasi dimana layanan Networking akan digunakan untuk berkomunikasi dengan placement API di Compute scheduler. Silakan lihat di bawah konfigurasi contoh.
tr_tr: Yönlendirilmiş bir sağlayıcı ağında bir IPv4 adresine sahip bir arayüze sahip bir sunucu Hesaplama zamanlayıcısı tarafından kullanılabilir IPv4 adreslerine sahip bir dilime erişimi olan bir ana bilgisayara yerleştirilmelidir. Bunu mümkün kılmak için, Ağ hizmeti, Hesaplama zamanlayıcısına yönlendirilmiş bir sağlayıcı ağının her bir bölümüyle ilişkili IPv4 adreslerinin envanterini iletir. Operatör, Ağ hizmetinin Hesaplama zamanlayıcı yerleştirme API'si ile iletişim kurmak için kullanacağı kimlik doğrulama bilgilerini yapılandırmalıdır. Lütfen aşağıda örnek yapılandırmaya bakın.

source: Any given Linux process runs in a particular network namespace. By default this is inherited from its parent process, but a process with the right capabilities can switch itself into a different namespace; in practice this is mostly done using the :command:`ip netns exec NETNS COMMAND...` invocation, which starts ``COMMAND`` running in the namespace named ``NETNS``. Suppose such a process sends out a message to IP address A.B.C.D, the effect of the namespace is that A.B.C.D will be looked up in that namespace's routing table, and that will determine the network device that the message is transmitted through.
id: Setiap proses Linux yang ada berjalan dalam namespace jaringan tertentu. Secara default proses ini merupakan warisan (inherited) dari proses induknya, tetapi sebuah proses dengan kemampuan yang tepat dapat mengalihkan dirinya menjadi namespace yang berbeda; dalam praktek ini banyak dilakukan dengan menggunakan :command:`ip netns exec NETNS COMMAND...` invocation, yang memulai menjalankan `` COMMAND`` di namespace yang bernama `` NETNS``. Misalkan proses tersebut mengirimkan pesan ke alamat IP A.B.C.D, efek dari namespace adalah bahwa A.B.C.D akan mencari dalam tabel routing yang memiliki namespace ini, dan yang akan menentukan perangkat jaringan dimana pesan akan diantarkan.
tr_tr: Herhangi bir Linux süreci belirli bir ağ ad alanında çalışır. Varsayılan olarak bu işlem üst süreçten devralınır, ancak doğru yeteneklere sahip bir süreç kendisini farklı bir ad alanına dönüştürebilir; pratikte bunun çoğunlukla :command:`ip netns exec NETNS COMMAND...` komutu kullanılarak yapılır; ``NETNS`` ad alanındaki ``COMMAND`` çalıştırılır. Böyle bir işlemin A.B.C.D IP adresine bir mesaj gönderdiğini varsayalım, isim alanının etkisi A.B.C.D bu ad alanının yönlendirme tablosunda aranacak ve mesajın gönderileceği ağ cihazını belirleyecektir.

source: Any plug-in or ml2 mechanism driver can claim support for some QoS rule types by providing a plug-in/driver class property called ``supported_qos_rule_types`` that returns a list of strings that correspond to `QoS rule types <https://git.openstack.org/cgit/openstack/neutron/tree/neutron/services/qos/qos_consts.py>`_.
id: Driver mekanisme ml2 atau plug-in dapat mengklaim dukungan untuk beberapa tipe atauran QoS dengan menyediakan properti kelas plug-in/driver yang disebut ``supported_qos_rule_types`` yang mengembalikan daftar string yang sesuai dengan `QoS rule types <https://git.openstack.org/cgit/openstack/neutron/tree/neutron/services/qos/qos_consts.py>`_.
tr_tr: Herhangi eklenti veya ml2 mekanizma sürücüsü, `QoS kural türleri <https://git.openstack.org/cgit/openstack/neutron/tree/neutron/services/qos/qos_consts.py>`_ne karşılık bir karakter dizisi listesi döndüren ``supported_qos_rule_types`` isimli bir eklenti/sürücü sınıf özelliği sağlayarak bazı QoS kural türleri için destek talep eder.

source: Anyone with access to the Networking service can create their own address scopes. However, network administrators can create shared address scopes, allowing other projects to create networks within that address scope.
id: Siapapun dengan akses ke layanan Networking dapat membuat lingkup alamat mereka sendiri. Namun, administrator jaringan dapat membuat lingkup alamat bersama, yang memungkinkan proyek lain untuk membuat jaringan dalam lingkup alamat itu.
tr_tr: Ağ hizmetine erişimi olan herkes kendi adres alanlarını oluşturabilir. Bununla birlikte, ağ yöneticileri, paylaşımlı adres alanları oluşturabilir ve diğer projelerin bu adres alanı içinde ağlar oluşturmasına izin verebilir.

source: Appendix
tr_tr: Ek

source: Apply the security group to the load balancer's network port using ``vip_port_id`` from the :command:`neutron lbaas-loadbalancer-show` command:
id: Terapkan kelompok keamanan untuk port jaringan penyeimbang beban menggunakan `` vip_port_id`` dari perintah :command:`neutron lbaas-loadbalancer-show`:
tr_tr: :command:`neutron lbaas-loadbalancer-show` komutundan ``vip_port_id`` kullanarak güvenlik grubunu yük dengeleyicinin ağ bağlantı noktasına uygulayın:

source: Architecture
id: Arsitektur
tr_tr: Mimari
