Repository: 25hours/openstack-manuals
Catalog: doc/networking-guide/source/locale/*/LC_MESSAGES/networking-guide.po
Languages: id, tr_tr

source: Create and add ``vhost-user`` network interfaces to instances in the same fashion as conventional interfaces. These interfaces can use the kernel ``virtio-net`` driver or a DPDK-compatible driver in the guest
id: Buat dan tambahkan antarmuka jaringan ``vhost-user`` untuk instance dengan cara yang sama sebagai antarmuka konvensional. Antarmuka ini dapat menggunakan driver ``virtio-net`` kernel atau driver DPDK-compatible di guest
tr_tr: Klasik arabirimlerle aynı kipte ``vhost-user`` ağ arabirimleri oluşturun ve ekleyin. Bu arabirimler konukta ``virtio-net`` çekirdeği veya DPDK uyumlu bir sürücü kullanabilir

source: Create and configure the BGP speaker
id: Membuat dan mengkonfigurasi BGP speaker
tr_tr: BGP yayıncıyı oluştur ve yapılandır

source: Create and configure the routers
id: Membuat dan mengkonfigurasi router
tr_tr: Yönlendiricileri oluştur ve yapılandır

source: Create default subnetpools
id: Buat subnetpools bawaan
tr_tr: Varsayılan altağ havuzu oluştur

source: Create flow classifier ``FC1`` that matches the appropriate packet headers.
id: Buat klassifier aliran ``FC1`` yang cocok dengan header paket yang sesuai.
tr_tr: Uygun paket üstbilgileriyle eşleşen akış sınıflandırıcısı ``FC1`` oluşturun.

source: Create initial networks
id: Menciptakan jaringan awal
tr_tr: Başlangıç ağları oluştur

source: Create networks and subnets for the trunk and subports
id: Buat jaringan dan subnet untuk trunk dan subports
tr_tr: Bilgi aktarım yolu ve alt bağlantı noktaları için ağlar ve alt ağlar oluştur

source: Create port chain ``PC1`` with port pair groups ``PPG1`` and ``PPG2`` and flow classifier ``FC1``.
id: Buat rantai port ``PC1`` dengan kelompok pasangan port ``PPG1`` dan `` PPG2`` dan mengalir klassifier aliran ``FC1``.
tr_tr: Bağlantı noktaları çiftleri grupları ``PPG1`` ve ``PPG2`` ve akış sınıflandırıcı ``FC1`` ile bağlantı birimi ``PC1`` oluşturun.

source: Create port pair ``PP1`` with ports ``p1`` and ``p2``, ``PP2`` with ports ``p3`` and ``p4``, and ``PP3`` with ports ``p5`` and ``p6``.
id: Buat pasangan port ``PP1`` dengan port ``p1`` dan ``p2``, ``PP2`` dengan port ``p3`` dan ``p4``, dan ``PP3`` dengan port ``p5`` dan ``p6``.
tr_tr: ``p1`` ve ``p2`` ile ``PP1``, ``p3`` ve ``p4`` ile ``PP2`` ve ``p5`` ve ``p6`` ile ``PP3`` bağlantı noktası çifti oluştur.

source: Create port pair group ``PPG1`` with port pair ``PP1`` and ``PP2`` and ``PPG2`` with port pair ``PP3``.
id: Buat grup pasangan port ``PPG1`` dengan pasangan port ``PP1`` dan ``PP2`` dan ``PPG2`` dengan pasangan port ``PP3``.
tr_tr: ``PP1`` ve ``PP2`` ve ``PPG2`` bağlantı noktası çiftleri ``PP3` bağlantı noktasıyla çiftiyle ``PPG1`` bağlantı noktası çifti grubu oluşturun.

source: Create ports on network ``net1`` and record the UUID values.
id: Buat port pada jaringan ``net1`` dan merekam nilai UUID.
tr_tr: ``net1`` ağında bağlantı noktaları oluşturun ve UUID değerlerini kaydedin.

source: Create shared address scopes as an administrative user
id: Buat lingkup alamat bersama sebagai pengguna administratif
tr_tr: Yönetici kullanıcı olarak paylaşımlı adres alanı oluştur

source: Create subnet pools specifying the name (or UUID) of the address scope that the subnet pool belongs to. If you have existing subnet pools, use the :command:`openstack subnet pool set` command to put them in a new address scope:
id: Buat kolam subnet yang menetapkan nama (atau UUID) dari lingkup alamat (address scope) dimana kolam subnet memilikinya. Jika Anda telah ada kolam subnet, gunakan perintah :command:`openstack subnet pool set` untuk menempatkan mereka dalam lingkup alamat baru:
tr_tr: Alt ağ havuzunun ait olduğu adres alanının adını (veya UUID'sini) belirten alt ağ havuzları oluşturun. Mevcut alt ağ havuzlarınız varsa, bunları yeni bir adres kapsamına koymak için :command:`openstack subnet pool set` komutunu kullanın:

source: Create subnet pools. The provider and self-service networks use different pools.
id: Membuat kolam subnet. Jaringan provider dan self-service menggunakan kolam yang berbeda.
tr_tr: Alt ağ havuzları oluşturun. Sağlayıcı ve self-servis ağları farklı havuzlar kullanmaktadır.

source: Create subnets on the ``segment1`` segment. In this example, the IPv4 subnet uses 203.0.113.0/24 and the IPv6 subnet uses fd00:203:0:113::/64.
id: Buat subnet pada segmen ``segment1``. Dalam contoh ini, subnet IPv4 menggunakan 203.0.113.0/24 dan IPv6 menggunakan subnet fd00:203:0:113::/64.
tr_tr: ``segment1`` diliminde alt ağlar oluşturun. Bu örnekte, IPv4 alt ağında 203.0.113.0/24 kullanılıyor ve IPv6 alt ağında fd00:203:0:113::/64 kullanılıyor.

source: Create subnets on the ``segment2`` segment. In this example, the IPv4 subnet uses 198.51.100.0/24 and the IPv6 subnet uses fd00:198:51:100::/64.
id: Buat subnet pada segmen ``segment2``. Dalam contoh ini, subnet IPv4 menggunakan 198.51.100.0/24 dan IPv6 menggunakan subnet fd00:198:51:100::/64.
tr_tr: ``segment2`` diliminde alt ağlar oluşturun. Bu örnekte, IPv4 alt ağında 198.51.100.0/24 kullanılıyor ve IPv6 alt ağında fd00:198:51:100::/64 kullanılıyor.

source: Create the BGP speaker.
id: Buat BGP speaker.
tr_tr: BGP yayıncıyı oluştur.

source: Create the OVS provider bridge ``br-provider``:
id: Buat OVS provider bridge ``br-provider``:
tr_tr: OVS sağlayıcı köprüsü ``br-provider``i oluştur:

source: Create the RBAC policy entry using the :command:`openstack network rbac create` command (in this example, the ID of the project we want to share with is ``be98b82f8fdf46b696e9e01cebc33fd9``):
id: Buat entri kebijakan RBAC menggunakan perintah :command:`openstack network rbac create` (dalam contoh ini, ID proyek dimana kami ingin berbagi dengan adalah ``be98b82f8fdf46b696e9e01cebc33fd9``):
tr_tr: RBAC poltikasını :command:`openstack network rbac create` komutunu kullanarak oluşturun (bu örnekte, politikayı paylaşmak istediğimiz projenin ID'si ``be98b82f8fdf46b696e9e01cebc33fd9``):

source: Create the SR-IOV port. ``vnic_type=direct`` is used here, but other options include ``normal``, ``direct-physical``, and ``macvtap``:
id: Buat port SR-IOV. ``vnic_type=direct`` digunakan di sini, tapi pilihan lain termasuk ``normal``, ``direct-physical``, dan ``macvtap``:
tr_tr: SR-IOV bağlantı noktası oluşturun. ``vnic_type=direct`` burada kullanılır, ancak diğer seçenekler ``normal``, ``direct-physical`` ve ``macvtap`` içerir:

source: Create the VFs for the network interface that will be used for SR-IOV. We use ``eth3`` as PF, which is also used as the interface for the VLAN provider network and has access to the private networks of all machines.
id: Buat VF untuk antarmuka jaringan yang akan digunakan untuk SR-IOV. Kami menggunakan ``eth3`` sebagai PF, yang juga digunakan sebagai antarmuka untuk jaringan penyedia VLAN dan memiliki akses ke jaringan private dari semua mesin.
tr_tr: SR-IOV için kullanılacak ağ arabirimi için VF'ler oluşturun. Ayrıca, VLAN sağlayıcı ağının arayüzü olarak kullanılan ve tüm makinelerin özel ağlarına erişimi olan PF olarak ``eth3`` kullanıyoruz.

source: Create the address scope and subnet pools
id: Buat lingkup alamat dan kolam subnet
tr_tr: Adres kapsamını ve alt ağ havuzlarını oluşturma

source: Create the appropriate networks for the trunk and subports that will be added to the trunk. Create subnets on these networks to ensure the desired layer-3 connectivity over the trunk.
id: Buat jaringan yang tepat untuk trunk dan subports yang akan ditambahkan ke bagasi. Buat subnet pada jaringan ini untuk memastikan konektivitas lapisan-3 yang diinginkan di atas trunk.
tr_tr: Bilgi aktarım yolu için gerekli ağları oluşturun ve bilgi aktarım yoluna eklenecek olan alt yüklemeleri yapın. Bilgi aktarım yolu üzerinde istediğiniz katman-3 bağlantısını sağlamak için bu ağlarda alt ağlar oluşturun.

source: Create the appropriate security group rules to allow ``ping`` and SSH access instances using the network.
id: Buat aturan kelompok keamanan yang sesuai untuk mengizinkan ``ping`` dan akses SSH instance menggunakan jaringan.
tr_tr: Ağı kullanarak ``ping`` ve SSH erişim örneklerine izin vermek için uygun güvenlik grubu kurallarını oluşturun.

source: Create the firewall rules and create a policy that contains them. Then, create a firewall that applies the policy.
id: Buat aturan firewall dan buat kebijakan yang berisi mereka. Kemudian, buat firewall yang memberlakukan kebijakan.
tr_tr: Güvenlik duvarı kurallarını oluşturun ve bunları içeren bir ilke oluşturun. Ardından, ilkeyi uygulayan bir güvenlik duvarı oluşturun.

source: Create the instance. Specify the SR-IOV port created in step two for the NIC:
id: Buat instance. Tentukan port SR-IOV yang akan dibuat pada dua langkah untuk NIC:
tr_tr: Sunucuyu oluştur. NIC için ikinci adımda oluşturulan SR-IOV bağlantı noktasını belirtin:

source: Create the policy entry using the :command:`openstack network rbac create` command (in this example, the ID of the project we want to share with is ``b87b2fc13e0248a4a031d38e06dc191d``):
id: Buat entri kebijakan menggunakan perintah :command:`openstack network rbac create` (Dalam contoh ini, ID proyek dimana kami ingin berbagi dengan adalah ``b87b2fc13e0248a4a031d38e06dc191d``):
tr_tr: :command:`openstack network rbac create` komutunu kullanarak politika girdisi oluştur (bu örnekte paylaşmak istediğimiz projenin ID'si ``b87b2fc13e0248a4a031d38e06dc191d``):

source: Create the provider and self-service networks
id: Buat jaringan provider dan self-service
tr_tr: Sağlayıcı ve self-servis ağları oluştur

source: Create the provider network pool.
id: Buat kolam jaringan provider.
tr_tr: Sağlayıcı ağ havuzu oluşturun.

source: Create the provider network.
id: Create jaringan provider.
tr_tr: Sağlayıcı ağ oluştur.

source: Create the required tables in the database:
id: Buat tabel yang diperlukan dalam database:
tr_tr: Veri tabanında gerekli tabloları oluşturun:

source: Create the routers.
id: Buat router.
tr_tr: Yönlendiricileri oluştur.

source: Create the self-service network pool.
id: Buat kolam jaringan self-service.
tr_tr: Self servis ağ havuzu oluşturun.

source: Create the self-service networks.
id: Buat jaringan self-service.
tr_tr: Self-servis ağları oluştur.

source: Create the trunk
id: Buat trunk
tr_tr: Bilgi aktarım yolunu oluştur

source: Create the trunk using ``--parent-port`` to reference the port from the previous step:
id: Buat trunk menggunakan ``--parent-port`` untuk referensi port dari langkah sebelumnya:
tr_tr: Bağlanto noktasını önceki adımdan referans almak için ``--parent-port`` kullanarak bilgi aktarım yolu oluşturun:

source: Create trunk with subports:
id: Buat trunk dengan subports:
tr_tr: Altportlar ile bilgi aktarım yolu oluşturma:

source: Creating CIDR subnets including a multicast address or a loopback address cannot be used in an OpenStack environment. For example, creating a subnet using ``224.0.0.0/16`` or ``127.0.1.0/24`` is not supported.
id: Pembuatan subnet CIDR termasuk alamat multicast atau alamat loopback tidak dapat digunakan dalam lingkungan OpenStack. Misalnya, membuat subnet dengan menggunakan ``224.0.0.0/16`` or ``127.0.1.0/24`` tidak didukung.
tr_tr: Bir çoklu yayın adresi veya bir geri döngü adresi de dahil olmak üzere CIDR alt ağları oluşturmak, bir OpenStack ortamında kullanılamaz. Örneğin, ``224.0.0.0/16`` veya ``127.0.1.0/24`` kullanarak bir alt ağ oluşturulması desteklenmemektedir.

source: Creating a port and passing it to an instance yields a different behavior than conventional networks. The Networking service defers assignment of IP addresses to the port until the particular compute node becomes apparent. For example:
id: Pembuatan port dan meneruskananya ke sebuah instance mengakibatkan aturan yang berbeda dari jaringan konvensional. Layanan Networking menangguhkan penugasan alamat IP ke port sampai node komputasi tertentu menjadi jelas. Sebagai contoh:
tr_tr: Bir bağlantı noktası oluşturmak ve onu bir sunucuya bağlamak, geleneksel ağlardan farklı bir davranışa neden olur. Ağ hizmeti, belirli hesaplama düğümü açık olana kadar IP adreslerinin bağlantı noktasına atanmasını erteler. Örneğin:

source: Creating a subnet with a service type requires administrative privileges.
id: Pembuatan subnet dengan tipe layanan membutuhkan hak administratif.
tr_tr: Hizmet türüne sahip bir alt ağ oluşturmak yönetimsel ayrıcalıkları gerektirir.

source: Creating or updating a port with a specific subnet skips this selection process and explicitly uses the given subnet.
id: Pembuatan atau pembaharuan port dengan subnet tertentu melompati proses seleksi ini dan secara eksplisit menggunakan subnet yang diberikan.
tr_tr: Belirli bir alt ağa sahip bir bağlantı noktasının oluşturulması veya güncellenmesi, bu seçim işlemini atlar ve verilen alt ağ'ı açıkça kullanır.

source: Currently, SFC lacks support for multi-project service functions.
id: Saat ini, SFC tidak memiliki dukungan untuk fungsi-fungsi layanan multi-proyek.
tr_tr: Şimdilik, SFC, çoklu proje hizmet işlevleri için destek bulunmuyor.

source: Currently, no migration path exists between v1 and v2 load balancers. If you choose to switch from v1 to v2, you must recreate all load balancers, pools, and health monitors.
id: Saat ini, tidak ada jalur migrasi berada antara penyeimbang beban v1 dan v2. Jika Anda memilih untuk beralih dari v1 ke v2, Anda harus menciptakan semua penyeimbang beban, kolam, dan monitor kesehatan.
tr_tr: Mevcutta, v1 ve v2 yük dengeleyicileri arasında hiç göç yolu bulunmuyor. V1'den v2'ye geçmeyi seçerseniz, tüm yük dengeleyicileri, havuzları ve sağlık monitörlerini yeniden oluşturmak zorundasınız.

source: Currently, the ``shared`` flag is just a mapping to the underlying RBAC policies for a network. Setting the flag to ``True`` on a network creates a wildcard RBAC entry. Setting it to ``False`` removes the wildcard entry.
id: Saat ini, flag ``shared`` hanyalah pemetaan kebijakan RBAC yang mendasarinya untuk jaringan. Pengaturan flag ke `` True`` pada jaringan menciptakan entri RBAC wildcard. Pengaturan ke `` False`` menghapus entri wildcard.
tr_tr: Şimdilik, ``paylaşımlı`` bayrağı sadece bir ağ için temel alınan RBAC ilkelerine bir eşlemedir. Bir ağda bayrağı ``True`` olarak ayarlamak joker karakter RBAC girişi oluşturur. Onu ``False`` olarak ayarlamak, joker karakter girdisini kaldırır.

source: Currently, the access that can be granted using this feature is supported by:
id: Saat ini, akses yang dapat diberikan penggunaan fitur ini didukung oleh:
tr_tr: Mevcutta, bu özellik kullanarak verilebilecek erişim şunun tarafından desteklenmektedir:

source: DHCP agent
id: Agen DHCP
tr_tr: DHCP ajanı

source: DHCP clients locate the DHCP server by sending a UDP_ packet from port 68 to address ``255.255.255.255`` on port 67. Address ``255.255.255.255`` is the local network broadcast address: all hosts on the local network see the UDP packets sent to this address. However, such packets are not forwarded to other networks. Consequently, the DHCP server must be on the same local network as the client, or the server will not receive the broadcast. The DHCP server responds by sending a UDP packet from port 67 to port 68 on the client. The exchange looks like this:
id: Klien DHCP mencari server DHCP dengan mengirimkan UDP_ packet dari port 68 untuk alamat `` 255.255.255.255`` pada port 67. Alamat `` 255.255.255.255`` adalah alamat broadcast jaringan lokal: semua host di jaringan lokal melihat paket UDP dikirim ke alamat ini. Namun, paket tersebut tidak diteruskan ke jaringan lain. Akibatnya, server DHCP harus berada di jaringan lokal yang sama sebagai klien, atau server tidak akan menerima siaran. Server DHCP merespon dengan mengirimkan paket UDP dari port 67 ke port 68 pada klien. Pertukaran terlihat seperti ini:
tr_tr: DHCP istemcileri, 68 numaralı bağlantı noktasından 67 numaralı bağlantı noktasındaki ``255.255.255.255`` adresine bir UDP_ paketi göndererek DHCP sunucusunu bulur. Yerel ağ yayın adresi olan ``255.255.255.255`` adresidir: yerel ağdaki tüm ana bilgisayarlar, bkz. Bu adrese gönderilen UDP paketleri. Bununla birlikte, bu tür paketler diğer ağlara yönlendirilmez. Sonuç olarak, DHCP sunucusu istemci ile aynı yerel ağda olmalıdır veya sunucu yayın almayacaktır. DHCP sunucusu, 67 numaralı bağlantı noktasından istemcideki 68 numaralı bağlantı noktasına bir UDP paketi göndererek yanıt verir. Alış veriş şöyle görünür:

source: DHCP high availability
id: DHCP ketersediaan tinggi
tr_tr: DHCP yüksek kullanılabilirliği

source: DHCP services are created on availability zones you selected when creating the network.
id: Layanan DHCP diciptakan di zona ketersediaan dimana Anda pilih ketika pembuatan jaringan.
tr_tr: DHCP servisleri, ağı oluştururken seçtiğiniz kullanılabilirlik bölgesinde oluşturulur.

source: DHCP_, the Domain Name System (DNS), the Network Time Protocol (NTP), and :ref:`VXLAN` are examples of UDP-based protocols used in OpenStack deployments.
id: DHCP_, the Domain Name System (DNS), Network Time Protocol (NTP), dan :ref:`VXLAN` adalah contoh dari protokol berbasis UDP yang digunakan dalam pengerahan OpenStack.
tr_tr: DHCP_, Alan Adı Sistemi (DNS), Ağ Zaman Protokolü (NTP) ve :ref:`VXLAN`, OpenStack dağıtımlarında kullanılan UDP tabanlı protokol örneklerindendir.

source: DNS integration
id: Integrasi DNS
tr_tr: DNS entegrasyonu

source: DVR lacks support for routing directly to a fixed IP address via the floating IP agent gateway port and thus prevents the BGP speaker from advertising fixed IP addresses.
id: DVR kekurangan dukungan untuk routing langsung ke alamat IP tetap melalui port gateway agen IP mengambang dan dengan demikian mencegah BGP speaker dari penyiaran update dan perubahan alamat IP tetap.
tr_tr: DVR, kayan IP ajan ağ geçidi portu üzerinden doğrudan sabit bir IP adresine yönlendirme desteğine sahip değildir ve böylece BGP yayıncının sabit IP adreslerini önerilerden almasını önler.

source: DVR with IPv6 functions similarly to DVR with IPv4.
id: DVR dengan fungsi IPv6 mirip dengan DVR dengan IPv4.
tr_tr: IPv6'lı DVR, IPv4'li DVR'ye benzer şekilde işlev görür.

source: Database
tr_tr: Veritabanı

source: Database downgrade is not supported.
id: Database downgrade tidak didukung.
tr_tr: Veritabanı sürüm düşürme desteklenmiyor.

source: Database management command-line tool
id: Alat command-line pengelolaan database
tr_tr: Komut satırı veritabanı yönetim aracı

source: Deactivating the network will remove the ``virbr0`` bridge, terminate the dnsmasq process, and remove the iptables rules.
id: Penonaktifkan jaringan akan menghapus jembatan ``virbr0``, akhiri proses dnsmasq, dan hapus aturan iptable.
tr_tr: Ağın devre dışı bırakılması ``virbr0`` köprüsünü kaldıracak, dnsmasq sürecini sonlandıracak ve iptables kurallarını kaldıracaktır.

source: Default scheduling.
id: Penjadwalan default.
tr_tr: Varsayılan zamanlama.

source: Default subnet pools
id: Kolam subnet default
tr_tr: Varsayılan altağ havuzları

source: Define how an OpenStack network is technically realized. Example: VXLAN
id: Definisikan bagaimana jaringan OpenStack secara teknis diwujudkan. Contoh: VXLAN
tr_tr: OpenStack ağının teknik olarak nasıl gerçekleştirildiğini tanımla. Örnek: VXLAN

source: Define one or more service types for one or more subnets on a particular network. Each service type must correspond to a valid device owner within the port model in order for it to be used.
id: Tentukan satu atau lebih tipe layanan untuk satu atau lebih subnet pada jaringan tertentu. Setiap tipe layanan harus sesuai dengan pemilik perangkat valid dalam model port supaya digunakan.
tr_tr: Belirli bir ağdaki bir veya daha fazla alt ağ için bir veya daha fazla hizmet türünü tanımlayın. Her hizmet türü, kullanılabilmesi için bağlantı noktası modelindeki geçerli bir cihaz sahibine karşılık gelmelidir.

source: Define the mechanism to access an OpenStack network of a certain type. Example: Open vSwitch mechanism driver.
id: Definisikan mekanisme untuk mengakses jaringan OpenStack dari tipe tertentu. Contoh: sopir mekanisme Open vSwitch.
tr_tr: Belirli bir tipteki bir OpenStack ağına erişim mekanizmasını tanımlayın. Örnek: Open vSwitch mekanizma sürücüsü.

source: Definition
tr_tr: Açıklama

source: Delete the network resources for a particular project.
id: Hapus sumber daya jaringan untuk suatu proyek tertentu.
tr_tr: Belirli bir proje için ağ kaynaklarını silin.

source: Deleting the router interface causes the subnet to be reverted to the temporary CIDR, and all ports have their IPs updated. Prefix leases are released and renewed automatically as necessary.
id: Penghapusan antarmuka router menyebabkan subnet yang akan dikembalikan ke CIDR sementara, dan semua port memiliki IP yang diperbaruinya. Peminjaman prefiks dilepaskan dan diperpanjang secara otomatis bila diperlukan.
tr_tr: Yönlendirici arabirimini silmek, alt ağın geçici CIDR'ye dönmesine ve tüm bağlantı noktalarının IP'lerinin güncellenmesine neden olur. Ön ek kiralamalar serbest bırakılır ve gerektiğinde otomatik olarak yenilenir.

source: Demo
tr_tr: Deneme

source: Demo setup
id: Penyiapan demo
tr_tr: Tanıtım kurulumu

source: Deny egress DHCP and DHCPv6 responses to prevent instances from acting as DHCP(v6) servers.
id: Tolak egress DHCP dan DHCPv6 response untuk mencegah instance dari tindakan sebagai server DHCP (v6).
tr_tr: Sunucuların DHCP (v6) sunucuları gibi hareket etmesini önlemek için DHCP ve DHCPv6 yanıtlarını göndermeyi reddet.

source: Deny egress ICMPv6 router advertisements to prevent instances from acting as IPv6 routers and forwarding IPv6 traffic for other instances.
id: Tolak egress ICMPv6 router advertisements untuk mencegah instance dari tindakan sebagai router IPv6 dan meneruskan lalu lintas IPv6 untuk instance lain.
tr_tr: Sunucuların IPv6 yönlendiricileri olarak hareket etmesini ve diğer sunucuları için IPv6 trafiğini iletmesini önlemek için ICMPv6 yönlendirici tanıtım yayınlamayı reddet.

source: Deploy DHCP agents.
id: Mengerahkan agen DHCP.
tr_tr: DHCP ajanlarını yayına al.

source: Deployment examples
id: Contoh pengerahan
tr_tr: Devreye alma örnekleri

source: Description
id: Deskripsi
tr_tr: Açıklama

source: Details about the DB models, API extension, and use cases are out of the scope of this guide but can be found in the `Neutron QoS specification <https://specs.openstack.org/openstack/neutron-specs/specs/liberty/qos-api-extension.html>`_.
id: Rincian tentang model DB, ekstensi API, dan kasus penggunaan (use case) berada di luar cakupan panduan ini, tetapi dapat ditemukan di `Neutron QoS specification <https://specs.openstack.org/openstack/neutron-specs/specs/liberty/qos-api-extension.html>`_.
tr_tr: DB modelleri, API uzantıları ve kullanım durumları hakkındaki detaylar bu belgenin kapsamı dışındadır ama `Neutron QoS özellikleri <https://specs.openstack.org/openstack/neutron-specs/specs/liberty/qos-api-extension.html>`_ belgesinde bulabilirsiniz.

source: Determine the IPv4 and IPv6 addresses of the instance.
id: Tentukan alamat IPv4 dan IPv6 instance.
tr_tr: Sunucunun IPv4 ve IPv6 adreslerini belirleyin.

source: Different types of agents show different details. The following output shows information for a Linux bridge agent:
id: Berbagai jenis agen menunjukkan rincian yang berbeda. Output berikut menunjukkan informasi untuk agen Linux bridge:
tr_tr: Farklı türde ajanlar farklı ayrıntılar gösterir. Aşağıdaki çıktı bir Linux köprü ajanı için bilgi gösterir:

source: Direct assignment during subnet creation via command line or Horizon
id: tugas langsung selama pembuatan subnet melalui baris perintah (command line) atau Horizon
tr_tr: Komut satırı veya Horizon aracılığıyla alt ağ oluşturma sırasında doğrudan atama
