Repository: 25hours/openstack-manuals
Catalog: doc/networking-guide/source/locale/*/LC_MESSAGES/networking-guide.po
Languages: id, tr_tr

source: IP addresses are broken up into two parts: a *network number* and a *host identifier*. Two hosts are on the same *subnet* if they have the same network number. Recall that two hosts can only communicate directly over Ethernet if they are on the same local network. ARP assumes that all machines that are in the same subnet are on the same local network. Network administrators must take care when assigning IP addresses and netmasks to hosts so that any two hosts that are in the same subnet are on the same local network, otherwise ARP does not work properly.
id: Alamat IP yang dipecah menjadi dua bagian: *network number* dan *host identifier*. Dua host pada *subnet* yang sama jika mereka memiliki jumlah jaringan yang sama. Ingat bahwa dua host hanya dapat berkomunikasi secara langsung melintasi Ethernet jika mereka berada di jaringan lokal yang sama. ARP mengasumsikan bahwa semua mesin yang berada di subnet yang sama berada di jaringan lokal yang sama. Administrator jaringan harus berhati-hati ketika menetapkan alamat IP dan netmask ke host sehingga setiap dua host yang berada di subnet yang sama berada di jaringan lokal yang sama, jika tidak seperti itu ARP tidak bekerja dengan benar.
tr_tr: IP adresleri iki kısma ayrılır: bir *ağ numarası* ve bir *anabilgisayar tanımlayıcı*. Aynı ağ numarası varsa, iki ana bilgisayar aynı *alt ağda* bulunur. İki ana bilgisayarın yalnızca aynı yerel ağa bağlıysa doğrudan Ethernet üzerinden iletişim kurabildiğini hatırlayın. ARP, aynı alt ağdaki tüm makinelerin aynı yerel ağda olduğunu varsayar. Ağ yöneticileri, IP adreslerini ve ağ maskelerini ana makinelere atarken dikkatli olmalıdır, böylece aynı alt ağdaki iki ana bilgisayar aynı yerel ağda olur, aksi takdirde ARP düzgün çalışmaz.

source: IP availability metrics
id: Metrik ketersediaan IP
tr_tr: IP kullanılabilirilik ölçütleri

source: IPAM configuration
id: Konfigurasi IPAM
tr_tr: IPAM yapılandırması

source: IPv4 self-service networks typically use private IP address ranges (RFC1918) and interact with provider networks via source NAT on virtual routers. Floating IP addresses enable access to instances from provider networks via destination NAT on virtual routers. IPv6 self-service networks always use public IP address ranges and interact with provider networks via virtual routers with static routes.
id: Jaringan self-service IPv4 biasanya menggunakan rentang alamat IP private (RFC1918) dan berinteraksi dengan jaringan provider melalui sumber NAT pada router virtual. Alamat IP mengambang mengaktifkan akses ke instance dari jaringan provider via NAT tujuan pada router virtual. IPv6 jaringan self-service selalu menggunakan rentang alamat IP publik dan berinteraksi dengan jaringan provider melalui router virtual dengan rute statis.
tr_tr: IPv4 self-servis ağları genellikle özel IP adres aralıklarını (RFC1918) kullanır ve sanal yönlendiriciler üzerinde kaynak NAT vasıtasıyla sağlayıcı ağlarıyla etkileşim kurar. Değişken IP adresleri, sanal yönlendiriciler üzerindeki hedef NAT yoluyla sağlayıcı ağlarından örneklere erişilmesini sağlar. IPv6 self-servis ağları her zaman ortak IP adres aralıklarını kullanır ve statik yollarla sanal yönlendiriciler aracılığıyla sağlayıcı ağlarıyla etkileşim kurar.

source: IPv4: 192.168.0.0/16 in /24 segments
tr_tr: IPv4: /24'lük dilimlerde 192.168.0.0/16

source: IPv6 addressing
id: Alamat IPv6
tr_tr: IPv6 adresleme

source: IPv6 connectivity with self-service networks often requires addition of static routes to nodes and physical network infrastructure.
id: Konektivitas IPv6 dengan jaringan self-service sering membutuhkan penambahan rute statis untuk node dan infrastruktur jaringan fisik.
tr_tr: Self servis ağlar ile IPv6 bağlantısı genellikle düğümlere statik yol eklemeyi ve fiziksel ağ altyapısını gerektirir.

source: IPv6 does work when the Distributed Virtual Router functionality is enabled, but all ingress/egress traffic is via the centralized router (hence, not distributed). More work is required to fully enable this functionality.
id: IPv6 tidak bekerja ketika fungsi Distributed Virtual Router diaktifkan, tetapi semua lalu lintas masuk/keluar (ingress/egress) adalah melalui router terpusat (oleh karena itu, tidak didistribusikan). Banyak pekerjaan diperlukan untuk sepenuhnya mengaktifkan fungsi ini.
tr_tr: IPv6, Dağıtılmış Sanal Yöneltici işlevi etkinleştirildiğinde çalışır, ancak tüm giriş/çıkış trafiği merkezi yönlendirici aracılığıyladır (dolayısıyla dağıtılmamıştır). Bu işlevselliği tamamen etkinleştirmek için daha fazla çalışma gereklidir.

source: IPv6 multicast
tr_tr: IPv6 çoklu gönderim

source: IPv6 since OpenStack Networking has no IPv6 floating IPs.
id: IPv6 sejak OpenStack Networking tidak mempunyai IPv6 floating IP.
tr_tr: OpenStack Ağ IPv6 yüzen IP'leri olmadığından IPv6.

source: IPv6 support in conjunction with any out of tree routers, switches, services or agents whether in physical or virtual form factors.
id: IPv6 mendukungan dalam hubungannya dengan keluar dari tree router, switch, layanan atau agen baik dalam faktor bentuk fisik atau virtual.
tr_tr: Fiziksel veya sanal biçim faktörlerine bakılmaksızın ağaç yönlendiricilerinin, anahtarların, servislerin veya temsilcilerin herhangi biriyle bağlantılı olarak IPv6 desteği.

source: IPv6 supports three different addressing schemes for address configuration and for providing optional network information.
id: IPv6 mendukung tiga skema pengalamatan yang berbeda untuk konfigurasi alamat dan untuk menyediakan informasi jaringan opsional.
tr_tr: IPv6, adres yapılandırması ve isteğe bağlı ağ bilgisi sağlamak için üç farklı adresleme düzenini desteklemektedir.

source: IPv6: fd00:192:168::/48 in /64 segments
tr_tr: IPv6: fd00:192:168::/48 /64'lük dilimlerde

source: If Dashboard is configured to compress static files for better performance (usually set through ``COMPRESS_OFFLINE`` in ``local_settings.py``), optimize the static files again:
id: Jika Dashboard dikonfigurasi untuk kompres file statis untuk kinerja yang lebih baik (biasanya diatur melalui ``COMPRESS_OFFLINE`` dalam ``local_settings.py``), lakukan optimalisasi file statis lagi:
tr_tr: Dashboard, statik dosyaları daha iyi performans için sıkıştırmak üzere yapılandırılmışsa (genellikle ``local_settings.py`` dosyasında ``COMPRESS_OFFLINE`` ile ayarlanır), statik dosyaları tekrar optimize edin:

source: If ``ebrctl`` does not appear in any of the rootwrap files, add this to the ``/etc/nova/rootwrap.d/compute.filters`` file in the ``[Filters]`` section.
id: JIka ``ebrctl`` tidak muncul dalam salah satu file rootwrap, tambahkan ini ke file ``/etc/nova/rootwrap.d/compute.filters`` dalam bagian ``[Filters]``.
tr_tr: Eğer ``ebrctl`` ana paket dosyalardan herhangi birinde görünmezse, ``/etc/nova/rootwrap.d/compute.filters`` dosyasına ``[Filters]`` böülümüne bunu ekleyin.

source: If ``keepalived`` on the backup router stops receiving *heartbeat* packets, it assumes failure of the master router and promotes the backup router to master router by configuring IP addresses on the interfaces in the ``qrouter`` namespace. In environments with more than one backup router, ``keepalived`` on the backup router with the next highest priority promotes that backup router to master router.
tr_tr: Yedekleme yönlendiricisinde ``keepalived``, *heartbeat* paketlerini almayı durdurursa, ana yönlendiricinin başarısız olduğunu varsayar ve ``qrouter`` ad alanındaki arabirimlerdeki IP adreslerini yapılandırarak yedek yönlendiriciyi ana yönlendiriciye yönlendirir. Birden fazla yedek yönlendirici bulunan ortamlarda, bir sonraki en yüksek önceliği olan yedek yönlendirici üzerindeki ``keepalived``, yedek yönlendiriciyi ana yönlendiriciye yönlendirir.

source: If a network is marked as external during creation, it now implicitly creates a wildcard RBAC policy granting everyone access to preserve previous behavior before this feature was added.
id: Jika jaringan ditandai sebagai eksternal selama pembuatan, sekarang secara implisit hal itu menciptakan kebijakan RBAC wildcard memberikan akses setiap orang untuk menjaga tindakan sebelumnya sebelum fitur ini ditambahkan.
tr_tr: Oluşturma sırasında bir ağ, harici olarak işaretlenirse, artık bu özellik eklenmeden önceki davranışlarını korumak için herkesin erişim iznini veren bir joker karakter RBAC politikası oluşturur.

source: If a service function involves a pair of ports, the first port acts as the ingress port of the service function and the second port acts as the egress port. If both ports use the same value, they function as a single virtual bidirectional port.
id: Jika fungsi pelayanan melibatkan sepasang port, port pertama bertindak sebagai ingress port fungsi pelayanan dan port kedua bertindak sebagai port egress. Jika kedua port menggunakan nilai yang sama, mereka berfungsi sebagai port bidirectional virtual tunggal.
tr_tr: Bir hizmet işlevi bir çift bağlantı noktasını içeriyorsa, ilk bağlantı noktası hizmet işlevinin giriş bağlantı noktası görevi görür ve ikinci bağlantı noktası çıkış bağlantı noktası görevi görür. Her iki bağlantı noktası da aynı değeri kullanıyorsa, tek bir sanal iki yönlü bağlantı noktası olarak işlev görürler.

source: If all routers lose connectivity simultaneously, the process of selecting a new master router will be repeated in a round-robin fashion until one or more routers have their connectivity restored.
id: Jika semua router kehilangan konektivitas secara bersamaan, proses pemilihan router induk baru akan diulang secara round-robin sampai satu atau lebih router telah dipulihkan konektivitas mereka.
tr_tr: Tüm yönlendiriciler aynı anda bağlantıyı kaybederse, yeni bir ana yönlendirici seçme işlemi, bir veya daha fazla yönlendiricinin bağlantısını geri yükleyinceye kadar round-robin kipine tekrarlanır.

source: If an operator wants to prevent normal users from doing this, the ``"create_rbac_policy":`` entry in ``policy.json`` can be adjusted from ``""`` to ``"rule:admin_only"``.
id: Jika operator ingin mencegah pengguna biasa melakukan ini, ``"create_rbac_policy":`` entri dalam ``policy.json`` dapat disesuaikan dari ``""`` menjadi ``"rule:admin_only"``.
tr_tr: Eğer operator, normal kullanıcıların bunu yapmasını engellemek isterse, ``policy.json`` dosyasındaki ``"create_rbac_policy":`` girdisi ``""`` iken ``"rule:admin_only"`` olarak ayarlanabilir.

source: If installing from source, you must configure a daemon file for the init system manually.
id: Jika menginstal dari source, Anda harus mengkonfigurasi file daemon untuk sistem init secara manual.
tr_tr: Kaynaktan yükleme yapıyorsanız, init sistemi için bir arka plan dosyasını elle yapılandırmanız gerekir.

source: If necessary, :ref:`configure MTU <config-mtu>`.
id: Jika diperlukan, :ref:`configure MTU <config-mtu>`.
tr_tr: Gerekli ise, :ref:`MTU yapılandırın <config-mtu>`.

source: If projects are trusted to administrate their own QoS policies in your cloud, neutron's file ``policy.json`` can be modified to allow this.
id: Jika proyek dipercaya melakukan administrasi kebijakan QoS sendiri di cloud Anda, file ``policy.json`` milik neutron ini dapat dimodifikasi untuk memberi ini.
tr_tr: Projeler bulutunuzda kendi QoS politikalarını yönetmek üzere güvenilir ise, neutron'un ``policy.json`` dosyası buna izin verecek şekilde değiştirilebilir.

source: If projects are trusted to create their own policies, check the trusted projects ``policy.json`` configuration section.
id: Jika proyek dipercaya untuk membuat kebijakan mereka sendiri, periksa bagian konfigurasi ``policy.json`` proyek dipercaya.
tr_tr: Eğer projelerin kendi politikalarını oluşturmalarına güveniliyorsa, güvenilir projeler ``policy.json`` yapılandırma bölümünü kontrol edin.

source: If that project has ports on the network, the server will prevent the policy from being deleted until the ports have been deleted:
id: Jika proyek memiliki port pada jaringan, server akan mencegah kebijakan dari penghapusan sampai port itu telah dihapus:
tr_tr: Bu proje ağda bağlantı noktalarına sahipse, sunucu, bağlantı noktaları silinene kadar politikanın silinmesini önleyecektir:

source: If that project has ports or networks with the QoS policy applied to them, the server will not delete the RBAC policy until the QoS policy is no longer in use:
id: Jika proyek yang memiliki port atau jaringan dengan kebijakan QoS diterapkan kepada mereka, server tidak akan menghapus kebijakan RBAC sampai kebijakan QoS tidak lagi digunakan:
tr_tr: Bu projede QoS politikası uygulanmış bağlantı noktaları veya ağlar varsa, sunucu QoS ilkesi artık kullanılmayana kadar RBAC ilkesini silmeyecektir:

source: If that project has router gateway ports attached to that network, the server prevents the policy from being deleted until the ports have been deleted:
id: Jika proyek yang memiliki port gerbang router terpasang ke jaringan itu, server akan mencegah kebijakan dari penghapusan sampai port telah dihapus:
tr_tr: Bu proje, o ağa bağlı yönlendirici ağ geçidi bağlantı noktalarına sahipse, sunucu, bağlantı noktaları silinene kadar politikanın silinmesini önler:

source: If the DVR/SNAT backup router stops receiving these packets, it assumes failure of the master DVR/SNAT router and promotes itself to master router by configuring IP addresses on the interfaces in the ``snat`` namespace. In environments with more than one backup router, the rules of VRRP are followed to select a new master router.
id: Jika router backup DVR/SNAT berhenti menerima paket ini, hal ini mengasumsikan kegagalan router DVR/SNAT master dan mempromosikan diri untuk menguasai router dengan mengkonfigurasi alamat IP pada antarmuka dalam namespace ``snat``. Dalam lingkungan dengan lebih dari satu router cadangan, aturan VRRP diikuti untuk memilih router msater baru.
tr_tr: DVR/SNAT yedek yönlendirici bu paketleri almayı durdurursa, ana DVR/SNAT yönlendiricisinin başarısız olduğunu varsayar ve arabirimlerdeki IP adreslerini ``snat`` ad alanına yapılandırarak kendisini ana yönlendiriciye yönlendirir. Birden fazla yedek yönlendiricinin bulunduğu ortamlarda, yeni bir ana yönlendirici seçmek için VRRP'nin kuralları izlenir.

source: If the Open vSwitch agent is being used, set ``extensions`` to ``qos`` in the ``[agent]`` section of ``/etc/neutron/plugins/ml2/openvswitch_agent.ini``. For example:
id: Jika agen Open vSwitch sedang digunakan, atur ``extensions`` ke ``qos`` dalam bagian ``[agent]`` dari ``/etc/neutron/plugins/ml2/openvswitch_agent.ini``. Sebagai contoh:
tr_tr: Open vSwitch aracı kullanılırsa, ``/etc/neutron/plugins/ml2/openvswitch_agent.ini`` bölümündeki ``[agent]`` bölümünde ``extensions``ü ``qos`` olarak ayarlayın. Örneğin:

source: If the OpenStack DNS service is the target external DNS, the ``[designate]`` section of ``/etc/neutron/neutron.conf`` must define the following parameters:
id: Jika layanan OpenStack DNS adalah target DNS eksternal, bagian ``[designate]`` dari ``/etc/neutron/neutron.conf`` harus mendefiniskan parameter berikut:
tr_tr: OpenStack DNS hizmeti hedef dış DNS ise, ``/etc/neutron/neutron.conf`` dosyasının ``[designate]`` bölümü aşağıdaki parametreleri tanımlamalıdır:

source: If the address scopes match between networks then pings and other traffic route directly through. If the scopes do not match between networks, the router either drops the traffic or applies NAT to cross scope boundaries.
id: Jika lingkup alamat ada kesesuaian antar jaringan maka ping dan rute lalu lintas lainnya akan melalui langsung. Jika lingkup tidak cocok antar jaringan, router menjatuhkan lalu lintas ataupun menerapkan NAT untuk melintasi batas ruang lingkup.
tr_tr: Adres alanları ağlar arasında eşleşirse, pingler ve diğer trafik yönlendirmeleri doğrudan geçer. Alanlar ağlar arasında eşleşmiyorsa, yönlendirici trafiği durdurur veya alan sınırlarını aşmak için NAT uygular.

source: If the device defined by the PCI address or ``devname`` corresponds to an SR-IOV PF, all VFs under the PF will match the entry. Multiple ``pci_passthrough_whitelist`` entries per host are supported.
id: Jika perangkat didefinisikan oleh alamat PCI atau ``devname`` sesuai dengan SR-IOV PF, semua VF bawah PF akan cocok dengan entri. Beberapa entri ``pci_passthrough_whitelist`` per host didukungnya.
tr_tr: PCI adresi veya ``devname`` ile tanımlanan cihaz SR-IOV PF'ye karşılık gelirse, PF altındaki tüm VF'ler girişi eşleştirir. Her bir ana makine için birden fazla ``pci_passthrough_whitelist`` girişi desteklenir.

source: If the interfaces are down, set them to ``up`` before launching a guest, otherwise the instance will fail to spawn:
id: Jika interface turun, aturlah mereka ke ``up`` sebelum meluncurkan guest (tamu), jika instance akan gagal berkembangan (spawn):
tr_tr: Arabirimler kapalıysa, bir konuk başlatmadan önce bunları ``ayakta`` olarak ayarlayın, aksi halde sunucu oluşturulamayacaktır:

source: If the policy is shared, the project is able to attach or detach such policy from its own ports and networks.
id: Jika kebijakan ini bersama, proyek ini dapat melekatkan atau melepaskan kebijakan tersebut dari port dan jaringan itu sendiri.
tr_tr: Politika paylaşılırsa, proje bu tür politikaları kendi bağlantı noktalarından ve ağlarından bağlayabilir veya çıkarabilir.

source: If the pool becomes exhausted, load some more prefixes:
id: Jika kolam menjadi habis, muatlah beberapa awalan (prefix) yang lebih:
tr_tr: Havuz tükenirse, daha fazla ön ek yükleyin:

source: If the prefix delegation server is configured to delegate globally routable prefixes and setup routes, then any instance with a port on this subnet should now have external network access.
id: Jika server prefix delegation dikonfigurasi untuk mendelegasikan prefiks routable global dan mengatur rute, maka setiap instance dengan port pada subnet ini sekarang harus memiliki akses jaringan eksternal.
tr_tr: Önek temsilci sunucusu, genel yönlendirilebilir önekleri ve kurulum yollarını temsil edecek şekilde yapılandırıldıysa, bu alt ağdaki bir bağlantı noktasına sahip herhangi bir örneğe, harici ağ erişimine sahip olmalıdır.

source: If there is a default, it can be requested by passing ``--use-default-subnetpool`` instead of ``--subnet-pool SUBNETPOOL``.
id: Jika ada default, itu dapat diminta dengan melewati ``--use-default-subnetpool`` bukannya ``--subnet-pool SUBNETPOOL``.
tr_tr: Bir varsayılan varsa, ``--subnet-pool SUBNETPOOL`` yerine ``--use-default-subnetpool`` iletilerek istenebilir.

source: If two switches are to be connected together, and the switches are configured for VLANs, then the switchports used for cross-connecting the switches must be configured to allow Ethernet frames from any VLAN to be forwarded to the other switch. In addition, the sending switch must tag each Ethernet frame with the VLAN ID so that the receiving switch can ensure that only hosts on the matching VLAN are eligible to receive the frame.
id: Jika dua switch dihubungkan bersama-sama, dan switch dikonfigurasi untuk VLAN, maka switchport yang digunakan untuk cross-connecting switch harus dikonfigurasi untuk mengizinkan frame Ethernet dari VLAN apapun untuk diteruskan ke switch lainnya. Selain itu, switch pengirim harus menandai (tag) setiap frame Ethernet dengan ID VLAN sehingga switch penerima dapat memastikan bahwa hanya host pada VLAN yang cocok memenuhi syarat untuk menerima frame.
tr_tr: İki switch birbirine bağlanacaksa ve switchler VLAN'lar için yapılandırılmışsa, switchleri çapraz bağlamak için kullanılan geçiş noktaları, herhangi bir VLAN'dan gelen Ethernet çerçevelerinin diğer switche yönlendirilmesine izin vermek üzere yapılandırılmalıdır. Buna ek olarak, gönderen switch, her Ethernet çerçevesini VLAN Kimliğiyle etiketlemelidir, böylece alım anahtarı yalnızca eşleşen VLAN'daki ana makinelerin çerçeveyi almaya uygun olmasını sağlar.

source: If you are an admin, you can create a pool which can be accessed by any regular project. Being a shared resource, there is a quota mechanism to arbitrate access.
id: Jika Anda adalah seorang admin, Anda dapat membuat kolam yang dapat diakses oleh setiap proyek biasa. Menjadi sumber daya bersama, kolam mempunyai mekanisme kuota untuk menengahi konflik akses.
tr_tr: Eğer bir yönetici iseniz, normal bir proje tarafından erişilebilen bir havuz oluşturabilirsiniz. Paylaşılan bir kaynak olarak, erişimi tahkim etmek için bir kota mekanizması var.

source: If you are not using the default dibbler-based driver for prefix delegation, then you also need to set the driver in ``/etc/neutron/neutron.conf``:
id: Jika Anda tidak menggunakan driver berbasis dibbler default untuk prefix delegation, maka Anda juga perlu mengatur driver dalam ``/etc/neutron/neutron.conf``:
tr_tr: Önek yetkilendirme için varsayılan dibbler-tabanlı sürücüleri kullanmıyorsanız, ``/etc/neutron/neutron.conf`` dosyasında sürücüyü ayarlamanız gerekiyor:

source: If you have access to an OpenStack Kilo or later based neutron, you can play with this feature now. Give it a try. All of the following commands work equally as well with IPv6 addresses.
id: Jika Anda memiliki akses ke OpenStack Kilo atau later based neutron, Anda dapat bermain dengan fitur ini sekarang. Cobalah. Semua perintah berikut bekerja sama juga dengan alamat IPv6.
tr_tr: Bir OpenStack Kilo veya daha sonrasına dayalı bir neutron'a erişiminiz varsa, şimdi bu özellikle oynayabilirsiniz. Bir şans ver. Aşağıdaki komutların tümü IPv6 adresleriyle eşit derecede çalışır.

source: If you have deployed LBaaS v1, **stop the LBaaS v1 agent now**. The v1 and v2 agents **cannot** run simultaneously.
id: Jika Anda telah mengerahkan LBaaS v1, **stop the LBaaS v1 agent now**. Agen v1 dan v2 **cannot** berjalan secara bersamaan.
tr_tr: LBaaS v1'i kurduysanız **LBaaS v1 aracısını şimdi durdurun**. V1 ve v2 ajanları aynı anda **çalışamaz**.

source: If you have existing service providers for other networking service plug-ins, such as VPNaaS or FWaaS, add the ``service_provider`` line shown above in the ``[service_providers]`` section as a separate line. These configuration directives are repeatable and are not comma-separated.
id: Jika Anda memiliki penyedia layanan yang ada untuk plug-in layanan jejaring lainnya, seperti VPNaaS atau FWaaS, tambahkan baris ``service_provider`` yang ditunjukkan di atas dalam bagian ``[service_providers] `` sebagai baris terpisah. Perintah konfigurasi ini berulang dan tidak dipisahkan koma.
tr_tr: VPNaaS veya FWaaS gibi diğer ağ servisi eklentileri için var olan servis sağlayıcılarına sahipseniz, ``service_provider`` satırını yukarıda gösterilen ``[service_providers]`` bölüme ayrı bir satır olarak ekleyin. Bu yapılandırma yönergeleri tekrarlanabilir ve virgül ile ayrılmış değildir.

source: If you use the metadata service, removing the default egress rules denies access to TCP port 80 on 169.254.169.254, thus preventing instances from retrieving metadata.
id: Jika Anda menggunakan layanan metadata, penghapusan aturan default egress menolak akses ke TCP port 80 pada 169.254.169.254, sehingga hal itu dapat mencegah pengambilan metadata.
tr_tr: Üst veri hizmetini kullanırsanız, varsayılan çıkış kuralı kaldırmak 169.254.169.254 TCP bağlantı noktası 80'e erişimi reddeder, böylece sunucuların üst veri almasını engeller.

source: Impact and limitations
id: Dampak dan keterbatasan
tr_tr: Etki ve sınırlamalar

source: Implement routing between segments.
id: Terapkan routing antara segmen.
tr_tr: Segmentler arasında yönlendirme uygulayın.

source: In *Destination Network Address Translation* (DNAT), the NAT router modifies the IP address of the destination in IP packet headers.
id: Dalam *Destination Network Address Translation* (DNAT), router NAT memodifikasi alamat IP tujuan ke dalam header paket IP.
tr_tr: *Hedef Ağ Adresi Çevirisi* (DNAT) içinde, NAT yönlendiricisi, hedefin IP adresini IP paket üstbilgilerinde değiştirir.
