Repository: 25hours/openstack-manuals
Catalog: doc/networking-guide/source/locale/*/LC_MESSAGES/networking-guide.po
Languages: id, tr_tr

source: The Role-Based Access Control (RBAC) policy framework enables both operators and users to grant access to resources for specific projects.
id: Kerangka kebijakan Role-Based Access Control (RBAC) mengaktifkan operator dan pengguna untuk memberikan akses ke sumber daya untuk proyek-proyek tertentu.
tr_tr: Rol-Tabanlı Erişim Kontrolü (RBAC) politika çerçevesi, belirli projeler için hem işleyicilere hem kullanıcılara kaynaklara erişim yetkisi verilmesini sağlar.

source: The SNAT gateway resides on 203.0.113.11.
id: SNAT gateway berada pada 203.0.113.11.
tr_tr: SNAT ağ geçidi 203.0.113.11 üzerinde.

source: The SR-IOV agent allows you to set the admin state of ports, configure port security (enable and disable spoof checking), and configure QoS rate limiting. You must include the SR-IOV agent on each compute node using SR-IOV ports.
id: Agen SR-IOV memungkinkan Anda untuk mengatur kondisi admin port, mengkonfigurasi keamanan port (mengaktifkan dan menonaktifkan pengecekan spoof), dan mengkonfigurasi pembatasan tingkat QoS. Anda harus menyertakan agen SR-IOV pada setiap node komputasi menggunakan port SR-IOV.
tr_tr: SR-IOV ajanı, bağlantı noktalarının yönetici durumunu ayarlamanızı, bağlantı güvenliği yapılandırmanızı (sahte denetimin etkinleştirilmesini ve devre dışı bırakılmasını) ve QoS hızı sınırlamasını yapılandırmanızı sağlar. SR-IOV bağlantı noktası kullanarak her hesaplama düğümüne SR-IOV aracısını eklemelisiniz.

source: The SR-IOV agent was optional before Mitaka, and was not enabled by default before Liberty.
id: Agen SR-IOV sebagai opsional sebelum Mitaka, dan tidak diaktifkan secara default sebelum Liberty.
tr_tr: SR-IOV ajanı Mitaka'dan önce isteğe bağlıydı ve Liberty'den önce varsayılan olarak etkinleştirilmemişti.

source: The VLAN sub-interface port (13) on the provider bridge forwards the packet to the provider physical network interface (14).
id: VLAN sub-interface port (13) di provider bridge meneruskan paket ke provider physical network interface (14).
tr_tr: Sağlayıcı köprüsündeki VLAN alt arabirim bağlantı noktası (13) paketi sağlayıcı fiziksel ağ arabirimine iletir (14).

source: The VLAN sub-interface port (4) on the provider bridge forwards the packet to the physical network interface (5).
id: Port sub-interface VLAN (4) di provider bridge meneruskan paket ke antarmuka jaringan fisik (5).
tr_tr: Sağlayıcı köprüde VLAN alt-arabirim bağlantı noktası (4) paketi fiziksel ağ arabirimine yönlendirir (5).

source: The Virtual Private Network-as-a-Service (VPNaaS) is a neutron extension that introduces the VPN feature set.
id: Virtual Private Network-as-a-Service (VPNaaS) adalah ekstensi neutron yang memperkenalkan set fitur VPN.
tr_tr: Sanal Özel Servis olarak Ağı (VPNaaS), VPN özellik setini tanıtan bir neutron uzantısıdır.

source: The ``active_connections`` count is the total number of connections that were active at the time the agent polled the load balancer. The other three statistics are cumulative since the load balancer was last started. For example, if the load balancer restarts due to a system error or a configuration change, these statistics will be reset.
id: Count ``active_connections`` adalah jumlah koneksi yang aktif pada saat agen disurvei penyeimbang beban. Tiga statistik lainnya adalah kumulatif sejak penyeimbang beban yang terakhir dimulai. Misalnya, jika penyeimbang beban restart karena kesalahan sistem atau perubahan konfigurasi, statistik ini akan disetel ulang.
tr_tr: ``active_connections`` sayısı, ajan yük dengeleyicisini çağırdığı sırada aktif olan toplam bağlantı sayısını ifade etmektedir. Diğer üç istatistik, yük dengeleyici son başlatıldığından birikimlidir. Örneğin, yük dengeleyici bir sistem hatası veya yapılandırma değişikliği nedeniyle yeniden başlatılırsa, bu istatistikler sıfırlanır.

source: The ``availability_zone`` attribute can be defined in ``dhcp-agent`` and ``l3-agent``. To define an availability zone for each agent, set the value into ``[AGENT]`` section of ``/etc/neutron/dhcp_agent.ini`` or ``/etc/neutron/l3_agent.ini``:
id: Atribut ``availability_zone`` dapat didefinisikan dalam ``dhcp-agent`` and ``l3-agent``. Untuk menentukan zona ketersediaan untuk setiap agen, tetapkan nilai ke dalam bagian ``[AGENT]`` dari ``/etc/neutron/dhcp_agent.ini`` atau ``/etc/neutron/l3_agent.ini``:
tr_tr: ``availability_zone`` özelliği ``dhcp-agent`` ve ``l3-agent`` içinde tanımlanabilir. Her ajan için bir kullanılabilirlik bölgesi tanımlamak için, ``/etc/neutron/dhcp_agent.ini`` veya ``/etc/neutron/l3_agent.ini`` dosyalarının ``[AGENT]`` bölümüne değeri ayarlayın:

source: The ``availability_zones`` attribute does not have a value until the resource is scheduled. Once the Networking service schedules the resource to zones according to ``availability_zone_hints``, ``availability_zones`` shows in which zone the resource is hosted practically. The ``availability_zones`` may not match ``availability_zone_hints``. For example, even if you specify a zone with ``availability_zone_hints``, all agents of the zone may be dead before the resource is scheduled. In general, they should match, unless there are failures or there is no capacity left in the zone requested.
id: Atribut ``availability_zones`` tidak memiliki nilai sampai sumber yang dijadwalkan. Setelah layanan Networking menjadwal sumber daya untuk zona menurut ``availability_zone_hints``, ``availability_zones`` menunjukkan zona dimana sumber disimpan (hosted) secara praktis. ``availability_zones`` mungkin tidak cocok dengan ``availability_zone_hints``. Misalnya, bahkan jika Anda menentukan zona dengan ``availability_zone_hints``, semua agen dari zona mungkin akan mati sebelum sumber dijadwalkan. Secara umum, mereka harus cocok, kecuali ada kegagalan atau tidak ada kapasitas yang tersisa di zona yang diminta.
tr_tr: ``availability_zones`` niteliği, kaynak zamanlanıncaya kadar bir değere sahip olmaz. Ağ servisi kaynağı ilk kez ``availability_zone_hints``'e göre bölgeye zamanladığında, ``availability_zones`` pratik olarak kaynağın konaklayacağı bölgeyi gösterir. ``availability_zones`` ile ``availability_zone_hints`` eşleşmeyebilir. Örneğin, ``availability_zone_hints`` ile bir bölge belirleseniz bile, bölgenin tüm ajanları kaynak zamanlanmadan önce ölmüş olabilir. Genellikle, eşleşmelidirler, hata veya istenilen bölgelerde yeterli kapasite kalmadığı durumlar hariç.

source: The ``chain_parameters`` attribute contains one or more parameters for the port chain. Currently, it only supports a correlation parameter that defaults to ``mpls`` for consistency with :term:`Open vSwitch` (OVS) capabilities. Future values for the correlation parameter may include the :term:`network service header (NSH)`.
id: Atribut ``chain_parameters`` berisi satu atau lebih parameter untuk rantai port. Saat ini, hanya mendukung parameter korelasi yang defaultnya ``mpls`` untuk konsistensi dengan kemampuan (OVS) :term:`Open vSwitch` . Nilai-nilai masa depan untuk parameter korelasi dapat mencakup :term:`network service header (NSH)`.
tr_tr: ``chain_parameters`` özelliği, bağlantı noktası zinciri için bir veya daha fazla parametre içerir. Şimdilik, yalnızca :term:`Open vSwitch` (OVS) yetenekleriyle tutarlılık için ``mpls``ye varsayılan bir korelasyon parametresi destekliyor. Korelasyon parametresi için gelecek değerler şunları içerebilir :term:`ağ servis başlığı (NSH)`.

source: The ``default_prefix_length`` defines the subnet size you will get if you do not specify ``--prefix-length`` when creating a subnet.
id: ``default_prefix_length`` mendefinisikan ukuran subnet dimana Anda akan mendapatkan jika Anda tidak menentukan `` --prefix-length`` saat membuat subnet.
tr_tr: ``default_prefix_length``, bir alt ağ oluştururken ``--prefix-length`` belirtmezseniz alacağınız alt ağ boyutunu tanımlar.

source: The ``dns_assignment`` attribute also shows that the port's ``hostname`` in the Networking service internal DNS is ``my-vm``.
id: Atribut ``dns_assignment`` juga menunjukkan bahwa ``hostname`` milik port di DNS internal layanan Networking adalah``my-vm``.
tr_tr: ``dns_assignment`` özelliği ayrıca, ağ hizmetinin dahili DNS'sindeki ``hostname`` portunun ``my-vm`` olduğunu gösterir.

source: The ``dns_name`` and ``dns_domain`` attributes of a floating IP must be specified together on creation. They cannot be assigned to the floating IP separately.
id: Atribut ``dns_name`` dan ``dns_domain``` dari IP mengambang harus ditentukan bersama-sama pada pembuatan. Mereka tidak dapat ditugaskan ke IP mengambang secara terpisah.
tr_tr: Yüzen bir IP'nin ``dns_name`` ve ``dns_domain`` öznitelikleri oluşturulurken birlikte belirtilmelidir. Yüzen IP'ye ayrı olarak atanamazlar.

source: The ``dns_name`` and ``dns_domain`` of a floating IP have precedence, for purposes of being published in the external DNS service, over the ``dns_name`` of its associated port and the ``dns_domain`` of the port's network, whether they are specified or not. Only the ``dns_name`` and the ``dns_domain`` of the floating IP are published in the external DNS service.
id: `` dns_name`` dan `` dns_domain`` dari IP mengambang berada di awal (have precedence), untuk tujuan penerbitan dalam layanan DNS eksternal, di atas ``dns_name`` port yang terkait dan ``dns_domain`` dari jaringan port, apakah mereka dibuat spesifik atau tidak. Hanya ``dns_name`` dan ``dns_domain`` dari IP mengambang akan diterbitkan dalam layanan DNS eksternal.
tr_tr: Yüzen bir IP'nin ``dns_name`` ve ``dns_domain``i, bağlantılı portun ``dns_name``i üzerinden ve harici DNS servisinde yayınlanabilmesi için ``dns_domain``i önceliğe sahiptir. Bağlantı noktasının ağı, belirlenmiş olsun ya da olmasın. Harici DNS servisinde, yalnızca kayan IP'nin ``dns_name`` ve ``dns_domain``i yayınlanır.

source: The ``exclude_devices`` parameter is empty, therefore, all the VFs associated with eth3 may be configured by the agent. To exclude specific VFs, add them to the ``exclude_devices`` parameter as follows:
id: Parameter ``exclude_devices`` kosong, oleh karena itu, semua VF terkait dengan eth3 dapat dikonfigurasi oleh agen. Untuk mengeluarkan VF tertentu, tambahkan VF ke parameter ``exclude_devices`` sebagai berikut:
tr_tr: ``exclude_devices`` parametresi boş olduğundan, eth3 ile ilişkili tüm VF'ler ajan tarafından yapılandırılabilir. Belirli VF'leri hariç tutmak için bunları ``exclude_devices`` parametresine aşağıdaki gibi ekleyin:

source: The ``external_network_bridge`` option intentionally contains no value.
id: Opsi ``external_network_bridge`` sengaja tidak mengandung nilai.
tr_tr: ``external_network_bridge`` seçeneğinin değeri bilerek boş bırakılmıştır.

source: The ``force_metadata`` option forces the DHCP agent to provide a host route to the metadata service on ``169.254.169.254`` regardless of whether the subnet contains an interface on a router, thus maintaining similar and predictable metadata behavior among subnets.
id: Opsi ``force_metadata`` memaksa agen DHCP untuk memberikan rute host ke layanan metadata pada ``169.254.169.254`` terlepas dari apakah subnet berisi sebuah antarmuka pada router, dengan demikian mempertahankan perilaku metadata yang sama dan dapat diprediksi antar subnet.
tr_tr: ``force_metadata`` seçeneği, DHCP ajanını alt ağın bir yönlendiricide bir arabirim barındırıp barındırmadığına bakılmaksızın ``169.254.169.254`` üzerinde meta veri servisine bir ana bilgisayar yolu sunmasını zorlar ve böylece alt ağlar arasında benzer ve öngörülebilir meta veri davranışı sürdürülür.

source: The ``ipv6_address_mode`` attribute is used to control how addressing is handled by OpenStack. There are a number of different ways that guest instances can obtain an IPv6 address, and this attribute exposes these choices to users of the Networking API.
id: Atribut ``ipv6_address_mode`` digunakan untuk mengontrol bagaimana pengalamatan ditangani oleh OpenStack. Ada sejumlah cara yang berbeda dimana guest instance dapat memperoleh alamat IPv6, dan atribut ini membuka (expose) pilihan ini untuk pengguna dari API Networking.
tr_tr: ``ipv6_address_mode`` özelliği, adreslemenin OpenStack tarafından nasıl işlendiğini kontrol etmek için kullanılır. Misafir sunucularının bir IPv6 adresi edinebileceği çeşitli yollar vardır ve bu özellik bu seçenekleri Ağ API'sinin kullanıcılarına sunar.

source: The ``ipv6_ra_mode`` attribute is used to control router advertisements for a subnet.
id: Atribut ``ipv6_ra_mode`` digunakan untuk mengontrol penyiaran update dan perubahan router untuk subnet.
tr_tr: Bir alt ağ için yönlendirici reklamları kontrol etmek için ``ipv6_ra_mode`` özelliği kullanılır.

source: The ``ipv6_ra_mode`` is used to specify if the Networking service should generate Router Advertisement packets for a subnet.
tr_tr: ``ipv6_ra_mode``, Ağ hizmetinin bir alt ağ için Yönlendirici Tanıtım paketleri oluşturması gerekip gerekmediğini belirtmek için kullanılır.

source: The ``physical_device_mappings`` parameter is not limited to be a 1-1 mapping between physical networks and NICs. This enables you to map the same physical network to more than one NIC. For example, if ``physnet2`` is connected to ``eth3`` and ``eth4``, then ``physnet2:eth3,physnet2:eth4`` is a valid option.
id: Parameter ``physical_device_mappings`` tidak terbatas menjadi pemetaan 1-1 antara jaringan fisik dan NIC. Hal ini memungkinkan Anda untuk memetakan jaringan fisik yang sama untuk lebih dari satu NIC. Misalnya, jika ``physnet2`` terhubung ke ``eth3`` dan ``eth4``, maka ``physnet2: eth3, physnet2: eth4`` adalah pilihan yang valid.
tr_tr: ``physical_device_mappings`` parametresi fiziksel ağlar ve NIC'ler arasında 1-1 haritalama olarak sınırlandırılmamıştır. Bu, aynı fiziksel ağın birden fazla NIC'e eşlenmesini sağlar. Örneğin ``physnet2``, ``eth3`` ve ``eth4``'e bağlıysa, ``physnet2:eth3,physnet2:eth4`` geçerli bir seçenektir.

source: The ``provider`` value in the ``network_vlan_ranges`` option lacks VLAN ID ranges to support use of arbitrary VLAN IDs.
id: Nilai ``provider`` di opsi ``network_vlan_ranges`` tidak memiliki berkisar VLAN ID untuk mendukung penggunaan ID VLAN bebas.
tr_tr: ``network_vlan_ranges`` seçeneğindeki ``sağlayıcı`` değeri keyfi VLAN Kimliklerinin kullanılmasını desteklemek için VLAN ID aralıklarından yoksundur.

source: The ``segmentation-type`` and ``segmentation-id`` parameters are optional in the Networking API. However, all drivers as of the Newton release require both to be provided when adding a subport to a trunk. Future drivers may be implemented without this requirement.
id: Parameter ``segmentation-type`` dan ``segmentation-id`` adalah opsional dalam Networking API. Namun, semua driver pada rilis Newton mengharuskan kedua parameter yang akan diberikan ketika menambahkan subport ke trunk. Driver yang akan datang dapat dilaksanakan tanpa persyaratan ini.
tr_tr: ``segmentation-type`` and ``segmentation-id`` parametreleri, Ağ API'sında isteğe bağlıdır. Bununla birlikte, Newton sürümünden itibaren tüm sürücüler, bir bilgi aktarma yoluna bir subport eklerken sağlanmalıdır. Gelecekteki sürücüler bu gereklilik olmadan uygulanabilir.

source: The ``segmentation-type`` and ``segmentation-id`` specified by the user on the subports is intentionally decoupled from the ``segmentation-type`` and ID of the networks. For example, it is possible to configure the Networking service with ``tenant_network_types = vxlan`` and still create subports with ``segmentation_type = vlan``. The Networking service performs remapping as necessary.
id: ``segmentasi-type`` dan ``segmentasi-id`` ditentukan oleh pengguna pada subports yang sengaja dipisahkan dari ``segmentasi-type`` dan ID jaringan. Sebagai contoh, adalah mungkin untuk mengkonfigurasi layanan Networking dengan ``tenant_network_types = vxlan`` dan masih membuat subports dengan ``segmentation_type = vlan``. Layanan Networking melakukan mapping ulang seperlunya.
tr_tr: Kullanıcı tarafından altportlarda belirtilen ``segmentation-type`` ve ``segmentation-id``i, kasıtlı olarak ağların ``segmentation-type`` ve kimliğinden ayrılmıştır. Örneğin, Ağ hizmetini ``tenant_network_types = vxlan`` ile yapılandırmak ve yine de ``segmentation_type = vlan`` olan altportlar oluşturmak mümkündür. Ağ hizmeti, gerektiğinde yeniden haritalama gerçekleştirir.

source: The ``service_function_parameters`` attribute includes one or more parameters for the service function. Currently, it only supports a correlation parameter that determines association of a packet with a chain. This parameter defaults to ``none`` for legacy service functions that lack support for correlation such as the NSH. If set to ``none``, the data plane implementation must provide service function proxy functionality.
id: Atribut ``service_function_parameters`` mencakup satu atau lebih parameter untuk fungsi pelayanan. Saat ini, atribut itu hanya mendukung parameter korelasi yang menentukan asosiasi paket dengan rantai. Parameter ini default ke ``none`` untuk fungsi layanan legacy yang tidak memiliki dukungan untuk korelasi seperti NSH tersebut. Jika diatur ke ``none``, pelaksanaan data plane harus secara funcional menyediakan fungsi pelayanan proxy.
tr_tr: ``service_function_parameters`` özniteliği, servis fonksiyonu için bir veya daha fazla parametre içerir. Şimdilik, yalnızca bir paketin bir zincirle ilişkilendirilmesini belirleyen bir korelasyon parametresini desteklemektedir. Bu parametre, NSH gibi korelasyon için destek bulunmayan eski hizmet işlevleri için varsayılan olarak ``none`` olur. ``none`` olarak ayarlanmazsa, veri platformu uygulaması servis fonksiyonu vekil işlevselliği sağlamalıdır.

source: The ``share`` option allows any project to use this network. To limit access to provider networks, see :ref:`config-rbac`.
id: Opsi ``share`` memungkinkan proyek untuk menggunakan jaringan ini. Untuk membatasi akses ke jaringan provider, lihat :ref: `config-rbac`.
tr_tr: ``share`` seçeneği herhangi bir projenin bu ağı kullanmasına izin verir. Sağlayıcı ağlarına erişimi sınırlamak için :ref:`config-rbac` konusuna bakın.

source: The ``tags``, ``tags-any``, ``not-tags``, and ``not-tags-any`` arguments can be combined to build more complex queries. Example::
id: Argumen ``tags``, ``tags-any``, ``not-tags``, dan ``not-tags-any`` dapat dikombinasikan untuk membangun query yang lebih kompleks. Contoh::
tr_tr: ``tags``, ``tags-any``, ``not-tags``, ve ``not-tags-any`` öznitelikleri daha karmaşık sorgular oluşturmak için kombine edilebilir. Örnek::

source: The ``target-project`` parameter specifies the project that requires access to the QoS policy. The ``action`` parameter specifies what the project is allowed to do. The ``type`` parameter says that the target object is a QoS policy. The final parameter is the ID of the QoS policy we are granting access to.
id: Parameter ``target-project`` menentukan proyek yang membutuhkan akses ke kebijakan QoS. Parameter ``action`` menentukan proyek apa yang diperbolehkan untuk dilakukan. Parameter ``type`` mengatakan bahwa objek target adalah kebijakan QoS. Parameter terakhir adalah ID kebijakan QoS dimana kita memberikan akses ke.
tr_tr: ``target-project`` parametresi, QoS politikasına erişim gerektiren projeyi belirtir. ``action`` parametresi, projenin neler yapmasına izin verildiğini belirtir. ``type`` parametresi, hedef nesnenin QoS politikası olduğunu söyler. Son parametre, erişim izni verdiğimiz QoS politikasının kimliğidir.

source: The ``target-project`` parameter specifies the project that requires access to the network. The ``action`` parameter specifies what the project is allowed to do. The ``type`` parameter indicates that the target object is a network. The final parameter is the ID of the network we are granting external access to.
id: Parameter ``target-project`` menentukan proyek yang membutuhkan akses ke jaringan. Parameter ``action`` menentukan proyek apa yang diperbolehkan untuk dilakukan. Parameter ``type`` menunjukkan bahwa objek target adalah jaringan. Parameter terakhir adalah ID jaringan dimana kami memberikan akses eksternalnya.
tr_tr: ``target-project`` parametresi, ağa erişim gerektiren projeyi belirtir. ``action`` parametresi, projenin neler yapmasına izin verildiğini belirtir. ``type`` parametresi, hedef nesnenin bir ağ olduğunu gösterir. Son parametre, harici erişim izni verdiğimiz ağın kimliğidir.

source: The ``target-project`` parameter specifies the project that requires access to the network. The ``action`` parameter specifies what the project is allowed to do. The ``type`` parameter says that the target object is a network. The final parameter is the ID of the network we are granting access to.
id: Parameter ``target-project``` menentukan proyek yang membutuhkan akses ke jaringan. Parameter ``action`` menentukan proyek apa yang diperbolehkan untuk dilakukan. Parameter ``type`` mengatakan bahwa objek target adalah jaringan. Parameter terakhir adalah ID jaringan dimana kita memberikan akses ke.
tr_tr: ``target-project`` parametresi, ağa erişim gerektiren projeyi belirtir. ``action`` parametresi, projeye ne yapmaya izin verildiğini belirtir. ``type``parametresi, hedef nesnenin bir ağ olduğunu söyler. Son parametre, erişim izni verdiğimiz ağın kimliğidir.

source: The ``tenant_network_types`` option contains no value because the architecture does not support self-service networks.
id: Opsi ``tenant_network_types`` tidak mengandung nilai karena arsitektur tidak mendukung jaringan self-service.
tr_tr: ``tenant_network_types`` seçeneği, hiçbir değer içermiyor, çünkü mimari self servis ağları desteklemez.

source: The `branches`, `current`, and `history` commands all accept a ``--verbose`` option, which, when passed, will instruct :command:`neutron-db-manage` to display more verbose output for the specified command:
id: Perintah `branches`,`current`, dan `history` semuanya menerima opsi ``--verbose``, ketika melewatinya, dan perintah ini akan menginstruksikan :command:`neutron-db-manage` untuk menampilkan output yang lebih banyak kata (verbose) untuk perintah tertentu:
tr_tr: `branches`, `current` ve `history` komutlarının hepsi bir ``--verbose`` seçeneği kabul eder; bu seçenek geçildiğinde belirtilen komut için daha detaylı sonuç göstermek için :command:`neutron-db-manage` komutu çalıştırılacaktır:

source: The ability to control port security and QoS rate limit settings was added in Liberty.
id: Kemampuan untuk mengontrol pengaturan batas keamanan port dan tingkat QoS ditambahkan di Liberty.
tr_tr: Bağlantı noktası güvenliği ve QoS hız limit ayarlarını kontrol etme olanağı Liberty'de eklendi.

source: The above example returns any networks that have the "red" and "blue" tags, plus at least one of "green" and "orange".
id: Contoh di atas mengembalikan setiap jaringan yang memiliki tag "red" dan "blue", ditambah setidaknya satu dari "green" dan "orange".
tr_tr: Yukarıdaki örnek, "kırmızı" ve "mavi" etiketleri ve ayrıca "yeşil" ve "turuncu" dan en az birini içeren ağları döndürür.

source: The above is all you need in this scenario, but more information on installing, configuring, and running Dibbler is available in the Dibbler user guide, at `Dibbler – a portable DHCPv6 <http://klub.com.pl/dhcpv6/doc/dibbler-user.pdf>`_.
id: Hal di atas adalah semua hal yang Anda butuhkan untuk skenario ini, tetapi informasi lebih lanjut tentang instalasi, konfigurasi, dan mejalankan Dibbler tersedia di buku petunjuk Dibbler, di `Dibbler – a portable DHCPv6 <http://klub.com.pl/dhcpv6/doc/dibbler-user.pdf>`_.
tr_tr: Yukarıdaki tüm senaryodur, ancak Dibbler'ı kurma, yapılandırma ve çalıştırma hakkında daha fazla bilgiye Dibbler kullanım kılavuzunda, `Dibbler – taşınabilir DHCPv6 <http://klub.com.pl/dhcpv6/doc/dibbler-user.pdf>`_.
