Repository: 25hours/openstack-manuals
Catalog: doc/networking-guide/source/locale/*/LC_MESSAGES/networking-guide.po
Languages: id, tr_tr

source: Integration with an external DNS service
id: Integrasi dengan layanan DNS eksternal
tr_tr: Harici bir DNS servisi ile entegrasyon

source: Interface on self-service network 1
id: Antarmuka pada jaringan self-service 1
tr_tr: Self-servis ağ 1 üzerindeki arabirim

source: Interface on self-service network 2
id: Antarmuka pada jaringan self-service 2
tr_tr: Self-servis ağ 2 üzerindeki arabirim

source: Internal router ports, that act as default gateway ports for a network, will share a common port for all IPv6 subnets associated with the network. This implies that there will be an IPv6 internal router interface with multiple IPv6 addresses from each of the IPv6 subnets associated with the network and a separate IPv4 internal router interface for the IPv4 subnet. On the other hand, external router ports are allowed to have a dual-stack configuration with both an IPv4 and an IPv6 address assigned to them.
id: Port router internal, yang bertindak sebagai port gateway default untuk jaringan, akan berbagi port umum untuk semua subnet IPv6 terkait dengan jaringan. Ini berarti bahwa akan ada sebuah antarmuka router internal yang IPv6 dengan beberapa alamat IPv6 dari masing-masing subnet IPv6 yang terkait dengan jaringan dan interface router internal IPv4 yang terpisah untuk subnet IPv4. Di sisi lain, port router eksternal diperbolehkan untuk memiliki konfigurasi dual-stack dengan IPv4 dan alamat IPv6 yang ditugaskan kepada mereka.
tr_tr: Bir ağ için varsayılan ağ geçidi bağlantı noktaları görevi gören iç yönlendirici bağlantı noktaları, ağla ilişkili tüm IPv6 alt ağları için ortak bir bağlantı noktasını paylaşır. Bu, ağ ile ilişkili IPv6 alt ağlarının her birinden birden fazla IPv6 adresi olan bir IPv6 dahili yönlendirici arabirimi ve IPv4 alt ağ için ayrı bir IPv4 dahili yönlendirici arabirimi olacağı anlamına gelir. Öte yandan, harici yönlendirici bağlantı noktalarının kendilerine atanmış bir IPv4 ve bir IPv6 adresi olan ikili yığın yapılandırmasına sahip olmalarına izin verilir.

source: Interruption of VRRP *heartbeat* traffic between network nodes, typically due to a network interface or physical network infrastructure failure, triggers a failover. Restarting the layer-3 agent, or failure of it, does not trigger a failover providing ``keepalived`` continues to operate.
id: Gangguanlalu lintas *heartbeat* VRRP antara node jaringan, biasanya karena antarmuka jaringan atau kegagalan infrastruktur jaringan fisik, memicu failover. Restart agen lapisan-3, atau kegagalan itu, tidak memicu failover menyediakan ``keepalived`` terus beroperasi.
tr_tr: Ağ düğümleri arasındaki VRRP *heartbeat* trafiğinin kesilmesi, genellikle bir ağ arabirimi veya fiziksel ağ altyapısı hatası nedeniyle bir yerine çalışma tetikler. Katman-3 aracısını yeniden başlatın veya başarısız olursa, ``keepalived`` olanağı sağlayan bir yük devretme işlemi devreye girmez.

source: Introduction
id: Pengantar
tr_tr: Giriş

source: Irrelevant fields have been trimmed from the output of these commands for brevity.
id: Field tidak relevan telah dipangkas dari output dari perintah ini supaya singkat.
tr_tr: Kısaltmalar için bu komutların çıktısından alakasız bölümler kesilmiştir.

source: Is deployed besides an other mechanism driver and L2 agent such as OVS or Linux bridge. It offers instances direct access to the network adapter through a PCI Virtual Function (VF). This gives an instance direct access to hardware capabilities and high performance networking.
id: Dikerahkan bersama driver mekanisme lain dan agen L2 seperti OVS atau jembatan Linux. Ia menawarkan akses langsung instance ke adaptor jaringan melalui PCI Virtual Function (VF). Hal ini memberikan sebuah akses langsung instance ke kekuatan hardware dan jaringan kinerja tinggi.
tr_tr: OVS veya Linux köprüsü gibi başka bir mekanizma sürücüsü ve L2 aracısı dışında dağıtılır. PCI Sanal İşleviyle (VF) ağ bağdaştırıcısına anlık doğrudan erişim sunar. Bu, donanım özelliklerine ve yüksek performanslı ağa anlık doğrudan erişim verir.

source: It follows that with these two flags set to ``True`` in the configuration file, routers created by all users will default to distributed HA routers (DVR HA).
id: Ini berarti bahwa dengan dua flag ini diatur ke ``True`` dalam file konfigurasi, router yang dibuat oleh semua pengguna akan menjadi default untuk router HA (DVR HA) terdistribusi.
tr_tr: Bu iki bayrak, yapılandırma dosyasında ``True`` olarak ayarlandığında, tüm kullanıcılar tarafından oluşturulan yönlendiriciler, varsayılan olarak, dağıtılmış HA yönlendiricilerini (DVR HA) varsayılan hale getirir.

source: It includes the following components:
id: Ini mencakup komponen-komponen berikut:
tr_tr: Aşağıdaki bileşenleri içerir:

source: It is allocated to DHCP agent on HostA. If you want to validate the behavior through the :command:`dnsmasq` command, you must create a subnet for the network because the DHCP agent starts the dnsmasq service only if there is a DHCP.
id: Hal ini dialokasikan untuk agen DHCP pada HostA. Jika Anda ingin memvalidasi perilaku melalui perintah :command:`dnsmasq`, Anda harus membuat subnet untuk jaringan karena agen DHCP memulai layanan dnsmasq hanya jika ada DHCP.
tr_tr: HostA üzerindeki DHCP ajanı için ayrılmıştır. :command:`dnsmasq` komutu ile davranışı doğrulamak isterseniz, ağ için bir alt ağ oluşturmanız gerekir, çünkü DHCP ajanı sadece bir DHCP varsa dnsmasq servisini başlatır.

source: It is also possible to combine several rules in one policy:
tr_tr: Bir politikada birkaç kuralın birleştirilmesi de mümkündür:

source: It is common for a packet to hop across multiple routers to reach its final destination. On a Linux machine, the ``traceroute`` and more recent ``mtr`` programs prints out the IP address of each router that an IP packet traverses along its path to its destination.
id: Hal ini umum untuk sebuah paket untuk hop di beberapa router untuk mencapai tujuan akhir. Pada mesin Linux, program ``traceroute`` dan ``mtr`` lebih baru mencetak alamat IP untuk setiap router dimana paket IP melintasi sepanjang jalan ke tujuannya.
tr_tr: Bir paketin, son yönlendiricisine ulaşmak için birden fazla yönlendirici arasında gezinmesi yaygındır. Bir Linux makinesinde, ``traceroute`` ve daha yeni ``mtr`` programları, bir IP paketinin hedefine giden yol boyunca geçtiği her yönlendiricinin IP adresini yazdırır.

source: It is important that you select a VLAN range not being used by your current network infrastructure. For example, if you estimate that your cloud must support a maximum of 100 projects, pick a VLAN range outside of that value, such as VLAN 200–299. OpenStack, and all physical network infrastructure that handles project networks, must then support this VLAN range.
id: Adalah penting bahwa Anda memilih rentang VLAN yang tidak digunakan oleh infrastruktur jaringan Anda saat ini. Misalnya, jika Anda memperkirakan bahwa cloud Anda harus mendukung maksimal 100 proyek, pilihlah rentang VLAN yang luar nilai itu, seperti VLAN 200-299. OpenStack, dan semua infrastruktur jaringan fisik yang menangani jaringan proyek, maka harus mendukung berbagai VLAN ini.
tr_tr: Geçerli ağ altyapınız tarafından kullanılmayan bir VLAN aralığı seçmeniz önemlidir. Örneğin, bulutunuzun maksimum 100 projeyi desteklemesi gerektiğini varsayarsanız, VLAN 200-299 gibi bu değerin dışında bir VLAN aralığı seçin. OpenStack ve proje ağlarını idare eden tüm fiziksel ağ altyapısı bu VLAN aralığını desteklemelidir.

source: It is positioned as alternative to Open vSwitch or Linux bridge support on the compute node for internal deployments.
id: Hal ini diposisikan sebagai alternatif untuk Open vSwitch atau dukungan jembatan Linux pada node komputasi untuk pengerahan internal.
tr_tr: Dahili dağıtımlar için hesaplama düğümünde Open vSwitch veya Linux köprüsü desteğine alternatif olarak konumlandırılmıştır.

source: It should be possible for projects to communicate with each other on an isolated network (a network without a router port) using LLA with little to no participation on the part of OpenStack. The authors of this section have not proven that to be true for all scenarios.
tr_tr: Projelerin, izole edilmiş bir ağda (yönlendirici bağlantı noktası olmayan bir ağ) birbirleriyle iletişim kurması, OpenStack'ın katılımı az veya hiç yapılmayacak şekilde LLA'yı kullanarak mümkün olmalıdır. Bu bölümün yazarları, tüm senaryolar için doğru olduğunu kanıtlamış değiller.

source: Jumbo frames
id: Frame jumbo
tr_tr: Jumbo çerçeveler

source: Just like with bandwidth limiting, create a policy for DSCP marking rule:
id: Sama seperti dengan bandwidth yang membatasi, buat kebijakan untuk aturan DSCP marking:
tr_tr: Bant genişliği sınırı gibi, DSCP işaretleme kuralı için de bir politika oluşturun:

source: Keepalived VRRP health check
id: Cek kesehatan Keepalived VRRP health check
tr_tr: Keepalived VRRP durum kontrolü

source: Kernel version 3.3, but less than 4.3, does not include *conntrack* support and requires building the OVS modules.
id: Kernel versi 3.3, tetapi kurang dari 4.3, tidak termasuk dukungan *conntrack * dan membutuhkan pembangunan modul OVS.
tr_tr: Çekirdek sürüm 3.3, ancak 4.3'den az, *conntrack* desteği içermez ve OVS modüllerini oluşturmayı gerektirir.

source: Kernel version 4.3 or newer includes *conntrack* support.
id: Kernel version 4.3 atau lebih baru termasuk dukungan *conntrack*.
tr_tr: 4.3 veya daha üst çekirdek sürümü *conntrack* desteği içerir.

source: Known limitations
id: Keterbatasan dikenal
tr_tr: Bilinen sınırlamalar

source: L2 agent
id: Agen L2
tr_tr: L2 ajanı

source: L2 agents support some important security configurations.
id: Agen L2 mendukung beberapa konfigurasi keamanan penting.
tr_tr: L2 ajanları bazı önemli güvenlik yapılandırmalarını desteklemektedir.

source: L2 population
id: Populasi L2
tr_tr: L2 populasyon

source: L2 population is a special mechanism driver that optimizes BUM (Broadcast, unknown destination address, multicast) traffic in the overlay networks VXLAN and GRE. It needs to be used in conjunction with either the Linux bridge or the Open vSwitch mechanism driver and cannot be used as standalone mechanism driver. For more information, see the *Mechanism drivers* section below.
id: Populasi L2 adalah driver mekanisme khusus yang mengoptimalkan lalu lintas BUM (Broadcast, unknown destination address, multicast) di VXLAN dan GRE jaringan overlay. Perlu digunakan bersama dengan baik jembatan Linux atau driver mekanisme Open vSwitch dan tidak dapat digunakan sebagai driver mekanisme mandiri. Untuk informasi lebih lanjut, lihat bagian bawah *Mechanism drivers*.
tr_tr: L2 topluluğu, VXLAN ve GRE kaplama ağlarındaki BUM (Yayın, bilinmeyen hedef adres, çok noktaya yayın) trafiği optimize eden özel bir mekanizma sürücüsüdür. Linux köprüsü veya Open vSwitch mekanizma sürücüsü ile birlikte kullanılmalıdır ve bağımsız mekanizma sürücüsü olarak kullanılamaz. Daha fazla bilgi için aşağıdaki *Mekanizma sürücüleri* bölümüne bakın.

source: L2 population is not listed here, as it is not a standalone mechanism. If other agents are supported depends on the conjunctive mechanism driver that is used for binding a port.
id: Populasi L2 tidak tercantum di sini, karena itu tidak memiliki mekanisme mandiri. Jika agen lain didukung tergantung pada driver mekanisme penghubung yang digunakan untuk mengikat port.
tr_tr: L2 popülasyonu burada listelenmemiştir, çünkü bağımsız bir mekanizma değildir. Diğer ajanlar destekleniyorsa, bir bağlantı noktasını bağlamak için kullanılan bağlaç mekanizma sürücüsüne bağlıdır.

source: L3 HA to Legacy
id: L3 HA untuk Legacy
tr_tr: Legacy için L3 HA

source: L3 Metering agent
id: Agen metering L3
tr_tr: L3 Ölçüm ajanı

source: L3 agent
id: Agen L3
tr_tr: L3 ajanı

source: L3 high availability
id: L3 ketersediaan tinggi
tr_tr: L3 yüksek kullanılabilirliği

source: L3 metering agent
id: Agen metering L3
tr_tr: L3 ölçme ajanı

source: LBaaS v1 was removed in the Newton release. These links provide more details about how LBaaS v1 works and how to configure it:
id: LBaaS v1 telah dihapus dalam rilis Newton. Link ini memberikan rincian lebih lanjut tentang bagaimana LBaaS v1 bekerja dan bagaimana mengkonfigurasinya:
tr_tr: LBaaS v1, Newton sürümünde kaldırıldı. Bu bağlantılar, LBaaS v1'in nasıl çalıştığını ve nasıl yapılandıracağıyla ilgili daha ayrıntılı bilgi sağlar:

source: LBaaS v2 Concepts
tr_tr: LBaaS v2 Konseptleri

source: LBaaS v2 adds the concept of listeners to the LBaaS v1 load balancers. LBaaS v2 allows you to configure multiple listener ports on a single load balancer IP address.
id: LBaaS v2 menambahkan konsep pendengar ke penyeimbang beban LBaaS v1. LBaaS v2 memungkinkan Anda untuk mengkonfigurasi beberapa port pendengar pada alamat IP penyeimbang beban tunggal.
tr_tr: LBaaS v2, dinleyicilerin konseptini LBaaS v1 yük dengeleyicilerine ekler. LBaaS v2, tek bir yük dengeleyici IP adresinde birden fazla dinleyici bağlantı noktasını yapılandırmanıza izin verir.

source: LBaaS v2 has multiple implementations via different service plug-ins. The two most common implementations use either an agent or the Octavia services. Both implementations use the `LBaaS v2 API <https://developer.openstack.org/api-ref/networking/v2/#lbaas-2-0-stable>`_.
id: LBaaS v2 memiliki beberapa implementasi melalui berbagai service plug-ins. Dua implementasi yang paling umum menggunakan layanan agen ataupun layanan Octavia. Kedua implementasi menggunakan `LBaaS v2 API <https://developer.openstack.org/api-ref/networking/v2/#lbaas-2-0-stable>`_.
tr_tr: LBaaS v2, farklı hizmet eklentileri yoluyla birden fazla uygulama içerir. En yaygın kullanılan iki uygulama hem bir ajan hem de Octavia hizmetleri kullanır. Her iki uygulama da `LBaaS v2 API <https://developer.openstack.org/api-ref/networking/v2/#lbaas-2-0-stable>`_ kullanıyor.

source: LBaaS v2 has several new concepts to understand:
id: LBaaS v2 memiliki beberapa konsep baru untuk memahami:
tr_tr: LBaaS v2 anlaşılması gereken bir takım yeni konseptlere sahiptir:

source: LBaaS v2 operations
id: operasi LBaaS v2
tr_tr: LBaaS v2 işlemleri

source: Lacks support for layer-3 high-availability mechanisms such as Virtual Router Redundancy Protocol (VRRP) and Distributed Virtual Routing (DVR).
id: Kekurangan dukungan untuk mekanisme layer-3 high-availability seperti Virtual Router Redundancy Protocol (VRRP) dan Distributed Virtual Routing (DVR).
tr_tr: Sanal Yönlendirici Yedekleme Protokolü (VRRP) ve Dağıtılmış Sanal Yönlendirme (DVR) gibi katman-3 yüksek erişilebilirlik mekanizmalarını desteklemiyor.

source: Lacks support for security groups including basic (sanity) and anti-spoofing rules.
id: Kekurangan dukungan untuk kelompok keamanan termasuk aturan basic (sanity) dan anti-spoofing.
tr_tr: Temel (sağlıklı) ve sızdırmayı önleme kurallarını içeren güvenlik grupları için desteğin olmaması.

source: Large pages are required for each instance running on hosts with OVS-DPDK. If large pages are not present in the guest, the interface will appear but will not function.
id: Halaman besar diperlukan untuk setiap instance yang berjalan pada host dengan OVS-DPDK. Jika halaman besar tidak hadir dalam guest, antarmuka akan muncul tetapi tidak akan berfungsi.
tr_tr: OVS-DPDK'lı ana makinelerde çalışan her sunucu için büyük sayfalar gereklidir. Misafir sunucuda büyük sayfalar yoksa, arayüz görünür, ancak çalışmaz.

source: Larger deployments typically deploy the DHCP and metadata agents on a subset of compute nodes to increase performance and redundancy. However, too many agents can overwhelm the message bus. Also, to further simplify any deployment, you can omit the metadata agent and use a configuration drive to provide metadata to instances.
id: Pengerahan yang lebih besar biasanya menggunakan DHCP dan agen metadata pada subset node komputasi untuk meningkatkan kinerja dan redundansi. Namun, terlalu banyak agen dapat membanjiri (overwhelm) pengangkutan pesan. Juga, untuk lebih menyederhanakan penyebaran, Anda dapat menghilangkan agen metadata dan menggunakan drive konfigurasi untuk memberikan metadata untuk instance.
tr_tr: Daha büyük dağıtımlar, performansı ve yedekliliği artırmak için genellikle DHCP ve meta veri aracısını bir hesaplama düğümleri alt grubuna yerleştirir. Bununla birlikte, çok fazla aracı mesaj veriyolunu zorlayabilir. Ayrıca, herhangi bir dağıtımı daha da basitleştirmek için, meta veri aracısını atlayabilir ve sunuculara meta veri sağlamak için bir yapılandırma sürücüsü kullanabilirsiniz.

source: Launch an instance on a private network and retrieve the neutron port ID that was allocated. As above, use the ``cirros`` image and ``m1.tiny`` flavor:
id: Luncurkan sebuah instance pada jaringan private dan mengambil ID port neutron yang dialokasikan. Seperti di atas, gunakan image ``cirros`` dan flavor ``m1.tiny``:
tr_tr: Özel bir ağda bir örneği başlatın ve tahsis edilen neutron bağlantı noktası kimliğini alın. Yukarıdaki gibi ``cirros`` imajını ve ``m1.tiny`` flavor'ını kullanın:

source: Launch an instance on the trunk
id: Luncurkan instance pada trunk
tr_tr: Bilgi aktarım yolu üzerinde bir sunucu başlat

source: Launch an instance using the network. For example, using the ``cirros`` image and ``m1.tiny`` flavor.
id: Luncurkan sebuah instance menggunakan jaringan. Misalnya, dengan menggunakan image ``cirros`` dan flavor ``m1.tiny``.
tr_tr: Ağı kullanarak bir sunucuyu başlatın. Örneğin, ``cirros`` imajını ve ``m1.tiny`` flavor'ını kullanarak.

source: Launch an instance with an interface on the addtional self-service network. For example, a CirrOS image using flavor ID 1.
id: Luncurkan instance dengan sebuah antarmuka pada jaringan self-service tambahan. Misalnya, image CirrOS menggunakan flavor ID 1.
tr_tr: Ek self-servis ağında bir arabirimle bir sunucuyu başlatın. Örneğin, flavor ID 1'i kullanan bir CirrOS imajı.

source: Launch an instance with an interface on the provider network. For example, a CirrOS image using flavor ID 1.
id: Luncurkan sebuah instance dengan sebuah antarmuka pada jaringan provider. Misalnya, image CirrOS menggunakan flavor ID 1.
tr_tr: Sağlayıcı ağı üzerindeki bir arayüzle bir sunucuyu başlatın. Örneğin, flavor ID 1'i kullanan bir CirrOS imajı.

source: Launch an instance with an interface on the self-service network. For example, a CirrOS image using flavor ID 1.
id: Luncurkan sebuah instance dengan sebuah antarmuka di jaringan self-service. Misalnya, image CirrOS menggunakan flavor ID 1.
tr_tr: Self servis ağı üzerindeki bir arayüzle bir sunucuyu başlatın. Örneğin, flavor ID 1'i kullanan bir CirrOS imajı.

source: Launch one or more instances. Each instance obtains IP addresses according to the segment it uses on the particular compute node.
id: Luncurkan satu atau lebih instance. Setiap instance memperoleh alamat IP sesuai dengan segmennya pada node komputasi tertentu.
tr_tr: Bir veya daha fazla örneği başlatın. Her örnek, belirli hesaplama düğümünde kullandığı dilime göre IP adresleri alır.

source: Launch service function instance ``vm1`` using ports ``p1`` and ``p2``, ``vm2`` using ports ``p3`` and ``p4``, and ``vm3`` using ports ``p5`` and ``p6``.
id: Peluncuran fungsi pelayanan instance ``vm1`` menggunakan ports ``p1`` dan ``p2``, ``vm2`` menggunakan ports ``p3`` and ``p4``, dan ``vm3`` menggunakan ports ``p5`` and ``p6``.
tr_tr: ``p1`` ve ``p2`` bağlantı noktalarını kullanarak ``vm1``, ``p3`` ve ``p4`` bağlantı noktalarını kullanarak ``vm2``, ``p5`` ve ``p6`` bağlantı noktalarını kullanarak ``vm3`` servis fonksiyon sunucularını başlatın.

source: Launch the instance by specifying ``port-id`` using the value of ``port_id`` from the trunk details. Launching an instance on a subport is not supported.
id: Luncurkan instance dengan menentukan ``port-id`` menggunakan nilai ``port_id`` dari rincian trunk. Peluncuran sebuah instance pada subport tidak didukung.
tr_tr: Bilgi aktarım yolu detaylarından ``port-id`` değerini kullanarak ``port-id`` belirterek sunucuyu başlatın. Altport üzerinde bir sunucuyu başlatma desteklenmiyor.

source: Launch two instances, ``instance1`` on ``network1`` and ``instance2`` on ``network2``. Associate a floating IP address to both instances.
id: Meluncurkan dua instance, ``instance1`` pada ``network1`` and ``instance2`` pada ``network2``. Mengasosiasikan alamat IP mengambang dengan kedua instance.
tr_tr: İki sunucu başlatın ``network1`` üzerinde ``instance1`` ve ``network2`` üzerinde ``instance2`` bir yüzen IP adresinin her iki sunucu için de ilişkilendirin.

source: Launching instances with SR-IOV ports
id: Peluncuran instance dengan port SR-IOV
tr_tr: SR-IOV bağlantı noktalarıyla sunucuları başlatmak

source: Layer 2 (Ethernet and Switching)
id: Lapisan 2 (Ethernet dan Switching)
tr_tr: Katman 2 (Eternet ve Anahtarlama)

source: Layer 3 (IP and Routing)
id: Lapisan 3 (IP dan Routing)
tr_tr: Katman 3 (IP ve Yönlendirme)

source: Layer-3 agent
id: Layer-3 agent (agen lapisan-3)
tr_tr: Katman-3 ajanı

source: Legacy nova-network to OpenStack Networking (neutron)
id: Legacy nova-network ke OpenStack Networking (neutron)
tr_tr: Eski nova-network'ten OpenStack Ağa (neutron)

source: Like TCP, the sockets API is the most common API for writing UDP-based applications. The sockets API provides a *message-oriented* interface for writing UDP applications: a programmer sends data over UDP by transmitting a fixed-sized message. If an application requires retransmissions of lost packets or a well-defined ordering of received packets, the programmer is responsible for implementing this functionality in the application code.
id: Seperti TCP, soket API adalah API yang paling umum untuk menulis aplikasi berbasis UDP. Soket API menyediakan antarmuka *message-oriented* untuk menulis aplikasi UDP: programmer mengirimkan data melalui UDP dengan mengirimkan pesan berukuran tetap. Jika aplikasi membutuhkan transmisi ulang paket yang hilang atau memesan paket yang diterima didefinisikan dengan baik, programmer bertanggung jawab untuk melaksanakan fungsi ini dalam kode aplikasi.
tr_tr: TCP gibi yuva API'leri, UDP tabanlı uygulamalar yazmak için en yaygın API'dir. Yuva API'sı, UDP uygulamaları yazmak için bir *mesaj odaklı* arabirim sağlar: bir programcı, sabit boyutlu bir ileti göndererek UDP üzerinden veri gönderir. Bir uygulama kayıp paketlerin yeniden gönderilmesini veya alınan paketlerin iyi tanımlanmış bir sıralamasını gerektiriyorsa, programcı bu işlevselliği uygulama kodunda uygulamakla yükümlüdür.

source: Limitations
id: Limitations (keterbatasan)
tr_tr: Kısıtlamalar

source: Limitations and issues
id: Keterbatasan dan masalah
tr_tr: Sınırlamalar ve sorunlar

source: Line 1 of the output specifies the location of the default route, which is the effective routing rule if none of the other rules match. The router associated with the default route (``10.0.2.2`` in the example above) is sometimes referred to as the *default gateway*. A DHCP_ server typically transmits the IP address of the default gateway to the DHCP client along with the client's IP address and a netmask.
id: Baris 1 output menentukan lokasi rute default, yang merupakan aturan routing yang efektif jika tidak ada aturan lain sesuai. Router yang berhubungan dengan rute default (``10.0.2.2`` dalam contoh di atas) kadang-kadang disebut sebagai *default gateway*. Sebuah DHCP_ server biasanya mengirimkan alamat IP dari default gateway ke klien DHCP bersama dengan alamat IP klien dan netmask.
tr_tr: Çıktıdaki 1. satır, diğer kuralların hiçbiri eşleşmiyorsa, etkili yönlendirme kuralı olan varsayılan rota yerini belirtir. Varsayılan rota ile ilişkili yönlendirici (yukarıdaki örnekte ``10.0.2.2``) bazen *varsayılan ağ geçidi* olarak adlandırılır. Bir DHCP_ sunucusu, varsayılan ağ geçidinin IP adresini, istemcinin IP adresi ve bir ağ maskesi ile birlikte DHCP istemcisine gönderir.
