Repository: 25hours/openstack-manuals
Catalog: doc/networking-guide/source/locale/*/LC_MESSAGES/networking-guide.po
Languages: id, tr_tr

source: To remove access for that project, delete the RBAC policy that allows it using the :command:`openstack network rbac delete` command:
id: Untuk menghapus akses untuk proyek itu, hapuslah kebijakan RBAC yang mengizinkan penggunaan perintah :command:`openstack network rbac delete`:
tr_tr: Projeden erişimi kaldırmak için, buna izin veren RBAC politikasını :command:`openstack network rbac delete` komutu kullanarak silin:

source: To remove access for that project, delete the policy that allows it using the :command:`openstack network rbac delete` command:
id: Untuk menghapus akses untuk proyek itu, hapus kebijakan yang mengizinkan penggunaan perintah :command:`openstack network rbac delete`:
tr_tr: Bu proje için erişimi kaldırmak için, :command:`openstack network rbac delete` komutunu kullanarak erişim izni veren politikayı silin:

source: To request the list of networks that do not have at least one of a list of tags, the ``not-tags-any`` argument should be set to the list of tags, separated by commas. In this case, only the networks that do not have at least one of the given tags will be included in the query result. Example that returns the networks that do not have the "red" tag, or do not have the "blue" tag::
id: Untuk meminta daftar jaringan yang tidak memiliki setidaknya satu dari daftar tag, argumen ``not-tags-any`` harus ditetapkan ke daftar tag, dipisahkan dengan koma. Dalam hal ini, hanya jaringan yang tidak memiliki setidaknya salah satu tag yang diberikan akan dimasukkan dalam hasil query. argumen yang mengembalikan jaringan yang tidak memiliki tag "merah", atau tidak memiliki tag "biru" ::
tr_tr: Etiket listesinden en az bir tanesine sahip olmayan ağların listesini talep etmek için, ``not-tags-any`` argümanı etiketler listesine virgülle ayrılmış olarak ayarlanmalıdır. Bu durumda, yalnızca verilen etiketlerden en az birine sahip olmayan ağlar, sorgu sonucuna dahil edilir. "kırmızı" etiketine sahip olmayan ağları döndüren örnek veya "mavi" etiketine sahip olmadığınız örnek::

source: To request the list of networks that do not have one or more tags, the ``not-tags`` argument should be set to the list of tags, separated by commas. In this case, only the networks that do not have any of the given tags will be included in the query results. Example that returns the networks that do not have either "red" or "blue" tag::
id: Untuk meminta daftar jaringan yang tidak memiliki satu atau lebih tag, argumen ``not-tags`` harus ditetapkan ke daftar tag, dipisahkan dengan koma. Dalam hal ini, hanya jaringan yang tidak memiliki tag yang diberikan akan dimasukkan dalam hasil query. Contoh argumen mengembalikan jaringan yang tidak memiliki tag "merah" ataupun "biru" ::
tr_tr: Bir veya daha fazla etiket içermeyen ağların listesini talep etmek için, ``not-tags`` argümanı etiketler listesine virgülle ayrılmış olarak ayarlanmalıdır. Bu durumda, yalnızca verilen etiketlerden herhangi birine sahip olmayan ağlar, sorgu sonuçlarına dahil edilir. "kırmızı" veya "mavi" etiketi olmayan ağları döndüren örnek::

source: To request the list of networks that have a single tag, ``tags`` argument should be set to the desired tag name. Example::
id: Untuk meminta daftar jaringan yang memiliki tag tunggal, argumen ``tags`` harus ditetapkan dengan nama tag yang diinginkan. Contoh::
tr_tr: Tek bir etiketi olan ağların listesini istemek için, ``tags`` argümanı istenen etiket adına ayarlanmalıdır. Örnek::

source: To request the list of networks that have one or more of a list of given tags, the ``tags-any`` argument should be set to the list of tags, separated by commas. In this case, as long as one of the given tags is present, the network will be included in the query result. Example that returns the networks that have the "red" or the "blue" tag::
id: Untuk meminta daftar jaringan yang memiliki satu atau lebih dari daftar tag yang diberikan, argumen ``tag-any`` harus ditetapkan ke daftar tag, dipisahkan dengan koma. Dalam hal ini, selama salah satu tag yang diberikan hadir, jaringan akan dimasukkan dalam hasil query. Contoh argumen mengembalikan jaringan yang memiliki tag "red" atau "blue" ::
tr_tr: Verilen etiketlerden bir veya daha fazlasına sahip olan ağların listesini istemek için, ``tags-any`` argümanı etiketler listesine virgülle ayrılmış olarak ayarlanmalıdır. Bu durumda, verilen etiketlerden biri mevcut olduğu sürece, ağ sorgu sonucuna dahil edilir. "kırmızı" veya "mavi" etiketi olan ağları geri getiren örnek ::

source: To request the list of networks that have two or more tags, the ``tags`` argument should be set to the list of tags, separated by commas. In this case, the tags given must all be present for a network to be included in the query result. Example that returns networks that have the "red" and "blue" tags::
id: Untuk meminta daftar jaringan yang memiliki dua atau lebih tag, argumen ``tags`` harus ditetapkan ke daftar tag, dipisahkan dengan koma. Dalam hal ini, tag yang diberikan harus semua hadir untuk jaringan untuk dimasukkan dalam hasil query. Contoh argumen mengembalikan jaringan yang memiliki tag "red" and "blue"::
tr_tr: İki veya daha fazla etikete sahip olan ağların listesini istemek için, ``tags`` argümanı virgüllerle ayrılmış etiketlerin listesine ayarlanmalıdır. Bu durumda, bir ağın sorgu sonucuna dahil edilmesi için verilen etiketler mutlaka mevcut olmalıdır. "kırmızı" ve "mavi" etiketleri olan ağları döndüren örnek::

source: To return to classic mode, turn down the router again, turning off L3 HA and starting the router again.
id: Untuk kembali ke modus klasik, kecilkan lagi router, matikan L3 HA dan mulai router lagi.
tr_tr: Klasik moda dönmek için, yönlendiriciyi tekrar durdurun, L3 HA'yı kapatın ve yönlendiriciyi yeniden başlatın.

source: To see if your cloud has this feature available, you can check that it is listed in the supported aliases. You can do this with the OpenStack client.
id: Untuk melihat apakah cloud Anda memiliki fitur ini tersedia, Anda dapat memeriksa dimana fitur tercantum dalam alias didukung. Anda dapat melakukan ini dengan klien OpenStack.
tr_tr: Bulutunuzun bu özelliği kullanıp kullanmadığını görmek için, bunun desteklenen takma adlar listesinde olup olmadığını kontrol edebilirsiniz. Bunu OpenStack istemcisi ile yapabilirsiniz.

source: To start your Dibbler server, run:
id: Untuk memulai server Dibbler Anda, jalankan:
tr_tr: Dibbler sunucusu başlatmak için, şunu çalıştırın:

source: To support integration with the deployment examples, this content configures the Macvtap mechanism driver to use the overlay network for untagged (flat) or tagged (VLAN) networks in addition to overlay networks such as VXLAN. Your physical network infrastructure must support VLAN (802.1q) tagging on the overlay network.
id: Untuk mendukung integrasi dengan contoh pengerahan, konten ini mengkonfigurasi driver mekanisme Macvtap untuk menggunakan jaringan overlay untuk jaringan untagged (flat) atau tag (VLAN) dan juga jaringan overlay seperti VXLAN. Infrastruktur jaringan fisik Anda harus mendukung VLAN (802.1q) tagging pada jaringan overlay.
tr_tr: Dağıtım örnekleriyle entegrasyonu desteklemek için, bu içerik, Macvtap mekanizma sürücüsünü, VXLAN gibi yer paylaşım ağlarına ek olarak etiketlenmemiş (flat) veya etiketlenmiş (VLAN) ağlar için yer paylaşımı ağını kullanacak şekilde yapılandırır. Fiziksel ağ altyapınızın, yer paylaşımlı ağdaki VLAN (802.1q) etiketlemesini desteklemesi gerekir.

source: To test the HA of DHCP agent:
id: Untuk menguji HA agen DHCP:
tr_tr: DHCP ajanının HA'sını test etmek için:

source: To trigger the prefix delegation process, create a router interface between this subnet and a router with an active interface on the external network:
id: Untuk memicu proses prefix delegation, buat antarmuka router antara subnet ini dan router dengan interface yang aktif pada jaringan eksternal:
tr_tr: Önek delegasyonu sürecini tetiklemek için, bu alt ağ ile harici ağda etkin bir arabirime sahip bir yönlendirici arasında bir yönlendirici arabirimi oluşturun:

source: To understand how ARP translates IP addresses to MAC addresses, consider the following example. Assume host *A* has an IP address of ``192.168.1.5/24`` and a MAC address of ``fc:99:47:49:d4:a0``, and wants to send a packet to host *B* with an IP address of ``192.168.1.7``. Note that the network number is the same for both hosts, so host *A* is able to send frames directly to host *B*.
id: Untuk memahami bagaimana ARP diterjemahkan alamat IP ke alamat MAC, pertimbangkan contoh berikut. Asumsikan host *A* memiliki alamat IP ``192.168.1.5/24`` dan alamat MAC ``fc:99:47:49:d4:a0``, dan ingin mengirim paket ke host *B* dengan alamat IP ``192.168.1.7``. Perhatikan bahwa nomor jaringan adalah sama untuk kedua host, sehingga host *A* mampu mengirim frame langsung ke host *B*.
tr_tr: ARP'nin IP adreslerini MAC adreslerine nasıl çevirdiğini anlamak için aşağıdaki örneğe bakın. Ana bilgisayar *A*'nın bir IP adresinin ``192.168.1.5/24`` olduğu ve MAC adresinin ``fc:99:47:49:d4:a0`` olduğunu ve IP adresi ``192.168.1.7`` olan *B* ana bilgisayarına bir paket göndermek istediğini varsayalım. Ağ numarası, her iki ana bilgisayar için aynı olduğundan, ana bilgisayar *A*'nın doğrudan ana bilgisayar *B*'ye çerçeve gönderebildiğine dikkat edin.

source: To understand how VLANs work, let's consider VLAN applications in a traditional IT environment, where physical hosts are attached to a physical switch, and no virtualization is involved. Imagine a scenario where you want three isolated networks but you only have a single physical switch. The network administrator would choose three VLAN IDs, for example, 10, 11, and 12, and would configure the switch to associate switchports with VLAN IDs. For example, switchport 2 might be associated with VLAN 10, switchport 3 might be associated with VLAN 11, and so forth. When a switchport is configured for a specific VLAN, it is called an *access port*. The switch is responsible for ensuring that the network traffic is isolated across the VLANs.
id: Untuk memahami bagaimana VLAN bekerja, mari kita pertimbangkan aplikasi VLAN dalam lingkungan TI tradisional, dimana host fisik yang melekat pada switch fisik, dan tidak ada virtualisasi yang terlibat. Bayangkan sebuah skenario dimana Anda ingin tiga jaringan terisolasi tetapi Anda hanya memiliki switch fisik tunggal. Administrator jaringan akan memilih tiga ID VLAN, misalnya, 10, 11, dan 12, dan akan mengkonfigurasi switch untuk mengasosiasikan switchport dengan VLAN ID. Misalnya, switchport 2 mungkin terkait dengan VLAN 10, switchport 3 mungkin terkait dengan VLAN 11, dan sebagainya. Ketika switchport dikonfigurasi untuk VLAN tertentu, hal itu disebut *access port*. Switch bertanggung jawab untuk memastikan bahwa lalu lintas jaringan terisolasi di seluruh VLAN.
tr_tr: VLAN'ların nasıl çalıştığını anlamak için, VLAN uygulamalarını, fiziksel bilgisayarların fiziksel bir switch'e bağlandığı geleneksel bir BT ortamında düşünün ve sanallaştırma dahil değildir. Üç yalıtılmış ağ istediğinizi, ancak yalnızca tek bir fiziksel switch'iniz olduğunu düşünün. Ağ yöneticisi, örneğin, 10, 11 ve 12 gibi üç VLAN kimliği seçer ve switch'i VLAN kimlikleriyle ilişkilendirmek üzere switch'i yapılandırır. Örneğin, switchport 2 VLAN 10 ile ilişkilendirilebilir, switchport 3 VLAN 11 ile ilişkilendirilebilir vb. Belirli bir VLAN için bir switchport yapılandırıldığında, buna bir *access port* adı verilir. Anahtar, ağ trafiğinin VLAN'lar arasında izole edilmesinden sorumludur.

source: To upgrade the database incrementally, use the following command:
id: Untuk meng-upgrade database secara bertahap, gunakan perintah berikut:
tr_tr: Veritabanını aşamalı olarak yükseltmek için aşağıdaki komutu kullanın:

source: To use this feature, the neutron service must have the following extensions enabled:
id: Untuk menggunakan fitur ini, layanan neutron harus memiliki ekstensi yang diaktifkan berikut:
tr_tr: Bu özelliği kullanmak için neutron hizmetinin aşağıdaki uzantıları etkinleştirmiş olması gerekir:

source: To use this feature, you need a prefix delegation capable DHCPv6 server that is reachable from your OpenStack Networking node(s). This could be software running on the OpenStack Networking node(s) or elsewhere, or a physical router. For the purposes of this guide we are using the open-source DHCPv6 server, Dibbler. Dibbler is available in many Linux package managers, or from source at `tomaszmrugalski/dibbler <https://github.com/tomaszmrugalski/dibbler>`_.
id: Untuk menggunakan fitur ini, Anda perlu delegasi awalan (prefix delegation) yang mampu server DHCPv6 yang dicapai dari node OpenStack Networking Anda. Ini bisa menjadi perangkat lunak yang berjalan pada node OpenStack Networking atau di tempat lain, atau router fisik. Untuk tujuan panduan ini kita menggunakan Dibbler, open source Server DHCPv6. Dibbler tersedia di banyak manajer paket Linux, atau dari sumber di `tomaszmrugalski/dibbler <https://github.com/tomaszmrugalski/dibbler>`_.
tr_tr: Bu özelliği kullanmak için, OpenStack Ağ Oluşturma düğümlerinden erişilebilen bir önek delegasyon yeteneğine sahip DHCPv6 sunucusuna ihtiyacınız vardır. Bu, OpenStack Networking düğümleri veya başka yerlerde çalışan bir yazılım veya bir fiziksel yönlendirici olabilir. Bu kılavuzun amaçları doğrultusunda, açık kaynaklı DHCPv6 sunucusu Dibbler kullanıyoruz. Dibbler birçok Linux paket yöneticisinde veya `tomaszmrugalski/dibbler <https://github.com/tomaszmrugalski/dibbler>`_ adresindeki kaynaktan temin edilebilir.

source: To validate that the required resources are correctly set up for auto-allocation, without actually provisioning any resource, use the ``--dry-run`` option:
tr_tr: Gerekli kaynakların otomatik tahsis için doğru şekilde kurulduğunu doğrulamak için, herhangi bir kaynağı gerçekte provizyon yapmadan ``--dry-run`` seçeneğini kullanın:

source: To view the defined libvirt networks and their state:
id: Untuk melihat jaringan libvirt yang didefinisikan dan keadaan mereka:
tr_tr: Tanımlanmış libvirt ağlarını ve durumlarını görüntülemek için:

source: Trunk states
id: Status Trunk
tr_tr: Bilgi aktarım yolu durumları

source: Trunking
tr_tr: Bilgi aktarım yolu

source: Trunking is used to connect between different switches. Each trunk uses a tag to identify which VLAN is in use. This ensures that switches on the same VLAN can communicate.
id: Trunking digunakan untuk menghubungkan antara switch yang berbeda. Setiap trunk menggunakan tag untuk mengidentifikasi VLAN yang sedang digunakan. Hal ini memastikan bahwa switch pada VLAN yang sama dapat berkomunikasi.
tr_tr: Bilgi aktarım yolu iki farklı switch arasındaki bağlantı için kullanılır. Her bilgi aktarım yolı hangi VLAN'ın kullanıldığını belirlemek için bir etiket kullanır. Bu, aynı VLAN üzerindeki switch'lerin iletişim kurabildiklerini garantiler.

source: Trusted projects policy.json configuration
id: Konfigurasi policy.json proyek terpercaya
tr_tr: Güvenilen projeler policy.json yapılandırması

source: Tunneling is a mechanism that makes transfer of payloads feasible over an incompatible delivery network. It allows the network user to gain access to denied or insecure networks. Data encryption may be employed to transport the payload, ensuring that the encapsulated user network data appears as public even though it is private and can easily pass the conflicting network.
id: Tunneling (terowongan) adalah sebuah mekanisme yang membuat pemidahan payload feasible melalui jaringan pengiriman tidak kompatibel. Tunneling ini mengizinkan pengguna jaringan untuk mendapatkan akses ke jaringan tidak aman atau ditolak. Enkripsi data dapat digunakan untuk mengangkut payload, memastikan bahwa jaringan data pengguna yang dikemas akan muncul sebagai publik meskipun sebenarnya private, dan dapat dengan mudah melewati jaringan yang saling bertentangan.
tr_tr: Tünelleme, uyumsuz bir dağıtım ağı üzerinde yüklerin transferini mümkün kılan bir mekanizma. Ağ kullanıcısının reddedilen veya güvensiz şebekelere erişmesini sağlar. Veri şifreleme, yükü taşımak için kullanılabilir, böylece kapsüllenmiş kullanıcı ağı verisinin özel olmasına ve çakışan ağa kolayca geçebilmesine rağmen kamuya açık olmasını sağlar.

source: Two compute nodes with the following components:
id: Dua node komputasi dengan komponen-komponen berikut:
tr_tr: Aşağıdaki bileşenlere sahip iki hesaplama düğümü:

source: Two network interfaces: management and provider.
id: Dua antarmuka jaringan: manajemen dan provider.
tr_tr: İki ağ arabirimi: yönetim ve sağlayıcı.

source: Two networking models exist in OpenStack. The first is called legacy networking (:term:`nova-network`) and it is a sub-process embedded in the Compute project (nova). This model has some limitations, such as creating complex network topologies, extending its back-end implementation to vendor-specific technologies, and providing project-specific networking elements. These limitations are the main reasons the OpenStack Networking (neutron) model was created.
id: Dua model jaringan ada di OpenStack. Yang pertama disebut legacy networking (:term:`nova-network`) dan itu adalah sub-process tertanam dalam proyek Compute (nova). Model ini memiliki beberapa keterbatasan, seperti dalam pembuatan topologi jaringan yang kompleks, peluasan implementasi back-end untuk teknologi vendor-specific, dan penyediaan elemen jaringan project-specific. Keterbatasan ini adalah alasan utama model OpenStack Networking (neutron) dibuat.
tr_tr: OpenStack'te iki ağ modeli bulunmaktadır. Birincisi eski ağ olarak adlandırılır (:term:`nova-network`) ve Hesaplama projesine (nova) gömülü bir alt süreçtir. Bu model, karmaşık ağ topolojileri oluşturma, arka uç uygulamasını satıcıya özgü teknolojilere genişletme ve projeye özgü ağ oluşturma öğeleri sunma gibi bazı kısıtlamalara sahiptir. Bu kısıtlamalar, OpenStack Ağ (neutron) modeli oluşturulmasının temel nedenidir.

source: Type drivers
id: Tipe driver
tr_tr: Tür sürücüleri

source: Typically, one uses this mechanism to delete networking resources for a defunct project regardless of its existence in the Identity service.
id: Biasanya, orang menggunakan mekanisme ini untuk menghapus sumber daya jaringan untuk proyek mati (defunct) terlepas dari keberadaannya dalam layanan Identity.
tr_tr: Tipik olarak, kimlik servisindeki varoluşundan bağımsız olarak, yok olan bir projenin ağ kaynaklarını silmek için bu mekanizmayı kullanır.

source: UDP has support for one-to-many communication: sending a single packet to multiple hosts. An application can broadcast a UDP packet to all of the network hosts on a local network by setting the receiver IP address as the special IP broadcast address ``255.255.255.255``. An application can also send a UDP packet to a set of receivers using *IP multicast*. The intended receiver applications join a multicast group by binding a UDP socket to a special IP address that is one of the valid multicast group addresses. The receiving hosts do not have to be on the same local network as the sender, but the intervening routers must be configured to support IP multicast routing. VXLAN is an example of a UDP-based protocol that uses IP multicast.
id: UDP memiliki dukungan untuk komunikasi one-to-many: mengirimkan paket ke beberapa host. Sebuah aplikasi dapat menyiarkan paket UDP ke semua host jaringan pada jaringan lokal dengan menetapkan alamat IP penerima sebagai alamat broadcast IP khusus ``255.255.255.255``. Sebuah aplikasi juga dapat mengirim paket UDP ke satu set receiver menggunakan *IP multicast *. Aplikasi penerima yang dimaksudkan akan menggabungkan kelompok multicast yang terikat soket UDP ke alamat IP khusus yang merupakan salah satu alamat grup multicast yang valid. Host menerima tidak harus berada di jaringan lokal yang sama sebagai pengirim, tetapi router intervensi harus dikonfigurasi untuk mendukung IP multicast routing. VXLAN adalah contoh dari protokol berbasis UDP yang menggunakan IP multicast.
tr_tr: UDP, çoklu iletişim için destek sağlar: tek bir paketin birden çok ana bilgisayara gönderilmesi. Bir uygulama, alıcı IP adresini özel IP yayın adresi ``255.255.255.255`` olarak ayarlayarak bir yerel ağdaki tüm ağ ana makinelerine bir UDP paketi yayınlayabilir. Bir uygulama ayrıca *IP multicast* özelliğini kullanarak bir dizi uydu alıcısına bir UDP paketi gönderebilir. Amaçlanan alıcı uygulamaları, bir çok noktaya yayın grubuna, bir UDP soketini, geçerli çoklu yayın grup adreslerinden biri olan özel bir IP adresine bağlayarak katılırlar. Alıcı bilgisayarların gönderenle aynı yerel ağ üzerinde olması gerekmez, ancak ara yönlendiriciler IP çok noktaya yayın yönlendirmesini destekleyecek şekilde yapılandırılmalıdır. VXLAN, IP çok noktaya yayın kullanan bir UDP tabanlı protokol örneğidir.

source: UDP, like TCP, uses the notion of ports to distinguish between different applications running on the same system. Note, however, that operating systems treat UDP ports separately from TCP ports. For example, it is possible for one application to be associated with TCP port 16543 and a separate application to be associated with UDP port 16543.
id: UDP, seperti TCP, menggunakan gagasan (notion) port untuk membedakan antara aplikasi yang berbeda berjalan pada sistem yang sama. Catatan, bagaimanapun, bahwa sistem operasi memperlakukan port UDP secara terpisah dari port TCP. Sebagai contoh, ada kemungkinan satu aplikasi untuk dihubungkan dengan TCP port 16543 dan aplikasi terpisah untuk dihubungkan dengan port UDP 16.543.
tr_tr: TCP gibi UDP, aynı sistemde çalışan farklı uygulamalar arasında ayrım yapmak için bağlantı noktaları kavramını kullanır. Bununla birlikte, işletim sistemlerinin UDP bağlantı noktalarını TCP bağlantı noktalarından ayrı olarak ele aldığını unutmayın. Örneğin, bir uygulamanın TCP bağlantı noktası 16543 ile ilişkilendirilmesi ve ayrı bir uygulama UDP bağlantı noktası 16543 ile ilişkilendirilmesi mümkündür.

source: URLs differ depending on your OpenStack deployment. You can discover the URL by executing the :command:`openstack endpoint list | grep placement` command.
tr_tr: URL'ler OpenStack dağıtımınıza bağlı olarak farklılık gösterir. URL'yi :command:`openstack endpoint list | grep placement` komutunu çalıştırarak keşfedebilirsiniz.

source: Unique physical network name
id: Unique physical network name (nama jaringan fisik unik)
tr_tr: Benzersiz fiziksel ağ adı

source: Unlike IPv4 the MTU of a given network can be conveyed in the RA messages sent by the router as well as in the DHCP messages.
tr_tr: Pv4'den farklı olarak, verilen bir ağın MTU'su, yönlendirici tarafından gönderilen RA iletilerinde olduğu kadar DHCP iletilerinde de iletilebilir.

source: Unlike conventional provider networks, a DHCP agent cannot support more than one segment within a network. The operator must deploy at least one DHCP agent per segment. Consider deploying DHCP agents on compute nodes containing the segments rather than one or more network nodes to reduce node count.
id: Tidak seperti jaringan penyedia konvensional, agen DHCP tidak dapat mendukung lebih dari satu segmen dalam jaringan. Operator harus menggunakan setidaknya satu agen DHCP per segmen. Pertimbangkan penggelaran agen DHCP pada node komputasi yang berisi segmen daripada satu atau lebih node jaringan untuk mengurangi jumlah node.
tr_tr: Geleneksel sağlayıcının ağlarının aksine, DHCP aracı bir ağda birden fazla segmenti destekleyemez. Operatör, segment başına en az bir DHCP aracı yayına almalıdır. Düğüm sayısını azaltmak için bir veya daha fazla ağ düğümünden ziyade segmentleri içeren hesaplama düğümlerinde DHCP aracıları yayına almayı düşünün.
