Repository: 25hours/openstack-manuals
Catalog: doc/networking-guide/source/locale/*/LC_MESSAGES/networking-guide.po
Languages: id, tr_tr

source: Self-service (project/private/internal) networks including routers using IPv4 and IPv6
id: Jaringan (proyek/private/internal) self-service meliputi routers menggunakan IPv4 dan IPv6
tr_tr: IPv4 ve IPv6 kullanan yönlendiriciler de dahil olmak üzere kendi kendine hizmet (proje/özel/dahili) ağları

source: Self-service network 1 (VXLAN)
id: Jaringan self-service 1 (VXLAN)
tr_tr: Self-servis ağ 1 (VXLAN)

source: Self-service network 2 (VXLAN)
id: Jaringan self-service 2 (VXLAN)
tr_tr: Self-servis ağ 2 (VXLAN)

source: Self-service network 3 uses a unique IP address range 10.0.3.0/24 to demonstrate that the BGP speaker does not advertise prefixes outside of address scopes.
tr_tr: Kendi kendine hizmet ağı 3, BGP hoparlörünün adres kapsamlarının dışındaki önekleri tanıtmadığını göstermek için 10.0.3.0/24 aralığında benzersiz bir IP adresi kullanır.

source: Self-service networks
id: Jaringan self-service
tr_tr: Self-servis ağları

source: Self-service networks 1 and 2 use IP address ranges inside of the address scope.
id: Jaringan self-service 1 dan 2 menggunakan berkisar alamat IP dalam lingkup alamat.
tr_tr: Kendi kendine hizmet ağları 1 ve 2, adres alanının içinde IP adresi aralıkları kullanır.

source: Self-service networks primarily enable general (non-privileged) projects to manage networks without involving administrators. These networks are entirely virtual and require virtual routers to interact with provider and external networks such as the Internet. Self-service networks also usually provide DHCP and metadata services to instances.
id: Jaringan self-service terutama mengaktifkan secara umum proyek (non-privileged) untuk mengelola jaringan tanpa melibatkan administrator. Jaringan ini sepenuhnya virtual dan membutuhkan router virtual untuk berinteraksi dengan provider dan jaringan eksternal seperti Internet. Jaringan self-service juga biasanya menyediakan DHCP dan layanan metadata untuk instance.
tr_tr: Self-servis ağları, genel olarak (ayrıcalıksız) genel projeleri, yöneticileri içermeksizin ağları yönetmeyi sağlar. Bu ağlar tamamen sanaldır ve sanal yönlendiricilerin sağlayıcı ve İnternet gibi harici ağlarla etkileşim kurmalarını gerektirir. Self-servis ağları, genellikle sunuculara DHCP ve meta veri hizmetleri sağlar.

source: Self-service networks:
id: Self-service networks (jaringan swalayan):
tr_tr: Self-servis ağları:

source: Self-service router
tr_tr: Self-servis yönlendirici

source: Separate firewall rule IDs or names with spaces. The order in which you specify the rules is important.
id: Pisahkan ID aturan firewall atau nama dengan spasi. Urutan menjadi penting, dimana Anda menentukan aturan urutan itu.
tr_tr: Güvenlik duvarı kuralı kimliklerini veya adları boşluklarla ayırın. Kuralları belirtme sırası önemlidir.

source: Server
tr_tr: Sunucu

source: Service and component hierarchy
id: Layanan dan hirarki komponen
tr_tr: Servis ve bileşen hiyerarşisi

source: Service function chaining
id: Service function chaining (SFC)
tr_tr: Servis işlev zinciri

source: Service subnets
id: Subnet layanan
tr_tr: Servis altağları

source: Service subnets enable operators to define valid port types for each subnet on a network without limiting networks to one subnet or manually creating ports with a specific subnet ID. Using this feature, operators can ensure that ports for instances and router interfaces, for example, always use different subnets.
id: Subnet layanan mengaktifkan operator untuk menentukan tipe port yang valid untuk setiap subnet pada jaringan tanpa membatasi jaringan ke satu subnet atau secara manual membuat port dengan ID subnet tertentu. Menggunakan fitur ini, operator dapat memastikan bahwa port untuk instance dan antarmuka router, misalnya, selalu menggunakan subnet yang berbeda.
tr_tr: Servis alt ağları, operatörlerin ağları bir alt ağa sınırlamadan veya belirli bir alt ağ kimliği olan elle bağlantı noktaları oluşturmadan bir ağdaki her alt ağ için geçerli bağlantı noktaları türleri tanımlamalarını sağlar. Bu özelliği kullanarak operatörler, örnekler ve yönlendirici arayüzleri için bağlantı noktalarının her zaman farklı alt ağlar kullanmasını sağlayabilir.

source: Services
id: Layanan-layanan
tr_tr: Servisler

source: Set ``AZAwareWeightScheduler`` to ``network_scheduler_driver`` in ``/etc/neutron/neutron.conf`` so that the Networking service schedules a network according to the availability zone:
id: Atur ``AZAwareWeightScheduler`` ke ``network_scheduler_driver`` dalam ``/etc/neutron/neutron.conf`` sehingga layanan Networking menjadwal jaringan sesuai dengan zona ketersediaan:
tr_tr: ``/etc/neutron/neutron.conf`` dosyası içindeki ``network_scheduler_driver`` değerini ``AZAwareWeightScheduler`` olarak ayarlayın böylece Ağ servisi kullanılabilirlik bölgesine göre bir ağı zamanlayacaktır:

source: Set ``AZLeastRoutersScheduler`` to ``router_scheduler_driver`` in file ``/etc/neutron/neutron.conf`` so that the Networking service schedules a router according to the availability zone:
id: Atur ``AZLeastRoutersScheduler`` ke ``router_scheduler_driver`` dalam file ``/etc/neutron/neutron.conf`` sehingga layanan Networking menjadwal router sesuai dengan zona ketersediaan:
tr_tr: ``/etc/neutron/neutron.conf`` dosyasında ``router_scheduler_driver`` değerini ``AZLeastRoutersScheduler``'a ayarlayın böylece Ağ servisi kullanılabilirlik bölgesine göre bir yönlendiriciyi zamanlar:

source: Set the "has_transitioned" flag in the Compute hypervisor database/config.
id: Atur flag "has_transitioned" di Compute hypervisor database/config.
tr_tr: Hesaplama hypervisor veritabanı/yapılandırmasında "has_transitioned" bayrağını ayarla.

source: Set the ``ha`` attribute of the router to ``True``.
id: Atur attribut router ``ha`` ke ``True``.
tr_tr: Yönlendiricinin ``ha`` özniteliğini ``True`` olarak ayarla.

source: Set the admin_state_up to ``False``. This will severe south-north connections until admin_state_up is set to ``True`` again.
id: Atur admin_state_up ke ``False``. Ini akan ada koneksi selatan-utara yang parah sampai admin_state_up diatur ke ``True`` kembali.
tr_tr: Admin_state_up'ı ``False`` olarak ayarla. Bu, admin_state_up tekrar "True" olarak ayarlanıncaya kadar ciddi güney-kuzey bağlantılarına sahip olacak

source: Set the admin_state_up to ``True``. After this, south-north connections can start.
id: Atur admin_state_up ke ``True``. Setelah ini, koneksi selatan-utara dapat mulai.
tr_tr: Admin_state_up'ı ``True`` olarak ayarlayın. Bundan sonra güney-kuzey bağlantıları başlayabilir.

source: Set the external gateway for the router, which will create an interface and allocate an IP address on demo-ext-net:
id: Atur gateway eksternal untuk router, yang akan membuat sebuah antarmuka dan mengalokasikan alamat IP pada demo-ext-net:
tr_tr: Bir arayüz oluşturacak ve demo-ext-net üzerinde bir IP adresi tahsis edecek yönlendirici için harici ağ geçidini ayarlayın:

source: Set the following configuration options in file ``/etc/neutron/neutron.conf`` so that you get DHCP high availability.
id: Atur opsi konfigurasi berikut dalam file ``/etc/neutron/neutron.conf`` sehingga Anda mendapatkan DHCP ketersediaan tinggi.
tr_tr: ``/etc/neutron/neutron.conf`` dosyasında aşağıdaki yapılandırma seçeneklerini ayarlayarak DHCP'nin yüksek kullanılabilirliğini sağlayın.

source: Set the following configuration options in file ``/etc/neutron/neutron.conf`` so that you get L3 high availability.
id: Atur opsi konfigurasi berikut dalam file ``/etc/neutron/neutron.conf`` sehingga Anda mendapatkan L3 ketersediaan tinggi.
tr_tr: Aşağıdaki yapılandırma seçeneklerini ``/etc/neutron/neutron.conf`` dosyasında ayarlayarak L3'ün yüksek kullanılabilirliğini sağlayın.

source: Set up a default external network
id: Mengatur jaringan eksternal standar
tr_tr: Varsayılan harici ağı ayarlayın

source: Setting DHCPv6-stateful for ``ipv6_ra_mode`` configures the neutron router with radvd agent to send RAs. The list below captures the values set for the address configuration flags in the RA packet in this scenario. Similarly, setting DHCPv6-stateful for ``ipv6_address_mode`` configures neutron DHCP implementation to provide addresses and additional network information through DHCPv6.
tr_tr: DHCPv6-stateful'u `ipv6_ra_mode`` için ayarlamak radvd aracısıyla neutron yönlendiriciyi RA'ları göndermek üzere yapılandırır. Aşağıdaki liste, bu senaryoda RA paketindeki adres yapılandırma bayrakları için ayarlanan değerleri yakalar. Benzer şekilde, ``ipv6_address_mode`` için DHCPv6-stateful ayarı, DHCPv6 aracılığıyla adresler ve ek ağ bilgileri sağlamak için neutron DHCP uygulamasını yapılandırır.

source: Setting DHCPv6-stateless for ``ipv6_ra_mode`` configures the neutron router with radvd agent to send RAs. The list below captures the values set for the address configuration flags in the RA packet in this scenario. Similarly, setting DHCPv6-stateless for ``ipv6_address_mode`` configures neutron DHCP implementation to provide the additional network information.
tr_tr: DHCPv6-stateless'i ``ipv6_ra_mode`` için ayarlamak radvd aracısı ile neutron yönlendiriciyi RA'lar göndermek üzere yapılandırır. Aşağıdaki liste, bu senaryoda RA paketindeki adres yapılandırma bayrakları için ayarlanan değerleri yakalar. Benzer şekilde, DHCPv6-stateless'i ``ipv6_address_mode`` için ayarlamak, ek ağ bilgilerini sağlamak için neutron DHCP uygulamasını yapılandırır.

source: Setting ``ipv6_ra_mode`` to ``slaac`` will result in OpenStack Networking routers being configured to send RA packets, when they are created. This results in the following values set for the address configuration flags in the RA messages:
id: Pengaturan ``ipv6_ra_mode`` untuk ``slaac`` akan menghasilkan router OpenStack Networking yang dikonfigurasi untuk mengirim paket RA, ketika mereka diciptakan. Hal ini menyebabkan nilai berikut ditetapkan untuk flag konfigurasi alamat dalam pesan RA:
tr_tr: ``ipv6_ra_mode`` parametresini ``slaac`` olarak ayarlamak OpenStack Networking yönlendiricilerinin RA paketlerini oluşturacak şekilde yapılandırılmasına neden olur. Bu, RA iletilerindeki adres yapılandırma bayrakları için aşağıdaki değerleri ayarlar:

source: Setting quotas for LBaaS v2
id: Penetapan kuota untuk LBaaS v2
tr_tr: LBaaS v2 için kota ayarlama

source: Setting up an external network is described in `OpenStack Administrator Guide <https://docs.openstack.org/admin-guide/networking-adv-features.html>`_. Assuming the external network to be used for the auto-allocation feature is named ``public``, make it the ``default`` external network with the following command:
tr_tr: Bir harici ağ ayarlama `OpenStack Yönetim Kılavuzu <https://docs.openstack.org/admin-guide/networking-adv-features.html>`_'nda açıklanmıştır. Otomatik tahsis özelliği için kullanılacak harici ağın``public`` isimli olduğunu varsayıp, bu ağı aşağıdaki komutlar ile ``varsayılan`` harici ağ yapalım:

source: Sharing a QoS policy with specific projects
id: Berbagi kebijakan QoS dengan proyek tertentu
tr_tr: Belirli projelerle bir QoS politikası paylaşma

source: Sharing a network with specific projects
id: Berbagi jaringan dengan proyek tertentu
tr_tr: Bir ağı belirli projelerle paylaşma

source: Sharing an object with a specific project is accomplished by creating a policy entry that permits the target project the ``access_as_shared`` action on that object.
id: Berbagi sebuah objek dengan proyek tertentu dilakukan dengan pembuatan entri kebijakan yang mengizinkan proyek target aksi `` access_as_shared`` pada objek itu.
tr_tr: Bir nesneyi belirli bir projeyle paylaşmak, hedef projeye o nesne üzerindeki ``access_as_shared`` eylemine izin veren bir politika girişi oluşturarak gerçekleştirilir.

source: Sharing an object with specific projects
id: Berbagi obyek dengan proyek tertentu
tr_tr: Bir nesneyi belirli projelerle paylaşma

source: Show agent details.
id: Tampilkan detail agen.
tr_tr: Ajan detaylarını göster.

source: Show available dynamic routing agents.
id: Tampilkan agen routing dinamis yang tersedia
tr_tr: Mevcut dinamik yönlendirme araçlarını gösterin.

source: Show trunk details to get the ``port_id`` of the trunk.
id: Tampilkan detail trunk untuk mendapatkan ``port_id`` dari trunk.
tr_tr: Bilgi aktarım yolunun ``port_id``sini almak için bilgi aktarım yolunun detaylarını göster.

source: Similar to :ref:`deploy-ovs-selfservice-networktrafficflow-ns1`, except the router namespace on the network node becomes the SNAT namespace. The network node still contains the router namespace, but it serves no purpose in this case.
id: Mirip dengan :ref:`deploy-ovs-selfservice-networktrafficflow-ns1`, kecuali namespace router pada node jaringan menjadi namespace SNAT. Node jaringan masih mengandung namespace router, tetapi node jaringan ini melayani tanpa tujuan dalam hal ini.
tr_tr: :ref:`deploy-ovs-selfservice-networktrafficflow-ns1`e benzer şekilde, ağ düğümündeki yönlendirici ad alanı SNAT ad alanına girme haricinde. Ağ düğümü hala yönlendirici ad alanını içerir, ancak bu durumda hiçbir amaca hizmet etmemektedir.

source: Similar to conventional networking, layer-2 (switching) handles transit of traffic between ports on the same segment and layer-3 (routing) handles transit of traffic between segments.
id: Mirip dengan jaringan konvensional, lapisan-2 (switching) menangani transit lalu lintas antara port pada segmen yang sama dan lapisan-3 (routing) menangani transit lalu lintas antara segmen.
tr_tr: Geleneksel ağa benzer şekilde, katman-2 (anahtarlama), aynı segmentteki portlar arasındaki trafiği aktarır ve katman-3 (yönlendirme) segmentler arasındaki trafiğin geçişini ele alır.

source: Similar to legacy HA routers, DVR/SNAT HA routers provide a quick fail over of the SNAT service to a backup DVR/SNAT router on an l3-agent running on a different node.
id: Mirip dengan legacy HA router, DVR/SNAT HA router menyediakan penanganan kegagalan (failover) cepat layanan SNAT ke router DVR/SNAT backup pada l3-agent yang berjalan pada node yang berbeda.
tr_tr: Eski HA yönlendiricilerine benzer şekilde, DVR/SNAT HA yönlendiricileri farklı bir düğümde çalışan bir l3 ajanına yedek bir DVR/SNAT yönlendiricisine SNAT hizmetinin hızlı bir şekilde yük devretmesini sağlar.

source: Similar to the classic scenario, all network traffic on a project network that requires routing actively traverses only one network node regardless of the quantity of network nodes providing HA for the router. Therefore, this high-availability implementation primarily addresses failure situations instead of bandwidth constraints that limit performance. However, it supports random distribution of routers on different network nodes to reduce the chances of bandwidth constraints and to improve scaling.
id: Serupa dengan skenario klasik, semua lalu lintas jaringan pada jaringan proyek yang memerlukan routing yang aktif hanya melintasi satu node jaringan terlepas dari kuantitas node jaringan menyediakan HA untuk router. Oleh karena itu, pelaksanaan ketersediaan tinggi ini terutama membahas situasi kegagalan bukan kendala bandwidth yang membatasi kinerja. Namun, hal itu mendukung distribusi router acak pada node jaringan yang berbeda untuk mengurangi kemungkinan kendala bandwidth dan untuk meningkatkan skala.
tr_tr: Klasik senaryoya benzer şekilde, bir proje ağında yönlendirme gerektiren tüm ağ trafiği, yönlendirici için HA sağlayan ağ düğümlerinin sayısına bakılmaksızın yalnızca bir ağ düğümünü aktif olarak geçmektedir. Bu nedenle, bu yüksek erişilebilirlik uygulaması, öncelikle performansı sınırlayan bant genişliği kısıtlamaları yerine hata durumlarına yöneliktir. Bununla birlikte, bant genişliği kısıtlamaları şansını azaltmak ve ölçekleme geliştirmek için farklı ağ düğümlerinde yönlendiricilerin rasgele dağılımını destekler.

source: Similar to the self-service deployment example, this configuration supports multiple VXLAN self-service networks. After enabling high-availability, all additional routers use VRRP. The following procedure creates an additional self-service network and router. The Networking service also supports adding high-availability to existing routers. However, the procedure requires administratively disabling and enabling each router which temporarily interrupts network connectivity for self-service networks with interfaces on that router.
id: Serupa dengan contoh pengerahan self-service, konfigurasi ini mendukung beberapa VXLAN jaringan self-service. Setelah mengaktifkan high-availability, semua router tambahan menggunakan VRRP. Prosedur berikut membuat jaringan self-service tambahan dan router. Layanan Networking juga mendukung penambahan high-availability untuk router yang ada. Namun, prosedur ini secara administratif membutuhkan penonaktifkan dan pengaktifkan setiap router yang sementara mengganggu konektivitas jaringan untuk jaringan self-service dengan interface pada router itu.
tr_tr: Self-servis kurulum örneğine benzer şekilde, bu yapılandırma birden fazla VXLAN self-servis ağını desteklemektedir. Yüksek kullanılabilirlik sağlandıktan sonra, tüm ek yönlendiriciler VRRP'yi kullanıyor. Aşağıdaki prosedür, ilave bir self-servis ağı ve yönlendirici oluşturur. Ağ hizmeti, mevcut yönlendiricilere yüksek kullanılabilirlik eklemeyi de destekliyor. Bununla birlikte, bu yordam, idari olarak devre dışı bırakmayı ve bu yönlendiricideki arabirimlerle self servis ağlar için ağ bağlantısını geçici olarak kesen her yönlendiriciyi etkinleştirmeyi gerektirir.

source: Similar to the self-service deployment example, this configuration supports multiple VXLAN self-service networks. After enabling high-availability, all additional routers use distributed routing. The following procedure creates an additional self-service network and router. The Networking service also supports adding distributed routing to existing routers.
id: Serupa dengan contoh pengerahan self-service, konfigurasi ini mendukung beberapa jaringan self-service VXLAN. Setelah mengaktifkan ketersediaan tinggi, semua router tambahan menggunakan routing terdistribusikan. Prosedur berikut membuat jaringan self-service tambahan dan router. Layanan Networking juga mendukung penambahan routing terdistribusikan untuk router yang ada.
tr_tr: Self-servis kurulum örneğine benzer şekilde, bu yapılandırma birden fazla VXLAN self-servis ağını desteklemektedir. Yüksek kullanılabilirlik sağlandıktan sonra, tüm ek yönlendiriciler dağıtılmış yönlendirme kullanır. Aşağıdaki prosedür, ilave bir self-servis ağı ve yönlendirici oluşturur. Ağ hizmeti, mevcut yönlendiricilere dağıtılmış yönlendirme eklemeyi de destekler.

source: Similarly, when the ``l3_ha = True`` flag is configured, routers created by all users default to HA.
id: Demikian pula, ketika flag ``l3_ha = True`` dikonfigurasi, router yang dibuat oleh semua pengguna menjadi default untuk HA.
tr_tr: Benzer şekilde, ``l3_ha = True`` bayrağı yapılandırıldığında, tüm kullanıcılar tarafından oluşturulan yönlendiriciler varsayılan olarak HA'ya gelir.

source: Since Liberty, Networking maintains two parallel Alembic migration branches.
id: Sejak Liberty, Networking mempertahankan dua cabang migrasi Alembic yang paralel.
tr_tr: Liberty'den bu yana, Ağ iki paralel Alembic göç dalını tutar.

source: Single large layer-2 network
id: Jaringan lapisan-2 besar tunggal.
tr_tr: Tek büyük katman-2 ağı

source: Single large layer-2 networks become complex at scale and involve significant failure domains.
id: Jaringan lapisan-2 besar tunggal menjadi kompleks pada skala dan melibatkan failure domain yang signifikan.
tr_tr: Tek büyük katman-2 ağları ölçekte karmaşık hale gelir ve önemli başarısızlık alanlarını içerir.

source: Single stack IPv6 project networking
id: Satu tumpukan (stack) jaringan proyek IPv6
tr_tr: Tek yığınlı IPv6 proje ağı

source: Some underlying physical network architectures contain a unique layer-2 network for overlay networks using protocols such as VXLAN and GRE.
id: Beberapa arsitektur jaringan fisik yang mendasarinya memuat jaringan lapisan-2 yang unik untuk jaringan overlay menggunakan protokol seperti VXLAN dan GRE.
tr_tr: Bazı temel fiziksel ağ mimarileri, VXLAN ve GRE gibi protokolleri kullanan yer paylaşımlı ağlar için eşsiz bir katman-2 ağı içerir.

source: Some underlying physical network architectures contain multiple layer-2 networks with different MTU values. You can configure each flat or VLAN provider network in the bridge or interface mapping options of the layer-2 agent to reference a unique MTU value.
id: Beberapa arsitektur jaringan fisik yang mendasari berisi beberapa jaringan lapisan-2 dengan nilai-nilai MTU yang berbeda. Anda dapat mengkonfigurasi setiap jaringan penyedia VLAN atau datar di jembatan atau opsi pemetaan antarmuka dari agen lapisan-2 untuk referensi nilai MTU yang unik.
tr_tr: Bazı temel fiziksel ağ mimarileri, farklı MTU değerleri olan çok katmanlı-2 ağları içerir. Katman-2 aracısının köprü veya arabirim eşleme seçeneklerinde, her bir flat veya VLAN sağlayıcısı ağını, benzersiz bir MTU değerine başvurmak üzere yapılandırabilirsiniz.

source: Sometimes we want to refer to a subnet, but not any particular IP address on the subnet. A common convention is to set the host identifier to all zeros to make reference to a subnet. For example, if a host's IP address is ``10.10.53.24/16``, then we would say the subnet is ``10.10.0.0/16``.
id: Kadang-kadang kita ingin merujuk ke subnet, tapi tidak ada alamat IP tertentu pada subnet. Sebuah konvensi umum adalah untuk mengatur host identifier ke semua nol untuk membuat referensi ke subnet. Misalnya, jika alamat IP host adalah ``10.10.53.24/16``, maka kita akan mengatakan subnet adalah ``10.10.0.0/16``.
tr_tr: Bazen bir alt ağa başvurmak istiyoruz, ancak alt ağdaki belirli bir IP adresine değil. Ortak bir kural, bir alt ağa başvurmak için ana bilgisayar tanımlayıcısını sıfırlar olarak ayarlamaktır. Örneğin, bir hostun IP adresi ``10.10.53.24/16`` ise, alt ağın ``10.10.0.0/16`` olduğunu söyleyebiliriz.

source: Source a regular (non-administrative) project credentials.
id: Dapatkan sumber kredensial proyek (non-administratif) biasa.
tr_tr: Normal (idari olmayan) bir proje kimlik bilgisi kaynağı.

source: Source the administrative project credentials and list the enabled extensions.
id: Dapatkan sumber kredensial proyek administrasi dan daftar ekstensi yang diaktifkan.
tr_tr: Yönetimsel proje kimlik bilgilerini yazın ve etkin uzantıları listeleyin.

source: Source the administrative project credentials.
id: Dapatkan sumber kredensial proyek administrasi.
tr_tr: Yönetimsel proje kimlik bilgilerini kaynak olarak verin.

source: Source the credentials of the project that owns the ``net1`` network.
id: Sumber kepercayaan dari proyek yang memiliki jaringan ``net1``.
tr_tr: ``net1`` ağına sahip olan projenin kimlik bilgilerini yazın.

source: Source the necessary project credentials. The administrative project can delete resources for all other projects. A regular project can delete its own network resources and those belonging to other projects for which it has sufficient access.
id: Dapatkan sumber kredensial proyek yang diperlukan. Proyek administrasi dapat menghapus sumber daya untuk semua proyek lainnya. Sebuah proyek yang teratur dapat menghapus sumber daya jaringan sendiri dan sumber daya yang termasuk proyek lain yang memiliki akses yang memadai.
tr_tr: Gerekli proje kimlik bilgilerini tedarik edin. Yönetici proje tüm diğer projeler için kaynakları silebilir. Normal bir proje, kendi ağ kaynaklarını ve uygun erişimlere sahip olduğu diğer projeye ait şeyleri silebilir.

source: Specialized
tr_tr: Özelleştirilmiş

source: Start DHCP agent on HostB. The VM gets the wanted IP again.
id: Mulailah agen DHCP pada HostB. VM mendapatkan yang diinginkan IP lagi.
tr_tr: HostB üzerinde DHCP ajanını başlat. VM istenilen IP'yi tekrar alır.
