Repository: 25hours/openstack-manuals
Catalog: doc/networking-guide/source/locale/*/LC_MESSAGES/networking-guide.po
Languages: id, tr_tr

source: The health of your ``keepalived`` instances can be automatically monitored via a bash script that verifies connectivity to all available and configured gateway addresses. In the event that connectivity is lost, the master router is rescheduled to another node.
id: Kesehatan instance ``keepalived`` Anda dapat secara otomatis dipantau melalui skrip bash yang memverifikasi konektivitas ke semua alamat gerbang yang dikonfigurasi dan tersedia. Dalam hal konektivitas yang hilang, master router dijadwal ulang ke node lain.
tr_tr: ``keepalived`` sunucunuzun durumu, kullanılabilir ve yapılandırılmış tüm ağ geçidi adreslerine olan bağlantıyı doğrulayan bir bash komut dosyası aracılığıyla otomatik olarak izlenebilir. Bağlanabilirlik kaybolduğunda, ana yönlendirici başka bir düğüme yeniden düzenlenir.

source: The host containing the BGP agent must have layer-3 connectivity to the provider router.
id: Host yang berisi agen BGP harus memiliki konektivitas lapisan-3 dengan router provider.
tr_tr: BGP ajanı içeren sunucu sağlayıcı yönlendiriciye katman-3 bağlanabilirliğine sahip olmak zorundadır.

source: The instance 1 interface (1) forwards the packet to the provider bridge instance port (2) via ``veth`` pair.
id: Instance 1 interface (1) meneruskan paket ke provider bridge instance port (2) melalui pasangan ``veth``.
tr_tr: Sunucu 1 arabirimi (1) paketi sağlayıcı köprü sunucu bağlantı noktasına (2) ``veth`` çifti ile yönlendirir.

source: The instance 1 interface (1) forwards the packet to the security group bridge instance port (2) via ``veth`` pair.
id: Instance 1 interface (1) meneruskan paket ke security group bridge instance port (2) melalui pasangan ``veth``.
tr_tr: Sunucu 1 arabirimi (1) paketi ``veth`` çifti aracılığıyla güvenlik grubu köprü sunucu bağlantı noktasına iletir.

source: The instance 1 interface (1) forwards the packet to the self-service bridge instance port (2) via ``veth`` pair.
id: The instance 1 interface (1) meneruskan paket untuk self-service bridge instance port (2) melalui pasangan ``veth``.
tr_tr: Sunucu 1 arabirimi (1) paketi ``veth`` çifti aracılığıyla self servis köprü sunucu bağlantı noktasına (2) iletir.

source: The instance interface (1) forwards the packet to the provider bridge instance port (2) via ``veth`` pair.
id: Antarmuka instance (1) meneruskan paket ke provider bridge instance port (2) melalui pasangan ``veth``.
tr_tr: Sunucu arabirimi (1) paketi sağlayıcı köprü sunucu bağlantı noktasına (2) ``veth`` çifti aracılığıyla yönlendirir.

source: The instance interface (1) forwards the packet to the security group bridge instance port (2) via ``veth`` pair.
id: Instance interface (1) meneruskan paket ke security group bridge instance port (2) melalui pasangan ``veth``.
tr_tr: Sunucu arabirimi (1) paketi ``veth`` çifti aracılığıyla güvenlik grubu köprüsü sunucu portuna (2) iletir.

source: The instance interface (1) forwards the packet to the self-service bridge instance port (2) via ``veth`` pair.
id: Instance interface (1)) meneruskan paket ke self-service bridge instance port (2) melalui pasangan ``veth``.
tr_tr: Sunucu arabirimi (1) paketi ``veth`` çifti aracılığıyla self servis köprü sunucu bağlantı noktasına (2) iletir.

source: The instance of a router on each compute node consumes an IPv4 address on the provider network on which it contains a gateway.
id: Instance router pada setiap node komputasi mengkonsumsi alamat IPv4 pada jaringan provider yang mengandung gateway.
tr_tr: Her hesaplama düğümünde bir yönlendiricinin örneği, ağ geçidi içeren sağlayıcı ağında bir IPv4 adresi tüketir.

source: The instance resides on compute node 1 and uses provider network 1.
id: Instance berada pada komputasi node 1 dan menggunakan jaringan provider 1.
tr_tr: Sunucu, hesaplama düğümü 1'de bulunur ve sağlayıcı ağı 1'i kullanır.

source: The instance resides on compute node 1 and uses self-service network 1.
id: Instance berada pada menghitung node 1 dan menggunakan jaringan self-service 1.
tr_tr: Sunucu, hesaplama düğümü 1'de bulunur ve self-servis ağı 1'i kullanır.

source: The instance sends a packet to a host on the Internet.
id: Instance mengirimkan sebuah paket ke host di Internet.
tr_tr: Sunucu ana bilgisayara internet üzerinden bir paket gönderir.

source: The intent of separate branches is to allow invoking those safe migrations from the expand branch while the Neutron server is running and therefore reducing downtime needed to upgrade the service.
id: Maksud dari cabang terpisah adalah untuk memungkinkan permohonan migrasi mereka yang aman dari perluasan cabang ketika server Neutron berjalan dan karena itu mengurangi downtime yang dibutuhkan untuk meng-upgrade layanan.
tr_tr: Ayrı dalların amacı, Neutron sunucusu çalışırken genişletme dalından bu güvenli geçişlerin başlatılmasına ve dolayısıyla hizmeti yükseltmek için gereken kesintilerin azaltılmasına izin vermektir.

source: The internal DNS functionality offered by the Networking service and its interaction with the Compute service.
id: Fungsi DNS internal yang ditawarkan oleh layanan Networking dan interaksinya dengan layanan Compute.
tr_tr: Ağ hizmeti tarafından sunulan dahili DNS işlevselliği ve Hesaplama hizmeti ile olan etkileşimi.

source: The list of supported rule types reported by core plug-in is not enforced when accessing QoS rule resources. This is mostly because then we would not be able to create any rules while at least one ml2 driver lacks support for QoS (at the moment of writing, only macvtap is such a driver).
id: Daftar tipe aturan yang didukung yang dilansir core plug-in tidak diberlakukan ketika mengakses sumber aturan QoS. Hal ini terutama karena ketika kita tidak mampu membuat aturan apapun sementara setidaknya satu sopir ml2 tidak memiliki dukungan untuk QoS (pada saat penulisan, hanya macvtap menjadi driver tersebut).
tr_tr: Çekirdek eklenti tarafından bildirilen desteklenen kural türleri listesi, QoS kural kaynaklarına erişirken zorunlu kılınmaz. Bunun sebebi genellikle, QoS (yazma anında, adece macvtap böyle bir sürücüdür) için en az bir ml2 sürücü desteği yokken herhangi bir kural oluşturamayız.

source: The load balancer now handles traffic on ports 80 and 443.
id: Penyeimbang beban sekarang menangani lalu lintas pada port 80 dan 443.
tr_tr: Yük dengeleyici artık 80 ve 443 numaralı bağlantı noktalarında trafik işlemektedir.

source: The load balancer occupies a neutron network port and has an IP address assigned from a subnet.
id: Penyeimbang beban menempati port jaringan neutron dan memiliki alamat IP yang ditetapkan dari subnet.
tr_tr: Yük dengeleyici bir neutron ağ bağlantı noktasını kaplar ve bir alt ağdan atanmış bir IP adresine sahiptir.

source: The master router may reside on network node 2.
id: Router utama mungkin berada pada network node 2.
tr_tr: Ana yönlendirici, ağ düğümü 2'de bulunabilir.

source: The mechanism driver is responsible for taking the information established by the type driver and ensuring that it is properly applied given the specific networking mechanisms that have been enabled.
id: Driver mekanisme bertanggung jawab untuk mengambil informasi yang ditetapkan oleh driver tipe dan memastikan bahwa itu benar diterapkan mengingat mekanisme jaringan tertentu yang telah diaktifkan.
tr_tr: Mekanizma sürücüsü, tür sürücüsü tarafından kurulan bilgileri alarak ve etkinleştirilen belirli ağ mekanizmaları göz önüne alındığında sürücünün doğru şekilde uygulanmasını sağlamakla sorumludur.

source: The migration may be paused, even for an extended period of time (for example, while testing or investigating issues) with some hypervisors on legacy networking and some on Networking, and Compute API remains fully functional. Individual hypervisors may be rolled back to legacy networking during this stage of the migration, although this requires an additional restart.
id: Migrasi dapat berhenti, bahkan untuk jangka waktu (misalnya, saat uji coba atau menyelidiki masalah) dengan beberapa hypervisors pada jaringan legacy dan beberapa di layanan Networking, dan Compute API tetap berfungsi secara penuh. Hypervisors individu dapat digulung kembali (rolled back) ke jaringan legacy selama tahap ini migrasi, meskipun ini membutuhkan restart tambahan.
tr_tr: Taşıma, eski ağda bazı hypervisor'larla, hatta bazıları Ağ'da ve hesaplama API'sı tamamen işlevsel kalırken, uzun bir süre boyunca bile (örneğin, sorunları test ederken veya araştırırken) duraklatılabilir. Ayrı hipervizörler, göçün bu aşamasında eski ağlara geri döndürülebilir, ancak bu, ek bir yeniden başlatmayı gerektirir.

source: The migration process from the legacy nova-network networking service to OpenStack Networking (neutron) has some limitations and impacts on the operational state of the cloud. It is critical to understand them in order to decide whether or not this process is acceptable for your cloud and all users.
id: Proses migrasi dari layanan jaringan nova-network legacy ke OpenStack Networking (neutron) memiliki beberapa keterbatasan dan dampak pada keadaan operasional cloud. Hal ini penting untuk memahami mereka untuk memutuskan apakah proses ini dapat diterima atau tidak bagi cloud dan semua pengguna.
tr_tr: Eski nova-network ağ servisinden OpenStack Ağa (neutron) geçiş işlemi bulutun operasyonel durumu üzerinde bazı kısıtlamalar ve etkilere sahiptir. Bu işlemin bulutunuz ve tüm kullanıcılar için kabul edilebilir olup olmadığına karar vermek için bunları anlamak önemlidir.

source: The migration process is quite simple, it involves turning down the router by setting the router's ``admin_state_up`` attribute to ``False``, upgrading the router to L3 HA and then setting the router's ``admin_state_up`` attribute back to ``True``.
id: Proses migrasi cukup sederhana, proses melibatkan menolak router dengan menetapkan attribut router ``admin_state_up`` ke ``False``, upgrade router ke L3 HA dan kemudian menetapkan attribut router ``admin_state_up`` kembali ke ``True``.
tr_tr: Geçiş süreci oldukça basittir; yönlendiricinin ``admin_state_up`` özniteliğini ``False`` olarak ayarlayarak, yönlendiriciyi L3 HA'ya yükselterek ve ardından yönlendiricinin ``admin_state_up`` özniteliğini ``True`` olarak ayarlayarak yönlendiriciyi durdurmayı içerir.

source: The most common application programming interface (API) for writing TCP-based applications is called *Berkeley sockets*, also known as *BSD sockets* or, simply, *sockets*. The sockets API exposes a *stream oriented* interface for writing TCP applications. From the perspective of a programmer, sending data over a TCP connection is similar to writing a stream of bytes to a file. It is the responsibility of the operating system's TCP/IP implementation to break up the stream of data into IP packets. The operating system is also responsible for automatically retransmitting dropped packets, and for handling flow control to ensure that transmitted data does not overrun the sender's data buffers, receiver's data buffers, and network capacity. Finally, the operating system is responsible for re-assembling the packets in the correct order into a stream of data on the receiver's side. Because TCP detects and retransmits lost packets, it is said to be a *reliable* protocol.
id: Application programming interface (API) yang paling umum untuk menulis aplikasi berbasis TCP disebut *Berkeley soket *, juga dikenal sebagai *BSD soket * atau, sederhananya, *soket *. Soket API mengekspos antarmuka *stream oriented* untuk menulis aplikasi TCP. Dari perspektif programmer, pengiriman data melalui koneksi TCP mirip dengan menulis aliran byte ke file. Ini adalah tanggung jawab penerapan TCP/IP di sistem operasi untuk memecah aliran data ke dalam paket IP. Sistem operasi ini juga bertanggung jawab untuk secara otomatis mentransmisi kembali paket terjatuh, dan untuk menangani kontrol aliran untuk memastikan bahwa data yang dikirimkan tidak dibanjiri buffer data pengirim, buffer data penerima, dan kapasitas jaringan. Akhirnya, sistem operasi bertanggung jawab untuk kembali merakit paket dalam urutan yang benar ke dalam aliran data di sisi penerima. Karena TCP mendeteksi dan mentransmisikan kembali paket yang hilang, maka dikatakan protokol *reliable*.
tr_tr: TCP tabanlı uygulamaları yazmak için kullanılan en yaygın uygulama programlama arabirimine *BSD yuvaları* veya basitçe *yuvalar* olarak da bilinen *Berkeley yuvaları* denir. Yuva API'leri, TCP uygulamaları yazmak için *akış yönelimli* bir arayüz sunar. Bir programcı perspektifinden, bir TCP bağlantısı üzerinden veri göndermek, bir dosyaya bayt akışı yazmakla benzerdir. Verilerin akışını IP paketlerine bölmek işletim sisteminin TCP/IP uygulamasının sorumluluğundadır. Işletim sistemi, düşen paketleri otomatik olarak yeniden iletmekten ve iletilen verilerin gönderenin veri arabelleklerini, alıcının veri arabelleklerini ve ağ kapasitesini aşmamasını sağlamak için akış denetimini yapmaktan sorumludur. Son olarak, işletim sistemi, paketlerin doğru sırayla alıcı tarafında bir veri akışı içine yeniden birleştirilmesinden sorumludur. TCP, kayıp paketleri algılar ve tekrar gönderdiğinden, bir *güvenilir* protokol olduğu söylenir.

source: The name assigned to the port by the Networking service internal DNS is now visible in the response in the ``dns_assignment`` attribute.
id: Nama yang ditugaskan ke port oleh layanan Jaringan DNS internal sekarang terlihat dalam respon dalam atribut ``dns_assignment``.
tr_tr: Ağ hizmetiyle ilgili dahili DNS tarafından bağlantı noktasına atanan ad, şimdi yanıtta ``dns_assignment`` özniteliğinde görülebilir.

source: The name given to the instance by the user, ``my_vm``, is sanitized by the Compute service and becomes ``my-vm`` as the port's ``dns_name``.
id: Nama yang diberikan untuk instance oleh pengguna, ``my_vm``, disterilkan oleh layanan Compute dan menjadi ``my-vm`` sebagai `` dns_name`` port.
tr_tr: Kullanıcı tarafından sunucuya verilen ``my_vm`` ismi Hesaplama servisi tarafından ayıklanmış ve bağlantı noktasının ``dns_name``i olarak ``my-vm`` haline gelir.

source: The namespace for router 1 from :ref:`deploy-lb-selfservice` should only appear on network node 1 because of creation prior to enabling VRRP.
id: Namespace untuk router 1 dari :ref:`deploy-lb-selfservice` seharusnya hanya muncul di jaringan node 1 karena penciptaan sebelum mengaktifkan VRRP.
tr_tr: Yönlendirici 1 için :ref:`deploy-lb-selfservice` ad alanı, yalnızca VRRP'yi etkinleştirmeden önce oluşturma nedeniyle ağ düğümü 1'de görünmelidir.

source: The namespace for router 1 from :ref:`deploy-ovs-selfservice` should also appear on network node 1 because of creation prior to enabling distributed routing.
id: Namespace untuk router 1 dari :ref:`deploy-ovs-selfservice` juga harus muncul di jaringan node 1 karena penciptaan sebelum mengaktifkan routing terdistribusikan.
tr_tr: :ref:`deploy-ovs-selfservice`den yönlendirici 1 için ad alanı, ağın düğümü 1'de, dağıtımlı yönlendirmeyi etkinleştirmeden önce oluşturulması nedeniyle görünmelidir.

source: The native OVS firewall implementation requires kernel and user space support for *conntrack*, thus requiring minimum versions of the Linux kernel and Open vSwitch. All cases require Open vSwitch version 2.5 or newer.
id: Implementasi firewall OVS asli memerlukan kernel dan dukungan ruang pengguna untuk *conntrack *, sehingga membutuhkan versi minimum dari kernel Linux dan Open vSwitch. Semua case memerlukan Open vSwitch versi 2.5 atau yang lebih baru.
tr_tr: Yerel OVS güvenlik duvarı uygulaması, *conntrack* için çekirdek ve kullanıcı alanı desteği gerektirir, bu nedenle Linux çekirdeğinin ve Open vSwitch'in minimum sürümlerini gerektirir. Tüm durumlar Open vSwitch 2.5 veya daha yeni sürümü gerektirir.

source: The network address ranges in the examples of this guide should not be used for any purpose other than documentation.
id: Rentang alamat jaringan dalam contoh panduan ini tidak boleh digunakan untuk tujuan apapun selain dokumentasi.
tr_tr: Bu kılavuzdaki örneklerdeki ağ adres aralıkları, belgeler dışındaki herhangi bir amaç için kullanılmamalıdır.

source: The network address ranges used in this guide are chosen in accordance with `RFC 5737 <https://tools.ietf.org/rfc/rfc5737>`_ and `RFC 3849 <https://tools.ietf.org/html/rfc3849>`_, and as such are restricted to the following:
id: Rentang alamat jaringan yang digunakan dalam panduan ini dipilih sesuai dengan `RFC 5737 <https://tools.ietf.org/rfc/rfc5737>`_ dan `RFC 3849 <https://tools.ietf.org/html/rfc3849>`_, dan dengan demikian dibatasi sebagai berikut:
tr_tr: Bu kılavuzda kullanılan ağ adresi aralıkları `RFC 5737 <https://tools.ietf.org/rfc/rfc5737>`_ ve `RFC 3849 <https://tools.ietf.org/html/rfc3849>`_e uygun olarak seçilir ve dolayısıyla aşağıdakilerle sınırlıdır:

source: The network cannot have attribute ``router:external`` set to ``True``.
id: Jaringan tidak dapat memiliki atribut ``router:external`` atur ke ``True``.
tr_tr: Ağ, ``router:external`` özniteliğini ``True`` olarak ayarlayabilir.

source: The network presented by the subport is the network of the associated port. When creating a subport, a ``segmentation-id`` may be required by the driver. ``segmentation-id`` defines the segmentation ID on which the subport network is presented to the instance. ``segmentation-type`` may be required by certain drivers like OVS, although at this time only ``vlan`` is supported as a ``segmentation-type``.
id: Jaringan disajikan oleh subport adalah jaringan dari port yang terkait. Ketika membuat subport, satu `` segmentasi-id`` mungkin diperlukan oleh driver. ``segmentasi-id`` mendefinisikan ID segmentasi dimana jaringan subport disajikan untuk instance. ``segmentasi-type`` mungkin diperlukan oleh driver tertentu seperti OVS, meskipun saat ini hanya ``vlan`` didukung sebagai ``segmentasi-type``.
tr_tr: Subport tarafından sunulan ağ, bağlantı noktası olan ağdır. Subport oluştururken, sürücü tarafından bir ``segmentation-id`` gerekebilir. ``segmentation-id``, subport ağının sunucuya sunulduğu segmentasyon kimliğini tanımlar. ``segmentation-type``, OVS gibi bazı sürücüler tarafından zorunlu kılınabilir, buna rağmen şu an sadece ``vlan`` ``segmentation-type`` olarak desteklenmektedir.

source: The network trunk service allows multiple networks to be connected to an instance using a single virtual NIC (vNIC). Multiple networks can be presented to an instance by connecting it to a single port.
id: Layanan trunk jaringan mengizinkan beberapa jaringan untuk terhubung ke sebuah instance menggunakan NIC virtual tunggal (vNIC). Beberapa jaringan dapat disajikan ke sebuah instance dengan menghubungkannya ke port tunggal.
tr_tr: Ağ bilgi aktarım servisi, birden fazla ağın bir sunucuya tek bir sanal NIC (vNIC) kullanarak bağlanmasını sağlar. Bir sunucuya tek bir bağlantı noktasına bağlanarak birden çok ağ gösterilebilir.

source: The network type can be FLAT, VLAN, GRE, VXLAN or GENEVE.
id: Tipe jaringan dapat FLAT, VLAN, GRE, VXLAN atau GENEVE.
tr_tr: Ağ türü FLAT, VLAN, GRE, VXLAN veya GENEVE olabilir.

source: The newer FWaaS implementation, v2, provides a much more granular service. The notion of a firewall has been replaced with firewall group to indicate that a firewall consists of two policies: an ingress policy and an egress policy. A firewall group is applied not at the router level (all ports on a router) but at the port level. Currently, router ports can be specified. For Ocata, VM ports can also be specified.
id: Penerapan FWaaS yang lebih baru, v2, menyediakan layanan yang jauh lebih rinci. Gagasan firewall telah diganti dengan kelompok firewall untuk menunjukkan bahwa firewall terdiri dari dua kebijakan: kebijakan masuknya (ingress) dan kebijakan egress. Sekelompok firewall diterapkan tidak pada tingkat router (semua port pada router) tetapi di tingkat port. Saat ini, port router dapat ditentukan. Untuk Ocata, port VM juga dapat ditentukan.
tr_tr: En yeni FWaaS uygulaması olan v2, çok daha ayrıntılı bir hizmet sunmaktadır. Bir güvenlik duvarı kavramı bir güvenlik duvarının iki ilkeden oluştuğunu belirtmek için güvenlik duvarı grubuyla değiştirildi: bir girme politikası ve bir çıkış politikası. Bir güvenlik duvarı grubu, yönlendirici seviyesinde (bir yönlendiricideki tüm bağlantı noktaları değil), ancak bağlantı noktası düzeyinde uygulanır. Şu anda, yönlendirici bağlantı noktaları belirtilebilir. Ocata için VM bağlantı noktaları da belirtilebilir.

source: The operating system of the TCP client application automatically assigns a port number to the client. The client owns this port number until the TCP connection is terminated, after which the operating system reclaims the port number. These types of ports are referred to as *ephemeral ports*.
id: Sistem operasi dari aplikasi klien TCP secara otomatis memberikan nomor port untuk klien. Klien memiliki nomor port ini sampai koneksi TCP dihentikan, setelah sistem operasi mengambil kembali nomor port. Jenis port disebut sebagai *ephemeral ports*.
tr_tr: TCP istemci uygulamanın işletim sistemi, istemciye otomatik olarak bir bağlantı noktası numarası atar. İstemci, bu bağlantı noktası numarasını, TCP bağlantısı sonlandırılıncaya kadar sahip olur; ardından işletim sistemi bağlantı noktası numarasını geri ister. Bu tür portlara *geçici bağlantı noktaları* denir.

source: The optional DHCP service manages IP addresses for instances on provider and self-service networks. The Networking service implements the DHCP service using an agent that manages ``qdhcp`` namespaces and the ``dnsmasq`` service.
id: Layanan DHCP opsional mengelola alamat IP untuk instance pada jaringan provider dan self-service. Layanan Networking mengimplementasikan layanan DHCP dengan menggunakan agen yang mengelola namespaces ``qdhcp`` dan layanan ``dnsmasq``.
tr_tr: İsteğe bağlı DHCP hizmeti, sağlayıcı ve self-servis ağlarındaki sunucuların IP adreslerini yönetir. Ağ hizmeti, ``qdhcp`` ad alanlarını ve ``dnsmasq`` hizmetini yöneten bir aracı kullanarak DHCP hizmetini uygular.

source: The optional metadata service provides an API for instances to obtain metadata such as SSH keys.
id: Layanan metadata opsional menyediakan API instance untuk mendapatkan metadata seperti kunci SSH.
tr_tr: İsteğe bağlı metadata hizmeti, sunucuların SSH tuşları gibi üst verileri elde etmesini sağlayan bir API sağlar.

source: The options used in the configuration file above are:
id: Opsi yang digunakan dalam file konfigurasi di atas adalah:
tr_tr: Yukarıdaki yapılandırma dosyasında kullanılan seçenekler şunlardır:

source: The original FWaaS implementation, v1, provides protection for routers. When a firewall is applied to a router, all internal ports are protected.
id: Pelaksanaan FWaaS original, v1, memberikan perlindungan untuk router. Ketika firewall diterapkan untuk router, semua port internal dilindungi.
tr_tr: Orijinal FWaaS uygulaması, v1, yönlendiriciler için koruma sağlar. Yönlendiriciye bir güvenlik duvarı uygulandığında, tüm dahili portlar korunur.

source: The output of the :command:`route -n` and :command:`netstat -rn` commands are formatted in a slightly different way. This example shows how the same routes would be formatted using these commands:
id: Output dari perintah :command:`route -n` and :command:`netstat -rn` diformat dengan cara yang sedikit berbeda. Contoh ini menunjukkan bagaimana rute yang sama akan diformat menggunakan perintah ini:
tr_tr: :command:`route -n` ve :command:`netstat -rn` komutlarının çıktısı bir miktar farklı biçimlendirilmiştir. Bu örnek, aynı yönlendiricilerin bu komut kullanılarak nasıl biçimlendirileceğını gösterir.

source: The output shows ``bridge-mapping`` and the number of virtual network devices on this L2 agent.
id: Output menunjukkan ``bridge-mapping`` dan jumlah perangkat jaringan virtual pada agen L2 ini.
tr_tr: Çıktı ``bridge-mapping``'i ve bu L2 ajanı üzerindeki sanal ağ aygıtlarının sayısını gösterir.
