Repository: 25hours/openstack-manuals
Catalog: doc/networking-guide/source/locale/*/LC_MESSAGES/networking-guide.po
Languages: id, tr_tr

source: Network devices such as switches and routers can mark traffic so that it is handled with a higher priority to fulfill the QoS conditions agreed under the SLA. In other cases, certain network traffic such as Voice over IP (VoIP) and video streaming needs to be transmitted with minimal bandwidth constraints. On a system without network QoS management, all traffic will be transmitted in a "best-effort" manner making it impossible to guarantee service delivery to customers.
id: Perangkat jaringan seperti switch dan router bisa menandai lalu lintas sehingga hal itu ditangani dengan prioritas yang lebih tinggi untuk memenuhi persetujuan persyaratan QoS di bawah SLA. Dalam kasus lain, lalu lintas jaringan tertentu seperti Voice over IP (VoIP) dan video streaming perlu ditransmisikan dengan keterbatasan bandwidth minimal. Pada sistem tanpa manajemen QoS jaringan, semua lalu lintas akan ditransmisikan dalam cara "best-effort" membuat mustahil untuk menjamin pelayanan kepada pelanggan.
tr_tr: Anahtarlar ve yönlendiriciler gibi ağ cihazları, trafiği SLA kapsamında üzerinde anlaşmaya varılan QoS koşullarını yerine getirmek için daha yüksek önceliğe sahip olacak şekilde işaretleyebilir. Diğer durumlarda, IP üzerinden ses (VoIP) ve video akışı gibi belirli ağ trafiği, minimum bant genişliği kısıtlamaları ile iletilmelidir. Şebeke QoS yönetimi olmayan bir sistemde, tüm trafik, müşterilere sunulan hizmetlerin garanti edilmesini imkansız hale getiren "en iyi çaba (best-effort)" tarzında iletilecektir.

source: Network namespaces
id: Network namespaces (namespace jaringan)
tr_tr: Ağ ad alanları

source: Network node
id: Node jaringan
tr_tr: Ağ düğümü

source: Network node 1
tr_tr: Ağ düğümü 1

source: Network node 1:
tr_tr: Ağ düğümü 1:

source: Network node 2
tr_tr: Ağ düğümü 2

source: Network node 2:
tr_tr: Ağ düğümü 2:

source: Network nodes
id: Network nodes (simpul jaringan)
tr_tr: Ağ düğümleri

source: Network or compute nodes
id: Jaringan atau node komputasi
tr_tr: Ağ veya hesaplama düğümleri

source: Network scheduler
id: Alat penjadwal jaringan
tr_tr: Ağ zamanlayıcı

source: Network traffic flow
id: Arus lalu lintas jaringan
tr_tr: Ağ trafik akışı

source: Network trunking consists of a service plug-in and a set of drivers that manage trunks on different layer-2 mechanism drivers. Users can create a port, associate it with a trunk, and launch an instance on that port. Users can dynamically attach and detach additional networks without disrupting operation of the instance.
id: Jaringan trunking terdiri dari service plug-in dan satu set driver yang mengelola trunk di berbagai driver mekanisme lapisan-2. Pengguna dapat membuat sebuah port, mengasosiasikannya dengan trunk, dan meluncurkan sebuah instance pada port tersebut. Pengguna dinamis dapat menghubungkan dan melepaskan jaringan tambahan tanpa mengganggu pengoperasian instance.
tr_tr: Ağ geçidi, bir hizmet eklentisinden ve farklı katman-2 mekanizma sürücüleri üzerindeki bilgi aktarım yolunu yöneten bir dizi sürücüden oluşur. Kullanıcılar bir bağlantı noktası oluşturabilir, bir bağlantı noktasına bağlayabilir ve bu bağlantı noktasında bir örnek başlatabilir. Kullanıcılar, örneğin, işlemin kesintiye uğramadan ek ağları dinamik olarak ekleyebilir ve ayırabilir.

source: Network type drivers
id: Driver tipe jaringan
tr_tr: Ağ tür sürücüleri

source: Network: Contains the OpenStack Networking service layer-3 (routing) component. High availability options may include additional components.
id: Network: Berisi layanan OpenStack Networking komponen lapisan-3 (routing). Opsi ketersediaan tinggi (high availability) mungkin termasuk komponen tambahan.
tr_tr: Ağ: OpenStack Ağ hizmet katmanı-3 (yönlendirme) bileşenini içerir. Yüksek kullanılabilirlik seçenekleri ek bileşenler içerebilir.

source: Networking allows users to create multiple provider or project networks using VLAN IDs (802.1Q tagged) that correspond to VLANs present in the physical network. This allows instances to communicate with each other across the environment. They can also communicate with dedicated servers, firewalls, load balancers, and other networking infrastructure on the same layer 2 VLAN.
id: Jaringan mengizinkan pengguna untuk membuat beberapa provider atau proyek jaringan menggunakan ID VLAN (802.1Q tag) yang sesuai dengan VLAN yang ada dalam jaringan fisik. Hal ini mengizinkan instance untuk berkomunikasi satu sama lain di lingkungan. Mereka juga dapat berkomunikasi dengan dedicated server, firewall, load balancer, dan infrastruktur jaringan lain pada layer 2 VLAN yang sama.
tr_tr: Ağ, kullanıcıların fiziksel ağda bulunan VLAN'lara karşılık gelen VLAN Kimliğini (802.1Q etiketli) kullanarak birden fazla sağlayıcı veya proje ağını oluşturmalarına olanak tanır. Bu, sunucuların çevrede birbirleriyle iletişim kurmasını sağlar. Aynı katmanlı 2 VLAN'da adanmış sunucular, güvenlik duvarları, yük dengeleyici ve diğer ağ altyapısı ile de iletişim kurabilirler.

source: Networks
tr_tr: Ağlar

source: Networks and network interfaces
id: Jaringan dan antarmuka jaringan
tr_tr: Ağlar ve ağ arabirimleri

source: Networks created before the Mitaka release do not contain explicitly named address scopes, unless the network contains subnets from a subnet pool that belongs to a created or updated address scope. The Networking service preserves backwards compatibility with pre-Mitaka networks through special address scope properties so that these networks can perform advanced routing:
id: Jaringan yang dibuat sebelum rilis Mitaka tidak mengandung secara eksplisit lingkup address bernama, kecuali jaringan berisi subnet dari kolam subnet milik lingkup alamat yang dibuat atau diperbarui. Layanan Networking mempertahankan kompatibilitas mundur dengan jaringan pra-Mitaka melalui sifat lingkup alamat khusus sehingga jaringan ini bisa melakukan routing canggih:
tr_tr: Ağ, oluşturulan veya güncellenmiş bir adres alanına ait bir alt ağ havuzundan alt ağlar içeriyorsa Mitaka sürümünden önce oluşturulan ağlar açıkça adlandırılmış adres alanları içermez. Ağ hizmeti, özel adres alanı özellikleri aracılığıyla Mitaka öncesi ağlarla geriye dönük uyumluluğu korur, böylece bu ağlar gelişmiş yönlendirme yapabilir:

source: Neutron Server
tr_tr: Neutron Sunucu

source: Neutron configuration file ``/etc/neutron/neutron.conf``:
id: file konfigurasi Neutron ``/etc/neutron/neutron.conf``:
tr_tr: Neutron yapılandırma dosyası ``/etc/neutron/neutron.conf``:

source: Neutron project networks that are assigned Global Unicast Address (GUA) prefixes and addresses don’t require NAT on the neutron router external gateway port to access the outside world. As a consequence of the lack of NAT the external router port doesn’t require a GUA to send and receive to the external networks. This implies a GUA IPv6 subnet prefix is not necessarily needed for the neutron external network. By default, a IPv6 LLA associated with the external gateway port can be used for routing purposes. To handle this scenario, the implementation of router-gateway-set API in neutron has been modified so that an IPv6 subnet is not required for the external network that is associated with the neutron router. The LLA address of the upstream router can be learned in two ways.
id: Jaringan proyek neutron yang ditugaskan di alamat dan prefiks Global Unicast Address (GUA) tidak memerlukan NAT pada gateway port eksternal router neutron untuk mengakses dunia luar. Sebagai konsekuensi dari kurangnya NAT port router eksternal tidak memerlukan GUA untuk mengirim dan menerima dengan jaringan eksternal. Ini berarti subnet prefix GUA IPv6 tidak selalu diperlukan untuk jaringan eksternal neutron. Secara default, LLA IPv6 terkait dengan port eksternal gateway dapat digunakan untuk tujuan routing. Untuk menangani skenario ini, pelaksanaan router-gateway-set API di neutron telah dimodifikasi sehingga suatu subnet IPv6 tidak diperlukan untuk jaringan eksternal yang berhubungan dengan router neutron. Alamat LLA dari router hulu dapat dipelajari dalam dua cara.
tr_tr: Global Tek Noktaya Yayın Adresi (GUA) önekleri ve adresleri atanan Neutron proje ağları, dış dünyaya erişmek için Neutron yönlendiricinin dış ağ geçidi bağlantı noktasında NAT gerektirmez. NAT eksikliğinden dolayı harici yönlendirici bağlantı noktası, bir dış bağlantılar ağına (GUA) göndermek ve almak için dış ağlara ihtiyaç duymaz. Bu, bir GUA IPv6 alt ağ önekinin, Neutron harici ağ için mutlaka gerekli olmadığı anlamına gelir. Varsayılan olarak, yönlendirme amacıyla harici ağ geçidi bağlantı noktasına bağlı bir IPv6 LLA kullanılabilir. Bu senaryoyu ele almak için, Neutron'da router-gateway-set API'nin uygulanması, neutron yönlendiriciyle ilişkili harici ağ için bir IPv6 alt ağının gerekli olmadığı şekilde değiştirildi. Upstream yönlendiricinin LLA adresi iki şekilde öğrenilebilir.

source: Neutron routers, by default, will NAT traffic from internal networks to external networks.
id: Router neutron, secara default, akan men-NAT (Network Address Translation) lalu lintas dari jaringan internal untuk jaringan eksternal.
tr_tr: Neutron yönlendiricileri, varsayılan olarak, iç ağlardan harici ağlara NAT trafiğini yönetecektir.

source: Neutron subnets and the IPv6 API attributes
id: Subnet neutron dan atribut API IPv6
tr_tr: Neutron alt ağları ve IPv6 API öznitelikleri

source: Neutron's Distributed Router feature and IPv6
id: Fitur Router Terdistribusi milik Neutron dan IPv6
tr_tr: Neutron'un Dağıtılmış Yönlendirici özelliği ve IPv6

source: New or existing neutron networks that contain a SLAAC enabled IPv6 subnet will result in all neutron ports attached to the network receiving IPv6 addresses. This is because when RA broadcast messages are sent out on a neutron network, they are received by all IPv6 capable ports on the network, and each port will then configure an IPv6 address based on the information contained in the RA packet. In some cases, an IPv6 SLAAC address will be added to a port, in addition to other IPv4 and IPv6 addresses that the port already has been assigned.
tr_tr: SLAAC etkin IPv6 alt ağını içeren yeni veya mevcut neutron ağları, IPv6 adresleri alan ağa bağlı tüm neutron bağlantı noktaları ortaya çıkmasına neden olur. Bunun nedeni, RA yayını mesajları bir neutron ağı üzerinden gönderildiğinde, bunlar ağdaki tüm IPv6 özellikli bağlantı noktaları tarafından alınır ve her bağlantı noktası daha sonra RA paketinde yer alan bilgilere dayanarak bir IPv6 adresi yapılandıracaktır. Bazı durumlarda, bir IPv6 SLAAC adresi bir bağlantı noktasına eklenirken, bağlantı noktasının zaten atandığı diğer IPv4 ve IPv6 adresleri de eklenir.

source: Next, you'll need to migrate each hypervisor. To do that, follow these steps:
id: Berikutnya, Anda akan perlu memigrasikan setiap hypervisor. Untuk melakukannya, ikuti langkah berikut:
tr_tr: Ardından, her bir üst denetleyiciyi taşımanız gerekir. Bunu yapmak için şu adımları izleyin:

source: No
tr_tr: Hayır

source: No additional configuration required.
id: Tidak ada konfigurasi tambahan yang diperlukan.
tr_tr: Ek yapılandırma gerekmiyor.

source: No additional configurations required for the mechanism driver. Additional agent configuration is required. For details, see the related *L2 agent* section below.
id: Tidak ada konfigurasi tambahan yang dibutuhkan untuk driver mekanisme. Konfigurasi agen tambahan diperlukan. Untuk rincian, lihat bagian bawah *L2 agent* terkait.
tr_tr: Mekanizma sürücüsü için ek yapılandırmalar gerekmez. Ek ajan yapılandırması gerekiyor. Ayrıntılar için, aşağıdaki ilgili *L2 ajanı* bölümüne bakın.

source: No additional configurations required for the mechanism driver. Additional agent configuration is required. Please see the related section.
id: Tidak ada konfigurasi tambahan yang dibutuhkan untuk driver mekanisme. Konfigurasi agen tambahan diperlukan. Silakan lihat bagian terkait.
tr_tr: Mekanizma sürücüsü için ek yapılandırmalar gerekmez. Ek ajan yapılandırması gerekiyor. Lütfen ilgili bölüme bakın.

source: No changes.
id: Tidak ada perubahan.
tr_tr: Değişiklik yok.

source: Nodes
id: Node (simpul)
tr_tr: Düğümler

source: North-south
id: North-south (utara-selatan)
tr_tr: Kuzey-güney

source: North-south scenario 1: Instance with a fixed IP address
id: North-south scenario 1: Instance dengan alamat IP tetap
tr_tr: Kuzey-güney senaryosu 1: Sabit bir IP adresine sahip sunucu

source: North-south scenario 2: Instance with a floating IPv4 address
id: North-south scenario 2: Instance dengan alamat IPv4 mengambang
tr_tr: Kuzey-güney senaryosu 2: Değişken IPv4 adresli sunucu

source: North-south scenario: Instance with a fixed IP address
id: North-south scenario: Instance dengan alamat IP tetap
tr_tr: Kuzey-güney senaryosu: Sabit bir IP adresi olan sunucu

source: Not Defined
id: Not Defined (tak terdefinisikan)
tr_tr: Tanımlanmamış

source: Not currently implemented in the reference implementation.
id: Saat ini tidak dilaksanakan dalam implementasi referensi.
tr_tr: Şu anda referans uygulamasında uygulanmamaktadır.

source: Not specified.
id: Tidak ditentukan.
tr_tr: Belirtilmedi.

source: Note that if you are using VLANs on your physical switches to implement project isolation in your OpenStack cloud, you must ensure that all of your switchports are configured as trunk ports.
id: Perhatikan bahwa jika Anda menggunakan VLAN pada switch fisik Anda untuk menerapkan isolasi proyek di cloud OpenStack Anda, Anda harus memastikan bahwa semua switchport Anda dikonfigurasi sebagai trunk port.
tr_tr: OpenStack bulutunuzda proje izolasyonu uygulamak için fiziksel switch'inizde VLAN kullanıyorsanız tüm switchport'larınızın bilgi aktarım yolu bağlantı noktası olarak yapılandırıldığından emin olun.

source: Note that in this use case:
id: Perhatikan dalam use case ini:
tr_tr: Bu kullanım durumunda şunu unutmayın:

source: Nova uses the ``auto-allocated-typology`` feature with API micro version 2.37 or later. This is because, unlike the neutron feature which was implemented in the Mitaka release, the integration for nova was completed during the Newton release cycle. Note that the CLI option ``--nic`` can be omitted regardless of the microversion used as long as there is no more than one network available to the project, in which case nova fails with a 400 error because it does not know which network to use. Furthermore, nova does not start using the feature, regardless of whether or not a user requests micro version 2.37 or later, unless all of the ``nova-compute`` services are running Newton-level code.
tr_tr: Nova, API mikro sürüm 2.37 veya sonrası olan ``auto-allocated-typology`` özelliğini kullanıyor. Bunun nedeni, Mitaka sürümünde uygulanan neutron özelliğinin aksine, Newton sürümü sırasında nova için entegrasyon tamamlanmış olmasıdır. Projede kullanılabilir birden fazla ağ olmadığı sürece, ``--nic`` CLI seçeneğinin kullanılmasına bakılmaksızın, atlanabileceğini unutmayın; bu durumda nova, 400 hatasıyla başarısız olur; çünkü kullanacağınız ağ hangisinin hangisi olduğunu bilmiyor. Ayrıca, ``nova-compute`` hizmetlerinin tümü Newton seviyesinde kod çalıştırmadıkça, kullanıcı bir mikro sürüm 2.37 veya daha ileri sürüm talep edip etmediğine bakılmaksızın, bu özelliği kullanmaya başlamıyor.

source: Now consider the scenario that all of the switchports in the first switch become occupied, and so the organization buys a second switch and connects it to the first switch to expand the available number of switchports. The second switch is also configured to support VLAN IDs 10, 11, and 12. Now imagine host A connected to switch 1 on a port configured for VLAN ID 10 sends an Ethernet frame intended for host B connected to switch 2 on a port configured for VLAN ID 10. When switch 1 forwards the Ethernet frame to switch 2, it must communicate that the frame is associated with VLAN ID 10.
id: Sekarang mempertimbangkan skenario bahwa semua switchport di switch pertama sedang dipakai, dan perusahaan (organization) membeli switch kedua dan menghubungkannya ke switch pertama untuk memperluas jumlah yang tersedia dari switchports. Switch kedua juga dikonfigurasi untuk mendukung VLAN ID 10, 11, dan 12. Sekarang bayangkan bahwa host A terhubung dengan switch 1 pada port yang dikonfigurasi untuk VLAN ID 10 mengirimkan sebuah frame Ethernet yang ditujukan untuk host B yang terhubung dengan switch 2 pada port yang dikonfigurasi untuk VLAN ID 10. Ketika switch 1 meneruskan frame Ethernet untuk switch 2, switch 1 harus berkomunikasi frame yang berhubungan dengan VLAN ID 10.
tr_tr: Şimdi, ilk switch'teki tüm switchport'ların dolup dolduğunu ve böylece kuruluşun ikinci bir anahtarı satın aldığını ve mevcut switchport sayısını genişletmek için anahtarı ilk anahtara bağladığını göz önünde bulundurun. İkinci anahtar da VLAN ID 10, 11 ve 12'yi destekleyecek şekilde yapılandırılmıştır. Şimdi, VLAN ID için yapılandırılmış bir bağlantı noktasındaki 1 numaralı switch'e bağlı olan A sunucusunu düşünün 10 numaralı kimliği için yapılandırılmış bir bağlantı noktasında 2 numaralı anasisteme bağlı B sunucusu için bir Ethernet çerçevesi gönderir. VLAN ID 10. Switch 1, Ethernet çerçevesini switch 2'ye ilettiğinde, çerçevenin VLAN ID 10 ile ilişkili olduğunu bildirmelidir.

source: Now project ``838030a7bf3c4d04b4b054c0f0b2b17c`` is able to see the network when running :command:`openstack network list` and :command:`openstack network show` and can attach router gateway ports to that network. No other users (other than admins and the owner) are able to see the network.
id: Sekarang proyek `` 838030a7bf3c4d04b4b054c0f0b2b17c`` mampu melihat jaringan ketika berjalan :command:`openstack network list` dan :command:`openstack network show` dan dapat menghubungkan router gateway port ke jaringan itu. Tidak ada pengguna lain (selain admin dan pemilik) dapat melihat jaringan.
tr_tr: Şimdi ``838030a7bf3c4d04b4b054c0f0b2b17c`` projesi, :command:`openstack network list` and :command:`openstack network show` komutları çalıştırıldığında ağı görebilir ve yönlendirici geçit bağlantı noktalarını bu ağa bağlayabilir. Diğer kullanıcılar (yöneticiler ve sahipler dışındakiler) ağı göremezler.

source: Now, use them. It is easy to create a subnet from a pool:
id: Sekarang, silahkan menggunakannya. Sangat mudah untuk membuat subnet dari kolam:
tr_tr: Şimdi bunları kullanın. Bir havuzdan bir alt ağ oluşturmak kolaydır:

source: OVS agent
id: Agen OVS
tr_tr: OVS ajanı

source: OVS with DPDK, or OVS-DPDK, can be used to provide high-performance networking between instances on OpenStack compute nodes.
id: OVS dengan DPDK, atau OVS-DPDK, dapat digunakan untuk menyediakan jaringan high-performance antara instance pada node komputasi OpenStack.
tr_tr: DPDK ile OVS (OVS-DPDK) OpenStack hesaplama düğümlerinde sunucular arasında yüksek performanslı ağlar sağlamak için kullanılabilir.

source: Obtain access to the instance.
id: Dapatkan akses ke instance.
tr_tr: Sunucuya erişim alın.

source: Octavia provides additional capabilities for load balancers, including using a compute driver to build instances that operate as load balancers. The `Hands on Lab - Install and Configure OpenStack Octavia <https://www.openstack.org/summit/tokyo-2015/videos/presentation/rsvp-required-hands-on-lab-install-and-configure-openstack-octavia>`_ session at the OpenStack Summit in Tokyo provides an overview of Octavia.
id: Octavia memberikan kemampuan tambahan untuk penyeimbang beban, meliputi penggunaan driver komputasi untuk membangun instance yang beroperasi sebagai penyeimbang beban. Sesi `Hands on Lab - Install and Configure OpenStack Octavia <https://www.openstack.org/summit/tokyo-2015/videos/presentation/rsvp-required-hands-on-lab-install-and-configure-openstack-octavia>`_ pada KTT OpenStack di Tokyo memberikan gambaran tentang Octavia.
tr_tr: Octavia yük dengeleyiciler için yük dengeleyici gibi işleyen sunucular oluşturmak için bir hesaplama sürücüsünü de içeren ek yetenekler sağlar. Tokyo'daki OpenStack Summit'teki `Uygulamalı Lab - OpenStack Octavia Kurulumu ve Yapılandırması <https://www.openstack.org/summit/tokyo-2015/videos/presentation/rsvp-required-hands-on-lab-install-and-configure-openstack-octavia>`_ oturumu Octavia için bir özet sağlar.

source: Off
tr_tr: Kapalı

source: Offline migration requires all Neutron server instances in the cluster to be shutdown before you apply any contract scripts.
id: Migrasi Offline memerlukan semua instance server Neutron dalam cluster untuk shutdown sebelum Anda menerapkan script kontrak.
tr_tr: Çevrimdışı göç, herhangi bir sözleşme komut dosyasını uygulamadan önce kümedeki tüm Neutron sunucu örneklerinin kapanmasını gerektirir.

source: Often, an application running on a host with a private IP address will need to connect to a server on the public Internet. An example is a user who wants to access a public website such as www.openstack.org. If the IP packets reach the web server at www.openstack.org with a private IP address as the source, then the web server cannot send packets back to the sender.
id: Seringkali, sebuah aplikasi yang berjalan pada host dengan alamat IP private akan harus terhubung ke server di Internet publik. Contohnya adalah pengguna yang ingin mengakses situs publik seperti www.openstack.org. Jika paket IP mencapai server web di www.openstack.org dengan alamat IP private sebagai sumber, maka web server tidak dapat mengirim paket kembali ke pengirim.
tr_tr: Genellikle, özel bir IP adresine sahip bir ana bilgisayarda çalışan bir uygulamanın, ortak İnternet'teki bir sunucuya bağlanması gerekir. Buna bir örnek, www.openstack.org gibi kamuya açık bir web sitesine erişmek isteyen bir kullanıcıdır. IP paketleri kaynak olarak özel bir IP adresi olan www.openstack.org adresindeki web sunucusuna ulaşırsa, web sunucusu gönderene geri paket gönderemez.

source: On Ubuntu, modify the ``[fwaas]`` section in the ``/etc/neutron/fwaas_driver.ini`` file instead of ``/etc/neutron/neutron.conf``.
id: Pada Ubuntu, memodifikasi bagian ``[fwaas]`` dalam file ``/etc/neutron/fwaas_driver.ini`` dari pada ``/etc/neutron/neutron.conf``.
tr_tr: Ubuntu üzerinde, ``/etc/neutron/neutron.conf`` yerine ``/etc/neutron/fwaas_driver.ini`` dosyasındaki ``[fwaas]`` bölümünü düzenleyin.

source: On Ubuntu, the iptables ruleset that libvirt creates includes the following rules::
id: Pada Ubuntu, iptables ruleset dimana libvirt menciptakan, ruleset mencakup aturan berikut ::
tr_tr: Ubuntu'da, libvirt'in oluşturduğu iptales kural seti aşağıdaki kuralları içerir::

source: On a Linux machine, any of the following commands displays the routing table:
id: Pada mesin Linux, semua perintah berikut menampilkan routing table:
tr_tr: Bir Linux makinesinde, aşağıdaki komutlardan herhangi biri yönlendirme tablosunu görüntüler:

source: On compute nodes:
id: Pada node komputasi:
tr_tr: Hesaplama düğümlerinde:

source: On each compute node, create the VFs via the PCI SYS interface:
id: Pada setiap node komputasi, buatlah VF melalui antarmuka PCI SYS:
tr_tr: Her hesaplama düğümünde, PCI SYS arayüzü vasıtasıyla VF'leri oluşturun:

source: On each compute node, verify creation of a ``qrouter`` namespace with the same ID.
id: Pada setiap node komputasi, lakukan verifikasi penciptaan namespace ``qrouter`` dengan ID yang sama.
tr_tr: Her hesaplama düğümünde, aynı kimliği olan bir ``qrouter`` ad alanının oluşturulmasını doğrulayın.

source: On each compute node, verify creation of a second ``qdhcp`` namespace.
id: Pada setiap node komputasi, lakukan verifikasi penciptaan namespace ``qdhcp`` kedua.
tr_tr: Her hesaplama düğümünde, ikinci bir ``qdhcp`` ad alanının oluşturulmasını doğrulayın.

source: On each compute node, verify creation of the ``qdhcp`` namespace.
id: Pada setiap node komputasi, lakukan verifikasi penciptaan namespace ``qdhcp``.
tr_tr: Her hesaplama düğümünde, ``qdhcp`` ad alanının oluşumunu doğrulayın.
