Repository: 25hours/openstack-manuals
Catalog: doc/networking-guide/source/locale/*/LC_MESSAGES/networking-guide.po
Languages: id, tr_tr

source: Arp Spoofing Prevention
tr_tr: Arp Aldatmacasından Korunma

source: As a regular project in an OpenStack cloud, you can create a subnet pool of your own and use it to manage your own pool of addresses. This does not require any admin privileges. Your pool will not be visible to any other project.
id: Sebagai proyek reguler di cloud OpenStack, Anda dapat membuat subnet kolam Anda sendiri dan menggunakannya untuk mengelola kolam alamat Anda sendiri. Ini tidak memerlukan hak istimewa admin. Kolam renang Anda tidak akan terlihat dari proyek lainnya.
tr_tr: Bir OpenStack bulutundaki düzenli bir proje olarak, kendi alt ağ havuzunuzu oluşturabilir ve kendi adres havuzunuzu yönetmek için kullanabilirsiniz. Bu, herhangi bir yönetici ayrıcalığı gerektirmez. Havuzunuz başka hiçbir projeye görünmeyecek.

source: As introduced in other guide entries, neutron provides a means of making an object (``network``, ``qos-policy``) available to every project. This is accomplished using the ``shared`` flag on the supported object:
id: Seperti yang diperkenalkan dalam entri buku lainnya, neutron menyediakan sarana untuk membuat sebuah objek (``network``, ``qos-policy``) tersedia untuk setiap proyek. Hal ini dicapai dengan menggunakan ``shared`` flag pada objek yang didukung:
tr_tr: Diğer rehber kayıtlarında da belirtildiği üzere neutron, her proje için bir nesne (``network``, ``qos-policy``) yapma aracı sağlar. Bu, desteklenen nesnede ``shared`` bayrağı kullanılarak gerçekleştirilir:

source: As mentioned earlier, modern Ethernet networks use switches to interconnect the network hosts. A switch is a box of networking hardware with a large number of ports that forward Ethernet frames from one connected host to another. When hosts first send frames over the switch, the switch doesn’t know which MAC address is associated with which port. If an Ethernet frame is destined for an unknown MAC address, the switch broadcasts the frame to all ports. The switch learns which MAC addresses are at which ports by observing the traffic. Once it knows which MAC address is associated with a port, it can send Ethernet frames to the correct port instead of broadcasting. The switch maintains the mappings of MAC addresses to switch ports in a table called a *forwarding table* or *forwarding information base* (FIB). Switches can be daisy-chained together, and the resulting connection of switches and hosts behaves like a single network.
id: Seperti disebutkan sebelumnya, jaringan Ethernet modern menggunakan switch untuk menghubungkan host jaringan. Sebuah switch adalah sebuah kotak dari perangkat keras jaringan dengan sejumlah besar port yang meneruskan frame Ethernet dari satu host terhubung ke host yang lain. Ketika host pertama mengirim frame melintasi switch, switch tidak tahu dimana alamat MAC dikaitkan dengan port. Jika sebuah frame Ethernet diperuntukan untuk alamat MAC yang tidak diketahui, switch menyiarkan frame ke semua port. Switch ini mempelajari alamat MAC dengan cara pengamatan lalu lintas pada port. Setelah tahu dimana alamat MAC terkait dengan port, switch dapat mengirim frame Ethernet ke port yang benar bukan ke penyiaran. Switch mempertahankan pemetaan dari alamat MAC ke switch port dalam tabel yang disebut *forwarding table* atau *forwarding information base* (FIB). Switch dapat daisy-chained bersama-sama, dan koneksi yang dihasilkan dari switch dan host berperilaku seperti jaringan tunggal.
tr_tr: Daha önce de belirtildiği gibi, modern Ethernet ağları, ağ ana bilgisayarlarını birbirine bağlamak için anahtarlar kullanır. Bir anahtar, birleştirilmiş ana bilgisayardan diğerine Ethernet çerçevelerini ileten çok sayıda porta sahip bir ağ donanımı kutusu. Sunucular anahtardan önce çerçeve gönderdiklerinde, anahtar hangi MAC adresinin hangi bağlantı noktasıyla ilişkili olduğunu bilmiyor. Bir Ethernet çerçevesi bilinmeyen bir MAC adresi için yönlendirilmişse, anahtar çerçeve tüm bağlantı noktalarına yayın yapar. Anahtar, trafiği gözlemleyerek hangi MAC adreslerinin hangi portlarda olduğunu öğrenir. Hangi MAC adresinin bir bağlantı noktasıyla ilişkili olduğunu bildikten sonra, Ethernet çerçevelerini yayın yerine doğru bağlantı noktasına gönderebilir. Anahtar, *yönlendirme tablosu* veya *yönlendirme bilgi tabanı* (FIB) olarak adlandırılan bir tabloda, portları değiştirmek için MAC adreslerinin eşlemelerini tutar. Anahtarlar birbirine papatya zincir halinde zincirlenebilir ve sonuçtaki anahtarlar ve ana bilgisayar bağlantıları tek bir ağ gibi davranıyor.

source: As of Juno, the OpenStack Networking service (neutron) provides two new attributes to the subnet object, which allows users of the API to configure IPv6 subnets.
id: Sebagaimana Juno, layanan OpenStack Networking (neutron) menyediakan dua atribut baru ke objek subnet, yang memungkinkan pengguna API untuk mengkonfigurasi subnet IPv6.
tr_tr: Juno'dan beri, OpenStack Ağ Hizmeti (neutron), alt ağ nesnesine API yeni kullanıcıların IPv6 alt ağlarını yapılandırmasına olanak tanıyan iki yeni özellik sunar.

source: As of the Kilo release, considerable effort has gone in to ensuring the project network can handle dual stack IPv6 and IPv4 transport across the variety of configurations described above. OpenStack control network can be run in a dual stack configuration and OpenStack API endpoints can be accessed via an IPv6 network. At this time, Open vSwitch (OVS) tunnel types - STT, VXLAN, GRE, support both IPv4 and IPv6 endpoints.
tr_tr: Kilo sürümünden itibaren, proje ağının yukarıda açıklanan çeşitli yapılandırmalarda çift yığın IPv6 ve IPv4 taşımacılığını üstlenebilmesi için önemli gayret sarf edildi. OpenStack kontrol ağı çift yığın yapılandırmada çalıştırılabilir ve OpenStack API uç noktalarına bir IPv6 ağı üzerinden erişilebilir. Şu anda Open VSwitch (OVS) tünel türleri - STT, VXLAN, GRE, hem IPv4 hem de IPv6 uç noktalarını destekliyor.

source: As of the writing of this guide, there is not placement API CLI client, so the :command:`curl` command is used for this example.
id: Pada penulisan buku ini, tidak ada penempatan API CLI client, sehingga perintah :command:`curl` digunakan untuk contoh ini.
tr_tr: Bu kılavuzun yazılmasından bu yana yerleşim API CLI istemcisi yok, bu nedenle :command:`curl` komutu bu örnek için kullanılıyor.

source: As of today it is not used in the Linux bridge agent. The Linux bridge agent has its own agent specific configuration option. Please see the following bug for more details: https://bugs.launchpad.net/neutron/+bug/1523614
id: Sampai hari ini tidak digunakan di agen jembatan Linux. Agen jembatan Linux memiliki agen sendiri pilihan konfigurasi spesifik. Silakan lihat bug berikut untuk lebih jelasnya :https://bugs.launchpad.net/neutron/+bug/1523614
tr_tr: Bugün itibariyle Linux köprü aracında kullanılmıyor. Linux köprü aracısının kendine ait özel bir yapılandırma seçeneği vardır. Daha fazla detay için lütfen aşağıdaki hataya bakın: https://bugs.launchpad.net/neutron/+bug/1523614

source: As the `admin` user, verify the neutron routers are allocated IP addresses from their correct subnets. Use ``openstack port list`` to find ports associated with the routers.
id: Sebagai pengguna `admin`, lakukan verifikasi apakah router neutron dialokasikan alamat IP dari subnet yang benar. Gunakan ``openstack port list`` untuk menemukan port yang berhubungan dengan router.
tr_tr: `admin` kullanıcısı olarak, neutron yönlendiricilerinin doğru alt ağlarından IP adresleri tahsis edildiğini doğrulayın. Yönlendiricilerle bağlantılı bağlantı noktalarını bulmak için ``openstack port list`` kullanın.

source: Assign a network to a given DHCP agent.
id: Tetapkan jaringan untuk agen DHCP yang diberikan.
tr_tr: Verilen bir DHCP ajanına bir ağ ata.

source: Assign a valid domain name to the network's ``dns_domain`` attribute. This name must end with a period (``.``).
id: Tetapkan nama domain yang valid untuk atribut ``dns_domain`` milik jaringan. Nama ini harus diakhiri dengan titik (``.``).
tr_tr: Ağın `dns_domain`` özniteliğine geçerli bir alan adı atayın. Bu isim bir nokta ile bitmelidir (``.``).

source: Associate a floating IP with the instance port and verify it was allocated an IP address from the correct subnet:
id: Kaitkan IP mengambang dengan port instance dan lakukan verifikasi apakah alamat IP yang dialokasikan itu dari subnet yang benar:
tr_tr: Yüzen bir IP'yi sunucu bağlantı noktasıyla ilişkilendirin ve doğru alt ağdan bir IP adresi tahsis edildiğini doğrulayın:

source: Associate the floating IPv4 address with the instance.
id: Lakukan asosiasi alamat IPv4 mengambang dengan instance.
tr_tr: Sunucu ile yüzen IPv4 adresini ilişkilendir.

source: Associating a floating IP address
id: Mengaitkannya alamat IP mengambang
tr_tr: Yüzen IP adresini ilişkilendirme

source: At a high level, the basic steps to launching an instance on a trunk are the following:
id: Pada tingkat tinggi, langkah dasar untuk meluncurkan sebuah instance pada trunk adalah sebagai berikut:
tr_tr: Üst düzeyde, bir veri aktarım yolu üzerinde bir sunucuyu başlatmanın temel adımları şunlardır:

source: At the current time OpenStack Networking does not provide any facility to support any flavor of NAT with IPv6. Unlike IPv4 there is no current embedded support for floating IPs with IPv6. It is assumed that the IPv6 addressing amongst the projects is using GUAs with no overlap across the projects.
tr_tr: Şu an OpenStack Ağ servisi, NAT'ın herhangi bir flavor'ını IPv6 ile destekleyen herhangi bir olanak sağlamıyor. IPv4'ten farklı olarak, IPv6 ile kayan IP'ler için mevcut gömülü destek yok. Projeler arasında IPv6 adreslemesinin, projelerde örtüşme yapmadan GUA kullandığı varsayılmaktadır.

source: At this moment the Networking DB is the source of truth, but nova-api is the only public read-write API.
id: Pada saat ini Networking DB adalah sumber kebenaran (source of truth), tetapi nova-api adalah satu-satunya public read-write API.
tr_tr: Şu anda Ağ DB'si hakikatin kaynağıdır ancak nova-api, yalnızca okuma-yazma olanağı sağlayan tek API'dir.

source: At this point, all compute nodes have been migrated, but they are still using the nova-api API and Compute gateways. Finally, enable OpenStack Networking by following these steps:
id: Pada titik ini, semua node komputasi telah bermigrasi, namun mereka masih menggunakan nova-api API dan gateway Compute. Akhirnya, aktifkan OpenStack Networking dengan mengikuti langkah-langkah ini:
tr_tr: Bu noktada tüm hesaplama düğümleri taşınıyor ancak yine de nova-api API'sı ve Hesaplama ağ geçitleri'ni kullanıyorlar. Son olarak, şu adımları izleyerek OpenStack Ağını etkinleştirin:

source: Attaching router gateways to networks (since Mitaka).
id: Pelekatan router gateways untuk jaringan (sejak Mitaka).
tr_tr: Ağlara yönlendirici ağ geçitleri takma (Mitaka'dan beri).

source: Attribute name
id: Nama atribut
tr_tr: Özellik adı

source: Auto Configuration Flag = 0
tr_tr: Otomatik Yapılandırma Bayrağı = 0

source: Auto Configuration Flag = 1
tr_tr: Otomatik Yapılandırma Bayrağı = 1

source: Automated removal of empty bridges has been disabled to fix a race condition between the Compute (nova) and Networking (neutron) services. Previously, it was possible for a bridge to be deleted during the time when the only instance using it was rebooted.
id: Penghapusan secara otomatis jembatan kosong telah dinonaktifkan untuk memperbaiki kondisi perebuatan (race condition) antara layanan Compute (nova) dan Networking (neutron). Kondisi sebelumnya, penghapusan jembatan memungkinkan dilakukan ketika instance dilakukan reboot, dan bila hanya instance yang sedang menggunakan layanan itu.
tr_tr: Hesaplama (nova) ve Ağ (neutron) hizmetleri arasında bir yarış durumunu düzeltmek için boş köprülerin otomatik olarak kaldırılması devre dışı bırakıldı. Daha önce, bir köprü, onu kullanan tek sunucuyu yeniden başlatıldığında zaman içinde silinebilirdi.

source: Automatic allocation of network topologies
id: Alokasi otomatis topologi jaringan
tr_tr: Ağ topolojilerinin otomatik olarak tahsisi

source: Availability zone aware scheduler
id: Alat penjadwal mengetahui zona ketersediaan
tr_tr: Kullanılabilirlik bölgesi duyarlı zamanlayıcı

source: Availability zone is selected from ``default_availability_zones`` in ``/etc/neutron/neutron.conf`` if a resource is created without ``availability_zone_hints``:
id: ona ketersediaan dipilih dari ``default_availability_zones`` dalam ``/etc/neutron/neutron.conf`` jika sumber daya dibuat tanpa ``availability_zone_hints``:
tr_tr: Eğer kaynak ``availability_zone_hints`` özelliği olmadan oluşturulmuşsa ``/etc/neutron/neutron.conf`` dosyasında ``default_availability_zones``'dan kullanılabilirlik alanı seçilir:

source: Availability zone of agents
id: Zona ketersediaan agen
tr_tr: Ajanların kullanılabilirlik alanı

source: Availability zone related attributes
id: Zona Ketersediaan terkait atribut
tr_tr: Kullanılabilirlik alanı ile ilgili özellikler

source: Availability zones
id: Zona ketersediaan
tr_tr: Kullanılabilirlik bölgeleri

source: BGP dynamic routing
id: Border Gateway Protocol (BGP) routing dinamis
tr_tr: BGP dinamik yönlendirme

source: BGP dynamic routing advertises prefixes for self-service networks and host routes for floating IP addresses.
id: BGP routing dinamis menyiarkan update dan perubahan awalan untuk jaringan self-service dan host route alamat IP mengambang.
tr_tr: BGP dinamik yönlendirme, self servis ağlar için önekleri ve yüzen IP adresleri için ana bilgisayar yönlerini bildirir.

source: BGP dynamic routing consists of a service plug-in and an agent. The service plug-in implements the Networking service extension and the agent manages BGP peering sessions. A cloud administrator creates and configures a BGP speaker using the CLI or API and manually schedules it to one or more hosts running the agent. Agents can reside on hosts with or without other Networking service agents. Prefix advertisement depends on the binding of external networks to a BGP speaker and the address scope of external and internal IP address ranges or subnets.
id: BGP routing dinamis terdiri dari plug-in layanan dan agen. Plug-in layanan mengimplementasikan ekstensi layanan Networking dan agen mengelola BGP peering sessions. Seorang administrator cloud menciptakan dan mengkonfigurasi pembicara BGP menggunakan CLI atau API dan secara manual menjadwalkan untuk satu atau lebih host menjalankan agen. Agen dapat berada pada host dengan atau tanpa agen layanan Networking lainnya. Awalan penyiaran update dan perubahan tergantung pada pengikatan jaringan eksternal ke speaker BGP dan ruang lingkup alamat rentang atau subnet alamat IP eksternal dan internal.
tr_tr: BGP dinamik yönlendirme, bir hizmet eklentisinden ve bir ajandan oluşur. Hizmet eklentisi Ağ hizmet uzantısını uygular ve aracı BGP gözlemci oturumlarını yönetir. Bir bulut yöneticisi CLI veya API kullanarak bir BGP hoparlörü oluşturur ve yapılandırır ve aracıyı çalıştıran bir veya daha fazla ana makineye el ile zamanlar. Ajanlar, diğer Ağ servisleri ajanları olsun olmasın, ana makinelerde ikamet edebilir. Önek ilanı, harici ağların bir BGP hoparlörüne bağlanması ve dış ve iç IP adres aralıklarının veya alt ağlarının adres alanına bağlıdır.

source: BGP dynamic routing enables advertisement of self-service (private) network prefixes to physical network devices that support BGP such as routers, thus removing the conventional dependency on static routes. The feature relies on :ref:`address scopes <config-address-scopes>` and requires knowledge of their operation for proper deployment.
id: BGP routing dinamis memungkinkan penyiaran update dan perubahan awalan jaringan self-service (private) untuk perangkat jaringan fisik yang mendukung BGP seperti router, sehingga menghilangkan ketergantungan konvensional pada rute statis. Fitur ini bergantung pada :ref:`address scopes <config-address-scopes>` dan membutuhkan pengetahuan tentang operasi mereka untuk pengerahan yang tepat.
tr_tr: BGP dinamik yönlendirmesi, yönlendiriciler gibi BGP'yi destekleyen fiziksel ağ aygıtlarına self-servis (özel) ağ ön eklerinin tanıtımını sağlar ve böylece statik yollara geleneksel bağımlılığı ortadan kaldırır. Bu özellik şunlara dayanıyor :ref:`adres alanları <config-address-scopes>` ve doğru kurulum için işlemlerinin bilinmesi gerekir.

source: BGP dynamic routing supports peering via IPv6 and advertising IPv6 prefixes.
id: Routing dinamis BGP mendukung peering (kebersamaan) melalui IPv6 dan penyiaran update dan perubahan awalan IPv6.
tr_tr: BGP dinamik yönlendirmesi, IPv6 yoluyla gözlemlemeyi ve IPv6 öneklerini tanıtmayı destekler.

source: BGP dynamic routing supports scheduling a BGP speaker to multiple agents which effectively multiplies prefix advertisements to the same peer. If an agent fails, the peer continues to receive advertisements from one or more operational agents.
id: Routing dinamis BGP mendukung penjadwalan BGP speaker ke beberapa agen yang secara efektif melipatgandakan penyiaran update dan perubahan awalan untuk rekan yang sama. Jika agen gagal, peer terus menerima penyiaran update dan perubahan dari satu atau lebih agen operasional.
tr_tr: BGP dinamik yönlendirme, bir BGP yayıncı, önek tanıtımını aynı eşe etkili bir şekilde çarpan birden fazla ajana planlamayı destekler. Bir ajan başarısız olursa, eş bir veya daha fazla operasyonel aracıdan tanıtım yayınlamaya devam eder.

source: BGP routing can be used to automatically set up a static route for your instances.
id: Border Gateway Protocol (BGP) routing dapat digunakan untuk secara otomatis mengatur rute statis untuk instance Anda.
tr_tr: BGP yönlendirme, sunucularınız için otomatik olarak statik bir rota oluşturmak için kullanılabilir.

source: Backwards compatibility
id: Kompatibilitas mundur
tr_tr: Geriye dönük uyumluluk

source: Backwards compatibility with pre-Juno IPv6 behavior.
id: Kompatibilitas mundur dengan perilaku pra-Juno IPv6.
tr_tr: Pre-Juno IPv6 davranışı ile geriye dönük uyumluluk.

source: Bandwidth limit is supported on OVS, Linux bridge, and SR-IOV mechanism drivers. For the Newton release onward DSCP marking is supported on the OVS and Linux bridge mechanism drivers, and the minimum bandwidth rules on the SR-IOV NIC mechanism driver.
tr_tr: Bant genişliği sınırı OVS, Linux köprüsü ve SR-IOV mekanizma sürücüleri tarafından desteklenir. Newton'dan ileri sürümler için DSCP işaretlemesi, OVS ve Linux köprü mekanizması sürücüleri ve SR-IOV NIC mekanizma sürücüsündeki minimum bant genişliği kurallarında desteklenir.

source: Basic networking
id: Jaringan dasar
tr_tr: Temel ağ

source: Because a network host may have multiple TCP-based applications running, TCP uses an addressing scheme called *ports* to uniquely identify TCP-based applications. A TCP port is associated with a number in the range 1-65535, and only one application on a host can be associated with a TCP port at a time, a restriction that is enforced by the operating system.
id: Karena host jaringan mungkin memiliki beberapa aplikasi TCP-based yang sedang berjalan, TCP menggunakan skema pengalamatan yang disebut *port * untuk mengidentifikasi aplikasi TCP-based secara unik. Sebuah port TCP dikaitkan dengan angka dalam kisaran 1-65535, dan hanya satu aplikasi pada host dapat dikaitkan dengan port TCP pada suatu waktu, pembatasan yang diberlakukan dengan sistem operasi.
tr_tr: Bir ağ ana bilgisayarında birden fazla TCP tabanlı uygulama çalışıyor olabilir; TCP, TCP tabanlı uygulamaları benzersiz şekilde tanımlamak için *ports* adlı bir adresleme düzenini kullanır. Bir TCP bağlantı noktası, 1-65535 aralığındaki bir sayı ile ilişkilendirilir ve bir ana bilgisayardaki yalnızca bir uygulama bir TCP bağlantı noktası ile aynı anda ilişkilendirilebilir, bu da işletim sistemi tarafından zorlanan bir kısıtlamadır.

source: Because the NAT router modifies ports as well as IP addresses, this form of SNAT is sometimes referred to as *Port Address Translation* (PAT). It is also sometimes referred to as *NAT overload*.
id: Karena router NAT memodifikasi port serta alamat IP, bentuk SNAT kadang-kadang disebut sebagai *Port Address Translation* (PAT). Hal ini juga kadang-kadang disebut sebagai *NAT overload*.
tr_tr: NAT yönlendiricisi portların yanı sıra IP adreslerini de değiştirdiğinden, bu SNAT formuna bazen *Bağlantı Noktası Adres Çevirisi* (PAT) denir. Buna bazen *NAT aşırı yükleme* denir.

source: Before Kilo, Networking had no automation around the addresses used to create a subnet. To create one, you had to come up with the addresses on your own without any help from the system. There are valid use cases for this but if you are interested in the following capabilities, then subnet pools might be for you.
id: Sebelum Kilo, Networking tidak mempunyai otomatisasi sekitar alamat yang digunakan untuk membuat subnet. Untuk membuat subnet, Anda harus membawa alamat Anda sendiri tanpa bantuan dari sistem. Ada use case valid untuk ini, tetapi jika Anda tertarik pada kemampuan berikut, maka kolam subnet mungkin benar untuk Anda.
tr_tr: Kilo'dan önce, Networking'in bir alt ağ oluşturmak için kullanılan adreslerin etrafında otomasyonu yoktu. Bir tane oluşturmak için, sistemden herhangi bir yardım almadan kendi adresinizi bulmanız gerekiyordu. Bunun için geçerli kullanım örnekleri var, ancak aşağıdaki yeteneklerle ilgileniyorsanız, alt ağlar sizin için olabilir.

source: Before executing any of the use cases, the user must create in the DNS service under his project a DNS zone where the A and AAAA records will be created. For the description of the use cases below, it is assumed the zone ``example.org.`` was created previously.
id: Sebelum melaksanakan salah satu use case, pengguna harus membuat dalam layanan DNS di bawah proyeknya zona DNS dimana catatan A dan AAAA akan dibuat. Untuk deskripsi use case di bawah, diasumsikan zona ``example.org.`` diciptakan sebelumnya.
tr_tr: Kullanım durumlarından herhangi birini uygulamadan önce, kullanıcı projesindeki DNS hizmetinde A ve AAAA kayıtlarının oluşturulacağı bir DNS bölgesi oluşturmalıdır. Aşağıdaki kullanım durumlarının açıklaması için, ``example.org.`` bölgesi önceden oluşturulmuş olarak kabul edilmektedir.

source: Before routed provider networks, the Networking service could not present a multi-segment layer-3 network as a single entity. Thus, each operator typically chose one of the following architectures:
id: Sebelum jaringan penyedia yang diarahkan, layanan Networking tidak bisa menghadirkan jaringan lapisan-3 multi-segment sebagai satu kesatuan. Dengan demikian, masing-masing operator biasanya memilih salah satu arsitektur berikut:
tr_tr: Yönlendirilen sağlayıcı ağlarından önce, Ağ hizmeti tek bir varlık olarak çok dilimli katman-3 ağını sunamadı. Bu nedenle, her operatör tipik olarak aşağıdaki mimarilerden birini seçti:

source: Before the end-user can use the auto-allocation feature, the operator must create the resources that will be used for the auto-allocated network topology creation. To perform this task, proceed with the following steps:
id: Sebelum end-user dapat menggunakan fitur auto-alokasi, operator harus menciptakan sumber daya yang akan digunakan untuk pembuatan topologi jaringan auto-allocated. Untuk melakukan tugas ini, lanjutkan dengan langkah-langkah berikut:
tr_tr: Son kullanıcı otomatik tahsis özelliğini kullanabilmeden önce, operatör otomatik olarak tahsis edilen ağ topolojisi oluşturma için kullanılacak kaynakları oluşturmalıdır. Bu görevi gerçekleştirmek için aşağıdaki adımları takip edin:
