Repository: 25hours/openstack-manuals
Catalog: doc/networking-guide/source/locale/*/LC_MESSAGES/networking-guide.po
Languages: id, tr_tr

source: Configuration for the Open vSwitch agent is typically done in the ``openvswitch_agent.ini`` configuration file. Make sure that on agent start you pass this configuration file as argument.
id: Konfigurasi untuk agen Open vSwitch biasanya dilakukan di file konfigurasi ``openvswitch_agent.ini`` . Pastikan bahwa pada agent start Anda melewati file konfigurasi ini sebagai argumen.
tr_tr: Open vSwitch aracısı için yapılandırma genellikle ``openvswitch_agent.ini`` yapılandırma dosyasında yapılır. Ajanı başlattığınızda bu yapılandırma dosyasını argüman olarak verdiğinizden emin olun.

source: Configuration for the SRIOV nic switch agent is typically done in the ``sriov_agent.ini`` configuration file. Make sure that on agent start you pass this configuration file as argument.
id: Konfigurasi untuk SRIOV nic switch agen biasanya dilakukan dalam file konfigurasi ``sriov_agent.ini``. Pastikan bahwa pada agent start Anda melewati file konfigurasi ini sebagai argumen.
tr_tr: SRIOV nic switch ajanı için yapılandırma, tipik olarak ``sriov_agent.ini`` yapılandırma dosyasında yapılır. Ajanı başlattığınızda bu yapılandırma dosyasını parametre olarak verdiğinizden emin olun.

source: Configuration of the externally accessible network for use case 1
id: Konfigurasi jaringan yang dapat diakses secara eksternal untuk use case 1
tr_tr: Harici olarak erişilebilir ağın, kullanım durumu 1 için yapılandırması

source: Configuration of those drivers is not part of this document.
id: Konfigurasi driver ini bukan bagian dari dokumen ini.
tr_tr: Bu sürücülerin yapılandırması bu belgenin parçası değildir.

source: Configurations
tr_tr: Yapılandırmalar

source: Configure Firewall-as-a-Service v1
id: Lakukan konfigurasi Firewall-as-a-Service v1
tr_tr: Servis-olarak-Güvenlik-Duvarı v1'i yapılandır

source: Configure Firewall-as-a-Service v2
id: Lakukan konfigurasi Firewall-as-a-Service v2
tr_tr: Hizmet Olarak Güvenlik Duvarı'nı yapılandır v2

source: Configure a DNS resolver on an existing subnet.
id: Lakukan konfigurasi DNS resolver pada subnet yang ada.
tr_tr: Mevcut bir alt ağda bir DNS çözümleyici yapılandırın.

source: Configure a DNS resolver when creating a subnet.
id: Lakukan konfigurasi DNS resolver saat membuat subnet.
tr_tr: Bir alt ağ oluştururken bir DNS çözümleyici yapılandırın.

source: Configure an external DNS driver. The Networking service provides a driver reference implementation based on the OpenStack DNS service. It is expected that third party vendors will provide other implementations in the future. For detailed configuration instructions, see :ref:`config-dns-int-ext-serv`.
id: Lakukan konfigurasi driver DNS eksternal. Layanan Networking menyediakan implementasi referensi driver berdasarkan layanan DNS OpenStack. Diharapkan vendor pihak ketiga akan menyediakan implementasi lain di masa depan. Untuk petunjuk konfigurasi rinci, lihat :ref: `config-dns-int-ext-serv`.
tr_tr: Harici bir DNS sürücüsü yapılandırın. Ağ hizmeti, OpenStack DNS hizmetini temel alan bir sürücü başvurusu uygulaması sağlar. Üçüncü taraf satıcıların gelecekte başka uygulamaları sağlayacakları umulmaktadır. Ayrıntılı yapılandırma talimatları için, bakınız:ref:`config-dns-int-ext-serv`.

source: Configure common options:
id: Mengkonfigurasi opsi umum:
tr_tr: Genel seçenekleri yapılandır:

source: Configure communication of the Networking service with the Compute scheduler.
id: Lakukan konfigurasi komunikasi layanan Networking dengan Compute scheduler.
tr_tr: Ağ hizmetinin iletişim hesaplayıcısını Hesaplama zamanlayıcısı ile yapılandırın.

source: Configure drivers and network types:
id: Mengkonfigurasi driver dan tipe jaringan:
tr_tr: Sürücüleri ve ağ türlerini yapılandır:

source: Configure network mappings.
id: Mengkonfigurasi pemetaan jaringan.
tr_tr: Ağ eşleştirmeyi yapılandır.

source: Configure network mappings:
id: Mengkonfigurasi pemetaan jaringan:
tr_tr: Ağ eşlemelerini yapılandırın:

source: Configure neutron-server (Controller)
id: Lakukan konfigurasi neutron-server (Controller)
tr_tr: Neutron-server'ı yapılandır (Denetleyici)

source: Configure nova-scheduler (Controller)
id: Lakukan konfigurasi nova-scheduler (Controller)
tr_tr: Nova-scheduler'ı yapılandır (Denetleyici)

source: Configure the FWaaS plugin for the L3 agent.
id: Lakukan konfigurasi agen FWaaS plugin for the L3.
tr_tr: L3 ajanı için FWaaS eklentisini yapılandırın.

source: Configure the L3 agent. Add the following to ``/etc/neutron/l3_agent.ini``:
id: Lakukan konfigurasi agen L3. Tambahkan hal berikut ke ``/etc/neutron/l3_agent.ini``:
tr_tr: L3 ajanını yapılandır. Aşağıdakini ``/etc/neutron/l3_agent.ini`` dosyasına ekle:

source: Configure the Open vSwitch agent. Add the following to ``/etc/neutron/plugins/ml2/ml2_conf.ini``:
id: Lakukan konfigurasi agen Open vSwitch. Tambahkan hal berikut ke ``/etc/neutron/plugins/ml2/ml2_conf.ini``:
tr_tr: Open vSwitch ajanını yapılandır. Aşağıdakini ``/etc/neutron/plugins/ml2/ml2_conf.ini`` dosyasına ekle:

source: Configure the VXLAN network ID (VNI) range.
id: Lakukan konfigurasi kisaran VXLAN network ID (VNI).
tr_tr: VXLAN ağ kimliği (VNI) aralığını yapılandırın.

source: Configure the driver.
id: Mengkonfigurasi driver.
tr_tr: Sürücüyü yapılandır.

source: Configure the layer-2 agent on each node to map one or more segments to the appropriate physical network bridge or interface and restart the agent.
id: Mengkonfigurasi agen lapisan-2 pada setiap node untuk memetakan satu atau lebih segmen pada jembatan jaringan fisik yang sesuai atau antarmuka dan me-restart agen.
tr_tr: Bir veya daha fazla segmenti uygun fiziksel ağ köprüsüne veya arabirime eşlemek ve aracıyı yeniden başlatmak için her düğüm üzerindeki katman-2 aracısını yapılandırın.

source: Configure the router ID.
id: Konfigurasi ID router.
tr_tr: Yönlendirici ID'yi yapılandır.

source: Configure which PCI devices the ``nova-compute`` service may use. Edit the ``nova.conf`` file:
id: Lakukan konfigurasi dimana perangkat PCI layanan ``nova-compute`` dapat menggunakannya. Edit file ``nova.conf``:
tr_tr: ``nova-compute`` servisinin hangi PCI aygıtlarını kullanabileceğini yapılandır. ``nova.conf`` dosyasını düzenle:

source: Configured in the *L2 agent* configuration.
id: Dikonfigurasi dalam konfigurasi *L2 agent*.
tr_tr: *L2 ajanı* yapılandırmasında yapılandırıldı.

source: Configuring LBaaS v2 with Octavia
id: Konfigurasi LBaaS v2 dengan Octavia
tr_tr: Octavia ile LBaaS v2 yapılandırma

source: Configuring LBaaS v2 with an agent
id: Konfigurasi LBaaS v2 dengan agen
tr_tr: LBaaS v2'yi bir ajan yapılandırma

source: Configuring OpenStack Networking for integration with an external DNS service
id: Lakukan konfigurasi OpenStack Networking untuk integrasi dengan layanan DNS eksternal
tr_tr: Harici bir DNS hizmeti ile entegrasyon için OpenStack Ağını yapılandırma

source: Configuring OpenStack Networking for prefix delegation
id: Configuring OpenStack Networking untuk prefix delegation (penyerahan awalan)
tr_tr: Önek yetkilendirme için OpenStack Ağını yapılandırma

source: Configuring interfaces of the guest
id: Konfigurasi interface (antarmuka) dari guest
tr_tr: Misafirin arabiriminin yapılandırılması

source: Configuring the Dibbler server
id: Malakukan konfigurasi server Dibbler
tr_tr: Dibbler sunucusunu yapılandırma

source: Configuring the proper burst value is very important. If the burst value is set too low, bandwidth usage will be throttled even with a proper bandwidth limit setting. This issue is discussed in various documentation sources, for example in `Juniper's documentation <http://www.juniper.net/documentation/en_US/junos12.3/topics/concept/policer-mx-m120-m320-burstsize-determining.html>`_. Burst value for TCP traffic can be set as 80% of desired bandwidth limit value. For example, if the bandwidth limit is set to 1000kbps then enough burst value will be 800kbit. If the configured burst value is too low, achieved bandwidth limit will be lower than expected. If the configured burst value is too high, too few packets could be limited and achieved bandwidth limit would be higher than expected.
id: Konfigurasi burst value yang tepat sangat penting. Jika burst value diatur terlalu rendah, penggunaan bandwidth akan tercekik bahkan dengan pengaturan batas bandwidth yang tepat sekalipun. Masalah ini dibahas dalam berbagai sumber dokumentasi, misalnya di `Juniper's documentation <http://www.juniper.net/documentation/en_US/junos12.3/topics/concept/policer-mx-m120-m320-burstsize-determining.html>`_. Burst value untuk lalu lintas TCP dapat ditetapkan sebagai 80% dari nilai yang diinginkan batas bandwidth. Sebagai contoh, jika batas bandwidth diatur ke 1000kbps maka burst value yang cukup akan menjadi 800kbit. Jika burst value dikonfigurasi terlalu rendah, batas bandwidth yang dicapai akan lebih rendah dari yang diharapkan. Jika burst value dikonfigurasi terlalu tinggi, terlalu sedikit paket bisa dibatasi dan batas bandwidth mencapai akan lebih tinggi dari yang diharapkan.
tr_tr: Doğru patlama değerini yapılandırmak çok önemlidir. Yayın değeri çok düşük ayarlanmışsa, bant genişliği kullanımı uygun bir bant genişliği sınır ayarı olsa bile azaltılacaktır. Bu durum, çeşitli belge kaynaklarında tartışılmaktadır, örneğin `Juniper's belgesi <http://www.juniper.net/documentation/en_US/junos12.3/topics/concept/policer-mx-m120-m320-burstsize-determining.html>`_. TCP trafiği için patlama değeri istenen bant genişliği sınır değerinin % 80'i olarak ayarlanabilir. Örneğin, bant genişliği sınırı 1000kbps'ye ayarlanırsa, yeterli patlama değeri 800kbit olacaktır. Yapılandırılmış patlama değeri çok düşükse, elde edilen bant genişliği sınırı beklenenden daha düşük olur. Yapılandırılmış patlama değeri çok yüksekse, çok az sayıda paket sınırlanabilir ve bant genişliği sınırı elde edilir beklenenden daha yüksek olurdu.

source: Connect a router to each of the project subnets that have been created, for example, using a router called ``router1``:
id: Menghubungkan router untuk masing-masing subnet proyek yang telah dibuat, misalnya, menggunakan router disebut ``router1``:
tr_tr: Oluşturulan proje alt ağlarının her birine bir yönlendirici bağlayın, örneğin, ``router1`` adlı bir yönlendirici kullanarak:

source: Connection to the OpenStack APIs via an IPv6 transport network
id: Koneksi ke API OpenStack melalui jaringan transportasi IPv6
tr_tr: Bir IPv6 aktarım ağı vasıtasıyla OpenStack API'lerine bağlantı

source: Consider adding at least one additional network node to provide high-availability for instances with a fixed IP address. See See :ref:`config-dvr-snat-ha-ovs` for more information.
id: Pertimbangkan untuk menambahkan setidaknya satu node jaringan tambahan untuk menyediakan ketersediaan tinggi untuk instance dengan alamat IP tetap. Lihat lihat :ref: `config-dvr-SNAT-ha-ovs` untuk informasi lebih lanjut.
tr_tr: Sabit bir IP adresli örnekler için yüksek kullanılabilirlik sağlamak için en az bir ek ağ düğümü eklemeyi düşünün. Daha fazla bilgi için bakınız :ref:`config-dvr-snat-ha-ovs`.

source: Consider an IP address of 192.168.1.5, where the first 24 bits of the address are the network number. In dotted quad notation, the netmask would be written as ``255.255.255.0``. CIDR notation includes both the IP address and netmask, and this example would be written as ``192.168.1.5/24``.
id: Pertimbangkan alamat IP dari 192.168.1.5, dimana 24 bit pertama dari alamat adalah nomor jaringan. Dalam notasi dotted quad, netmask akan ditulis sebagai ``255.255.255.0``. Notasi CIDR mencakup alamat IP dan netmask, dan contoh ini akan ditulis sebagai ``192.168.1.5/24``.
tr_tr: Adresin ilk 24 bitinin ağ numarası olduğu 192.168.1.5'lik bir IP adresini düşünün. Noktalı dörtlü gösterimde ağ maskesi ``255.255.255.0`` olarak yazılır. CIDR gösterimi hem IP adresini hem de ağ maskesini içerir ve bu örnek ``192.168.1.5/24`` olarak yazılır.

source: Consider the following attributes of this high-availability mechanism to determine practicality in your environment:
id: Pertimbangkan atribut berikut mekanisme ketersediaan tinggi ini untuk menentukan kepraktisan di lingkungan Anda:
tr_tr: Ortamınızdaki pratikliği belirlemek için bu yüksek kullanılabilirlik mekanizmasının aşağıdaki özelliklerini göz önünde bulundurun:

source: Consider the following attributes of this mechanism driver to determine practicality in your environment:
id: Pertimbangkan atribut berikut dari driver mekanisme ini untuk menentukan kepraktisan di lingkungan Anda:
tr_tr: Ortamınızda pratikliği belirlemek için bu mekanizma sürücüsünün aşağıdaki niteliklerini göz önünde bulundurun:

source: Contents
id: Contents (isi)
tr_tr: İçerikler

source: Controller node
tr_tr: Denetleyici düğüm

source: Controller node configuration
id: Konfigurasi controller node
tr_tr: Denetleyici düğüm yapılandırması

source: Controller: Contains control plane components of OpenStack services and their dependencies.
id: Controller: Berisi control plane component dari layanan OpenStack dan dependensinya.
tr_tr: Denetleyici: OpenStack servislerinin kontrol düzlemi bileşenlerini ve bunların bağımlılıklarını içerir.

source: Coordination between the Networking service and the Compute scheduler is not necessary for IPv6 subnets as a consequence of their large address spaces.
id: Koordinasi antara layanan Networking dan Compute scheduler tidak diperlukan untuk subnet IPv6 sebagai konsekuensi dari ruang alamat (address space) yang besar.
tr_tr: Büyük adres alanlarının bir sonucu olarak IPv6 alt ağları için Ağ hizmeti ve Hesaplama zamanlayıcı arasındaki koordinasyon gerekli değildir.

source: Copy the ``_1481_project_ng_loadbalancersv2_panel.py`` file from the ``neutron-lbaas-dashboard/enabled`` directory into the Dashboard ``openstack_dashboard/local/enabled`` directory.
id: Salin file ``_1481_project_ng_loadbalancersv2_panel.py`` dari direktori ``neutron-lbaas-dashboard/enabled`` ke dalam direktori Dashboard ``openstack_dashboard/local/enabled``.
tr_tr: ``_1481_project_ng_loadbalancersv2_panel.py`` dosyasını ``neutron-lbaas-dashboard/enabled`` dizininden Dashboard ``openstack_dashboard/local/enabled`` dizinine kopyala.

source: Create IPv6 and IPv4 address scopes:
id: Buat lingkup alamat IPv6 dan IPv4:
tr_tr: IPv6 ve IPv4 adres alanı oluştur:

source: Create Virtual Functions (Compute)
id: BuatlahVirtual Functions (Compute)
tr_tr: Sanal İşlevler Oluştur (Hesaplama)

source: Create a BGP peer.
id: Buat rekan BGP.
tr_tr: Bir BGP akranı oluştur.

source: Create a IPv4 subnet on the provider network.
id: Buat subnet IPv4 pada jaringan provider.
tr_tr: Sağlayıcı ağ üzerinde bir IPv4 alt ağı oluştur.

source: Create a IPv4 subnet on the self-service network.
id: Buat subnet IPv4 pada jaringan self-service.
tr_tr: Self-servis ağı üzerinde bir IPv4 alt ağı oluştur.

source: Create a IPv6 subnet on the provider network.
id: Buat subnet IPv6 pada jaringan provider.
tr_tr: Sağlayıcı ağı üzerinde bir IPv6 alt ağı oluşturun.

source: Create a IPv6 subnet on the self-service network.
id: Buat subnet IPv6 pada jaringan self-service.
tr_tr: Self-servis ağı üzerinde bir IPv6 alt ağı oluştur.

source: Create a QoS policy to share:
id: Buat kebijakan QoS untuk berbagi:
tr_tr: Paylaşmak için QoS politikası oluşturun:

source: Create a VLAN provider network which includes a default segment. In this example, the network uses the ``provider1`` physical network with VLAN ID 2016.
id: Membuat jaringan penyedia VLAN yang meliputi segmen default. Dalam contoh ini, jaringan menggunakan jaringan fisik ``provider1`` dengan VLAN ID 2016.
tr_tr: Bir varsayılan segment içeren bir VLAN sağlayıcı ağı oluşturun. Bu örnekte, ağ, VLAN ID 2016 olan ``provider1`` fiziksel ağını kullanmaktadır.

source: Create a couple of networks to host subnets:
id: Buat beberapa jaringan untuk subnet host:
tr_tr: Alt ağlar sunmak için bir çift ağ oluştur:

source: Create a firewall policy:
id: Membuat kebijakan firewall:
tr_tr: Bir güvenlik duvarı politikası oluşturun:

source: Create a firewall rule:
id: Buat aturan firewall:
tr_tr: Bir güvenlik duvarı kuralı oluştur:

source: Create a firewall:
id: Buat firewall:
tr_tr: Bir güvenlik duvarı oluştur:

source: Create a flat network.
id: Buat jaringan datar (flat network)
tr_tr: Bir düz ağ oluşturun.

source: Create a floating IP and associate it to the port.
id: Buat IP mengambang dan mengasosiasikannya ke port.
tr_tr: Yüzen bir IP oluşturun ve bağlantı noktasına ilişkilendirin.

source: Create a floating IPv4 address on the provider network.
id: Buat alamat IPv4 mengambang di jaringan provider.
tr_tr: Sağlayıcı ağ üzerinde yüzen IPv4 adresini oluşturun.

source: Create a network
id: Membuat network
tr_tr: Bir ağ oluştur

source: Create a network that you want to be available as an external network:
id: Buat jaringan dimana Anda menginginkan tersedia sebagai jaringan eksternal:
tr_tr: Harici bir ağ olarak kullanılmasını istediğiniz bir ağ oluşturun:

source: Create a network to share:
id: Membuat jaringan untuk berbagi:
tr_tr: Paylaşmak için bir ağ oluştur:

source: Create a network.
id: Membuat jaringan.
tr_tr: Bir ağ oluştur.

source: Create a parent port for the trunk.
id: Buat port induk untuk trunk.
tr_tr: Bilgi aktarım yolu için ana bağlantı noktası oluştur.

source: Create a policy entry using the :command:`openstack network rbac create` command (in this example, the ID of the project we want to share with is ``838030a7bf3c4d04b4b054c0f0b2b17c``):
id: Buat entri kebijakan menggunakan perintah :command:`openstack network rbac create` (dalam contoh ini, ID proyek dimana kami ingin berbagi dengan adalah ``838030a7bf3c4d04b4b054c0f0b2b17c``):
tr_tr: :command:`openstack network rbac create` komutunu kullanarak politika girdisi oluştur (bu örnekte, politikayı paylaşmak istediğimiz projenin ID'si ``838030a7bf3c4d04b4b054c0f0b2b17c``)

source: Create a port chain
id: Create a port chain (pembuatan rantai port)
tr_tr: Bir bağlantı noktası zinciri oluşturun

source: Create a routed provider network
id: Membuat jaringan penyedia dialihkan (routed)
tr_tr: Yönlendirilmiş bir sağlayıcı ağı oluşturma

source: Create a router
id: Membuat router
tr_tr: Bir yönlendirici oluştur

source: Create a router.
id: Buat router.
tr_tr: Bir yönlendirici oluştur.

source: Create a router:
id: Buat router:
tr_tr: Bir yönlendirici oluştur:

source: Create a second segment on the provider network. In this example, the segment uses the ``provider2`` physical network with VLAN ID 2016.
id: Membuat segmen kedua pada jaringan operator. Dalam contoh ini, segmen menggunakan jaringan fisik ``provider2`` dengan VLAN ID 2016.
tr_tr: Sağlayıcı ağı üzerinde ikinci bir bölüm oluşturun. Bu örnekte, segment, VLAN ID 2016 olan ``provider2`` fiziksel ağını kullanmaktadır.

source: Create a security group and rules to allow TCP port 80, TCP port 443, and all ICMP traffic:
id: Buat grup keamanan dan aturan untuk memungkinkan TCP port 80, TCP port 443, dan semua lalu lintas ICMP:
tr_tr: TCP bağlantı noktası 80, TCP bağlantı noktası 443 ve tüm ICMP trafiğine izin vermek için güvenlik grubu ve kuralları oluştur:

source: Create a self-service network.
id: Buat jaringan self-service.
tr_tr: Bir self-servis ağı oluştur.

source: Create a subnet
id: Membuat subnet
tr_tr: Bir altağ oluştur

source: Create a subnet not associated with a subnet pool or an address scope:
id: Buat subnet yang tidak terkait dengan kolam subnet atau lingkup alamat:
tr_tr: Bir alt ağ havuzu veya bir adres alanı ile ilişkili olmayan bir alt ağ oluştur:

source: Create a subnet on the external network for all other IP addresses allocated on the external network. This will not use any service type. It acts as a fall back for allocations that do not match either of the above two service subnets.
id: Buat subnet pada jaringan eksternal untuk semua alamat IP lainnya yang dialokasikan pada jaringan eksternal. Subnet tidak akan menggunakan tipe layanan. Subnet bertindak minder (fall back) ke alokasi yang tidak sesuai dengan salah satu dari dua subnet layanan di atas.
tr_tr: Harici ağ üzerinde tahsis edilen diğer tüm IP adresleri için harici ağda bir alt ağ oluşturun. Bu herhangi bir hizmet türünü kullanmaz. Yukarıdaki iki hizmet alt ağacından herhangi biriyle uyuşmayan ayırmalar için kurtarma işlevini görür.

source: Create a subnet on the external network for the floating IP agent gateway IP addresses, which are configured by DVR on compute nodes. This will use the ``network:floatingip_agent_gateway`` service type.
id: Buat subnet pada jaringan eksternal untuk floating IP agent gateway IP addresses, yang dikonfigurasi dengan DVR pada node komputasi. Ini akan menggunakan tipe layanan ``network:floatingip_agent_gateway``.
tr_tr: Hesaplama düğümlerinde DVR tarafından yapılandırılan kayan IP aracı ağ geçidi IP adresleri için harici ağda bir alt ağ oluşturun. Bu, ``network:floatingip_agent_gateway`` servis türünü kullanacaktır.

source: Create a subnet on the external network for the instance floating IP addresses. This uses the ``network:floatingip`` service type.
id: Buat subnet pada jaringan eksternal untuk alamat IP mengambang instance. Ini menggunakan tipe layanan ``network:floatingip``.
tr_tr: Örnek yüzen IP adresleri için harici ağda bir alt ağ oluşturun. Bu, ``network:floatingip`` hizmet türünü kullanır.

source: Create a subnet on the first two self-service networks using an IP address range from the self-service subnet pool.
id: Buat subnet pada jaringan self-service dua pertama menggunakan kisaran alamat IP dari kolam subnet self-service.
tr_tr: Self-servis alt ağ havuzundan bir IP adres aralığı kullanarak ilk iki self-servis ağı üzerinde bir alt ağ oluştur.

source: Create a subnet on the last self-service network using an IP address range outside of the address scope.
id: Buat subnet pada jaringan self-service terakhir menggunakan kisaran alamat IP di luar lingkup alamat.
tr_tr: Adres alanının dışında bir IP adres aralığı kullanarak en son self-servis ağında bir alt ağ oluştur.

source: Create a subnet on the network with one or more service types. For example, the ``compute:nova`` service type enables instances to use this subnet.
id: Buat subnet pada jaringan dengan satu atau lebih tipe layanan. Sebagai contoh, tipe layanan ``compute:nova`` mengaktifkan instance untuk menggunakan subnet ini.
tr_tr: Bir veya daha fazla hizmet türüne sahip ağda bir alt ağ oluşturun. Örneğin, ``compute:nova`` servis tipi, örneklerin bu alt ağı kullanmasını sağlar.

source: Create a subnet on the provider network using an IP address range from the provider subnet pool.
id: Buat subnet pada jaringan provider menggunakan kisaran alamat IP dari kolam subnet provider.
tr_tr: Sağlayıcı alt ağ havuzundan bir IP adres aralığını kullanarak sağlayıcı ağ üzerinde bir alt ağ oluştur.

source: Create a subnet using a subnet pool associated with an address scope from an external network:
tr_tr: Harici bir ağdan bir adres alanı ile ilişkili bir alt ağ havuzu kullanarak bir alt ağ oluştur:

source: Create an address scope. The provider (external) and self-service networks must belong to the same address scope for the agent to advertise those self-service network prefixes.
id: Buat lingkup alamat. Jaringan provider (eksternal) dan self-service harus termasuk dalam ruang lingkup alamat yang sama untuk agen untuk penyiaran update dan perubahan awalan jaringan self-service mereka.
tr_tr: Bir adres alanı oluşturun. Hizmet sağlayıcı (dış) ve kendi kendine hizmet ağları, aracının bu self servis ağ öneklerini tanıtması için aynı adres alanına ait olmalıdır.

source: Create an external network:
id: Buat jaringan eksternal:
tr_tr: Harici bir ağ oluştur:
