Repository: 25hours/openstack-manuals
Catalog: doc/networking-guide/source/locale/*/LC_MESSAGES/networking-guide.po
Languages: id, tr_tr

source: Unlike most agents, BGP speakers require manual scheduling to an agent. BGP speakers only form peering sessions and begin prefix advertisement after scheduling to an agent. Schedule the BGP speaker to agent ``37729181-2224-48d8-89ef-16eca8e2f77e``.
id: Tidak seperti kebanyakan agen, speaker BGP memerlukan penjadwalan manual untuk agen. Speaker BGP hanya membentuk sesi kebersamaan dan mulai penyiaran update dan perubahan awal prefix setelah penjadwalan untuk agen. Jadwalkan speaker BGP untuk agen ``37729181-2224-48d8-89ef-16eca8e2f77e``.
tr_tr: Çoğu ajanın aksine, BGP yayıncıları bir ajanı el ile zamanlama gerektirir. BGP yayıncıları sadece bir eşleme oturumu oluşturur ve bir ajana planlandıktan sonra önek ilanını başlatırlar. BGP yayıncısını ``37729181-2224-48d8-89ef-16eca8e2f77e`` ajanına zamanla.

source: Unlimited address overlap is allowed.
id: Tak terbatas tumpang tindih alamat diperbolehkan.
tr_tr: Sınırsız adres çakışmasına izin verilir.

source: Update a port chain or port pair group
id: Memperbarui rantai port atau kelompok pasangan port
tr_tr: Bir bağlantı zinciri veya bağlantı noktası çifti grubunu güncelleme

source: Update the DHCP configuration file ``/etc/neutron/dhcp_agent.ini``:
id: Update file konfigurasi DHCP ``/etc/neutron/dhcp_agent.ini``:
tr_tr: DHCO yapılandırma dosyası ``/etc/neutron/dhcp_agent.ini``'yi güncelle:

source: Update the nova configuration file ``/etc/nova/nova.conf``:
id: Update file konfigurasi nova ``/etc/nova/nova.conf``:
tr_tr: ``/etc/nova/nova.conf`` nova yapılandırma dosyasını güncelle:

source: Update the plug-in configuration file ``/etc/neutron/plugins/linuxbridge/linuxbridge_conf.ini``:
id: Update file konfigurasi plug-in ``/etc/neutron/plugins/linuxbridge/linuxbridge_conf.ini``:
tr_tr: Eklenti yapılandırma dosyasını ``/etc/neutron/plugins/linuxbridge/linuxbridge_conf.ini`` güncelle:

source: Update the provider network to support external connectivity for self-service networks.
id: Lakukan update jaringan provider untuk mendukung konektivitas eksternal untuk jaringan self-service.
tr_tr: Self servis ağlar için harici bağlantıyı desteklemek için sağlayıcı ağını güncelleyin.

source: Update the security group to allow traffic to reach the new load balancer. Create a new security group along with ingress rules to allow traffic into the new load balancer. The neutron port for the load balancer is shown as ``vip_port_id`` above.
id: Update grup keamanan untuk mengizinkan lalu lintas untuk mencapai penyeimbang beban baru. Buat grup keamanan baru bersama dengan aturan masuknya untuk mengizinkan lalu lintas ke penyeimbang beban baru. Port neutron untuk penyeimbang beban ditampilkan sebagai ``vip_port_id`` di atas.
tr_tr: Trafiğin yeni yük dengeleyicisine erişmesine izin vermek için güvenlik grubunu güncelleyin. Yeni yük dengeleyicisine trafik akışını sağlamak için giriş kurallarıyla birlikte yeni bir güvenlik grubu oluşturun. Yük dengeleyici için neutron bağlantı noktası yukarıda ``vip_port_id`` olarak gösterilir.

source: Uplink the router on an external network
id: Uplink router pada jaringan eksternal
tr_tr: Harici bir ağda yönlendiriciyi bağlayın

source: Usage
id: Usage (penggunaan)
tr_tr: Kullanım

source: Use InfiniBand enabled network adapters.
id: Gunakan InfiniBand yang diaktifkan adapter jaringan.
tr_tr: InfiniBand etkin ağ adaptörlerini kullanın.

source: Use ``availability_zone_hints`` to specify the zone in which the resource is hosted:
id: Gunakan ``availability_zone_hints`` untuk menentukan zona dimana sumber akan disimpan (hosted):
tr_tr: Kaynağın hangi alanda sunulacağını belirlemek için ``availability_zone_hints`` özelliğini kullanın:

source: Use case
tr_tr: Kullanım örneği

source: Use case 1: Ports are published directly in the external DNS service
id: Use case 1: Port yang diterbitkan secara langsung dalam layanan DNS eksternal
tr_tr: Kullanım durumu1: Bağlantı noktaları doğrudan harici DNS hizmetinde yayınlanır

source: Use case 2: Floating IPs are published with associated port DNS attributes
id: Use case 2: IP mengambang diterbitkan dengan atribut DNS port terkait
tr_tr: Kullanım örneği 2: Kayan IP'ler ilişkili bağlantı noktası DNS öznitelikleriyle birlikte yayınlanır

source: Use case 3: Floating IPs are published in the external DNS service
id: Use case 3: IP mengambang diterbitkan dalam layanan DNS eksternal
tr_tr: Kullanım örneği 3: Değişken IP'ler harici DNS hizmetinde yayınlanır

source: Use cases
id: Use case (kasus penggunaan)
tr_tr: kullanım durumları

source: Use of ``macvtap`` is arbitrary. Only the self-service deployment examples require VLAN ID ranges. Replace ``VLAN_ID_START`` and ``VLAN_ID_END`` with appropriate numerical values.
id: Penggunaan ``macvtap`` ini sembarang. Hanya contoh pengerahan self-service memerlukan rentang ID VLAN. Gantikan ``VLAN_ID_START`` dan ``VLAN_ID_END`` dengan nilai-nilai numerik yang sesuai.
tr_tr: ``macvtap``in kullanımı isteğe bağlıdır. Yalnızca self servis dağıtım örnekleri VLAN ID aralıkları gerektirir. ``VLAN_ID_START`` ve ``VLAN_ID_END`` değerlerini uygun sayısal değerlerle değiştirin.

source: Use the :command:`neutron ext-list` client command to check if these extensions are enabled. Check ``agent`` and ``agent_scheduler`` are included in the output.
tr_tr: Bu uzantıların etkin olup olmadığını kontrol etmek için:command:`neutron ext-list` istemci komutunu kullanın. ``agent`` ve ``agent_scheduler`` işlevlerinin çıktıya dahil edilip edilmediğini kontrol edin.

source: Use the :command:`neutron port-chain-update` command to dynamically add or remove port pair groups or flow classifiers on a port chain.
id: Gunakan perintah :command:`neutron port-chain-update` untuk secara dinamis menambahkan atau menghapus kelompok pasangan port atau pengklasifikasi aliran pada rantai port.
tr_tr: Bir port zincirindeki port çift gruplarını veya akış sınıflandırıcılarını dinamik olarak eklemek veya kaldırmak için :command:`neutron port-chain-update` komutunu kullanın.

source: Use the :command:`neutron port-pair-group-update` command to perform dynamic scale-out or scale-in operations by adding or removing port pairs on a port pair group.
id: Gunakan perintah :command:`neutron port-pair-group-update` untuk melakukan scale-out dinamis atau operasi scale-in dengan menambahkan atau menghapus pasang port pada kelompok pasangan port.
tr_tr: Bir port çifti grubuna port çiftleri ekleyerek veya çıkartarak dinamik ölçeklendirme veya ölçeklendirme işlemleri gerçekleştirmek için :command:`neutron port-pair-group-update` komutunu kullanın.

source: Use the :command:`neutron rbac-show` command to see the details:
id: Gunakan perintah :command:`neutron rbac-show`, lihat rincian:
tr_tr: Detayları görmek için :command:`neutron rbac-show` komutunu kullanın:

source: Use the command :command:`openstack extension list --network` to verify that the ``Trunk Extension`` and ``Trunk port details`` extensions are enabled.
id: Gunakan perintah :command:`openstack extension list --network` untuk memverifikasi dimana ekstensi ``Trunk Extension`` dan ``Trunk port details`` diaktifkan.
tr_tr: ``Bilgi Aktarım Yolu eklentisi`` ve ``Bilgi aktarım yolu bağlantı noktası detayları`` uzantılarının etkin olduğunu doğrulamak için :command:`openstack extension list --network` komutunu kullanın.

source: Use the following example configuration as a template to add support for high-availability using DVR to an existing operational environment that supports self-service networks.
id: Menggunakan contoh konfigurasi berikut sebagai template untuk menambahkan dukungan untuk ketersediaan tinggi menggunakan DVR di lingkungan operasional yang ada yang mendukung jaringan self-service.
tr_tr: Aşağıdaki örnek yapılandırmayı, self servis ağları destekleyen mevcut bir operasyonel ortama DVR kullanarak yüksek kullanılabilirlik desteği eklemek için bir şablon olarak kullanın.

source: Use the following example configuration as a template to add support for high-availability using VRRP to an existing operational environment that supports self-service networks.
id: Gunakan contoh konfigurasi berikut sebagai template untuk menambahkan dukungan high-availability penggunaan VRRP untuk lingkungan operasional yang ada yang mendukung jaringan self-service.
tr_tr: Aşağıdaki örnek yapılandırmayı, self servis ağları destekleyen mevcut bir operasyonel ortama VRRP kullanarak yüksek kullanılabilirlik desteği eklemek için bir şablon olarak kullanın.

source: Use the following example configuration as a template to add support for self-service networks to an existing operational environment that supports provider networks.
id: Gunakan contoh konfigurasi berikut sebagai template untuk menambahkan dukungan untuk jaringan self-service untuk lingkungan operasional yang ada yang mendukung jaringan provider.
tr_tr: Sağlayıcı ağlarını destekleyen mevcut bir operasyon ortamına self servis ağlar için destek eklemek için aşağıdaki örnek yapılandırmayı şablon olarak kullanın.

source: Use the following example configuration as a template to add support for the Macvtap mechanism driver to an existing operational environment.
id: Gunakan konfigurasi contoh berikut sebagai template untuk menambahkan dukungan driver mekanisme Macvtap din lingkungan operasional yang ada.
tr_tr: Varolan bir operasyon ortamına Macvtap mekanizması sürücüsü desteği eklemek için aşağıdaki örnek yapılandırmayı şablon olarak kullanın.

source: Use the following example configuration as a template to deploy provider networks in your environment.
id: Gunakan konfigurasi contoh berikut sebagai template untuk menggunakan jaringan provider di lingkungan Anda.
tr_tr: Sağlayıcı ağlarını ortamınıza dağıtmak için aşağıdaki örnek yapılandırmayı bir şablon olarak kullanın.

source: Use the previous commands to assign the network to agents.
id: Gunakan perintah sebelumnya untuk menetapkan jaringan untuk agen.
tr_tr: Ağı ajanlara atamak için önceki komutları kullanın.

source: Use this script to remove empty bridges on compute nodes by running the following command:
id: Menggunakan skrip ini untuk menghapus jembatan kosong pada node komputasi dengan menjalankan perintah berikut:
tr_tr: Aşağıdaki komutu çalıştırarak, hesaplama düğümlerinde boş köprüleri kaldırmak için bu komut dosyasını kullanın:

source: User workflow
id: Alur kerja pengguna
tr_tr: Kullanıcı iş akışı

source: Users are encouraged to take these tools, test them, provide feedback, and then expand on the feature set to suit their own deployments; deployers that refrain from participating in this process intending to wait for a path that better suits their use case are likely to be disappointed.
id: Pengguna didorong untuk mengambil alat-alat ini, menguji alat mereka, memberikan umpan balik, dan kemudian memperluas pada pengaturan fitur yang sesuai dengan deployment mereka sendiri; deployers yang menahan diri dari berpartisipasi dalam proses ini berniat untuk menunggu jalan yang lebih baik sesuai dengan use case mereka mungkin akan kecewa.
tr_tr: Kullanıcıların bu araçları alması, test etmesi, geri bildirim sağlamaları ve daha sonra kendi dağıtımlarına uyacak şekilde özellik kümesini genişletmeleri önerilir; kullanım sürecine daha uygun bir yol beklemek isteyen bu sürece katılmayı bırakan görevlendiriciler hayal kırıklığına uğrayabilir.

source: Users can also integrate the Networking and Compute services with an external DNS. To accomplish this, the users have to:
id: Pengguna juga dapat mengintegrasikan layanan Networking dan Compute dengan DNS eksternal. Untuk mencapai hal ini, pengguna harus:
tr_tr: Kullanıcılar ayrıca Ağ ve Hesaplama servislerini harici bir DNS ile bütünleştirebilirler. Bunu gerçekleştirmek için kullanıcıların yapması gerekenler:

source: Users can control the behavior of the Networking service in regards to DNS using two attributes associated with ports, networks, and floating IPs. The following table shows the attributes available for each one of these resources:
id: Pengguna dapat mengontrol perilaku layanan Networking dalam hal DNS menggunakan dua atribut yang terkait dengan ports, jaringan, dan IP mengambang. Tabel berikut menunjukkan atribut yang tersedia untuk masing-masing sumber daya ini:
tr_tr: Kullanıcılar, bağlantı noktaları, ağlar ve yüzen IP'ler ile ilişkili iki özelliği kullanarak DNS açısından Ağ servisinin davranışını kontrol edebilirler. Aşağıdaki tablo, bu kaynaklardan her biri için kullanılabilir özellikleri gösterir:

source: Users create project networks for connectivity within projects. By default, they are fully isolated and are not shared with other projects. OpenStack Networking supports the following types of network isolation and overlay technologies.
id: Pengguna membuat jaringan proyek untuk konektivitas dalam proyek. Secara default, jeringan proyek sepenuhnya terisolasi dan tidak dibagi dengan proyek-proyek lainnya. OpenStack Networking mendukung jenis jaringan isolasi dan overlay teknologi.
tr_tr: Kullanıcılar, projeler arasında bağlantı için proje ağları oluşturur. Varsayılan olarak, tamamen izole edilmişlerdir ve diğer projelerle paylaşılmazlar. OpenStack Ağ aşağıdaki türden ağ izolasyonu ve bindirme teknolojilerini desteklemektedir.

source: Using DPDK in OVS requires the following minimum software versions:
id: Penggunaan DPDK di OVS membutuhkan perangkat lunak versi minimum berikut:
tr_tr: OVS'de DPDK'yı kullanmak için aşağıdaki minimum yazılım sürümleri gereklidir:

source: Using SLAAC for addressing
id: Penggunaan SLAAC untuk pengalamatan
tr_tr: Adresleme için SLAAC kullanılması

source: Using SR-IOV interfaces
id: Penggunaan SR-IOV interface
tr_tr: SR-IOV arabirimleri kullanma

source: Using a Prefix Delegation (PD) client to request a prefix for a subnet from a PD server
tr_tr: PD sunucusundan bir alt ağ için bir önek istemek için bir Önek Yetkilendirme (PD) istemcisi kullanma

source: Using subnet pools constrains what addresses can be used by requiring that every subnet be within the defined pool. It also prevents address reuse or overlap by two subnets from the same pool.
id: Penggunaan kolam subnet membatasi alamat dimana dapat digunakan dengan mewajibkan bahwa setiap subnet berada dalam kolam yang ditetapkan. Hal ini juga mencegah penggunaan ulang alamat atau tumpang tindih dengan dua subnet dari kolam yang sama.
tr_tr: Alt ağ havuzlarını kullanmak, her alt ağın tanımlı havuzun içinde olmasını gerektirerek hangi adreslerin kullanılabileceğini kısıtlar. Aynı havuzdan iki alt ağ tarafından adresin yeniden kullanılmasını veya çakışmasını önler.

source: Using this script can still trigger the original race condition. Only run this script if you have evacuated all instances off a compute node and you want to clean up the bridges. In addition to evacuating all instances, you should fence off the compute node where you are going to run this script so new instances do not get scheduled on it.
id: Penggunaan skrip ini masih dapat memicu kondisi race condition (kondisi perebutan). Hanya menjalankan skrip ini jika Anda telah mengevakuasi semua instance dari node komputasi dan Anda ingin membersihkan jembatan. Selain mengevakuasi semua instance, Anda harus memagari node komputasi ketika Anda akan menjalankan skrip ini sehingga instance baru tidak bisa dijadwalkan di node komputasi.
tr_tr: Bu komut dosyasını kullanmak, yine de orijinal yarış koşullarını tetikleyebilir. Tüm sunucuları bir hesaplama düğümünden çıkardıysanız ve köprüleri temizlemek istiyorsanız yalnızca bu komut dosyasını çalıştırın. Tüm sunucuları tahliye etmenin yanı sıra, yeni sunucuların üzerinde zamanlanmaması için bu komut dosyasını çalıştıracağınız hesaplama düğümünden uzak durmanız gerekir.

source: Using trunks and subports inside an instance
id: Penggunaan trunk dan subport dalam sebuah instance
tr_tr: Bir sunucuda bilgi aktarım yolu ve alt portlar kullanma

source: Using vhost-user interfaces
id: Penggunaan antarmuka vhost-user
tr_tr: vhost-user arabirimlerini kullanma

source: VLAN ID 101 (tagged)
tr_tr: VLAN ID 101 (etiketli)

source: VLAN ID 102 (tagged)
tr_tr: VLAN ID 102 (etiketli)

source: VLAN is a networking technology that enables a single switch to act as if it was multiple independent switches. Specifically, two hosts that are connected to the same switch but on different VLANs do not see each other's traffic. OpenStack is able to take advantage of VLANs to isolate the traffic of different projects, even if the projects happen to have instances running on the same compute host. Each VLAN has an associated numerical ID, between 1 and 4095. We say "VLAN 15" to refer to the VLAN with a numerical ID of 15.
id: VLAN adalah teknologi jaringan yang mengaktifkan sebuah switch tunggal untuk bertindak seolah-olah itu beberapa switch independen. Secara khusus, dua host yang terhubung ke switch yang sama tetapi pada VLAN yang berbeda tidak melihat lalu lintas masing-masing. OpenStack mampu memanfaatkan VLAN untuk mengisolasi lalu lintas dari proyek yang berbeda, bahkan jika proyek kebetulan punya instance yang sedang berjalan pada host komputasi yang sama. Setiap VLAN memiliki angka ID yang terkait, antara 1 sampai 4095. Kita mengatakan "VLAN 15" untuk merujuk pada VLAN dengan ID numerik dari 15.
tr_tr: VLAN, tek bir switch'in birden çok bağımsız switch gibi hareket etmesini sağlayan bir ağ oluşturma teknolojisidir. Özellikle, aynı anahtara ancak farklı VLAN'lara bağlı olan iki ana bilgisayar, birbirinin trafiğini görmez. OpenStack, projelerin aynı hesaplama ana sisteminde çalışan örnekleri olmasına rağmen, farklı projelerin trafiğini izole etmek için VLAN'lardan yararlanabilir. Her bir VLAN, 1 ila 4095 arasında bir sayısal kimliğe sahiptir. 15 numaralı kimliğiyle VLAN'a atıfta bulunmak için "VLAN 15" diyoruz.

source: VLANs
tr_tr: VLANlar

source: VPNaaS supports IPv6, but support in Kilo and prior releases will have some bugs that may limit how it can be used. More thorough and complete testing and bug fixing is being done as part of the Liberty release. IPv6-based VPN-as-a-Service is configured similar to the IPv4 configuration. Either or both the ``peer_address`` and the ``peer_cidr`` can specified as an IPv6 address. The choice of addressing modes and router modes described above should not impact support.
id: VPNaaS mendukung IPv6, namun dukungan di Kilo dan rilis sebelumnya akan memiliki beberapa bug yang mungkin membatasi bagaimana hal itu dapat digunakan. Lebih menyeluruh dan lengkap pengujian dan perbaikan bug telah dilakukan sebagai bagian dari rilis Liberty. IPv6 yang berbasis VPN-as-a-Service dikonfigurasi mirip dengan konfigurasi IPv4. Salah satu atau kedua ``peer_address`` dan `` peer_cidr`` dapat ditetapkan sebagai alamat IPv6. Pilihan mode pengalamatan dan mode router dijelaskan di atas seharusnya tidak berdampak dukungan.
tr_tr: VPNaaS, IPv6'yı desteklemektedir, ancak Kilo'daki ve önceki sürümlerin desteği, bunun nasıl kullanılacağını sınırlayabilecek bazı hatalarla karşı karşıya kalacaktır. Liberty sürümünün bir parçası olarak daha eksiksiz ve eksiksiz testler ve hata düzeltmeleri yapılmaktadır. IPv6 tabanlı bir VPN Hizmeti, IPv4 yapılandırmasına benzer şekilde yapılandırılmıştır. Bir veya her iki ``peer_address`` ve ``peer_cidr`` bir IPv6 adresi olarak belirtilebilir. Yukarıda açıklanan adresleme modları ve yönlendirici modlarının seçimi desteğe etki etmemelidir.

source: VXLAN and GRE are encapsulation protocols that create overlay networks to activate and control communication between compute instances. A Networking router is required to allow traffic to flow outside of the GRE or VXLAN project network. A router is also required to connect directly-connected project networks with external networks, including the Internet. The router provides the ability to connect to instances directly from an external network using floating IP addresses.
id: VXLAN dan GRE adalah protokol enkapsulasi yang membuat jaringan overlay untuk mengaktifkan dan mengendalikan komunikasi antara instance komputasi. Sebuah router jaringan diperlukan untuk mengizinkan lalu lintas mengalir di luar jaringan proyek GRE atau VXLAN. Sebuah router juga diperlukan untuk menghubungkan jaringan proyek langsung terhubung dengan jaringan eksternal, termasuk Internet. Router memberikan kemampuan untuk terhubung ke instance langsung dari jaringan eksternal menggunakan alamat IP mengambang.
tr_tr: VXLAN ve GRE, hesaplama sunucuları arasındaki iletişimi etkinleştirmek ve kontrol etmek için yer paylaşım ağları oluşturan kapsülleme protokolleridir. Trafik, GRE veya VXLAN proje ağının dışına akmasına izin vermek için bir ağ yönlendiricisi gereklidir. Doğrudan bağlı proje ağlarını, İnternet dahil olmak üzere harici ağlarla bağlamak için bir yönlendiriciye de ihtiyaç duyulmaktadır. Yönlendirici, yüzen IP adreslerini kullanarak harici bir ağdan doğrudan sunuculara bağlanma olanağı sağlar.

source: VXLAN multicast group configuration is not applicable for the Open vSwitch agent.
id: VXLAN konfigurasi kelompok multicast tidak berlaku untuk agen Open vSwitch.
tr_tr: VXLAN çok noktaya yayın grup yapılandırması Open vSwitch aracı için geçerli değildir.

source: Validating the requirements for auto-allocation
id: Memvalidasi persyaratan untuk auto-alokasi
tr_tr: Otomatik yer ayırma gereksinimlerini doğrulama

source: Various virtual networking resources support tags for use by external systems or any other clients of the Networking service API.
id: Berbagai sumber daya jaringan virtual mendukungan tag untuk digunakan oleh sistem eksternal atau klien lainnya dari Networking service API.
tr_tr: Çeşitli sanal ağ kaynakları, harici sistemler veya Ağ hizmet API'sinin diğer istemcileri tarafından kullanılmak üzere etiketleri destekler.

source: Verify addition of the BGP peer to the BGP speaker.
id: Lakukan verifikasi penambahan peer BGP ke BGP speaker.
tr_tr: BGP yayıncısına BGP eşi eklemeyi onayla.

source: Verify association of the provider network with the BGP speaker.
id: Lakukan verifikasi asosiasi jaringan provider dengan BGP speaker.
tr_tr: BGP yayıncı ile sağlayıcı ağ arasındaki ilişkiyi doğrula.

source: Verify creation of the internal high-availability network that handles VRRP *heartbeat* traffic.
id: Lakukan verifikasi penciptaan jaringan high-availability internal yang menangani VRRP lalu lintas *heartbeat*.
tr_tr: VRRP *heartbeat* trafiğini işleyen dahili yüksek kullanılabilirlikli ağın oluşturulmasını doğrulayın.

source: Verify distributed routing on the router.
id: Lakukan verifikasi routing terdistribusikan pada router.
tr_tr: Yönlendirici üzerinde dağıtık yönlendirmeyi doğrula.

source: Verify failover operation
id: Verifikasi operasi pemulihan kegagalan
tr_tr: Yük devretme işlemini doğrula

source: Verify network operation
id: Lakukan verifikasi operasi jaringan
tr_tr: Ağ işlemlerini doğrula

source: Verify presence and operation of each BGP dynamic routing agent.
id: Lakukan verifikasi keberadaan dan operasi masing-masing agen routing dinamis BGP.
tr_tr: Her bir BGP dinamik yönlendirme aracının varlığını ve çalışmasını doğrulayın.

source: Verify presence and operation of the agents.
id: Memverifikasi keberadaan dan operasi dari agen.
tr_tr: Ajanların varlığını ve işlevini doğrula.

source: Verify presence and operation of the agents:
id: Memverifikasi keberadaan dan operasi agen:
tr_tr: Ajanların varlığını ve çalışmasını doğrulayın:

source: Verify scheduling of the BGP speaker to the agent.
id: Lakukan verifikasi penjadwalan BGP speaker untuk agen.
tr_tr: BGP yayıncısını ajana zamanlamayı onayla.

source: Verify service operation
id: Melakukan verifikasi operasi layanan
tr_tr: Servis işlemini doğrula

source: Verify that each IPv4 subnet associates with at least one DHCP agent.
id: Pastikan bahwa setiap subnet IPv4 berasosiasi dengan setidaknya satu agen DHCP.
tr_tr: Her IPv4 alt ağının en az bir DHCP aracı ile ilişkili olduğunu doğrulayın.
