Repository: 25hours/openstack-manuals
Catalog: doc/networking-guide/source/locale/*/LC_MESSAGES/networking-guide.po
Languages: id, tr_tr

source: The IP address allocation pool starting at ``.11`` improves clarity of the diagrams. You can safely omit it.
id: Kolam alokasi alamat IP mulai ``.11`` meningkatkan kejelasan diagram. Anda dapat dengan aman menghilangkan itu.
tr_tr: ``.11``'den başlayan IP adres tahsis havuzu çizimlerin açıklığını arttırır. Güvenli bir şekilde çıkarabilirsiniz.

source: The IPv4 address resides in a private IP address range (RFC1918). Thus, the Networking service performs source network address translation (SNAT) for the instance to access external networks such as the Internet. Access from external networks such as the Internet to the instance requires a floating IPv4 address. The Networking service performs destination network address translation (DNAT) from the floating IPv4 address to the instance IPv4 address on the self-service network. On the other hand, the Networking service architecture for IPv6 lacks support for NAT due to the significantly larger address space and complexity of NAT. Thus, floating IP addresses do not exist for IPv6 and the Networking service only performs routing for IPv6 subnets on self-service networks. In other words, you cannot rely on NAT to "hide" instances with IPv4 and IPv6 addresses or only IPv6 addresses and must properly implement security groups to restrict access.
id: Alamat IPv4 berada dalam kisaran alamat IP pribadi (RFC1918). Dengan demikian, layanan Networking melakukan penterjemahan alamat jaringan sumber (SNAT) instance untuk mengakses jaringan eksternal seperti Internet. Akses dari jaringan eksternal seperti Internet untuk instance memerlukan alamat IPv4 mengambang. Layanan Networking melakukan penterjemahan alamat jaringan tujuan (DNAT) dari alamat IPv4 mengambang ke alamat IPv4 instance pada jaringan self-service . Di sisi lain, arsitektur layanan Networking untuk IPv6 tidak memiliki dukungan untuk NAT karena ruang alamat lebih besar (larger address space) secara nyata dan kompleksitas NAT. Dengan demikian, alamat IP mengambang tidak ada untuk IPv6 dan layanan Networking hanya melakukan routing untuk subnet IPv6 pada jaringan self-service. Dengan kata lain, Anda tidak dapat mengandalkan NAT untuk "hide" instance dengan alamat IPv4 dan IPv6 atau hanya alamat IPv6 dan harus menerapkan secara benar kelompok keamanan untuk membatasi akses.
tr_tr: IPv4 adresi, özel bir IP adres aralığında (RFC1918) bulunur. Böylece, Ağ hizmeti, sunucunun Internet gibi harici ağlara erişmesi için kaynak ağ adresi çevirisi (SNAT) gerçekleştirir. İnternet gibi harici ağlardan sunucuya erişim, kayan bir IPv4 adresini gerektirir. Ağ hizmeti, kayan IPv4 adresinden self servis ağdaki sunucu IPv4 adresine hedef ağ adresi çevirisi (DNAT) gerçekleştirir. Öte yandan, IPv6 için Ağ hizmet mimarisi, NAT'ın çok büyük adres alanı ve karmaşıklığı nedeniyle NAT'ı desteklemiyor. Böylece, kayan IP adresleri IPv6 için mevcut değildir ve Ağ hizmeti, yalnızca kendi kendine hizmet ağlarındaki IPv6 alt ağları için yönlendirme gerçekleştirir. Başka bir deyişle, IPv4 ve IPv6 adresleri veya sadece IPv6 adresleri ile "gizlemek" için NAT'a güvenemezsiniz ve erişimi kısıtlamak için güvenlik gruplarını doğru bir şekilde uygulamalısınız.

source: The IPv6 Protocol uses Internet Control Message Protocol packets (ICMPv6) as a way to distribute information about networking. ICMPv6 packets with the type flag set to 134 are called "Router Advertisement" packets, which contain information about the router and the route that can be used by guest instances to send network traffic.
tr_tr: IPv6 Protokolü, ağ hakkında bilgi dağıtmanın bir yolu olarak Internet Kontrol Mesajı Protokolü paketlerini (ICMPv6) kullanır. Tür bayrağı 134 olarak ayarlanmış ICMPv6 paketlerine, yönlendirici ve konuk sunucuları tarafından ağ trafiğini göndermek için kullanılabilecek yol hakkında bilgi içeren "Yönlendirici Tanıtımı" paketleri adı verilir.

source: The Internet Protocol (IP) specifies how to route packets between hosts that are connected to different local networks. IP relies on special network hosts called *routers* or *gateways*. A router is a host that is connected to at least two local networks and can forward IP packets from one local network to another. A router has multiple IP addresses: one for each of the networks it is connected to.
id: Internet Protocol (IP) menentukan bagaimana rute paket antara host yang terhubung ke jaringan lokal yang berbeda. IP bergantung pada host jaringan khusus yang disebut *routers* atau *gateways*. Sebuah router adalah host yang terhubung ke setidaknya dua jaringan lokal dan dapat meneruskan paket IP dari satu jaringan lokal ke yang lain. Sebuah router memiliki beberapa alamat IP: satu untuk masing-masing jaringan dimana router terhubung.
tr_tr: Internet Protokolü (IP), farklı yerel ağlara bağlı ana bilgisayarlar arasında nasıl paket yönlendirileceğini belirtir. IP, *yönlendiriciler* veya *ağ geçitleri* olarak adlandırılan özel ağ ana makinelerine güvenir. Yönlendirici, en az iki yerel ağa bağlı ve bir yerel ağdan diğerine IP paketlerini iletebilen bir ana makinedir. Bir yönlendiricinin birden fazla IP adresi vardır: bağlı olduğu her bir ağ için bir tane.

source: The L3 agent offers advanced layer 3 services, like virtual Routers and Floating IPs. It requires an L2 agent running in parallel.
id: Agen L3 menawarkan layanan lapisan 3 lanjutan, seperti Router virtual dan IP mengambang. Hal ini membutuhkan agen L2 berjalan secara paralel.
tr_tr: L3 ajanı, sanal Yönlendiriciler ve Yüzen IP'ler gibi gelişmiş katman 3 servisleri sunar. L2 ajanının paralelde çalışıyor olması gerekir.

source: The L3 metering agent enables layer3 traffic metering. It requires a running L3 agent on the same node.
id: Agen metering L3 mengaktifkan metering lalu lintas layer3. Hal ini membutuhkan agen L3 berjalan pada node yang sama.
tr_tr: L3 ölçüm ajanı, katman 3 trafik ölçümünü etkinleştirir. Aynı düğümde çalışan bir L3 ajanı gerektirir.

source: The LBaaS v2 agent collects four types of statistics for each load balancer every six seconds. Users can query these statistics with the :command:`neutron lbaas-loadbalancer-stats` command:
id: Agen LBaaS v2 mengumpulkan empat jenis statistik untuk setiap load balancer setiap enam detik. Pengguna dapat query statistik ini dengan perintah :command:`neutron lbaas-loadbalancer-stats`:
tr_tr: LBaaS v2 ajanı, her altı saniyede, her yük dengeleyici için istatistiklerin dört türünü toplar. Kullanıcılar bu istatistikleri :command:`neutron lbaas-loadbalancer-stats` komutu ile sorgulayabilir:

source: The Linux bridge agent configures Linux bridges to realize L2 networks for OpenStack resources.
id: Agen jembatan Linux mengkonfigurasi jembatan Linux untuk mewujudkan jaringan L2 untuk sumber daya OpenStack.
tr_tr: Linux köprü ajanı, OpenStack kaynakları için L2 ağları gerçekleştirmek için Linux köprülerini yapılandırır.

source: The Linux bridge agent lacks support for other overlay protocols such as GRE and Geneve.
id: Agen jembatan Linux memiliki dukungan untuk protokol overlay lain seperti GRE dan Geneve.
tr_tr: Linux köprü aracısı, GRE ve Geneve gibi diğer yerleşik protokolleri desteklemiyor.

source: The Linux bridge mechanism driver uses only Linux bridges and ``veth`` pairs as interconnection devices. A layer-2 agent manages Linux bridges on each compute node and any other node that provides layer-3 (routing), DHCP, metadata, or other network services.
id: Driver mekanisme jembatan Linux hanya menggunakan jembatan Linux dan pasang ``veth`` sebagai perangkat interkoneksi. Agen lapisan-2 mengelola jembatan Linux pada setiap node komputasi dan node lain yang menyediakan lapisan-3 (routing), DHCP, metadata, atau layanan jaringan lainnya.
tr_tr: Linux köprü mekanizması sürücüsü, arabağlantı aygıtları olarak yalnızca Linux köprüleri ve ``veth`` çiftlerini kullanır. Bir katman-2 aracı, her hesaplama düğümünde ve katman-3 (yönlendirme), DHCP, meta veri veya diğer ağ servislerini sağlayan diğer tüm düğümlerde Linux köprüleri yönetir.

source: The Load-Balancer-as-a-Service (LBaaS) API provisions and configures load balancers. The reference implementation is based on the HAProxy software load balancer.
id: Load-Balancer-as-a-Service (LBaaS) API menyediakan dan mengkonfigurasi penyeimbang beban. Implementasi referensi didasarkan pada penyeimbang beban perangkat lunak HAProxy.
tr_tr: Servis olarak Yük Dengeleyici (LBaaS) API, yük dengeleyicileri sunar ve yapılandırır. Referans uygulama HAProxy yazılımı yük dengeleyicisi tabanlıdır.

source: The ML2 plug-in supports trunking with the following mechanism drivers:
id: ML2 plug-in mendukung trunking dengan driver mekanisme sebagai berikut:
tr_tr: ML2 eklentisi aşağıdaki mekanizma sürücüleri ile bilgi aktarma yolunu destekler:

source: The MacVTap agent uses kernel MacVTap devices for realizing L2 networks for OpenStack instances. Network attachments for other resources like routers, DHCP, and so on are not supported.
id: Agen MacVTap menggunakan perangkat MacVTap kernel untuk mewujudkan jaringan L2 untuk instance OpenStack. Network attachment untuk sumber daya lain seperti router, DHCP, dan sebagainya tidak didukung.
tr_tr: MacVTap ajanı, OpenStack sunucuları için L2 ağını tanımak için çekirdek MacVTap aygıtını kullanır. Yönlendiriciler, DHCP ve benzeri gibi diğer kaynaklar için ağ ekleri desteklenmiyor.

source: The Macvtap mechanism driver for the ML2 plug-in generally increases network performance of instances.
id: Driver mekanisme Macvtap untuk ML2 plug-in umumnya meningkatkan kinerja jaringan instance.
tr_tr: ML2 eklentisi için Macvtap mekanizma sürücüsü genellikle sunucunun ağ performansını arttırır.

source: The Macvtap mechanism driver only applies to compute nodes. Otherwise, the environment resembles the prerequisite deployment example.
id: Driver mekanisme Macvtap hanya berlaku untuk komputasi node. Jika tidak, lingkungan menyerupai contoh prasyarat pengerahan.
tr_tr: Macvtap mekanizması sürücüsü yalnızca hesaplama düğümleri için geçerlidir. Aksi takdirde, ortam önkoşul dağıtım örneğine benzer.

source: The Metadata agent allows instances to access cloud-init meta data and user data via the network. It requires a running L2 agent on the same node.
id: Agen Metadata memungkinkan instance untuk mengakses data meta cloud-init dan data pengguna melalui jaringan. Hal ini membutuhkan agen L2 berjalan pada node yang sama.
tr_tr: Metadata aracısı, sunucuların cloud-init meta verilerine ve kullanıcı verilerine ağ üzerinden erişmesini sağlar. Aynı düğümde çalışan bir L2 ajanı gerektirir.

source: The Modular Layer 2 (ML2) neutron plug-in is a framework allowing OpenStack Networking to simultaneously use the variety of layer 2 networking technologies found in complex real-world data centers. The ML2 framework distinguishes between the two kinds of drivers that can be configured:
id: Modular Layer 2 (ML2) neutron plug-in adalah kerangka yang memungkinkan OpenStack Networking untuk secara bersamaan menggunakan berbagai teknologi jaringan lapisan 2 yang ditemukan di pusat data real-world yang kompleks. Kerangka ML2 membedakan antara dua jenis driver yang dapat dikonfigurasi:
tr_tr: Modular Layer 2 (ML2) neutron eklentisi OpenStack Ağ'in karmaşık gerçek dünya veri merkezlerinde bulunan çeşitli katman 2 ağ teknolojilerini aynı anda kullanmasına izin veren bir çerçeve. ML2 çerçevesi, yapılandırılabilen iki tür sürücü arasında ayrım yapar:

source: The Networking REST API is publicly read-only until after the migration is complete. During the migration, Networking REST API is read-write only to nova-api, and changes to Networking are only allowed via nova-api.
id: Networking REST API menjadi read-only publik sampai setelah migrasi selesai. Selama migrasi, Networking REST API menjadi read-write hanya untuk nova-api, dan perubahan Networking hanya diperbolehkan melalui nova-api.
tr_tr: Networking REST API'sı, taşıma işlemi tamamlanıncaya kadar herkese açık olarak salt okunurdur. Taşıma işlemi sırasında Networking REST API'sı yalnızca nova-api için okuma-yazma ve Ağlarda yapılan değişikliklere yalnızca nova-api yoluyla izin verilir.

source: The Networking client requires a protocol value. If the rule is protocol agnostic, you can use the ``any`` value.
id: Klien Networking membutuhkan nilai protokol. Jika aturan ini adalah protokol agnostik, Anda dapat menggunakan nilai ``any``.
tr_tr: Ağ istemcisi bir protokol değeri gerektirir. Eğer kural protokol bağımsızsa, ``any`` değerini kullanabilirsiniz.

source: The Networking service does not provide layer-3 services between segments. Instead, it relies on physical network infrastructure to route subnets. Thus, both the Networking service and physical network infrastructure must contain configuration for routed provider networks, similar to conventional provider networks. In the future, implementation of dynamic routing protocols may ease configuration of routed networks.
id: Layanan Networking tidak menyediakan layanan lapisan-3 antar segmen. Sebaliknya, hal itu bergantung pada infrastruktur jaringan fisik untuk rute subnet. Dengan demikian, layanan Networking dan infrastruktur jaringan fisik harus berisi konfigurasi untuk jaringan penyedia dialihkan (routed), mirip dengan jaringan penyedia konvensional. Di masa depan, pelaksanaan protokol routing dinamis dapat meringankan konfigurasi jaringan dialihkan (routed).
tr_tr: Ağ hizmeti, kesimler arasında katman-3 hizmetleri sağlamaz. Bunun yerine, alt ağları yönlendirmek için fiziksel ağ altyapısına güvenir. Bu nedenle hem Ağ hizmeti hem de fiziksel ağ altyapısı, geleneksel sağlayıcı ağlarına benzer şekilde yönlendirilmiş sağlayıcı ağları için yapılandırma içermelidir. Gelecekte, dinamik yönlendirme protokollerinin uygulanması yönlendirilen ağların yapılandırmasını kolaylaştırabilir.

source: The Networking service does not provision routing among segments. The operator must implement routing among segments of a provider network. Each subnet on a segment must contain the gateway address of the router interface on that particular subnet. For example:
id: Layanan Networking tidak penyediaan routing antara segmen. Operator harus mengimplementasikan routing antara segmen di jaringan penyedia. Setiap subnet di segmen harus berisi alamat gateway dari antarmuka router pada subnet tertentu itu. Sebagai contoh:
tr_tr: Ağ hizmeti, bölümler arasında yönlendirme sağlamaz. Operatör, bir sağlayıcı ağı kesimleri arasında yönlendirme uygulamalıdır. Bir segmentteki her alt ağda, söz konusu alt ağdaki yönlendirici arayüzünün ağ geçidi adresi bulunmalıdır. Örneğin:

source: The Networking service enables users to control the name assigned to ports by the internal DNS. To enable this functionality, do the following:
id: Layanan Networking memungkinkan pengguna untuk mengontrol nama ditugaskan untuk port oleh DNS internal. Untuk mengaktifkan fungsi ini, lakukan hal berikut:
tr_tr: Ağ hizmeti, kullanıcıların dahili DNS tarafından bağlantı noktalarına atanan adı kontrol etmelerini sağlar. Bu işlevi etkinleştirmek için aşağıdakileri yapın:

source: The Networking service implements routers using a layer-3 agent that typically resides at least one network node. Contrary to provider networks that connect instances to the physical network infrastructure at layer-2, self-service networks must traverse a layer-3 agent. Thus, oversubscription or failure of a layer-3 agent or network node can impact a significant quantity of self-service networks and instances using them. Consider implementing one or more high-availability features to increase redundancy and performance of self-service networks.
id: Layanan Networking menerapkan router yang menggunakan agen lapisan-3 yang biasanya berada pada setidaknya satu node jaringan. Bertentangan dengan jaringan provider yang menghubungkan instance untuk infrastruktur jaringan fisik pada lapisan-2, jaringan self-service harus melintasi agen lapisan-3. Dengan demikian, kelebihan permintaan atau kegagalan dari agen lapisan-3 atau node jaringan dapat berdampak pada jumlah yang signifikan dari jaringan self-service dan instance yang menggunakan mereka. Mempertimbangkan untuk menerapkan satu atau lebih fitur ketersediaan tinggi untuk meningkatkan redundansi dan kinerja jaringan swalayan.
tr_tr: Ağ hizmeti, genellikle en az bir ağ düğümünde bulunan bir katman-3 aracısını kullanan yönlendiricileri uygular. Sunucuları katman-2'deki fiziksel ağ altyapısına bağlayan sağlayıcı ağlarının aksine, self-servis ağları bir katman-3 aracısını dolaştırmalıdır. Böylece, bir katman 3 aracısının veya ağ düğümünün aşırı aboneliği veya başarısızlığı, önemli miktarda self servis ağları ve bunları kullanan örnekleri etkileyebilir. Self servis ağların fazlalığını ve performansını artırmak için bir veya daha fazla yüksek kullanılabilirlik özelliği uygulamayı düşünün.

source: The Networking service internal DNS resolution
id: Layanan Networking resolusi DNS internal
tr_tr: Ağ hizmeti dahili DNS çözümlemesi

source: The Networking service offers a load balancer feature called "LBaaS v2" through the ``neutron-lbaas`` service plug-in.
id: Layanan Networking menawarkan fitur penyeimbang beban (load balancer) disebut "LBaaS v2" melalui plug-in layanan ``neutron-lbaas``.
tr_tr: Ağ servisi, ``neutron-lbaas`` servis eklentisi ile "LBaaS v2" isimli yük dengeleme özelliği sunar.

source: The Networking service offers several methods to configure name resolution (DNS) for instances. Most deployments should implement case 1 or 2. Case 3 requires security considerations to prevent leaking internal DNS information to instances.
id: Layanan Networking menawarkan beberapa metode untuk mengkonfigurasi resolusi nama (DNS) untuk instance. Kebanyakan pengerahan harus menerapkan case 1 atau 2. Case 3 membutuhkan pertimbangan keamanan untuk mencegah kebocoran informasi DNS internal untuk instance.
tr_tr: Ağ hizmeti, sunucular için ad çözümlemesini (DNS) yapılandırmak için çeşitli yöntemler sunar. Pek çok dağıtım, durum 1 veya 2'yi uygulamalıdır. Durum 3, dahili DNS bilgilerini sunuculara sızdırmayı önlemek için güvenlik önlemleri gerektirir.

source: The Networking service only references the underlying physical network MTU. Changing the underlying physical network device MTU requires configuration of physical network devices such as switches and routers.
id: Layanan Networking hanya mereferensi MTU jaringan fisik yang mendasarinya. Perubahan MTU perangkat jaringan fisik yang mendasarinya memerlukan konfigurasi perangkat jaringan fisik seperti switch dan router.
tr_tr: Ağ hizmeti, yalnızca alttaki fiziksel ağ MTU'yu referanslar. Altta yatan fiziksel ağ aygıtının MTU'sunu değiştirmek, anahtarlar ve yönlendiriciler gibi fiziksel ağ aygıtlarının yapılandırılmasını gerektirir.

source: The Networking service provides a purge mechanism to delete the following network resources for a project:
id: Layanan Networking menyediakan mekanisme pembersihan untuk menghapus sumber daya jaringan berikut untuk proyek:
tr_tr: Ağ hizmeti, bir proje için aşağıdaki ağ kaynaklarını silmek için bir temizleme düzeneği sağlar:

source: The Networking service schedules a network to one of the agents within the selected zone as with ``WeightScheduler``. In this case, scheduler refers to ``dhcp_load_type`` as well.
id: Layanan Networking menjadwal jaringan ke salah satu agen dalam zona terpilih sebagai dengan ``WeightScheduler``. Dalam hal ini, scheduler mengacu juga ``dhcp_load_type``.
tr_tr: Ağ servisi ``WeightScheduler``'da olduğu gibi seçilen bölgedeki ajanlardan birine ağı zamanlar. Bu durumda, zamanlayıcı ``dhcp_load_type`` da başvurur.

source: The Networking service schedules a router to one of the agents within the selected zone as with ``LeastRouterScheduler``.
id: Layanan Networking menjadwal router untuk salah satu agen dalam zona terpilih sebagai dengan ``LeastRouterScheduler``.
tr_tr: Ağ hizmeti, bir yönlendiriciyi seçilen bölgedeki ajanlardan birine ``LeastRouterScheduler`` gibi programlar.

source: The Networking service supports the following underlying physical network architectures. Case 1 refers to the most common architecture. In general, architectures should avoid cases 2 and 3.
id: Layanan Networking mendukung arsitektur jaringan fisik yang mendasari berikutnya. Case 1 mengacu pada arsitektur yang paling umum. Secara umum, arsitektur harus menghindari case 2 dan 3.
tr_tr: Ağ hizmeti, aşağıdaki temel fiziksel ağ mimarilerini desteklemektedir. Durum 1, en yaygın mimariyi belirtir. Genel olarak, mimariler 2 ve 3. durumlardan kaçınmalıdır.

source: The Networking service supports underlying physical networks using jumbo frames and also enables instances to use jumbo frames minus any overlay protocol overhead. For example, an underlying physical network with a 9000-byte MTU yields a 8950-byte MTU for instances using a VXLAN network with IPv4 endpoints. Using IPv6 endpoints for overlay networks adds 20 bytes of overhead for any protocol.
id: Layanan Networking mendukung jaringan fisik yang mendasarinya menggunakan frame jumbo dan juga mengaktifkan instance menggunakan frame jumbo dikurangi overhead protokol overlay. Sebagai contoh, sebuah jaringan fisik yang mendasarinya dengan MTU 9000-byte menghasilkan MTU 8950-byte untuk instance menggunakan jaringan VXLAN dengan endpoint IPv4. Penggunaan endpoint IPv6 untuk jaringan overlay menambahkan 20 byte overhead untuk setiap protokol.
tr_tr: Ağ hizmeti, altta yatan fiziksel ağları jumbo çerçeveler kullanarak destekler ve ayrıca örneklerin jumbo çerçevelerden herhangi bir yer paylaşım protokolü ek yükünü kullanmasını sağlar. Örneğin, 9000 baytlık bir MTU'ya sahip olan fiziksel bir ağ, IPv4 uç noktaları olan bir VXLAN ağı kullanan örnekler için 8950 byte MTU üretir. Yer paylaşımlı ağlar için IPv6 bitiş noktalarını kullanmak, herhangi bir protokol için 20 baytlık ek masraf katar.

source: The Networking service uses the MTU of the underlying physical network to calculate the MTU for virtual network components including instance network interfaces. By default, it assumes a standard 1500-byte MTU for the underlying physical network.
id: Layanan Networking menggunakan MTU dari jaringan fisik yang mendasarinya untuk menghitung MTU untuk komponen jaringan virtual termasuk antarmuka jaringan instance. Secara default, hal ini diasumsikan MTU 1500-byte standard untuk jaringan fisik yang mendasari.
tr_tr: Ağ hizmeti, sunucu ağ arabirimleri de dahil olmak üzere sanal ağ bileşenleri için MTU'yu hesaplamak için alttaki fiziksel ağın MTU'sunu kullanır. Varsayılan olarak, temel fiziksel ağ için standart bir 1500 bayt MTU varsayar.

source: The Networking service uses the layer-3 agent to provide router advertisement. Provider networks rely on physical network infrastructure for layer-3 services rather than the layer-3 agent. Thus, the physical network infrastructure must provide router advertisement on provider networks for proper operation of IPv6.
id: Layanan Networking menggunakan agen lapisan-3 untuk memberikan router advertisement. Jaringan penyedia mengandalkan infrastruktur jaringan fisik untuk lapisan layer-3 daripada agen layer-3. Dengan demikian, infrastruktur jaringan fisik harus menyediakan router advertisement pada jaringan provider untuk operasi IPv6 yang tepat.
tr_tr: Ağ hizmeti, yönlendirici tanıtımı sağlamak için katman-3 aracısını kullanır. Sağlayıcı ağları, katman-3 aracı yerine katman-3 hizmetleri için fiziksel ağ altyapısına dayalıdır. Dolayısıyla, fiziksel ağ altyapısı IPv6'nın düzgün çalışması için sağlayıcı ağlarında yönlendirici tanıtımı sağlamalıdır.
