Repository: 25hours/openstack-manuals
Catalog: doc/networking-guide/source/locale/*/LC_MESSAGES/networking-guide.po
Languages: id, tr_tr

source: For networked software applications to communicate over an IP network, they must use a protocol layered atop IP. These protocols occupy the fourth layer of the OSI model known as the *transport layer* or *layer 4*. See the `Protocol Numbers <http://www.iana.org/assignments/protocol-numbers/protocol-numbers.xhtml>`_ web page maintained by the Internet Assigned Numbers Authority (IANA) for a list of protocols that layer atop IP and their associated numbers.
id: Untuk aplikasi perangkat lunak jaringan yang berkomunikasi melalui jaringan IP, mereka harus menggunakan protokol yang berlapisan atop IP. Protokol ini menempati lapisan keempat dari model OSI yang dikenal sebagai *transport layer* atau *layer 4*. Lihat halaman web `Protocol Numbers <http://www.iana.org/assignments/protocol-numbers/protocol-numbers.xhtml>`_ yang dikelola oleh Internet Assigned Numbers Authority (IANA) untuk daftar protokol yang berlapisan atop IP dan nomor yang terkait.
tr_tr: Ağa bağlı yazılım uygulamaları bir IP ağı üzerinden iletişim kurmak için IP üstünde katmanlı bir protokol kullanmalıdır. Bu protokoller, *ulaşım katmanı* veya *katman 4* olarak bilinen OSI modelinin dördüncü katmanına işgal eder. IP'nin üst katmanını ve ilgili numaralarını listeleyen bir protokol listesi için İnternet Atanmış Numaralar Otoritesi (IANA) tarafından yapılmakta olan `Protokol Numaraları <http://www.iana.org/assignments/protocol-numbers/protocol-numbers.xhtml>`_ web sayfasına bakınız.

source: For production deployments, we recommend at least three network nodes with sufficient resources to handle network traffic for the entire environment if one network node fails. Also, the remaining two nodes can continue to provide redundancy.
id: Untuk pengerahan produksi, kami sarankan setidaknya tiga node jaringan dengan sumber daya yang cukup untuk menangani lalu lintas jaringan untuk seluruh lingkungan jika salah satu simpul jaringan gagal. Disamping itu, dua node yang tersisa dapat terus memberikan redundansi.
tr_tr: Gerçek sistem kurulumları için, bir ağ düğümü başarısız olursa, tüm çevre için ağ trafiğini işlemek için yeterli kaynağa sahip en az üç ağ düğümünü öneriyoruz. Ayrıca, geriye kalan iki düğüm yedeklilik sağlamaya devam edebilir.

source: For the above two attributes to be effective, ``enable_dhcp`` of the subnet object must be set to True.
id: Untuk dua atribut di atas supaya menjadi efektif, ``enable_dhcp`` dari objek subnet harus diatur ke True.
tr_tr: Yukarıdaki iki niteliğin etkili olması için, alt ağ nesnesinin ``enable_dhcp`` değeri True olarak ayarlanmalıdır.

source: For typical underlying physical network architectures that implement a single MTU value, you can leverage jumbo frames using two options, one in the ``neutron.conf`` file and the other in the ``ml2_conf.ini`` file. Most environments should use this configuration.
id: Untuk arsitektur jaringan fisik yang mendasarinya yang khas yang menerapkan nilai MTU tunggal, Anda dapat memanfaatkan frame jumbo menggunakan dua pilihan, satu di file ``neutron.conf`` dan yang lainnya di file ``ml2_conf.ini``. Kebanyakan lingkungan harus menggunakan konfigurasi ini.
tr_tr: Tek bir MTU değerini uygulayan tipik altta yatan fiziksel ağ mimarileri için, biri ``neutron.conf`` dosyasında, diğeri ``ml2_conf.ini`` dosyasında olmak üzere iki seçenek kullanarak jumbo çerçevelerden yararlanabilirsiniz. Çoğu ortam bu yapılandırmayı kullanmalıdır.

source: Forwarding DataBase (FDB) population is an L2 agent extension to OVS agent or Linux bridge. Its objective is to update the FDB table for existing instance using normal port. This enables communication between SR-IOV instances and normal instances. The use cases of the FDB population extension are:
id: Populasi Forwarding DataBase (FDB) adalah L2 agent extension untuk OVS agent atau Linux bridge. Tujuannya adalah untuk memperbarui tabel FDB pada instance yang ada menggunakan port normal. Hal ini mengaktifkan komunikasi antara instance SR-IOV dan instance normal. Use case ekstensi populasi FDB adalah:
tr_tr: Yönlendirmeli Veri Tabanı (FDB) nüfusu, OVS aracısı veya Linux köprüsüne yönelik bir L2 aracı uzantısıdır. Amacı normal port kullanarak mevcut sunucu için FDB tablosunu güncellemektir. Bu, SR-IOV sunucuları ile normal sunucular arasındaki iletişimi sağlar. FDB nüfus uzantısı kullanım durumları şunlardır:

source: From the Liberty release onwards, OpenStack Networking supports IPv6 prefix delegation. This section describes the configuration and workflow steps necessary to use IPv6 prefix delegation to provide automatic allocation of subnet CIDRs. This allows you as the OpenStack administrator to rely on an external (to the OpenStack Networking service) DHCPv6 server to manage your project network prefixes.
id: Dari rilis Liberty dan seterusnya, OpenStack Networking mendukung IPv6 prefix delegation. Bagian ini menjelaskan langkah konfigurasi dan alur kerja yang diperlukan untuk menggunakan IPv6 prefix delegation untuk memberikan alokasi otomatis subnet CIDR. Hal ini memungkinkan Anda sebagai administrator OpenStack mengandalkan server DHCPv6 eksternal (ke layanan OpenStack Networking) untuk mengelola prefix jaringan proyek Anda.
tr_tr: Liberty sürümünden bu yana, OpenStack Networking IPv6 önek yetkilendirmesini desteklemektedir. Bu bölüm, alt ağ CIDR'lerinin otomatik olarak atanmasını sağlamak için IPv6 önek temsilciliğini kullanmak için gereken yapılandırmayı ve iş akışı adımlarını açıklar. Bu, OpenStack yöneticisinin, proje ağ öneklerini yönetmek için harici (OpenStack Ağ hizmeti) DHCPv6 sunucusuna güvenmesini sağlar.

source: Function: Firewall
tr_tr: Fonksiyon: Güvenlik Duvarı

source: Function: Intrusion detection system (IDS)
tr_tr: Fonksiyon: Saldırı tespit sistemi (IDS)

source: Fundamentally, SFC routes packets through one or more service functions instead of conventional routing that routes packets using destination IP address. Service functions essentially emulate a series of physical network devices with cables linking them together.
id: Pada dasarnya, SFC me-rute paket melalui satu atau lebih fungsi pelayanan bukan routing konvensional yang me-rute paket menggunakan alamat IP tujuan. Fungsi layanan pada dasarnya meniru serangkaian perangkat jaringan fisik dengan kabel yang menghubungkan mereka bersama-sama.
tr_tr: Temel olarak SFC, paketleri hedef IP adresini kullanarak yönlendiren geleneksel yönlendirme yerine bir veya daha fazla hizmet işleviyle paket yönlendirir. Servis fonksiyonları, aslında, kabloları bir araya getiren bir dizi fiziksel ağ cihazını taklit eder.

source: Future support
id: Dukungan di masa depan
tr_tr: Gelecek destek

source: GRE and VXLAN
id: GRE dan VXLAN
tr_tr: GRE ve VXLAN

source: Gateway
id: Gateway (gerbang)
tr_tr: Geçit

source: Gateway (via physical network infrastructure)
id: Gateway (melalui infrastruktur jaringan fisik)
tr_tr: Ağ geçidi (fiziksel ağ altyapısı yoluyla)

source: Gateway on the provider network
id: Gateway jaringan provider
tr_tr: Sağlayıcı ağ üzerinde geçit

source: Generic routing encapsulation (GRE)
tr_tr: Genel yönlendirme kapsüllemesi (GRE)

source: Generic routing encapsulation (GRE) is a protocol that runs over IP and is employed when delivery and payload protocols are compatible but payload addresses are incompatible. For instance, a payload might think it is running on a datalink layer but it is actually running over a transport layer using datagram protocol over IP. GRE creates a private point-to-point connection and works by encapsulating a payload. GRE is a foundation protocol for other tunnel protocols but the GRE tunnels provide only weak authentication.
id: Generic routing encapsulation (GRE) adalah protokol yang berjalan di atas IP dan digunakan saat pengiriman dan protokol payload yang kompatibel tetapi alamat payload tidak kompatibel. Misalnya, payload mungkin diperlirakan akan berjalan pada lapisan datalink tetapi sebenarnya berjalan di atas lapisan transport menggunakan protokol datagram over IP. GRE membuat koneksi point-to-point private dan bekerja dengan encapsulating payload. GRE adalah protokol dasar untuk protokol terowongan (terowongan) lain tetapi terowongan GRE hanya menyediakan otentikasi lemah.
tr_tr: Genel yönlendirme kapsülleme (GRE), IP üzerinden çalışan ve teslimat ve yükleme protokolleri uyumlu ancak yük taşıma adresleri uyumsuz olduğunda uygulanan bir protokoldür. Örneğin, bir yük, bir veri hattı katmanı üzerinde çalıştığını düşünebilir, ancak aslında, IP üzerinden veri birimi protokolünü kullanarak bir aktarım katmanı üzerinde çalışıyor demektir. GRE özel bir noktadan noktaya bağlantı oluşturur ve bir yükü kapsülleyerek çalışır. GRE, diğer tünel protokolleri için bir temel protokolüdür ancak GRE tünelleri yalnızca zayıf kimlik doğrulama sağlar.

source: Get Me A Network
id: Get Me A Network (dapatkan saya jaringan)
tr_tr: Bana Bir Ağ Al

source: Get Network IP address availability for all IPv4 networks:
id: Dapatkan ketersediaan alamat IP jaringan untuk semua jaringan IPv4:
tr_tr: Tüm IPv4 ağları için Ağ IP adresi kullanılabilirliği alın:

source: Get Network IP address availability for all IPv6 networks:
id: Dapatkan ketersediaan alamat IP jaringan untuk semua jaringan IPv6:
tr_tr: Tüm IPv6 ağları için Ağ IP adresi kullanılabilirliği alın:

source: Get Network IP address availability statistics for a specific network:
id: Dapatkan statistik ketersediaan alamat IP jaringan untuk jaringan tertentu:
tr_tr: Belirli bir ağ için Ağ IP adresi kullanılabilirliği istatistiklerini edinin:

source: Get list of resources with ``not-tags-any`` filter:
id: Dapatkan daftar sumber daya dengan penyaring ``not-tags-any``:
tr_tr: ``not-tags-any`` filtresiyle kaynak listesini çekin:

source: Get list of resources with ``not-tags`` filter:
id: Dapatkan daftar sumber daya dengan penyaring ``not-tags```:
tr_tr: ``not-tags`` filtresiyle kaynak listesini çekin:

source: Get list of resources with ``tags-any`` filter:
id: Dapatkan daftar sumber daya dengan penyaring ``tag-any``:
tr_tr: ``tags-any`` filtresiyle kaynak listesini çekin:

source: Get list of resources with ``tags`` filter:
id: Dapatkan daftar sumber daya dengan penyaring ``tags``:
tr_tr: ``tags`` filtresiyle kaynak listesini çekin:

source: Get list of resources with tag filters from networks. The networks are: test-net1 with "red" tag, test-net2 with "red" and "blue" tags, test-net3 with "red", "blue", and "green" tags, and test-net4 with "green" tag.
id: Dapatkan daftar sumber daya dengan filter tag dari jaringan. Jaringan menjadi are: test-net1 dengan tag "red", test-net2 dengan tag "red" and "blue", test-net3 dengan tag "red", "blue", dan "green", dan test-net4 dengan tag "green".
tr_tr: Ağlardaki etiket filtreleri ile kaynakların listesini alın. Ağlar: "kırmızı" etiketli test-net1, "kırmızı" ve "mavi" etiketli test-net2, "kırmızı", "mavi" ve "yeşil" etiketli test-net3 ve "yeşil" etiketli test-net4.

source: Get the ``id`` of the network where you want the SR-IOV port to be created:
id: Dapatkan ``id`` dari jaringan dimana Anda ingin port SR-IOV yang akan dibuat:
tr_tr: SR-IOV bağlantı noktasının oluşturulmasını istediğiniz ağın ``id``sini alalım:

source: Glossary
tr_tr: Sözlük

source: Guest instance obtains IPv6 address from OpenStack managed radvd using SLAAC and optional info from dnsmasq using DHCPv6.
id: Guest instance memperoleh alamat IPv6 dari OpenStack dikelola dengan radvd menggunakan SLAAC dan info opsional dari dnsmasq menggunakan DHCPv6.
tr_tr: Misafir sunucu, OpenApp yönetilen radvd'ten SLAAC kullanarak IPv6 adresini ve DHCPv6 kullanarak dnsmasq'tan isteğe bağlı bilgi alır.

source: Guest instance obtains IPv6 address from OpenStack managed radvd using SLAAC.
id: Guest instance memperoleh alamat IPv6 dari OpenStack dikelola dengan radvd menggunakan SLAAC.
tr_tr: Konuk örneği, SLAAC kullanarak OpenStack tarafından yönetilen radvd'ten IPv6 adresini alır.

source: Guest instance obtains IPv6 address from dnsmasq using DHCPv6 stateful and optional info from dnsmasq using DHCPv6.
id: Guest instance memperoleh alamat IPv6 dari dnsmasq menggunakan DHCPv6 stateful dan info opsional dari dnsmasq menggunakan DHCPv6.
tr_tr: Misafir sunucu DHCPv6 durumlu ve DHCPv6 kullanarak dnsmasq'tan isteğe bağlı bilgi kullanarak dnsmasq'tan IPv6 adresini alır.

source: Guest instance obtains IPv6 address from non-OpenStack router using SLAAC.
id: Guest instance memperoleh alamat IPv6 dari router non-OpenStack menggunakan SLAAC.
tr_tr: Misafir sunucu, SLAAC kullanarak OpenStack dışındaki yönlendiriciden IPv6 adresini alır.

source: HA of DHCP agents
id: HA untuk agen DHCP
tr_tr: DHCP ajanının HA'sı

source: HA routers are created on availability zones you selected when creating the router.
id: HA router diciptakan pada zona ketersediaan dimana Anda pilih pada saat pembuatan router.
tr_tr: HA yönlendiricileri, yönlendirici oluştururken seçtiğiniz kullanılabilirlik bölgelerinde oluşturulur.

source: Handles metadata, etc.
id: Tangani metadata, dll
tr_tr: Üst veri vs. yönetir.

source: Handles physical-virtual network transition
id: Tangani transisi jaringan physical-virtual
tr_tr: Fiziksel ve sanal ağ geçişlerini yönetir

source: Health monitor
tr_tr: Sağlık İzleme Sistemi

source: Here is an example of output from :command:`ip route show`:
id: Berikut adalah contoh output dari :command:`ip route show`:
tr_tr: :command:`ip route show` komutunun örnek çıktısı şöyle:

source: Here is the router we have used in our demonstration:
id: Berikut adalah router yang telah kami digunakan di demonstrasi kami:
tr_tr: Örneğimizde kullandığımız yönlendirici:

source: High availability
id: Ketersediaan tinggi
tr_tr: Yüksek kullanılabilirlik

source: High-availability features
id: Fitur high-availability
tr_tr: Yüksek kullanılabilirlik özellikleri

source: High-availability for DHCP
id: Ketersediaan tinggi untuk DHCP
tr_tr: DHCP için yüksek kullanılabilirlik

source: Historically, Open vSwitch (OVS) could not interact directly with *iptables* to implement security groups. Thus, the OVS agent and Compute service use a Linux bridge between each instance (VM) and the OVS integration bridge ``br-int`` to implement security groups. The Linux bridge device contains the *iptables* rules pertaining to the instance. In general, additional components between instances and physical network infrastructure cause scalability and performance problems. To alleviate such problems, the OVS agent includes an optional firewall driver that natively implements security groups as flows in OVS rather than Linux bridge and *iptables*, thus increasing scalability and performance.
id: Secara historis, Open vSwitch (OVS) tidak bisa berinteraksi langsung dengan *iptables* untuk melaksanakan kelompok keamanan. Dengan demikian, agen OVS dan layanan Compute menggunakan jembatan Linux antara setiap instance (VM) dan OVS integration bridge ``br-int`` untuk mengimplementasikan kelompok keamanan. Perangkat jembatan Linux berisi aturan *iptables* yang berkaitan dengan instance. Secara umum, komponen tambahan antara instance dan infrastruktur jaringan fisik menyebabkan skalabilitas dan masalah kinerja. Untuk mengatasi masalah tersebut, agen OVS memasukan driver firewall opsional yang secara native mengimplementasikan kelompok keamanan mengalir di OVS daripada jembatan Linux dan * iptables *, sehingga meningkatkan skalabilitas dan kinerja.
tr_tr: Tarihsel açıdan, Open VSwitch (OVS), güvenlik gruplarını uygulamak için doğrudan *iptables* ile etkileşim kuramazdı. Böylece, OVS aracı ve Hesaplama hizmeti, güvenlik gruplarını uygulamak için her sunucu (VM) ve OVS entegrasyon köprüsü ``br-int`` arasında bir Linux köprüsü kullanır. Linux köprü aygıtı, sunucuya ait *iptables* kurallarını içerir. Genel olarak, sunucular ve fiziksel ağ altyapısı arasındaki ek bileşenler ölçeklenebilirlik ve performans sorunlarına neden olur. Bu tür problemleri hafifletmek için OVS ajanı, güvenlik gruplarını doğal olarak Linux köprüsü ve *iptables* yerine OVS'de uygulayan isteğe bağlı bir güvenlik duvarı sürücüsü içerir; böylece ölçeklenebilirlik ve performans artar.

source: Horizon support
id: Dukungan Horizon
tr_tr: Horizon desteği

source: Host
tr_tr: Sunucu

source: Host *A* then sends Ethernet frames to host *B*.
id: Host *A* kemudian mengirimkan frame Ethernet ke host *B*.
tr_tr: *A* ana bilgisayarı Eternet çerçevesini *B* anabilgisayarına gönderir.

source: Host *B* responds with a response like this:
id: Host *B* merespon dengan respon seperti ini:
tr_tr: *B* ana bilgisayarı şöyle bir cevap döner:

source: Hosts connected to a network use the :term:`Dynamic Host Configuration Protocol (DHCP)` to dynamically obtain IP addresses. A DHCP server hands out the IP addresses to network hosts, which are the DHCP clients.
id: Host terhubung ke jaringan menggunakan :term:`Dynamic Host Configuration Protocol (DHCP)` untuk mendapatkan alamat IP secara dinamis. Sebuah server DHCP memberi alamat IP untuk jaringan host, yang merupakan klien DHCP.
tr_tr: Bir ağa bağlı olan ana bilgisayarlar, IP adreslerini dinamik olarak elde etmek için :term:`Dinamik Ana Bilgisayar Yapılandırma Protokolünü (DHCP)` kullanır. Bir DHCP sunucusu, IP adreslerini DHCP istemcileri olan ağ ana makinelerine verir.

source: How the 'shared' flag relates to these entries
id: Bagaimana 'shared' flag berkaitan dengan entri ini
tr_tr: 'paylaşımlı' bayrağı nasıl bu girdilerle ilişkilidir

source: How they work
id: Bagaimana mereka bekerja
tr_tr: Nasıl çalışırlar

source: How those instances communicate across a router to other subnets or the internet.
id: Bagaimana instance ini berkomunikasi melewati router ke subnet lain atau internet.
tr_tr: Bu sunucular bir yönlendirici üzerinden diğer alt ağlara veya internete nasıl iletişirler.

source: How those instances interact with other OpenStack services.
id: Bagaimana instance ini berinteraksi dengan layanan OpenStack lainnya.
tr_tr: Bu sunucular diğer OpenStack servisleriyle nasıl etkileşime girer.

source: How those instances receive an IPv6 address.
id: Bagaimana contoh menerima alamat IPv6.
tr_tr: Bu sunucular nasıl IPv6 adresi alırlar.

source: How to disable libvirt networks
id: Cara menonaktifkan jaringan libvirt
tr_tr: Nasıl libvirt ağları devre dışı bırakılır

source: How to enable dual-stack (IPv4 and IPv6 enabled) instances.
id: Cara mengaktifkan instance dual-stack (IPv4 dan IPv6 diaktifkan).
tr_tr: Çift-yapı (IPv4 ve IPv6 etkin) sunucuları nasıl etkinleştirilir.

source: However, libvirt is capable of providing networking services to the virtual machines that it manages. In particular, libvirt can be configured to provide networking functionality akin to a simplified, single-node version of OpenStack. Users can use libvirt to create layer 2 networks that are similar to OpenStack Networking's networks, confined to a single node.
id: Namun, libvirt mampu memberikan layanan jaringan untuk mesin virtual yang mengelolanya.. Secara khusus, libvirt dapat dikonfigurasi untuk menyediakan fungsionalitas jaringan mirip dengan jaringan sederhana, versi single-node dari OpenStack. Pengguna dapat menggunakan libvirt untuk membuat jaringan layer 2 yang mirip dengan jaringan OpenStack Networking's ini, terbatas pada node tunggal.
tr_tr: Bununla birlikte, libvirt yönettiği sanal makinelere ağ hizmetleri sağlayabilir. Özellikle, libvirt, OpenStack'in basitleştirilmiş, tek düğümlü sürümüne benzer bir ağ oluşturma işlevselliği sağlamak üzere yapılandırılabilir. Kullanıcılar libvirt'i, OpenStack Networking ağlarına benzer, tek bir düğümle sınırlı olan katman 2 ağlar oluşturmak için kullanabilirler.

source: However, load balancers deployed onto private or isolated networks need a floating IP address assigned if they must be accessible to external clients. To complete this step, you must have a router between the private and public networks and an available floating IP address.
id: Namun, balancers beban yang dikerahkan ke jaringan private atau jaringan terisolasi membutuhkan alamat IP mengambang yang ditetapkan jika mereka harus dapat diakses oleh klien eksternal. Untuk menyelesaikan langkah ini, Anda harus memiliki router antara jaringan private dan publik dan alamat IP mengambang yang tersedia.
tr_tr: Bununla birlikte, özel veya izole edilmiş ağlara yerleştirilen yük dengeleyicileri, harici istemciler tarafından erişilebilir olması gerekiyorsa, atanmış bir IP adresine ihtiyaç duyar. Bu adımı tamamlamak için özel ve genel ağlar arasında bir yönlendiriciniz ve mevcut bir kayan IP adresi olmalıdır.

source: IANA maintains a `registry of port numbers <http://www.iana.org/assignments/service-names-port-numbers/service-names-port-numbers.xhtml>`_ for many TCP-based services, as well as services that use other layer 4 protocols that employ ports. Registering a TCP port number is not required, but registering a port number is helpful to avoid collisions with other services. See `firewalls and default ports <https://docs.openstack.org/admin-guide/firewalls-default-ports.html>`_ in OpenStack Administrator Guide for the default TCP ports used by various services involved in an OpenStack deployment.
id: IANA memelihara `registry of port numbers <http://www.iana.org/assignments/service-names-port-numbers/service-names-port-numbers.xhtml>`_ untuk berbagai layanan berbasis TCP, serta layanan yang menggunakan protokol lapisan 4 lain yang mempekerjakan port. Pendaftaran nomor port TCP tidak diperlukan, tetapi pendaftaran nomor port adalah membantu untuk menghindari tabrakan dengan layanan lainnya. Lihat `firewalls and default ports <https://docs.openstack.org/admin-guide/firewalls-default-ports.html>`_ dalam OpenStack Administrator Guide untuk port TCP default yang digunakan oleh berbagai layanan yang terlibat dalam pengerahan OpenStack.
tr_tr: IANA, bağlantı noktalarını kullanan diğer katman 4 protokolleri gibi TCP tabanlı bir çok servis için bir `bağlantı noktası numara kaydı <http://www.iana.org/assignments/service-names-port-numbers/service-names-port-numbers.xhtml>`_ tutar. Bir TCP bağlantı noktası numarasını kaydetmek gerekli değildir ama bir bağlantı noktası numarasını kaydetmek diğer servislerle çakışmaları önler. Bir OpenStack sistemindekiler de dahil olmak üzere çeşitli servisler tarafından kullanılan varsayılan TCP bağlantı noktaları için OpenStack Yönetim Kılavuzunda `güvenlik duvarları ve varsayılan bağlantı noktaları <https://docs.openstack.org/admin-guide/firewalls-default-ports.html>`_na bakın.

source: IP address range 192.0.2.0/24 and fd00:192:0:2::/64
id: Rentang alamat IP 192.0.2.0/24 dan fd00:192:0:2::/64
tr_tr: 192.0.2.0/24 ve fd00:192:0:2::/64 IP adres aralığı

source: IP address ranges 203.0.113.0/24 and fd00:203:0:113::/64
id: Rentang alamat IP 203.0.113.0/24 dan fd00:203:0:113::/64
tr_tr: 203.0.113.0/24 ve fd00:203:0:113::/64 IP adres aralıkları

source: IP addresses 192.0.2.1 and fd00:192:0:2::1
id: Alamat IP 192.0.2.1 dan fd00:192:0:2::1
tr_tr: 192.0.2.1 ve fd00:192:0:2::1 IP adresleri

source: IP addresses 192.0.2.101 and fd00:192:0:2:0::101
id: Alamat IP 192.0.2.101 dan fd00:192:0:2:0::101
tr_tr: 192.0.2.101 ve fd00:192:0:2:0::101 IP adresleri

source: IP addresses 203.0.113.1 and fd00:203:0:113:0::1
id: Alamat IP 203.0.113.1 dan fd00:203:0:113:0::1
tr_tr: 203.0.113.1 ve fd00:203:0:113:0::1 IP adresleri

source: IP addresses 203.0.113.101 and fd00:203:0:113:0::101
id: Alamat IP 203.0.113.101 dan fd00:203:0:113:0::101
tr_tr: 203.0.113.101 ve fd00:203:0:113:0::101 IP adresleri
