Repository: 25hours/openstack-manuals
Catalog: doc/networking-guide/source/locale/*/LC_MESSAGES/networking-guide.po
Languages: id, tr_tr

source: For IPv6, the router sends the packet to the next-hop IP address, typically the gateway IP address on the self-service network, via the self-service interface (8).
id: Untuk IPv6, router mengirimkan paket ke alamat IP next-hop, biasanya alamat IP gateway di jaringan self-service, melalui antarmuka self-service (8).
tr_tr: IPv6 için yönlendirici, paketi self servis arabirimi (8) aracılığıyla bir sonraki durak IP adresine, genellikle self-servis ağındaki ağ geçidi IP adresine gönderir.

source: For a detailed list of configuration options, see the related section in the `Configuration Reference <https://docs.openstack.org/ocata/config-reference/networking/networking_options_reference.html#dhcp-agent>`__.
id: Untuk daftar rinci pilihan konfigurasi, lihat bagian terkait di `Configuration Reference <https://docs.openstack.org/ocata/config-reference/networking/networking_options_reference.html#dhcp-agent>`__.
tr_tr: Yapılandırma seçeneklerinin detaylı bir listesi için, `Yapılandırma Kılavuzu <https://docs.openstack.org/ocata/config-reference/networking/networking_options_reference.html#dhcp-agent>`__ belgesinde ilgili bölüme bakın.

source: For a detailed list of configuration options, see the related section in the `Configuration Reference <https://docs.openstack.org/ocata/config-reference/networking/networking_options_reference.html#l3-agent>`__.
id: Untuk daftar rinci pilihan konfigurasi, lihat bagian terkait di `Configuration Reference <https://docs.openstack.org/ocata/config-reference/networking/networking_options_reference.html#l3-agent>`__.
tr_tr: Yapılandırma seçeneklerinin detaylı bir listesi için, `Yapılandırma Kılavuzu <https://docs.openstack.org/ocata/config-reference/networking/networking_options_reference.html#l3-agent>`__ belgesindeki ilgili bölüme bakınız.

source: For a detailed list of configuration options, see the related section in the `Configuration Reference <https://docs.openstack.org/ocata/config-reference/networking/networking_options_reference.html#linux-bridge-agent-configuration-options>`__.
id: Untuk daftar rinci pilihan konfigurasi, lihat bagian terkait di `Configuration Reference <https://docs.openstack.org/ocata/config-reference/networking/networking_options_reference.html#linux-bridge-agent-configuration-options>`__.
tr_tr: Yapılandırma seçeneklerinin detaylı bir listesi için, `Yapılandırma Kılavuzu <https://docs.openstack.org/ocata/config-reference/networking/networking_options_reference.html#linux-bridge-agent-configuration-options>`__ belgesinde ilgili bölüme bakınız.

source: For a detailed list of configuration options, see the related section in the `Configuration Reference <https://docs.openstack.org/ocata/config-reference/networking/networking_options_reference.html#metadata-agent>`__.
id: Untuk daftar rinci pilihan konfigurasi, lihat bagian terkait di `Configuration Reference <https://docs.openstack.org/ocata/config-reference/networking/networking_options_reference.html#metadata-agent>`__.
tr_tr: Yapılandırma seçeneklerinin detaylı bir listesi için, `Yapılandırma Kılavuzu <https://docs.openstack.org/ocata/config-reference/networking/networking_options_reference.html#metadata-agent>`__ belgesinde ilgili bölüme bakınız.

source: For a detailed list of configuration options, see the related section in the `Configuration Reference <https://docs.openstack.org/ocata/config-reference/networking/networking_options_reference.html#metering-agent>`__.
id: Untuk daftar rinci pilihan konfigurasi, lihat bagian terkait di `Configuration Reference <https://docs.openstack.org/ocata/config-reference/networking/networking_options_reference.html#metering-agent>`__.
tr_tr: Yapılandırma seçeneklerinin detaylı bir listesi için `Yapılandırma Kılavuzu <https://docs.openstack.org/ocata/config-reference/networking/networking_options_reference.html#metering-agent>`__nda ilgili bölüme bakınız.

source: For a detailed list of configuration options, see the related section in the `Configuration Reference <https://docs.openstack.org/ocata/config-reference/networking/networking_options_reference.html#modular-layer-2-ml2-macvtap-mechanism-configuration-options>`__.
id: Untuk daftar rinci pilihan konfigurasi, lihat bagian terkait di `Configuration Reference <https://docs.openstack.org/ocata/config-reference/networking/networking_options_reference.html#modular-layer-2-ml2-macvtap-mechanism-configuration-options>`__.
tr_tr: Detaylı yapılandırma seçeneklerinin bir listesi için, `Yapılandırma Kılavuzu <https://docs.openstack.org/ocata/config-reference/networking/networking_options_reference.html#modular-layer-2-ml2-macvtap-mechanism-configuration-options>`__ belgesindeki ilgili alana bakınız.

source: For a detailed list of configuration options, see the related section in the `Configuration Reference <https://docs.openstack.org/ocata/config-reference/networking/networking_options_reference.html#open-vswitch-agent-configuration-options>`__.
id: Untuk daftar rinci pilihan konfigurasi, lihat bagian terkait di `Configuration Reference <https://docs.openstack.org/ocata/config-reference/networking/networking_options_reference.html#open-vswitch-agent-configuration-options>`__.
tr_tr: Yapılandırma seçeneklerinin detaylı bir listesi için `Yapılandırma Kılavuzu <https://docs.openstack.org/ocata/config-reference/networking/networking_options_reference.html#open-vswitch-agent-configuration-options>`__ belgesindeki ilgili bölüme bakın.

source: For a detailed list of configuration options, see the related section in the `Configuration Reference <https://docs.openstack.org/ocata/config-reference/networking/networking_options_reference.html#sr-iov-agent-configuration-options>`__.
id: Untuk daftar rinci pilihan konfigurasi, lihat bagian terkait di `Configuration Reference <https://docs.openstack.org/ocata/config-reference/networking/networking_options_reference.html#sr-iov-agent-configuration-options>`__.
tr_tr: Yapılandırma seçeneklerinin detaylı bir listesi için, `Yapılandırma Kılavuzu <https://docs.openstack.org/ocata/config-reference/networking/networking_options_reference.html#sr-iov-agent-configuration-options>`__ belgesinde ilgili bölüme bakınız.

source: For additional information describing the problem, refer to: `Virtual switching technologies and Linux bridge. <http://events.linuxfoundation.org/sites/events/files/slides/LinuxConJapan2014_makita_0.pdf>`_
id: Untuk informasi tambahan menjelaskan masalah ini, lihat: `Virtual switching technologies and Linux bridge. <http://events.linuxfoundation.org/sites/events/files/slides/LinuxConJapan2014_makita_0.pdf>`_
tr_tr: Problemi açıklayan ek bilgi için, bakınız: `Sanal anahtarlama teknolojileri ve Linux köprüsü. <http://events.linuxfoundation.org/sites/events/files/slides/LinuxConJapan2014_makita_0.pdf>`_

source: For an ml2 plug-in, the list of supported QoS rule types is defined as a common subset of rules supported by all active mechanism drivers.
id: Untuk plug-in ml2, daftar tipe aturan QoS didukung didefinisikan sebagai subset umum aturan yang didukung oleh semua driver mekanisme aktif.
tr_tr: Bir ml2 eklentisi için, desteklenen QoS kural türleri listesi, tüm aktif mekanizma sürücüleri tarafından desteklenen kuralların ortak bir alt kümesi olarak tanımlanır.

source: For basic configuration of prerequisites, see the `Ocata Install Tutorials and Guides <https://docs.openstack.org/project-install-guide/ocata>`__.
id: Untuk konfigurasi dasar dari prasyarat, lihat `Ocata Install Tutorials and Guides <https://docs.openstack.org/project-install-guide/ocata>`__.
tr_tr: Ön gereksinimlerin temel yapılandırması için, bakınız `Ocata Kurulum Dökümanları ve Kılavuzları <https://docs.openstack.org/project-install-guide/ocata>`__.

source: For best performance, 10+ Gbps physical network infrastructure should support jumbo frames.
id: Untuk performa terbaik, 10+ Gbps infrastruktur jaringan fisik harus mendukung frame jumbo.
tr_tr: En iyi performans için, 10 + Gbps'lik fiziksel ağ altyapısı jumbo çerçeveleri desteklemelidir.

source: For each router, add one self-service subnet as an interface on the router.
id: Untuk setiap router, tambahkan satu subnet self-service sebagai interface pada router.
tr_tr: Her yönlendirici için, yönlendiricide bir arabirim olarak bir self servis alt ağ ekleyin.

source: For example, Linux provides namespaces for networking and processes, among other things. If a process is running within a process namespace, it can only see and communicate with other processes in the same namespace. So, if a shell in a particular process namespace ran :command:`ps waux`, it would only show the other processes in the same namespace.
id: Misalnya, Linux menyediakan namespace untuk jaringan dan proses. Jika suatu proses sedang berjalan dalam namespace proses, proses hanya bisa melihat dan berkomunikasi dengan proses lainnya dalam namespace yang sama. Jadi, jika suatu shell dimana proses namespace tertentu menjalankan :command:`ps waux`, proses hanya akan menunjukkan proses lain dalam namespace yang sama.
tr_tr: Örneğin, Linux diğer şeyler arasında ağ oluşturma ve süreçler için ad alanları sağlar. Bir süreç bir ad alanı içinde çalışıyorsa, yalnızca aynı ad alanındaki diğer işlemleri görebilir ve bunlarla iletişim kurabilir. Yani, belirli bir işlem ad alanındaki bir kabuk :command:`ps waux` komutunu çalıştırdıysa, sadece aynı ad alanındaki diğer işlemleri gösterecektir.

source: For example, ``provider1``, ``VLAN``, and ``2016``. See the `API reference <https://developer.openstack.org/api-ref/networking/v2/#segments>`_ for more information.
tr_tr: Örnek, ``provider1``, ``VLAN``, ve ``2016``. Daha fazla bilgi için `API kılavuzu <https://developer.openstack.org/api-ref/networking/v2/#segments>`_na bakınız.

source: For example, add flow classifier ``FC2`` to port chain ``PC1``:
id: Misalnya, tambahkan klassifier aliran ``FC2`` untuk rantai port ``PC1``:
tr_tr: Örneğin, ``PC1`` bağlantı noktası zincirine ``FC2`` akış sınıflandırıcısı ekleyin:

source: For example, add port pair group ``PPG3`` to port chain ``PC1``:
id: Misalnya, tambahkan grup pasangan port ``PPG3`` untuk rantai port ``PC1``:
tr_tr: Örneğin, ``PC1`` bağlantı noktası zincirine ``PPG3`` bağlantı noktası grubunu ekleyin:

source: For example, consider the following components:
id: Sebagai contoh, pertimbangkan komponen-komponen berikut:
tr_tr: Örneğin, aşağıdaki bileşenleri göz önüne alın:

source: For example, referencing a 4000-byte MTU for ``provider2``, a 1500-byte MTU for ``provider3``, and a 9000-byte MTU for other networks using the Open vSwitch agent:
id: Misalnya, referensi 4000-byte MTU untuk ``provider2``, 1500-byte MTU untuk ``provider3``, dan 9000-byte MTU untuk jaringan lain menggunakan agen Open vSwitch:
tr_tr: Örneğin, ``provider2`` için 4000 bayt MTU'ya, ``provider3`` için 1500 bayt MTU'ya ve Open vSwitch ajanı kullanan diğer ağlar için 9000 bayt MTU'ya başvurulur:

source: For example, referencing a 4000-byte MTU for overlay networks and a 9000-byte MTU for other networks:
id: Sebagai contoh, referensi 4000-byte MTU untuk jaringan overlay dan 9000-byte MTU untuk jaringan lain:
tr_tr: Örneğin, yer paylaşımlı ağlar için 4000 baytlık bir MTU ve diğer ağlar için 9000 baytlık bir MTU başvurma:

source: For example, referencing an underlying physical network with a 9000-byte MTU:
id: Sebagai contoh, referensi jaringan fisik yang mendasari dengan MTU 9000-byte:
tr_tr: Örneğin, altta yatan bir fiziksel ağa 9000 bayt MTU ile başvuruda bulunmak:

source: For example, to match any domain, bus 0a, slot 00, and all functions:
id: Misalnya, untuk mencocokkan domain apapun, bus 0a, slot 00, dan semua fungsi:
tr_tr: Örneğin, herhangi bir alana, 0a, 00 numaralı yuvaya ve tüm işlevlere uyacak şekilde:

source: For further information, see `v1 configuration guide <https://docs.openstack.org/ocata/networking-guide/fwaas-v1-scenario.html>`_ or `v2 configuration guide <https://docs.openstack.org/ocata/networking-guide/fwaas-v2-scenario.html>`_.
id: Untuk informasi lebih lanjut, lihat `v1 configuration guide <https://docs.openstack.org/ocata/networking-guide/fwaas-v1-scenario.html>`_ atau `v2 configuration guide <https://docs.openstack.org/ocata/networking-guide/fwaas-v2-scenario.html>`_.
tr_tr: Daha detaylı bilgi için, `v1 yapılandırma kılavuzu <https://docs.openstack.org/ocata/networking-guide/fwaas-v1-scenario.html>`_ veya `v2 yapılandırma kılavuzu <https://docs.openstack.org/ocata/networking-guide/fwaas-v2-scenario.html>`_na bakınız.

source: For general configuration, see the `Configuration Reference <https://docs.openstack.org/ocata/config-reference/>`_.
id: Untuk konfigurasi umum, lihat `Configuration Reference <https://docs.openstack.org/ocata/config-reference/>`_.
tr_tr: Genel yapılandırma için bakınız `Yapılandırma Kılavuzu <https://docs.openstack.org/ocata/config-reference/>`_.

source: For illustration purposes, the configuration examples typically reference the following IP address ranges:
id: Untuk tujuan ilustrasi, contoh konfigurasi biasanya mereferensi rentang alamat IP berikut:
tr_tr: Örnekleme amacıyla, yapılandırma örnekleri tipik olarak aşağıdaki IP adres aralıklarını referans alır:

source: For information on **Mellanox SR-IOV Ethernet ConnectX-3/ConnectX-3 Pro cards**, see `Mellanox: How To Configure SR-IOV VFs <https://community.mellanox.com/docs/DOC-1484>`_.
id: Untuk informasi tentang **Mellanox SR-IOV Ethernet ConnectX-3/ConnectX-3 Pro cards**, lihat `Mellanox: How To Configure SR-IOV VFs <https://community.mellanox.com/docs/DOC-1484>`_.
tr_tr: **Mellanox SR-IOV Ethernet ConnectX-3/ConnectX-3 Pro cards** ile ilgili daha fazla bilgi için, bakınız `Mellanox: SR-IOV VFler Nasıl Yapılandırılır <https://community.mellanox.com/docs/DOC-1484>`_.

source: For information on **QLogic SR-IOV Ethernet cards**, see `User's Guide OpenStack Deployment with SR-IOV Configuration <http://www.qlogic.com/solutions/Documents/UsersGuide_OpenStack_SR-IOV.pdf>`_.
id: Untuk informasi tentang **QLogic SR-IOV Ethernet cards**, lihat `User's Guide OpenStack Deployment with SR-IOV Configuration <http://www.qlogic.com/solutions/Documents/UsersGuide_OpenStack_SR-IOV.pdf>`_.
tr_tr: **QLogic SR-IOV Ethernet kartları** ile ilgili daha fazla bilgi için, bakınız `SR-IOV Yapılandırması ile OpenStack Yayına alma Kullanıcı Kılavuzu <http://www.qlogic.com/solutions/Documents/UsersGuide_OpenStack_SR-IOV.pdf>`_.

source: For instances with a fixed IPv4 address, the network node performs SNAT on north-south traffic passing from self-service to external networks such as the Internet. For instances with a fixed IPv6 address, the network node performs conventional routing of traffic between self-service and external networks.
id: Untuk instance dengan alamat IPv4 tetap, node jaringan melakukan SNAT pada lalu lintas utara-selatan melewati dari self-service untuk jaringan eksternal seperti Internet. Untuk instance dengan alamat IPv6 tetap, node jaringan melakukan routing yang konvensional lalu lintas antara self-service dan jaringan eksternal.
tr_tr: Sabit bir IPv4 adresine sahip sunucular için, ağ düğümü, self-servisten İnternet gibi harici ağlara geçen kuzey-güney trafiğinde SNAT gerçekleştirir. Sabit IPv6 adresli sunucularda, ağ düğümü, self-servis ve harici ağlar arasında trafiğin geleneksel yolunu gerçekleştirir.

source: For instances with a floating IPv4 address using a self-service network on a distributed router, the compute node containing the instance performs SNAT on north-south traffic passing from the instance to external networks such as the Internet and DNAT on north-south traffic passing from external networks to the instance. Floating IP addresses and NAT do not apply to IPv6. Thus, the network node routes IPv6 traffic in this scenario. north-south traffic passing between the instance and external networks such as the Internet.
id: Untuk instance dengan alamat IPv4 mengambang menggunakan jaringan self-service pada router terdistribusikan, komputasi node yang berisi instance melakukan SNAT pada lalu lintas utara-selatan lewat dari instance ke jaringan eksternal seperti Internet dan DNAT di lalu lintas utara-selatan yang lewat dari jaringan eksternal untuk instance. Alamat IP mengambang dan NAT tidak berlaku untuk IPv6. Dengan demikian, node jaringan me-rute lalu lintas IPv6 dalam skenario ini, lalu lintas utara-selatan yang melewati antara instance dan jaringan eksternal seperti Internet.
tr_tr: Dağıtılmış bir yönlendiricide bir self servis ağı kullanan bir kayan IPv4 adresine sahip sunucular için, sunucuyu içeren hesaplama düğümü, harici ağdan sunucuya geçen kuzey-güney trafiği üzerindeki Internet ve DNAT gibi sunucudan harici ağa geçen kuzey güney trafiği üzerinde SNAT'ı gerçekleştirir. Yüzen IP adresleri ve NAT IPv6'ya uygulanmaz. Bu sebeple, bu senaryoda, ağ düğümü IPv6 trafiğini yönlendirir. Internet gibi sunucu ile harici network arasında geçen kuzey-güney trafiği.

source: For instances with a floating IPv4 address, maintains state of network connections during failover as a side effect of 1:1 static NAT. The mechanism does not actually implement connection tracking.
id: Untuk instance dengan alamat IPv4 mengambang, pertahankan keadaan koneksi jaringan selama failover sebagai efek samping dari NAT statis 1:1. Mekanisme tidak secara benar melaksanakan pelacakan koneksi.
tr_tr: Yüzen bir IPv4 adresine sahip sunucular için, yerine çalışma esnasında ağ bağlantılarının durumunu 1:1 statik NAT'nin bir yan etkisi olarak korur. Mekanizma aslında bağlantı takibi uygulamıyor.

source: For instances with a floating IPv4 address, the network node performs SNAT on north-south traffic passing from the instance to external networks such as the Internet and DNAT on north-south traffic passing from external networks to the instance. Floating IP addresses and NAT do not apply to IPv6. Thus, the network node routes IPv6 traffic in this scenario.
id: Untuk instance dengan alamat IPv4 mengambang, node jaringan melakukan SNAT pada lalu lintas utara-selatan lewat dari instance ke jaringan eksternal seperti Internet dan DNAT pada lalu lintas utara-selatan lewat dari jaringan eksternal untuk instance. Alamat IP mengambang dan NAT tidak berlaku untuk IPv6. Dengan demikian, node jaringan me-rute lalu lintas IPv6 dalam skenario ini.
tr_tr: Yüzen bir IPv4 adresine sahip örnekler için ağ düğümü, sunucudan harici ağlardan kuzey-güney trafiğine Internet ve DNAT gibi harici ağlara geçen kuzey-güney trafiğinde SNAT gerçekleştirir. Değişken IP adresleri ve NAT, IPv6 için geçerli değildir. Böylece, ağ düğüm bu senaryoda IPv6 trafiğini yönlendirir.

source: For more details, see `Networking command-line client <https://docs.openstack.org/cli-reference/neutron.html>`_ in the OpenStack Command-Line Interface Reference.
id: Untuk lebih jelasnya, lihat `Networking command-line client <https://docs.openstack.org/cli-reference/neutron.html>`_ dalam OpenStack Command-Line Interface Reference.
tr_tr: Daha fazla detay için, OpenStack Komut Satırı Arayüz Kılavuzunda `Ağ komut satırı istemcisi <https://docs.openstack.org/cli-reference/neutron.html>`_ bölümüne bakınız.

source: For more details, see the `Configuration Reference <https://docs.openstack.org/ocata/config-reference/networking/networking_options_reference.html#modular-layer-2-ml2-plug-in-configuration-options>`__.
id: Untuk lebih jelasnya, lihat `Configuration Reference <https://docs.openstack.org/ocata/config-reference/networking/networking_options_reference.html#modular-layer-2-ml2-plug-in-configuration-options>`__.
tr_tr: Daha fazla bilgi için, `Yapılandırma Referansı <https://docs.openstack.org/ocata/config-reference/networking/networking_options_reference.html#modular-layer-2-ml2-plug-in-configuration-options>`__ belgesine bakınız.

source: For more details, see the `Networking configuration options <https://docs.openstack.org/ocata/config-reference/networking/networking_options_reference.html#modular-layer-2-ml2-plug-in-configuration-options>`__ of Configuration Reference.
id: Untuk lebih jelasnya, lihat `Networking configuration options <https://docs.openstack.org/ocata/config-reference/networking/networking_options_reference.html#modular-layer-2-ml2-plug-in-configuration-options>`__ dari Configuration Reference.
tr_tr: Daha fazla bilgi için, Yapılandırma Referansının `Ağ yapılandırma seçenekleri <https://docs.openstack.org/ocata/config-reference/networking/networking_options_reference.html#modular-layer-2-ml2-plug-in-configuration-options>`__ bölümüne bakınız.

source: For more details, see the related section in the `Configuration Reference <https://docs.openstack.org/ocata/config-reference/networking/networking_options_reference.html#security-groups>`__.
id: Untuk lebih jelasnya, lihat bagian terkait di `Configuration Reference <https://docs.openstack.org/ocata/config-reference/networking/networking_options_reference.html#security-groups>`__.
tr_tr: Daha fazla detay için `Yapılandırma Kılavuzu <https://docs.openstack.org/ocata/config-reference/networking/networking_options_reference.html#security-groups>`__ belgesinde ilgili bölüme bakınız.

source: For more information about the syntax for ``hw:mem_page_size``, refer to the `Flavors <https://docs.openstack.org/admin-guide/compute-flavors.html>`__ guide.
id: Untuk informasi lebih lanjut tentang sintaks untuk ``hw:mem_page_size``, mengacu kepada panduan `Flavors <https://docs.openstack.org/admin-guide/compute-flavors.html>`__.
tr_tr: ``hw:mem_page_size`` için sözdizimi hakkında daha fazla bilgi için, `Flavors <https://docs.openstack.org/admin-guide/compute-flavors.html>`__ kılavuzuna bakın.

source: For more information see the :ref:`config-sriov`.
id: Untuk informasi lebih lanjut lihat :ref:`config-sriov`.
tr_tr: Daha fazla bilgi için bknz :ref:`config-sriov`.

source: For more information, see the `developer documentation <https://docs.openstack.org/developer/neutron/devref/openvswitch_firewall.html>`_ and the `video <https://www.youtube.com/watch?v=SOHeZ3g9yxM>`_.
id: Untuk informasi lebih lanjut, lihat `developer documentation <https://docs.openstack.org/developer/neutron/devref/openvswitch_firewall.html>`_ and the `video <https://www.youtube.com/watch?v=SOHeZ3g9yxM>`_.
tr_tr: Daha fazla bilgi için, `geliştirici belgesi <https://docs.openstack.org/developer/neutron/devref/openvswitch_firewall.html>`_ ve `video <https://www.youtube.com/watch?v=SOHeZ3g9yxM>`_a bakınız.

source: For network types VLAN, GRE, VXLAN or GENEVE, the segmentation ID must be outside the ranges assigned to tenant networks.
tr_tr: VLAN, GRE, VXLAN veya GENEVE ağ türleri için, dilimleme ID'si kiracı ağlara atanan aralığın dışında olmak zorundadır.
