Repository: 25hours/openstack-manuals
Catalog: doc/networking-guide/source/locale/*/LC_MESSAGES/networking-guide.po
Languages: id, tr_tr

source: There will be three hosts in the setup.
id: Akan ada tiga host saat penyiapan.
tr_tr: Kurulumda üç sunucu olacak.

source: These IP addresses are not publicly routable, meaning that a host on the public Internet can not send an IP packet to any of these addresses. Private IP addresses are widely used in both residential and corporate environments.
id: Alamat IP ini tidak routable publik, yang berarti bahwa host di Internet publik tidak dapat mengirim paket IP ke salah satu alamat ini. Alamat IP private yang banyak digunakan dalam lingkungan perumahan maupun perusahaan.
tr_tr: Bu IP adresleri genel olarak yönlendirilemez, yani ortak İnternet'teki bir ana makinenin bu adreslerden hiçbirine bir IP paketi gönderemediği anlamına gelir. Özel IP adresleri hem konut hem de kurumsal ortamlarda yaygın olarak kullanılmaktadır.

source: These attributes can be set to the following values:
id: Atribut ini dapat diatur untuk nilai berikut:
tr_tr: Bu öznitelikler aşağıdaki değerlere ayarlanabilir:

source: These commands provide no output.
id: Perintah ini tidak memberikan output.
tr_tr: Bu komut hiç çıktı üretmedi.

source: These figures omit the controller node because it does not handle instance network traffic.
id: Angka ini menghilangkan controller node karena tidak menangani lalu lintas jaringan instance.
tr_tr: Bu rakamlar denetleyici düğümünü atlar, çünkü sunucu ağ trafiğini işleyemez.

source: These steps need to be performed on each logical segment that a VM needs to be connected to, and may require networking knowledge the user might not have.
id: Langkah ini perlu dilakukan pada setiap segmen logis dimana VM perlu terhubung ke segmen itu, dan mungkin memerlukan pengetahuan jaringan dimana pengguna mungkin tidak memilikinya.
tr_tr: Bu adımların, bir VM'nin bağlı olması gereken her mantıksal kesim üzerinde gerçekleştirilmesi gerekir ve kullanıcıya sahip olmadığı ağ bilgisi gerektirebilir.

source: Third-party drivers must provide their own migration mechanisms to convert existing OpenStack installations to their IPAM.
id: Driver pihak ketiga harus menyediakan mekanisme migrasi mereka sendiri untuk mengkonversi instalasi OpenStack yang ada ke IPAM mereka.
tr_tr: Üçüncü taraf sürücüler, mevcut OpenStack yüklemelerini kendi IPAM'larına dönüştürmek için kendi geçiş mekanizmalarını sağlamalıdır.

source: This architecture example augments :ref:`deploy-lb-provider` to support a nearly limitless quantity of entirely virtual networks. Although the Networking service supports VLAN self-service networks, this example focuses on VXLAN self-service networks. For more information on self-service networks, see :ref:`intro-os-networking-selfservice`.
id: Contoh arsitektur ini menambah :ref:`deploy-lb-provider` untuk mendukung sejumlah hampir tak terbatas dari jaringan virtual sepenuhnya. Meskipun layanan Networking mendukung jaringan self-service VLAN, contoh ini berfokus pada jaringan self-service VXLAN. Untuk informasi lebih lanjut tentang jaringan self-service, lihat :ref:`intro-os-networking-selfservice`.
tr_tr: Bu mimari örneği, neredeyse sınırsız miktarda tamamen sanal ağları desteklemek için :ref:`deploy-lb-provider` işlevini güçlendirir. Ağ hizmeti, VLAN self-servis ağlarını desteklese de, bu örnek VXLAN self servis ağlarına odaklanmaktadır. Self servis ağları hakkında daha fazla bilgi için bkz :ref:`intro-os-networking-selfservice`.

source: This architecture example augments :ref:`deploy-ovs-provider` to support a nearly limitless quantity of entirely virtual networks. Although the Networking service supports VLAN self-service networks, this example focuses on VXLAN self-service networks. For more information on self-service networks, see :ref:`intro-os-networking-selfservice`.
id: Contoh arsitektur ini menambah :ref:`deploy-ovs-provider` untuk mendukung jumlah hampir tak terbatas dari jaringan virtual sepenuhnya. Meskipun layanan Networking mendukung jaringan self-service VLAN, contoh ini berfokus pada jaringan self-service VXLAN. Untuk informasi lebih lanjut tentang jaringan self-service, lihat :ref:`intro-os-networking-selfservice`.
tr_tr: Bu mimari örneği, neredeyse sınırsız miktarda tamamen sanal ağları desteklemek için :ref:`deploy-ovs-provider` işlevini arttırıyor. Ağ hizmeti, VLAN self-servis ağlarını desteklese de, bu örnek VXLAN self servis ağlarına odaklanmaktadır. Self servis ağları hakkında daha fazla bilgi için bkz :ref:`intro-os-networking-selfservice`.

source: This architecture example augments the self-service deployment example with a high-availability mechanism using the Virtual Router Redundancy Protocol (VRRP) via ``keepalived`` and provides failover of routing for self-service networks. It requires a minimum of two network nodes because VRRP creates one master (active) instance and at least one backup instance of each router.
id: Contoh arsitektur ini menambah contoh pengerahan self-service dengan mekanisme high-availability menggunakan Virtual Router Redundancy Protocol (VRRP) melalui ``keepalived`` dan menyediakan failover routing untuk jaringan self-service. Hal ini membutuhkan minimal dua node jaringan karena VRRP menciptakan satu instance master (aktif) dan setidaknya satu instance cadangan dari setiap router.
tr_tr: Bu mimari örneği, self-servis yayına alma sunucusunu, ``keepalived`` yoluyla Sanal Yönlendirici Yedekleme Protokolünü (VRRP) kullanarak yüksek kullanılabilirlik mekanizması ile zenginleştirir ve self servis ağlar için yönlendirme yük devretmesini sağlar. VRRP, bir ana (etkin) sunucuyu ve her yönlendiricinin en az bir yedek kopyasını oluşturduğu için, en az iki ağ düğümü gerektirir.

source: This architecture example augments the self-service deployment example with the Distributed Virtual Router (DVR) high-availability mechanism that provides connectivity between self-service and provider networks on compute nodes rather than network nodes for specific scenarios. For instances with a floating IPv4 address, routing between self-service and provider networks resides completely on the compute nodes to eliminate single point of failure and performance issues with network nodes. Routing also resides completely on the compute nodes for instances with a fixed or floating IPv4 address using self-service networks on the same distributed virtual router. However, instances with a fixed IP address still rely on the network node for routing and SNAT services between self-service and provider networks.
id: Contoh arsitektur ini menambah contoh pengerahan self-service dengan mekanisme ketersediaan tinggi Distributed Virtual Router (DVR) yang menyediakan konektivitas antara jaringan self-service dan jaringan provider pada node komputasi bukannya pada node jaringan untuk skenario tertentu. Untuk instance dengan alamat IPv4 mengambang, routing antara jaringan self-service dan jaringan provider berada sepenuhnya pada node komputasi untuk menghilangkan titik tunggal kegagalan (single point of failure) dan masalah kinerja dengan node jaringan. Routing juga berada sepenuhnya pada node komputasi untuk instance dengan alamat IPv4 tetap atau mengambang dengan menggunakan jaringan self-service dari router virtual terdistribusikan yang sama. Namun, instance dengan alamat IP tetap masih mengandalkan node jaringan untuk routing dan layanan SNAT antara jaringan self-service dan provider.
tr_tr: Bu mimari örneği, belirli senaryolarda ağ düğümleri yerine hesaplama düğümlerinde self-servis ve sağlayıcı ağları arasında bağlantı sağlayan Dağıtılmış Sanal Yöneltici (DVR) yüksek kullanılabilirlik mekanizması ile self servis dağıtım örneğini zenginleştirir. Yüzen bir IPv4 adresine sahip sunucular için, self servis ve sağlayıcı ağları arasındaki yönlendirme, ağ düğümleri ile tekli başarısızlık ve performans sorunlarını gidermek için hesaplama düğümlerinde tamamen bulunur. Yönlendirme, aynı dağıtılmış sanal yönlendiricideki self servis ağları kullanarak sabit veya kayan IPv4 adresli sunucular için hesaplama düğümlerinde de bulunur. Bununla birlikte, sabit bir IP adresine sahip olan sunucular, yönlendirme ve düğüm hizmetleri için self-servis ve sağlayıcı ağları arasındaki ağ düğümüne hala güvenmektedir.

source: This architecture example provides layer-2 connectivity between instances and the physical network infrastructure using VLAN (802.1q) tagging. It supports one untagged (flat) network and up to 4095 tagged (VLAN) networks. The actual quantity of VLAN networks depends on the physical network infrastructure. For more information on provider networks, see :ref:`intro-os-networking-provider`.
tr_tr: Bu mimari örneği, VLAN (802.1q) etiketleme kullanarak sunucular ve fiziksel ağ altyapısı arasında katman-2 bağlantısı sağlar. Bir etiketsiz (düz) ağı ve 4095 etiketli (VLAN) ağları destekler. Gerçek VLAN ağlarının miktarı fiziksel ağ altyapısına bağlıdır. Sağlayıcı ağları hakkında daha fazla bilgi için :ref:`intro-os-networking-provider`.

source: This command is the sibling command for the previous one. Remove ``net2`` from the DHCP agent for HostA:
id: Perintah ini adalah perintah sibling (saudara kandung) untuk perintah sebelumnya. Hapus ``net2`` dari agen DHCP untuk HostA:
tr_tr: Bu komut, önceki komutun kardeşi komutudur. HostA için DHCP aracısından ``net2``yi çıkartın:

source: This command is to show which networks a given dhcp agent is managing.
id: Perintah ini adalah untuk menunjukkan jaringan dimana agen dhcp diberikan sedang mengelola.
tr_tr: Bu komut, belirli bir dhcp ajanının hangi ağları yönettiğini göstermek içindir.

source: This command provides no output.
id: Perintah ini tidak memberikan output.
tr_tr: Bu komutun hiç çıktısı yok.

source: This command requires additional options to successfully launch an instance. See the `CLI reference <https://docs.openstack.org/cli-reference/openstack.html>`_ for more information.
id: Perintah ini memerlukan opsi tambahan untuk berhasil meluncurkan sebuah instance. Lihat `CLI reference <https://docs.openstack.org/cli-reference/openstack.html>`_ untuk informasi lebih lanjut.
tr_tr: Bu komut, bir sunucuyu başarılı bir şekilde başlatmak için ek seçeneklere ihtiyaç duyar. Daha fazla bilgi için `CLI kılavuzu <https://docs.openstack.org/cli-reference/openstack.html>`_ belgesine bakınız.

source: This command requires other options outside the scope of this content.
id: Perintah ini membutuhkan opsi lain di luar lingkup konten ini.
tr_tr: Bu komut, bu içeriğin kapsamı dışındaki diğer seçenekleri gerektirir.

source: This example shows how to check the connectivity between networks with address scopes.
id: Contoh ini menunjukkan bagaimana untuk memeriksa konektivitas antara jaringan dengan lingkup alamat.
tr_tr: Bu örnek adres alanları ile ağlar arasındaki bağlanabilirliğin nasıl kontrol edileceğini gösterir.

source: This example uses again the private network, ``demo-net1`` (b5b729d8-31cc-4d2c-8284-72b3291fec02) which was created in `Example 1 - Proof-of-concept`_.
id: Contoh ini menggunakan lagi jaringan private, ``demo-net1`` (b5b729d8-31cc-4d2c-8284-72b3291fec02) yang diciptakan di `Example 1 - Proof-of-concept`_.
tr_tr: Bu örnek yine `Örnek 1 - Konseptin ispatı`_nda oluşturulan ``demo-net1`` (b5b729d8-31cc-4d2c-8284-72b3291fec02) özel ağı kullanır.

source: This feature is designed to automate the basic networking provisioning for projects. The steps to provision a basic network are run during instance boot, making the networking setup transparent.
tr_tr: Bu özellik, projeler için temel ağ sağlama işlemini otomatikleştirmek için tasarlanmıştır. Temel bir ağ oluşturmaya yönelik adımlar, ağ önbelleği kurulumunu şeffaf hale getirerek, önyükleme sırasında çalıştırılır.

source: This feature is only supported when using the libvirt compute driver, and the KVM/QEMU hypervisor.
id: Fitur ini hanya didukung bila menggunakan libvirt compute driver, dan KVM/QEMU hypervisor.
tr_tr: Bu özellik yalnızca libvirt hesaplama sürücüsü ve KVM/QEMU yönetici arabirimi kullanıldığında desteklenir.

source: This following example is not typical of an actual deployment. It is shown to allow users to experiment with configuring service subnets.
id: Ini contoh berikut ini tidak khas dari pengerahan yang nyata. Hal ini ditunjukkan untuk memungkinkan pengguna untuk bereksperimen dengan konfigurasi subnet layanan.
tr_tr: Aşağıdaki örnek gerçek bir dağıtım için tipik değildir. Kullanıcıların, hizmet alt ağlarını yapılandırarak denemelerine olanak tanıdığı gösterilmiştir.

source: This generates a prepopulated template with the changes needed to match the database state with the models.
id: Ini menghasilkan prepopulated template dengan perubahan yang diperlukan untuk mencocokkan keadaan database dengan model.
tr_tr: Bu, veritabanı durumunu modellerle eşleştirmek için gereken değişiklikleri içeren önceden doldurulmuş bir şablon oluşturur.

source: This guide assumes that you are running a Dibbler server on the network node where the external network bridge exists. If you already have a prefix delegation capable DHCPv6 server in place, then you can skip the following section.
id: Panduan ini mengasumsikan bahwa Anda menjalankan server Dibbler pada node jaringan dimana jembatan jaringan eksternal ada. Jika Anda sudah memiliki server DHCPv6 yang mampu prefix delegation di tempat, maka anda dapat melewati (skip) bagian berikut.
tr_tr: Bu kılavuz, dış ağ köprüsünün bulunduğu ağ düğümünde bir Dibbler sunucusu çalıştığını varsaymaktadır. Önceden bir ajan seçebilme yeteneğine sahip DHCPv6 sunucusu varsa, aşağıdaki bölümü atlayabilirsiniz.

source: This guide characterizes the L2 reference implementations that currently exist.
id: Panduan ini mencirikan implementasi referensi L2 yang saat ini ada.
tr_tr: Bu kılavuz şu andaki mevcut L2 referans uygulamalarını karakterize etmektedir.

source: This guide documents the OpenStack Ocata release.
id: Panduan ini mendokumentasikan rilis OpenStack Ocata.
tr_tr: Bu kılavuz OpenStack Ocata sürümünü belgeler.

source: This guide targets OpenStack administrators seeking to deploy and manage OpenStack Networking (neutron).
id: Panduan ini menargetkan administrator OpenStack untuk berusaha mengerahkan dan mengelola OpenStack Networking (neutron).
tr_tr: Bu kılavuz, OpenStack Ağ'ı (neutron) devreye almak ve yönetmek isteyen OpenStack yöneticilerini hedef almaktadır.

source: This high-availability mechanism configures VRRP using the same priority for all routers. Therefore, VRRP promotes the backup router with the highest IP address to the master router.
id: Mekanisme high-availability ini mengkonfigurasi VRRP menggunakan prioritas yang sama untuk semua router. Oleh karena itu, VRRP mempromosikan router cadangan dengan alamat IP tertinggi ke router utama.
tr_tr: Bu yüksek kullanılabilirlik mekanizması, tüm yönlendiriciler için aynı öncelik kullanan VRRP'yi yapılandırır. Bu nedenle VRRP, ana yönlendiriciye en yüksek IP adresine sahip yedek yönlendiriciyi tanıtır.

source: This high-availability mechanism is not compatible with the layer-2 population mechanism. You must disable layer-2 population in the ``linuxbridge_agent.ini`` file and restart the Linux bridge agent on all existing network and compute nodes prior to deploying the example configuration.
id: Mekanisme high-availability ini tidak kompatibel dengan mekanisme populasi lapisan-2. Anda harus menonaktifkan populasi lapisan-2 di file ``linuxbridge_agent.ini`` dan restart agen Linux bridge pada semua jaringan dan komputasi node yang ada sebelum pengerahan konfigurasi contoh.
tr_tr: Bu yüksek kullanılabilirlik mekanizması katman-2 nüfus mekanizması ile uyumlu değildir. ``linuxbridge_agent.ini`` dosyasındaki katman 2 popülasyonunu devre dışı bırakmalı ve örnek konfigürasyonu yayına almadan önce tüm mevcut ağdaki Linux köprü aracısını ve hesaplama düğümlerini yeniden başlatmalısınız.

source: This high-availability mechanism simply augments :ref:`deploy-lb-selfservice` with failover of layer-3 services to another router if the master router fails. Thus, you can reference :ref:`Self-service network traffic flow <deploy-lb-selfservice-networktrafficflow>` for normal operation.
id: Mekanisme high-availabilityi ini hanya menambah :ref:`deploy-lb-selfservice` dengan failover layanan lapisan-3 kepada router lain jika router master gagal. Dengan demikian, Anda dapat referensi :ref:`Self-service network traffic flow <deploy-lb-selfservice-networktrafficflow>` untuk operasi normal.
tr_tr: Yüksek kullanılabilirlik mekanizması basitçe ana yönlendirici çökerse diğer yönlendiriciye katman-3 servislerinin yük devri ile ref:`deploy-lb-selfservice`i uzatır. Dolayısıyla, normal işlem için :ref:`Self-servis ağ trafik akışı <deploy-lb-selfservice-networktrafficflow>`na başvurabilirsiniz.

source: This high-availability mechanism simply augments :ref:`deploy-ovs-selfservice` with failover of layer-3 services to another router if the master router fails. Thus, you can reference :ref:`Self-service network traffic flow <deploy-ovs-selfservice-networktrafficflow>` for normal operation.
id: Mekanisme high-availability ini hanya menambah :ref:`deploy-ovs-selfservice` dengan failover layanan lapisan-3 kepada router lain jika master router gagal. Dengan demikian, Anda dapat referensi :ref:`Self-service network traffic flow <deploy-ovs-selfservice-networktrafficflow>` untuk operasi normal.
tr_tr: Bu yüksek kullanılabilirlik mekanizması, ana yönlendirici başarısız olursa katman-3 servislerinin yerine başka bir yönlendiriciye geçilmesi ile birlikte :ref:`deploy-ovs-selfservice` işlevini basitleştirir. Bu sebeple, normal işlemler için :ref: `Normal çalışma için self-servis ağı trafik akışı <deploy-ovs-selfservice-networktrafficflow>` referans alabilirsiniz.

source: This is the equivalent of creating a policy on the network that permits every project to perform the action ``access_as_shared`` on that network. Neutron treats them as the same thing, so the policy entry for that network should be visible using the :command:`openstack network rbac list` command:
id: Ini adalah setara dengan pembuatan kebijakan di jaringan yang mengizinkan setiap proyek untuk melakukan aksi ``access_as_shared`` pada jaringan itu. Neutron memperlakukan mereka sebagai hal yang sama, sehingga masuknya kebijakan untuk jaringan itu harus terlihat dengan menggunakan perintah :command:`openstack network rbac list`:
tr_tr: Bu, ağ üzerinde her projenin o ağdaki ``access_as_shared`` eylemini gerçekleştirmesine izin veren bir politika oluşturmanın eşdeğeridir. Neutron bunları aynı şey olarak görür, bu nedenle bu ağ için politika girişi şu komutu kullanarak görünür olmalıdır :command:`openstack network rbac list`:

source: This load balancer is active and ready to serve traffic on ``192.0.2.22``.
tr_tr: Bu yük dengeleyici aktif ve trafiği ``192.0.2.22`` üzerinden vermeye hazır.

source: This mechanism driver simply changes the virtual network interface driver for instances. Thus, you can reference the ``Create initial networks`` content for the prerequisite deployment example.
id: Driver mekanisme ini hanya merubah driver antarmuka jaringan virtual untuk instance. Dengan demikian, Anda dapat referensi konten ``Create initial networks` untuk contoh pengerahan prasyarat.
tr_tr: Bu mekanizma sürücüsü, örnekler için sanal ağ arabirimi sürücüsünü değiştirir. Bu nedenle, önkoşul dağıtım örneği için ``Create initial networks`` içeriğini referans alabilirsin.

source: This mechanism driver simply changes the virtual network interface driver for instances. Thus, you can reference the ``Verify network operation`` content for the prerequisite deployment example.
id: Driver mekanisme ini hanya merubah driver antarmuka jaringan virtual untuk instance. Dengan demikian, Anda dapat referensi konten ``Verify network operation`` untuk contoh pengerahan prasyarat.
tr_tr: Bu mekanizma sürücüsü, sunucular için sanal ağ arabirimi sürücüsünü değiştirir. Bu nedenle, ön şart olan kurulum örneği için ``Ağ İşlemini Doğrulama`` içeriğini referans alabilirsin.

source: This mechanism driver simply removes the Linux bridge handling security groups on the compute nodes. Thus, you can reference the network traffic flow scenarios for the prerequisite deployment example.
id: Driver mekanisme ini hanya menghilangkan jembatan Linux penanganan kelompok keamanan pada node komputasi. Dengan demikian, Anda dapat referensi skenario arus lalu lintas jaringan untuk contoh pengerahan prasyarat.
tr_tr: Bu mekanizma sürücüsü, hesaplama düğümlerinde güvenlik gruplarını işleyen Linux köprüsünü kaldırır. Bu nedenle, önkoşul dağıtım örneği için ağ trafiği akış senaryolarına başvurabilirsiniz.

source: This method entails creating a trunk, then adding subports to the trunk after it has already been created.
id: Metode ini memerlukan pembuatan trunk, kemudian menambahkan subports ke trunk setelah trunk dibuat.
tr_tr: Bu metod bir bilgi aktarım yolu oluşturmaya sebep olur, ardında bilgi aktarım yolu oluşturulduktan sonra altportlar eklenir.

source: This method entails creating the trunk with subports specified at trunk creation.
id: Metode ini memerlukan pembuatan trunk dengan subports yang spesifik pada pembuatan trunk.
tr_tr: Bu yöntem, bilgi aktarım yolu yaratmada belirtilen altportlarla bilgi aktarım yolu yaratmayı gerektirir.

source: This page serves as a guide for how to use the DNS integration functionality of the Networking service. The functionality described covers DNS from two points of view:
id: Halaman ini berfungsi sebagai panduan bagaimana menggunakan fungsi integrasi DNS dari layanan Networking. Fungsionalitas yang dijelaskan meliputi DNS dari dua sudut pandang:
tr_tr: Bu sayfa, Ağ hizmetinin DNS bütünleştirme işlevselliğini nasıl kullanacağınız konusunda bir kılavuz olarak hizmet eder. Açıklanan işlevler DNS'yi iki açıdan kapsar:

source: This page serves as a guide for how to use the OVS with DPDK datapath functionality available in the Networking service as of the Mitaka release.
id: Halaman ini berfungsi sebagai panduan untuk bagaimana menggunakan OVS dengan DPDK datapath secara fungsinal yang tersedia di layanan Networking sebagai rilis Mitaka.
tr_tr: Bu sayfa, Mitaka sürümünden itibaren Ağ servisinde bulunan DPDK veri yolu işlevselliği ile birlikte OVS'yi nasıl kullanacağınız konusunda bir rehber görevi görür.

source: This process can be repeated any number of times to make a network available as external to an arbitrary number of projects.
id: Proses ini dapat diulang beberapa kali untuk membuat jaringan yang tersedia sebagai eksternal sampai jumlah proyek berapapun.
tr_tr: Bu süreç, herhangi bir sayıda projeye harici olarak erişilebilmesi için tekrar edilebilir.

source: This process can be repeated any number of times to share a network with an arbitrary number of projects.
id: Proses ini dapat diulang beberapa kali untuk berbagi jaringan dengan jumlah proyek berapapun.
tr_tr: Bu süreç, keyfi sayıda projeyle bir ağ paylaşmak için herhangi bir sayıda tekrarlanabilir.

source: This process can be repeated any number of times to share a qos-policy with an arbitrary number of projects.
id: Proses ini dapat diulang beberapa kali untuk berbagi qos-policy dengan jumlah proyek berapapun.
tr_tr: Bu süreç, istenilen sayıda projeyle bir qos politikası paylaşmak için herhangi bir sayıda tekrarlanabilir.

source: This scenario places the instances on different compute nodes to show the most complex situation.
id: Skenario ini menempatkan instance pada node komputasi yang berbeda untuk menunjukkan situasi yang paling kompleks.
tr_tr: Bu senaryo, sunucuları en karmaşık durumu göstermek için farklı hesaplama düğümlerine yerleştirir.
