Repository: 25hours/openstack-manuals
Catalog: doc/networking-guide/source/locale/*/LC_MESSAGES/networking-guide.po
Languages: id, tr_tr

source: This section describes how to use the agent management (alias agent) and scheduler (alias agent_scheduler) extensions for DHCP agents scalability and HA.
id: Bagian ini menjelaskan cara menggunakan manajemen agen (agent alias) dan ekstensi scheduler (alias agent_scheduler) untuk skalabilitas agen DHCP dan HA.
tr_tr: Bu bölüm, DHCP ajanların ölçeklenebilirliği ve HA için aracı yönetimi (diğer ad aracısı) ve zamanlayıcı (diğer adet agent_scheduler) uzantılarının nasıl kullanılacağını açıklar.

source: This section describes the following items:
tr_tr: Bu bölüm aşağıdaki elemanları tanımlar:

source: This section describes the process of migrating clouds based on the legacy networking model to the OpenStack Networking model. This process requires additional changes to both compute and networking to support the migration. This document describes the overall process and the features required in both Networking and Compute.
id: Bagian ini menjelaskan proses migrasi cloud didasarkan pada model legacy networking ke model OpenStack Networking. Proses ini membutuhkan perubahan tambahan untuk komputasi maupun jaringan untuk mendukung migrasi. Dokumen ini menjelaskan proses secara keseluruhan dan fitur yang diperlukan di Networking maupun Compute.
tr_tr: Bu bölüm, eski ağ modeli temelli bulutların OpenStack Ağ Modeli'ne geçiş sürecini açıklar. Bu işlem, taşıma işlemini desteklemek için hem hesaplama hem de ağda ek değişiklikler gerektirir. Bu belgede hem Ağ Oluşturma hem de Hesaplama için gereken genel işlem ve özellikler açıklanmıştır.

source: This section describes the process of migrating from a classic router to an L3 HA router, which is available starting from the Mitaka release.
id: Bagian ini menjelaskan proses migrasi dari router klasik ke sebuah router L3 HA, yang tersedia mulai dari rilis Mitaka.
tr_tr: Bu bölüm, klasik bir yönlendiriciden L3 HA yönlendiricisine geçiş sürecini açıklar ve bu, Mitaka sürümünden başlar.

source: This section does not include the following items:
tr_tr: Bu bölümde aşağıdaki öğeler bulunmamaktadır:

source: This section explains how to get high availability with the availability zone for L3 and DHCP. You should naturally set above configuration options for the availability zone.
id: Bagian ini menjelaskan bagaimana untuk mendapatkan ketersediaan tinggi dengan zona ketersediaan L3 dan DHCP. Anda secara alami harus mengatur opsi konfigurasi di atas untuk zona ketersediaan.
tr_tr: Bu bölümde, L3 ve DHCP için kullanılabilirlik bölgesi ile yüksek kullanılabilirlik elde etme yöntemi açıklanmaktadır. Kullanılabilirlik bölgesi için yukarıda yapılandırma seçeneklerini doğal olarak ayarlamalısınız.

source: This section illustrates how you can get the Network IP address availability through the command-line interface.
id: Bagian ini menggambarkan bagaimana Anda bisa mendapatkan ketersediaan alamat IP jaringan melalui command-line interface.
tr_tr: Bu bölüm, Ağ IP adresinin kullanılabilirliğini komut satırı arabirimi yoluyla nasıl elde edebileceğinizi gösterir.

source: This section only contains flow scenarios that benefit from distributed virtual routing or that differ from conventional operation. For other flow scenarios, see :ref:`deploy-ovs-selfservice-networktrafficflow`.
id: Bagian ini hanya berisi skenario aliran yang menguntungkan dari routing virtual yang didistribusikan atau yang berbeda dari operasi konvensional. Untuk skenario aliran lainnya, lihat :ref:`deploy-ovs-selfservice-networktrafficflow`.
tr_tr: Bu bölümde yalnızca dağıtılmış sanal yönlendirmeden fayda sağlayan veya geleneksel operasyondan farklı akış senaryoları bulunur. Diğer akış senaryoları için bkz :ref:`deploy-ovs-selfservice-networktrafficflow`.

source: This section references parts of :ref:`deploy-lb-ha-vrrp` and :ref:`deploy-ovs-ha-vrrp`. For details regarding needed infrastructure and configuration to allow actual L3 HA deployment, read the relevant guide before continuing with the migration process.
id: Bagian ini merujuk bagian dari :ref:`deploy-lb-ha-vrrp` dan :ref:`deploy-ovs-ha-vrrp`. Untuk rincian mengenai infrastruktur yang diperlukan dan konfigurasi untuk melancarkan pengerahan L3 HA aktual, silahkan baca buku yang relevan sebelum melanjutkan dengan proses migrasi.
tr_tr: Bu bölüm, :ref:`deploy-lb-ha-vrrp` ve :ref:`deploy-ovs-ha-vrrp` bölümlerini referanslar. Gerçek L3 HA kurulumuna izin vermek için gereken altyapı ve yapılandırmayla ilgili ayrıntılar için, taşıma işlemine devam etmeden önce ilgili kılavuzu okuyun.

source: This section shows how non-privileged users can use address scopes to route straight to an external network without NAT.
id: Bagian ini menunjukkan bagaimana pengguna non-hak istimewa dapat menggunakan lingkup alamat untuk rute langsung ke jaringan eksternal tanpa NAT (Network Address Translation).
tr_tr: Bu bölüm, ayrıcalıksız kullanıcıların NAT olmadan doğrudan harici bir ağa yönlendirmek için adres alanlarını nasıl kullanabileceklerini gösterir.

source: This section shows how to set up shared address scopes to allow simple routing for project networks with the same subnet pools.
id: Bagian ini menunjukkan cara mengatur lingkup alamat bersama untuk memungkinkan routing sederhana untuk jaringan proyek dengan kolam subnet yang sama.
tr_tr: Bu bölüm, paylaşımlı adres alanlarını, aynı alt ağ havuzlarına sahip proje ağları için basit yönlendirmenin yapılmasına izin verecek şekilde nasıl ayarlayacağınızı gösterir.

source: This step ensures that Dashboard can find the plug-in when it enumerates all of its available panels.
id: Langkah ini memastikan bahwa Dashboard dapat menemukan plug-in ketika menjumlahkan semua panel yang tersedia.
tr_tr: Bu adım, Dashboard'un kullanılabilir tüm panelleri numaralandırdığı zaman eklentiyi bulmasını sağlar.

source: This tells OpenStack Networking to use the prefix delegation mechanism for subnet allocation when the user does not provide a CIDR or subnet pool id when creating a subnet.
id: Ini memberitahu OpenStack Networking supaya menggunakan mekanisme prefix delegation untuk alokasi subnet ketika pengguna tidak menyediakan CIDR atau id kolam subnet saat membuat subnet.
tr_tr: Bu, kullanıcı bir alt ağ oluştururken bir CIDR veya alt ağ havuzu kimliği sağlamazsa, OpenStack Ağına alt ağ tahsisi için önek yetkilendirme mekanizmasını kullanmasını söyler.

source: This tells the Compute service that all VFs belonging to ``eth3`` are allowed to be passed through to instances and belong to the provider network ``physnet2``.
id: Ini memberitahu layanan Compute dimana semua VF milik ``eth3`` diizinkan untuk dilewatkan ke instance dan menjadi milik jaringan penyedia ``physnet2``.
tr_tr: Bu, Hesaplama servisine, ``eth3``'e ait tüm VF'lerin sunuculara bağlanmasına ve sağlayıcı ağı ``physnet2``ye ait olmasına izin verildiğini bildirir.

source: Three instances, one per compute node, each with a floating IP address.
id: Tiga instance, salah satu per node komputasi, masing-masing dengan alamat IP mengambang.
tr_tr: Üç sunucu, her hesaplama düğümü için bir, her biri bir yüzen IP adresi ile.

source: Three network interfaces: management, overlay, and provider.
id: Tiga antarmuka jaringan: manajemen, overlay, dan provider.
tr_tr: Üç ağ arabirimi: yönetim, yer paylaşımı ve sağlayıcı.

source: Three network interfaces: management, provider, and overlay.
id: Tiga antarmuka jaringan: manajemen, penyedia (provider), dan overlay.
tr_tr: Üç ağ arabirimi: yönetim, sağlayıcı ve yer paylaşımı.

source: Three routers. Each router connects one self-service network to the provider network.
id: Tiga router. Setiap router menghubungkan satu jaringan self-service ke jaringan provider.
tr_tr: Üç yönlendirici. Her yönlendirici bir self-servis ağını sağlayıcı ağına bağlar.

source: Three self-service networks.
id: Tiga jaringan self-service.
tr_tr: Üç self-servis ağ.

source: Throughout this guide, ``eth3`` is used as the PF and ``physnet2`` is used as the provider network configured as a VLAN range. These ports may vary in different environments.
id: Dalam panduan ini, ``eth3`` digunakan sebagai PF dan ``physnet2`` digunakan sebagai jaringan penyedia yang dikonfigurasi sebagai rentang VLAN. Port ini dapat bervariasi dalam lingkungan yang berbeda.
tr_tr: Bu rehber boyunca, PF olarak ``eth3`` ve VLAN aralığı olarak yapılandırılmış sağlayıcı ağı olarak ``physnet2`` kullanılır. Bu bağlantı noktaları farklı ortamlarda değişiklik gösterebilir.

source: To activate the network after it has been deactivated:
id: Untuk mengaktifkan jaringan setelah jaringan telah dinonaktifkan:
tr_tr: Devre dışı bırakıldıktan sonra ağı etkinleştirmek için:

source: To add a single rule, use the insert-rule operation.
id: Untuk menambahkan aturan tunggal, gunakan operasi insert-rule.
tr_tr: Tek bir kural eklemek için kural-ekle işlemini kullanın.

source: To add another DHCP agent to host the network, run this command:
id: Untuk menambahkan agen DHCP lain supaya menjadi host jaringan, jalankan perintah ini:
tr_tr: Ağı sunmak için başka bir DHCP ajanı eklemek için bu komutu kullanın:

source: To add multiple rules, use the update operation.
id: Untuk menambahkan beberapa aturan (multiple rule), gunakan operasi update.
tr_tr: Birden fazla kural eklemek için, güncelle işlemini kullanın.

source: To allow the neutron-pd-agent to communicate with prefix delegation servers, you must set which network interface to use for external communication. In DevStack the default for this is ``br-ex``:
id: Untuk memungkinkan neutron-pd-agen untuk berkomunikasi dengan server prefix delegation, Anda harus mengatur jaringan yang antarmukanya digunakan untuk komunikasi eksternal. Dalam DevStack default untuk ini adalah ``br-ex``:
tr_tr: neutron-pd-agent önek temsilci sunucularıyla iletişim kurmasına izin vermek için, dış iletişim için hangi ağ arabirimini kullanmanız gerektiğini ayarlamanız gerekir. DevStack'te bunun için varsayılan ``br-ex``dir:

source: To apply the expansion migration rules, use the following command:
id: Untuk menerapkan aturan migrasi ekspansi, gunakan perintah berikut:
tr_tr: Genişletme taşıma kurallarını uygulamak için aşağıdaki komutu kullanın:

source: To apply the non-expansive migration rules, use the following command:
id: Untuk menerapkan aturan migrasi non-expansive, gunakan perintah berikut:
tr_tr: Genişletme dışı geçiş kurallarını uygulamak için aşağıdaki komutu kullanın:

source: To calculate the network number of an IP address, you must know the *netmask* associated with the address. A netmask indicates how many of the bits in the 32-bit IP address make up the network number.
id: Untuk menghitung jumlah jaringan alamat IP, Anda harus tahu *netmask * terkait dengan alamat. Sebuah netmask menunjukkan berapa banyak bit dalam alamat IP 32-bit yang menyusun jumlah jaringan.
tr_tr: Bir IP adresinin ağ numarasını hesaplamak için, adresle ilişkili *netmask* bilgisini bilmelisiniz. Bir ağ maskesi, 32-bit IP adresindeki kaç bitin ağ numarasını oluşturduğunu gösterir.

source: To check if any contract migrations are pending and therefore if offline migration is required, use the following command:
id: Untuk memeriksa apakah ada migrasi kontrak yang tertunda dan oleh karena itu jika migrasi secara offline diperlukan, gunakan perintah berikut:
tr_tr: Herhangi bir sözleşme geçiş işleminin beklemede olup olmadığını kontrol etmek ve dolayısıyla çevrimdışı geçiş yapılması gerekiyorsa aşağıdaki komutu kullanın:

source: To configure a driver other than the reference driver, specify it in the ``neutron.conf`` file. Do this after the migration is complete. There is no need to specify any value if you wish to use the reference driver.
id: Untuk mengkonfigurasi driver selain driver referensi, menetapkannya dalam file ``neutron.conf``. Lakukan ini setelah migrasi selesai. Tidak perlu untuk menentukan nilai apapun jika Anda ingin menggunakan driver referensi.
tr_tr: Referans sürücüsü dışındaki bir sürücüyü yapılandırmak için, onu ``neutron.conf`` dosyasında belirtin. Taşıma işlemi tamamlandıktan sonra bunu yapın. Referans sürücüsünü kullanmak isterseniz herhangi bir değer belirtmeye gerek yoktur.

source: To configure rich network topologies, you can create and configure networks and subnets and instruct other OpenStack services like Compute to attach virtual devices to ports on these networks. OpenStack Compute is a prominent consumer of OpenStack Networking to provide connectivity for its instances. In particular, OpenStack Networking supports each project having multiple private networks and enables projects to choose their own IP addressing scheme, even if those IP addresses overlap with those that other projects use. There are two types of network, project and provider networks. It is possible to share any of these types of networks among projects as part of the network creation process.
id: Untuk mengkonfigurasi topologi jaringan yang beragam, Anda dapat membuat dan mengkonfigurasi jaringan dan subnet dan menginstruksikan layanan OpenStack lain seperti Compute untuk menghubungkan perangkat virtual ke port pada jaringan ini. OpenStack Compute adalah konsumen yang menonjol dari OpenStack Networking untuk menyediakan konektivitas untuk instances nya. Secara khusus, OpenStack Networking mendukung setiap proyek yang memiliki beberapa jaringan private dan mengaktifkan proyek untuk memilih skema pengalamatan IP mereka sendiri, bahkan jika alamat IP proyek mereka terjadi tumpang tindih dengan proyek lain menggunakan. Ada dua jenis jaringan, jaringan proyek dan jaringan provider. Hal ini dimungkinkan untuk berbagi salah satu jenis jaringan antara proyek-proyek sebagai bagian dari proses pembuatan jaringan.
tr_tr: Zengin ağ topolojilerini yapılandırmak için, ağlar ve alt ağlar oluşturabilir ve yapılandırabilir ve Hesaplama gibi diğer OpenStack hizmetlerine sanal aygıtları bu ağdaki bağlantı noktalarına bağlamalarını söyleyebilirsiniz. OpenStack Hesapmala, sunucuları için bağlantı sağlamak için OpenStack Ağ'ın önde gelen bir tüketicisidir. Özellikle, OpenStack Ağ, birden çok özel ağa sahip her projeyi destekler ve projelerin kendi IP adresleme şemalarını seçmesine olanak tanır; bu IP adresleri diğer projelerin kullandığı IP adresleri ile çakışsa bile. İki tür ağ, proje ve sağlayıcı ağı vardır. Bu ağ türlerinden herhangi birini projeler arasında ağ oluşturma sürecinin bir parçası olarak paylaşmak mümkündür.

source: To confirm the agent's availability zone:
id: Untuk mengkonfirmasi zona ketersediaan agen:
tr_tr: Ajanın kullanılabilirlik alanını onaylayın:

source: To confirm the availability zone defined by the system:
id: Untuk mengkonfirmasi zona ketersediaan yang didefinisikan oleh sistem:
tr_tr: Sistem tarafından tanımlanan kullanılabilirlik bölgesini onaylamak için:

source: To create a VLAN network instead of a flat network, change ``--provider:network_type flat`` to ``--provider-network-type vlan`` and add ``--provider-segment`` with a value referencing the VLAN ID.
id: Untuk membuat jaringan VLAN bukannya jaringan datar, rubahlah ``--provider:network_type flat`` ke ``--provider-network-type vlan`` and add ``--provider-segment`` dengan nilai mereferensi VLAN ID.
tr_tr: Düz bir ağ yerine bir VLAN ağı oluşturmak için, ``--provider:network_type flat`` parametresini ``--provider-network-type vlan`` olarak değiştirin ve ``--provider-segment``e VLAN ID'e referans eden bir değer ekleyin.

source: To deactivate the libvirt network named ``default``:
id: Untuk menonaktifkan jaringan libvirt bernama ``default``:
tr_tr: ``default`` adlı libvirt ağını devre dışı bırakmak için:

source: To enable DSCP marking rule:
id: Mengaktifkan aturan DSCP marking:
tr_tr: DSCP işaretleme kuralını etkinleştirin:

source: To enable advertising IPv6 prefixes, create an address scope with ``ip_version=6`` and a BGP speaker with ``ip_version=6``.
id: Untuk mengaktifkan penyiaran update dan perubahan awalan IPv6, buatlah lingkup alamat dengan ``ip_version=6`` dan BGP speaker dengan ``ip_version=6``.
tr_tr: IPv6 öneklerini tanıtmak için, `ip_version=6`` ile bir adres kapsamı ve ``ip_version=6`` olan bir BGP yayıncı oluşturun.

source: To enable bandwidth limit rule:
id: Untuk mengaktifkan aturan batas bandwidth:
tr_tr: Bant genişliği sınır kuralını etkinleştir:

source: To enable mechanism drivers in the ML2 plug-in, edit the ``/etc/neutron/plugins/ml2/ml2_conf.ini`` file on the neutron server:
id: Untuk mengaktifkan driver mekanisme di ML2 plug-in, edit file ``/etc/neutron/plugins/ml2/ml2_conf.ini`` di server neutron:
tr_tr: ML2 eklentisinde mekanizma sürücülerini etkinleştirmek için neutron sunucudaki ``/etc/neutron/plugins/ml2/ml2_conf.ini`` dosyasını düzenleyin:

source: To enable minimum bandwidth rule:
tr_tr: En küçük bant genişliği kuralını etkinleştirin:

source: To enable peering via IPv6, create a BGP peer and use an IPv6 address for ``peer_ip``.
id: Untuk mengaktifkan peering (kebersamaan) melalui IPv6, membuat rekan (peer) BGP dan menggunakan alamat IPv6 untuk ``peer_ip``.
tr_tr: IPv6 vasıtasıyla gözatmayı etkinleştirmek için bir BGP eşi oluşturun ve ``peer_ip`` için bir IPv6 adresi kullanın.

source: To enable prefix delegation, edit the ``/etc/neutron/neutron.conf`` file. If you are running OpenStack Liberty, make the following change:
id: Untuk mengaktifkan prefix delegation, edit file ``/etc/neutron/neutron.conf``. Jika Anda menjalankan OpenStack Liberty, buatlah perubahan berikut:
tr_tr: Önek yetkilendirmeyi etkinleştirmek için ``/etc/neutron/neutron.conf`` dosyasını düzenleyin. OpenStack Liberty'i çalıştırıyorsanız, aşağıdaki değişikliği yapın:

source: To enable the driver for the dhcpv6_pd_agent, set pd_dhcp_driver to this in ``/etc/neutron/neutron.conf``:
id: Untuk mengaktifkan driver untuk ini dhcpv6_pd_agent, set pd_dhcp_driver dalam ``/etc/neutron/neutron.conf``:
tr_tr: dhcpv6_pd_agent için sürücüyü etkinleştir, ``/etc/neutron/neutron.conf`` dosyasındaki pd_dhcp_driver buna ayarlayın:

source: To enable the service, follow the steps below:
id: Untuk mengaktifkan layanan ini, ikuti langkah-langkah di bawah ini:
tr_tr: Servisi etkinleştirmek için aşağıdaki adımları takip edin:

source: To enable this feature, edit the ``l3_agent.ini`` file:
id: Untuk mengaktifkan fitur ini, edit file ``l3_agent.ini``:
tr_tr: Bu özelliği etkinleştirmek için, ``l3_agent.ini`` dosyasını düzenleyin:

source: To enable type drivers in the ML2 plug-in. Edit the ``/etc/neutron/plugins/ml2/ml2_conf.ini`` file:
id: Untuk mengaktifkan driver tipe dalam ML2 plug-in. Edit file ``/etc/neutron/plugins/ml2/ml2_conf.ini``:
tr_tr: ML2 eklentisindeki tür sürücülerini etkinleştirmek için. ``/etc/neutron/plugins/ml2/ml2_conf.ini`` dosyasını düzenle:

source: To experiment, you need VMs and a neutron network:
id: Untuk bereksperimen, Anda perlu VM dan jaringan neutron:
tr_tr: Denemek için VM'lere ve neutron ağına ihtiyacınız var:

source: To find the panel, click on :guilabel:`Project` in Dashboard, then click the :guilabel:`Network` drop-down menu and select :guilabel:`Load Balancers`.
id: Untuk menemukan panel, klik pada :guilabel:`Project` di Dashboard, lalu klik drop-down menu :guilabel:`Network` dan pilih :guilabel:`Load Balancers`.
tr_tr: Paneli bulmak için: Dashboard'da :guilabel:`Proje` tıklayın ve ardından :guilabel:`Ağ` açılır menüsünü tıklayın ve şu seçeneklerden birini seçin :guilabel:`Yük Dengeleyiciler`.

source: To generate a script of the command instead of operating immediately on the database, use the following command:
id: Untuk menghasilkan script perintah sebagai ganti operasi segera pada database, gunakan perintah berikut:
tr_tr: Veritabanında hemen çalıştırmak yerine komut betiğini oluşturmak için aşağıdaki komutu kullanın:

source: To look for differences between the schema generated by the upgrade command and the schema defined by the models, use the :command:`revision --autogenerate` command:
tr_tr: Yükseltme komutu tarafından oluşturulan şema ile modeller tarafından tanımlanan şema arasındaki farklara bakmak için :command:`revision --autogenerate` komutunu kullanın:

source: To make a network available as an external network for specific projects rather than all projects, use the ``access_as_external`` action.
id: Untuk membuat sebuah jaringan tersedia sebagai jaringan eksternal untuk proyek-proyek tertentu bukan untuk semua proyek, gunakan aksi ``access_as_external``.
tr_tr: Bir ağı tüm projeler yerine belirli projeler için harici bir ağ olarak kullanılabilir hale getirmek için ``access_as_external`` eylemini kullanın.

source: To make this possible, provide a default external network and default subnetpools (one for IPv4, or one for IPv6, or one of each) so that the platform can choose what to do in lieu of input. Once these are in place, users can boot their VMs without specifying any networking details. The Compute service will then use this feature automatically to wire user VMs.
tr_tr: Bunu mümkün kılmak için platformun giriş yerine ne yapacağını seçebilmesi için bir varsayılan dış ağ ve varsayılan alt ağ havuzlarını sağlayın (IPv4 için bir veya IPv6 için biri veya her biri için biri). Bunlar yerine getirildikten sonra, kullanıcılar herhangi bir ağ ayrıntısı belirtmeden VM'lerini önyükleyebilir. Compute hizmeti daha sonra bu özelliği, kullanıcı VM'lerini bağlamak için otomatik olarak kullanacaktır.

source: To migrate between specific migration versions, use the following command:
id: Untuk bermigrasi antara versi migrasi tertentu, gunakan perintah berikut:
tr_tr: Belirli taşıma sürümleri arasında taşımak için aşağıdaki komutu kullanın:

source: To prevent the network from automatically starting on boot:
id: Untuk mencegah jaringan dari permulaan secara otomatis saat boot:
tr_tr: Ağın önyükleme sırasında otomatik olarak başlatılmasını önlemek için:

source: To provide external network access to your instances, your Dibbler server also needs to create new routes for each delegated prefix. This is done using the script file named in the config file above. Edit the ``/var/lib/dibbler/pd-server.sh`` file:
id: Untuk menyediakan akses jaringan eksternal untuk instance Anda, server Dibbler Anda juga perlu membuat rute baru untuk setiap awalan yang didelegasikan. Hal ini dilakukan dengan menggunakan file script di dalam file konfigurasi di atas. Edit file ``/var/lib/dibbler/pd-server.sh``:
tr_tr: Örneklerinize harici ağ erişimi sağlamak için, Dibbler sunucunuzun da temsil edilen her önek için yeni yollar oluşturması gerekir. Bu, yukarıdaki yapılandırma dosyasında adı geçen komut dosyası kullanılarak yapılır. ``/var/lib/dibbler/pd-server.sh`` dosyasını düzenleyin:

source: To reduce clutter, this guide removes command output without relevance to the particular action.
id: Untuk mengurangi kekacauan (clutter), panduan ini menghilangkan output perintah tanpa relevansi dengan tindakan tertentu.
tr_tr: Dağınıklığı azaltmak için, bu kılavuz belirli bir işleme uygun olmadan komut çıktısını kaldırır.

source: To reduce the number of ARP requests, operating systems maintain an ARP cache that contains the mappings of IP addresses to MAC address. On a Linux machine, you can view the contents of the ARP cache by using the :command:`arp` command:
id: Untuk mengurangi jumlah permintaan ARP, sistem operasi mempertahankan cache ARP yang berisi pemetaan dari alamat IP ke alamat MAC. Pada mesin Linux, Anda dapat melihat isi dari cache ARP dengan menggunakan perintah :command:`arp`:
tr_tr: ARP isteklerinin sayısını azaltmak için işletim sistemi IP adresleri ile MAC adreslerinin bir eşleşmesini barındıran bir ARP ön belleği geliştirir. Bir Linux makinede, :command:`arp` command komutu ile ARP ön belleğinin içeriğini görüntüleyebilirsiniz:
