Repository: 25hours/openstack-manuals
Catalog: doc/networking-guide/source/locale/*/LC_MESSAGES/networking-guide.po
Languages: id, tr_tr

source: Enable neutron sriov-agent (Compute)
id: Aktifkan neutron sriov-agent (Compute)
tr_tr: Neutron sriov-agent'ı etkinleştir (Hesaplama)

source: Enable routing and allow overlapping IP address ranges.
id: Aktifkan routing dan memungkinkan rentang alamat IP tumpang tindih.
tr_tr: Yönlendirmeyi etkinleştirin ve çakışan IP adres aralıklarına izin verin.

source: Enable the FWaaS plug-in in the ``/etc/neutron/neutron.conf`` file:
id: Aktifkan FWaaS plug-in dalam file ``/etc/neutron/neutron.conf``:
tr_tr: ``/etc/neutron/neutron.conf`` dosyasında FWaaS eklentisini etkinleştirin:

source: Enable the Networking agent.
id: Aktifkan agen Networking.
tr_tr: Ağ ajanını etkinleştir.

source: Enable the firewall option in the local settings file (named ``local_settings`` on RHEL and CentOS, and ``local_settings.py`` on Ubuntu):
tr_tr: Yerel ayarlar dosyasında (RHEL ve CentOS'ta ``local_settings`` ve Ubuntu'da ``local_settings.py`` adlı) güvenlik duvarı seçeneğini etkinleştirin):

source: Enable the functionality described in :ref:`config-dns-int-dns-resolution`.
id: Aktifkan fungsi yang dijelaskan dalam :ref:`config-dns-int-dns-resolution`.
tr_tr: :ref:`config-dns-int-dns-resolution`de açıklanan işlevselliği devreye al.

source: Enable the layer-2 population mechanism driver.
id: Aktifkan driver mekanisme populasi lapisan-2
tr_tr: Katman-2 nüfus mekanizma sürücüsünü etkinleştir.

source: Enable the native OVS firewall driver
id: Aktifkan driver firewall OVS asli
tr_tr: Dahili OVS güvenlik duvarı sürücüsünü etkinleştir

source: Enable the neutron sriov-agent service.
id: Mengaktifkan layanan neutron sriov-agent.
tr_tr: Neutron sriov-agent servisini etkinleştir.

source: Enable the plug-in in Dashboard by editing the ``local_settings.py`` file and setting ``enable_lb`` to ``True`` in the ``OPENSTACK_NEUTRON_NETWORK`` dictionary.
id: Aktifkan plug-in di Dashboard dengan mengedit file ``local_settings.py`` dan pengaturan ``enable_lb`` ke ``True`` dalam direktori ``OPENSTACK_NEUTRON_NETWORK``.
tr_tr: ``local_settings.py`` dosyasını düzenleyerek ve ``OPENSTACK_NEUTRON_NETWORK`` dizininde ``enable_lb`` değerini `` True`` olarak ayarlayarak Dashboard'daki eklentiyi etkinleştirin.

source: Enable the segments service plug-in by appending ``segments`` to the list of ``service_plugins`` in the ``neutron.conf`` file on all nodes running the ``neutron-server`` service:
id: Aktifkan segmen layanan plug-in dengan menambahkan ``segments`` ke daftar ``service_plugins`` di file ``neutron.conf`` pada semua node yang menjalankan layanan ``neutron-server``:
tr_tr: ``neutron-server`` servisimi çalıştıran tüm düğümlerdeki ``neutron.conf`` dosyasındaki ``service_plugins`` listesine ``segments`` ekleyerek dilim sevis eklentisini etkinleştirin:

source: Enable two DHCP agents per network so both compute nodes can provide DHCP service provider networks.
id: Aktifkan dua agen DHCP per jaringan sehingga kedua node komputasi dapat memberikan layanan DHCP jaringan provider.
tr_tr: Ağ başına iki DHCP aracısı etkinleştirin, böylece her iki hesaplama düğümü de DHCP hizmeti sağlayıcısı ağları sağlayabilir.

source: Enabling DHCP causes the Networking service to provide DHCP which can interfere with existing DHCP services on the physical network infrastructure.
id: Pengaktifan DHCP membuat layanan Networking untuk menyediakan DHCP yang dapat mengganggu layanan DHCP yang ada pada infrastruktur jaringan fisik.
tr_tr: DHCP'nin etkinleştirilmesi, Ağ hizmetinin fiziksel ağ altyapısında mevcut DHCP hizmetleriyle etkileşime girebilecek DHCP sağlamasına neden olur.

source: Enabling DHCP high availability by default
id: Aktifkan HA DHCP secara default
tr_tr: DHCP yüksek kullanılabilirliğini varsayılan olarak etkinleştirme

source: Enabling a dual-stack network in OpenStack Networking simply requires creating a subnet with the ``ip_version`` field set to ``6``, then the IPv6 attributes (``ipv6_ra_mode`` and ``ipv6_address_mode``) set. The ``ipv6_ra_mode`` and ``ipv6_address_mode`` will be described in detail in the next section. Finally, the subnets ``cidr`` needs to be provided.
tr_tr: OpenStack Ağ'da ikili-yığın ağı etkinleştirmek sadece ``ip_version`` alanını ``6``` olarak ayarlayarak bir alt ağ oluşturmayı, ardından IPv6 özniteliklerini (``ipv6_ra_mode`` ve ``ipv6_address_mode``) ayarlamayı gerektirir. ``ipv6_ra_mode`` ve ``ipv6_address_mode`` bir sonraki bölümde ayrıntılı olarak açıklanacaktır. Son olarak, ``cidr`` alt ağları sağlanmalıdır.

source: Enabling the deployment for auto-allocation
id: Mengaktifkan pengerahan untuk auto-allocation
tr_tr: Otomatik yer ayırma için yayımlamayı aktifleştir

source: End users normally can create subnets with any valid IP addresses without other restrictions. However, in some cases, it is nice for the admin or the project to pre-define a pool of addresses from which to create subnets with automatic allocation.
id: End user biasanya dapat membuat subnet dengan alamat IP yang valid tanpa pembatasan lainnya. Namun, dalam beberapa kasus, itu bagus untuk admin atau proyek untuk pre-define kolam alamat yang membuat subnet dengan alokasi otomatis.
tr_tr: Son kullanıcılar normalde herhangi bir geçerli IP adresine sahip başka bir kısıtlama olmaksızın alt ağlar oluşturabilirler. Bununla birlikte, bazı durumlarda, yönetici veya proje için, otomatik ayırma ile alt ağlar oluşturmak için hangi adreslerin havuzunu önceden tanımlamak güzel olur.

source: Ensure SR-IOV and VT-d are enabled in BIOS.
id: Pastikan SR-IOV dan VT-d diaktifkan di BIOS.
tr_tr: SR-IOV ve VT-d'nin BIOS'ta etkinleştirildiğinden emin olun.

source: Ensure that the LBaaS v1 and v2 service providers are removed from the ``[service_providers]`` section. They are not used with Octavia. **Verify that all LBaaS agents are stopped.**
id: Pastikan bahwa LBaaS v1 dan penyedia layanan v2 dikeluarkan dari bagian ``[service_providers]``. Mereka tidak digunakan dengan Octavia. **Verify that all LBaaS agents are stopped.**
tr_tr: LBaaS v1 ve v2 servis sağlayıcıları ``[service_providers]`` bölümünden kaldırıldığından emin olun. Octavia ile kullanılmaz. **Tüm LBaaS ajanlarının durdurulduğunu doğrulayın.**

source: Ensure the neutron sriov-agent runs successfully:
id: Pastikan neutron sriov-agetn berjalan sukses:
tr_tr: Neutron sriov ajanının başarılı bir şekilde çalıştığından emin olun:

source: Ethernet
tr_tr: Eternet

source: Ethernet is a networking protocol, specified by the IEEE 802.3 standard. Most wired network interface cards (NICs) communicate using Ethernet.
id: Ethernet adalah protokol jaringan, ditentukan oleh standar IEEE 802.3. Kebanyakan kartu antarmuka jaringan kabel (NIC) berkomunikasi menggunakan Ethernet.
tr_tr: Eternet, IEEE 802.3 standardında belirtilen bir ağ protokolüdür. Çoğu kablolu ağ arabirim kartı (NIC) Eternet kullanarak iletişim kurar.

source: Every agent that supports these extensions will register itself with the neutron server when it starts up.
id: Setiap agen yang mendukung ekstensi ini akan mendaftarkan diri dengan server neutron ketika dijalankan.
tr_tr: Bu uzantıları destekleyen her ajan, başlatıldığında kendisini neutron sunucusuna kaydeder.

source: Every trunk has a parent port and can have any number of subports. The parent port is the port that the trunk is associated with. Users create instances and specify the parent port of the trunk when launching instances attached to a trunk.
id: Setiap trunk memiliki port orangtua dan dapat memiliki sejumlah subports. Port orangtua adalah port yang bagasi terkait dengan. Pengguna membuat contoh dan menentukan port induk dari bagasi saat meluncurkan kasus melekat batang.
tr_tr: Her bilgi aktarım yolunun ana bağlantı noktası vardır ve herhangi bir sayıda alt bağlantı noktasına sahip olabilir. Ana bağlantı noktası, bilgi aktarım yolunun bağlantılı olduğu bağlantı noktasıdır. Kullanıcılar, bir bilgi aktarım yoluna bağlı sunucuları başlatırken sunucular oluşturur ve bilgi aktarım yolunun ana bağlantı noktasını belirtir.

source: Example 1 - Proof-of-concept
tr_tr: Örnek 1 - Kavramın-ispatı

source: Example 2 - DVR configuration
tr_tr: Örnek 2 - DVR yapılandırması

source: Example commands using the ``openstack`` client assume version 3.2.0 or higher.
id: Contoh perintah menggunakan klien ``openstack`` menganggap versi 3.2.0 atau lebih tinggi.
tr_tr: ``openstack`` istemcisini kullanan örnek komutların 3.2.0 veya daha üst sürümü varsayılmaktadır.

source: Example configuration
id: Konfigurasi contoh
tr_tr: Örnek yapılandırma

source: Expect performance degradation of services using tap devices: these devices do not support DPDK. Example services include DVR, FWaaS, or LBaaS.
id: Mengharapkan penurunan kinerja pelayanan menggunakan perangkat tap: perangkat ini tidak mendukung DPDK. Layanan contoh termasuk DVR, FWaaS, atau LBaaS.
tr_tr: Tap cihazları kullanıldığında servislerin performansında azaltma beklenir: bu cihazlar DPDK'yı desteklemez. Örnek servisler arasında DVR, FWaaS veya LBaaS bulunur.

source: Experimental feature or incomplete documentation.
id: Fitur eksperimental atau dokumentasi tak lengkap.
tr_tr: Deneysel özellik veya eksik dokümantasyon.

source: Experimental feature. Use of this feature requires the OpenStack client version 3.3 or newer.
id: Fitur eksperimental. Penggunaan fitur ini memerlukan klien OpenStack versi 3.3 atau yang lebih baru.
tr_tr: Deneysel özellik. Bu özelliğin kullanımı OpenStack istemcisinin 3.3 veya daha yeni sürümlerini gerektirir.

source: Extensions
tr_tr: Uzantılar

source: External Router A,M,O
tr_tr: Harici Yönlendirici A,M,O

source: External mechanism drivers from various vendors exist as well as the neutron integrated reference implementations.
id: Driver mekanisme eksternal dari berbagai vendor ada serta implementasi referensi neutron terintegrasi.
tr_tr: Neutron ile entegre referans uygulamalarının yanısıra, çeşitli şirketlerden gelen harici mekanizma sürücüleri mevcuttur.

source: External open source mechanism drivers exist as well as the neutron integrated reference implementations. Configuration of those drivers is not part of this document. For example:
id: Driver mekanisme open source eksternal ada serta implementasi referensi neutron terintegrasi. Konfigurasi driver ini bukan bagian dari dokumen ini. Sebagai contoh:
tr_tr: Harici açık kaynak mekanizması sürücüleriyle birlikte neutron entegre referans uygulamaları da mevcuttur. Bu sürücülerin yapılandırması bu belgenin parçası değildir. Örneğin:

source: Extra configuration
id: Konfigurasi tambahan
tr_tr: Ek yapılandırmalar

source: FWaaS allows creation of IPv6 based rules.
id: FWaaS memungkinkan penciptaan aturan berbasis IPv6.
tr_tr: FWaaS IPv6 tabanlı kuralların oluşturulmasına olanak sağlar.

source: FWaaS always adds a default ``deny all`` rule at the lowest precedence of each policy. Consequently, a firewall policy with no rules blocks all traffic by default.
id: FWaaS selalu menambahkan default aturan ``deny all``` pada prioritas terendah dari setiap kebijakan. Akibatnya, kebijakan firewall tanpa aturan memblok semua lalu lintas secara default.
tr_tr: FWaaS her zaman her politikanın en düşük önceliğine ``deny all`` kuralını varsayılan olarak ekler. Sonuç olarak, hiç kural içermeyen bir güvenlik duvarı politikası tüm trafiği varsayılan olarak engeller.

source: FWaaS management options are also available in the Dashboard.
id: Opsi manajemen FWaaS juga tersedia di Dashboard.
tr_tr: FWaaS yönetim seçenekleri Gösterge Paneli'nde de mevcuttur.

source: FWaaS v1 versus v2
id: FWaaS v1 dibandingkan dengan v2
tr_tr: FWaaS v1 ve v2 karşılaştırması

source: Feature
id: Fitur
tr_tr: Özellik

source: Filtering resources with a tag whose name contains a comma is not supported. Thus, do not put such a tag name to resources.
id: Penyaringan sumber dengan tag yang namanya mengandung koma tidak didukung. Dengan demikian, tidak menempatkan seperti nama tag ke sumber daya.
tr_tr: Kaynakları virgül içeren bir etiketle filtrelemek desteklenmiyor. Bu nedenle, kaynaklara böyle bir etiket adı koymayın.

source: Filtering with tags
id: Penyaringan dengan tag
tr_tr: Etikete göre filtreleme

source: Firewall v2 is not supported by horizon yet.
tr_tr: Güvenlik duvarı v2 horizon tarafından henüz desteklenmiyor.

source: Firewall-as-a-Service (FWaaS)
tr_tr: Hizmet Olarak Güvenlik Duvarı (FWaaS)

source: Firewall-as-a-Service (FWaaS) v1 scenario
id: Skenario Firewall-as-a-Service (FWaaS) v1
tr_tr: Hizmet Olarak Güvenlik Duvarları (FWaaS) v1 senaryosu

source: Firewall-as-a-Service (FWaaS) v2 scenario
id: Skenario Firewall-as-a-Service (FWaaS) v2
tr_tr: Servis olarak güvenlik duvarı (FWaaS) v2 senaryosu

source: Firewalls
id: Firewall
tr_tr: Güvenlik duvarları

source: Firewalls are implemented in various ways, depending on the driver used. For example, an iptables driver implements firewalls using iptable rules. An OpenVSwitch driver implements firewall rules using flow entries in flow tables. A Cisco firewall driver manipulates Cisco appliances. A VMware driver configures NSX routers.
tr_tr: Güvenlik duvarları, kullanılan sürücüye bağlı olarak çeşitli şekillerde uygulanır. Örneğin, bir iptables sürücüsü iptables kurallarını kullanarak güvenlik duvarları uygular. Bir OpenVSwitch sürücüsü, akış tablolarındaki akış girdilerini kullanarak güvenlik duvarı kurallarını uygular. Bir Cisco güvenlik duvarı sürücüsü, Cisco cihazlarını yönetir. Bir VMware sürücüsü NSX yönlendiricilerini yapılandırır.

source: Firewalls are used to regulate traffic to and from a host or a network. A firewall can be either a specialized device connecting two networks or a software-based filtering mechanism implemented on an operating system. Firewalls are used to restrict traffic to a host based on the rules defined on the host. They can filter packets based on several criteria such as source IP address, destination IP address, port numbers, connection state, and so on. It is primarily used to protect the hosts from unauthorized access and malicious attacks. Linux-based operating systems implement firewalls through ``iptables``.
id: Firewall digunakan untuk mengatur lalu lintas ke dan dari host atau jaringan. Firewall dapat berupa perangkat khusus yang menghubungkan dua jaringan atau mekanisme penyaringan berbasis software diimplementasikan pada sistem operasi. Firewall digunakan untuk membatasi lalu lintas ke host berdasarkan aturan yang ditetapkan pada host. Mereka dapat menyaring paket berdasarkan beberapa kriteria seperti alamat IP sumber, alamat IP tujuan, nomor port, status koneksi, dan sebagainya. Hal ini terutama digunakan untuk melindungi host dari akses yang tidak sah dan serangan berbahaya. Sistem operasi berbasis Linux mengimplementasikan firewall melalui ``iptables``.
tr_tr: Güvenlik duvarları, bir ana bilgisayara veya bir ağa gelen ve bu ağdaki trafiği düzenlemek için kullanılır. Güvenlik duvarı, iki ağa bağlanan özel bir aygıt olabilir veya bir işletim sisteminde uygulanan yazılım tabanlı bir filtreleme mekanizması olabilir. Güvenlik duvarları, ana bilgisayarda tanımlanan kurallara dayanarak bir ana bilgisayara trafiği kısıtlamak için kullanılır. Paketleri, kaynak IP adresi, hedef IP adresi, bağlantı noktası numaraları, bağlantı durumu vb. gibi çeşitli ölçütlere dayalı olarak filtreleyebilirler. Öncelikli olarak, ana bilgisayarları yetkisiz erişime ve kötü niyetli saldırılara karşı korumak için kullanılır. Linux tabanlı işletim sistemleri, güvenlik duvarlarını ``iptables`` vasıtasıyla uygularlar.

source: First, as admin, create a shared subnet pool:
id: Pertama, sebagai admin, buatlah subnet kolam bersama:
tr_tr: Önce admin olarak paylaşılan bir alt ağ havuzu oluşturun:

source: First, create a QoS policy and its bandwidth limit rule:
id: Pertama, buat kebijakan QoS dan aturan batas bandwidth:
tr_tr: Önce QoS politikası ve bant genişliği sınırını oluşturun:

source: First, create a network and IPv6 subnet:
id: Pertama, buat jaringan dan subnet IPv6:
tr_tr: Önce bir ağ ve IPv6 alt ağı oluşturun:

source: First, the router gateway external port:
id: Pertama, port eksternal gerbang router:
tr_tr: İlk olarak, yönlendirici ağ geçidi harici bağlantı noktası:

source: First, would not it be nice if you could turn your pool of addresses over to Neutron to take care of? When you need to create a subnet, you just ask for addresses to be allocated from the pool. You do not have to worry about what you have already used and what addresses are in your pool. Subnet pools can do this.
id: Pertama, mungkin tidak akan lebih baik jika Anda bisa mengubah kolam alamat Anda ke Neutron untuk mengurusnya? Bila Anda perlu membuat subnet, Anda hanya meminta alamat yang akan dialokasikan dari kolam. Anda tidak perlu khawatir tentang apa yang Anda telah digunakan dan apa alamat yang ada di kolam Anda. Kolam subnet bisa melakukan ini.
tr_tr: Öncelikle, adresler havuzunu bakmak için Neutron'a çevirirsen hoş olmaz mıydı? Bir alt ağ oluşturmanız gerektiğinde, sadece havuzdan tahsis edilecek adresler isteyin. Zaten kullandıklarınız ve havuzunuzdaki adresler hakkında endişelenmenize gerek yok. Alt ağ havuzları bunu yapabilir.

source: Flat
tr_tr: Düz

source: Flat networks for project allocation are not supported. They only can exist as a provider network.
id: Jaringan datar (flat) untuk alokasi proyek tidak didukung. Mereka hanya bisa eksis sebagai jaringan operator (provider)
tr_tr: Proje paylaşımı için düz ağlar desteklenmiyor. Onlar yalnızca bir sağlayıcı ağı olarak var olabilirler.

source: Floating IP addresses
id: Alamat IP mengambang
tr_tr: Yüzen IP adresleri

source: Floating IPs
tr_tr: Yüzen IPler

source: Flow classifier
tr_tr: Akış sınıflandırıcı

source: Following are the PTR records created for this example. Note that for IPv4, the value of ipv4_ptr_zone_prefix_size is 24. For more details, see :ref:`config-dns-int-ext-serv`:
id: Berikut ini adalah catatan PTR yang dibuat untuk contoh ini. Perhatikan bahwa untuk IPv4, nilai ipv4_ptr_zone_prefix_size adalah 24. Untuk lebih jelasnya, lihat :ref: `config-dns-int-ext-serv`:
tr_tr: Bu örnek için oluşturulan PTR kayıtları aşağıda verilmiştir. IPv4 için ipv4_ptr_zone_prefix_size'nin değeri 24'tür. Ayrıntılı bilgi için bkz :ref:`config-dns-int-ext-serv`:

source: Following are the PTR records created for this example. Note that for IPv4, the value of ipv4_ptr_zone_prefix_size is 24. In the case of IPv6, the value of ipv6_ptr_zone_prefix_size is 116. For more details, see :ref:`config-dns-int-ext-serv`:
id: Berikut ini adalah catatan PTR yang dibuat untuk contoh ini. Perhatikan bahwa untuk IPv4, nilai ipv4_ptr_zone_prefix_size adalah 24. Dalam kasus IPv6, nilai ipv6_ptr_zone_prefix_size adalah 116. Untuk lebih jelasnya, lihat :ref:`config-dns-int-ext-serv`:
tr_tr: Aşağıdakiler bu örnek için oluşturulan PTR kayıtlarıdır. IPv4 için, ipv4_ptr_zone_prefix_size değerinin 24 olduğunu not edin. IPv6 için ipv6_ptr_zone_prefix_size değeri 116'dır. Daha fazla detay için, :ref:`config-dns-int-ext-serv` bakınız:

source: Following is an example of these steps:
id: Berikut ini adalah contoh langkah-langkah:
tr_tr: Aşağıda bu adımların bir örneği verilmiştir:

source: For DHCPv6, the currently supported combinations are as follows:
tr_tr: DHCPv6 için, mevcutta desteklenen kombinasyonlar aşağıdaki gibi:

source: For IPv4, the router performs DNAT on the packet which changes the destination IP address to the instance IP address on the self-service network and sends it to the gateway IP address on the self-service network via the self-service interface (6).
id: Untuk IPv4, router melakukan DNAT pada paket yang mengubah alamat IP tujuan ke alamat IP instance di jaringan self-service dan mengirimkannya ke alamat IP gateway di jaringan self-service melalui antarmuka self-service (6) .
tr_tr: IPv4 için yönlendirici, hedef IP adresini self servis ağındaki sunucu IP adresine değiştiren paket üzerinde DNAT gerçekleştirir ve self servis ağı üzerinden self servis ağı üzerindeki ağ geçidi IP adresine gönderir (6) .

source: For IPv4, the router performs DNAT on the packet which changes the destination IP address to the instance IP address on the self-service network and sends it to the gateway IP address on the self-service network via the self-service interface (7).
id: Untuk IPv4, router melakukan DNAT pada paket yang mengubah alamat IP tujuan ke alamat IP instance di jaringan self-service dan mengirimkannya ke alamat IP gateway di jaringan self-service melalui antarmuka self-service (7) .
tr_tr: IPv4 için, yönlendirici hedef IP adresini self servis ağındaki sunucu IP adresine değiştiren paket üzerinde DNAT gerçekleştirir ve kendini servis arabirimi (7) aracılığıyla self-servis ağındaki ağ geçidi IP adresine gönderir.

source: For IPv4, the router performs SNAT on the packet which changes the source IP address to the router IP address on the provider network and sends it to the gateway IP address on the provider network via the gateway interface on the provider network (11).
id: Untuk IPv4, router melakukan SNAT pada paket yang mengubah alamat IP sumber ke alamat IP router pada jaringan provider dan mengirimkannya ke alamat IP gateway di jaringan provider melalui antarmuka gateway pada jaringan provider (11).
tr_tr: IPv4 için yönlendirici, kaynak IP adresini sağlayıcı ağı üzerindeki yönlendirici IP adresine değiştiren ve sağlayıcının ağındaki ağ geçidi arabirimi (11) aracılığıyla sağlayıcı ağı üzerindeki ağ geçidi IP adresine gönderen paket üzerinde SNAT gerçekleştirir.

source: For IPv4, the router performs SNAT on the packet which changes the source IP address to the router IP address on the provider network and sends it to the gateway IP address on the provider network via the gateway interface on the provider network (17).
id: Untuk IPv4, router melakukan SNAT pada paket yang mengubah alamat IP sumber ke alamat IP router pada jaringan provider dan mengirimkannya ke alamat IP gateway di jaringan provider melalui antarmuka gateway pada jaringan provider (17).
tr_tr: IPv4 için yönlendirici, kaynak IP adresini sağlayıcı ağındaki yönlendirici IP adresine değiştiren ve sağlayıcı ağındaki ağ geçidi arabirimi (17) aracılığıyla sağlayıcı ağındaki ağ geçidi IP adresine gönderen paket üzerinde SNAT gerçekleştirir.

source: For IPv6, the router sends the packet to the next-hop IP address, typically the gateway IP address on the provider network, via the provider gateway interface (11).
id: Untuk IPv6, router mengirimkan paket ke alamat IP hop berikutnya (next-hop), biasanya alamat IP gateway pada jaringan provider, melalui antarmuka gateway provider (11).
tr_tr: IPv6 için yönlendirici, paketi sağlayıcı ağ geçidi arabirimi (11) vasıtasıyla, paketin bir sonraki durak IP adresine, genellikle sağlayıcı ağı üzerindeki ağ geçidi IP adresine gönderir.

source: For IPv6, the router sends the packet to the next-hop IP address, typically the gateway IP address on the provider network, via the provider gateway interface (17).
id: Untuk IPv6, router mengirimkan paket ke alamat IP next-hop, biasanya alamat IP gateway pada jaringan provider, melalui antarmuka gateway provider (17).
tr_tr: IPv6 için, yönlendirici paketi, sağlayıcının ağ geçidi arabirimi (17) aracılığıyla bir sonraki durak IP adresine, genellikle sağlayıcı ağı üzerindeki ağ geçidi IP adresine gönderir.

source: For IPv6, the router sends the packet to the next-hop IP address, typically the gateway IP address on the self-service network, via the self-service interface (6).
id: Untuk IPv6, router mengirimkan paket ke alamat IP hop berikutnya (next-hop), biasanya alamat IP gateway di jaringan self-service, melalui antarmuka self-service (6).
tr_tr: IPv6 için yönlendirici, paketi self-servis arayüzü (6) aracılığıyla bir sonraki durak IP adresine, genelde self-servis ağındaki ağ geçidi IP adresine gönderir.
