Repository: 25hours/openstack-manuals
Catalog: doc/user-guide/locale/*.po
Languages: fr, ja

source: To allow access through a UDP port, such as allowing access to a DNS server that runs on a VM, choose one of the following options:
ja: 仮想マシンで実行する DNS サーバーにアクセスするなど、UDP ポート経由でのアクセスを許可するには、以下のオプションの 1 つを選択します。

source: Allow UDP access from IP addresses, specified as IP subnet <filename>0.0.0.0/0</filename> in CIDR notation:<placeholder-1/>
ja: CIDR 表記で IP サブネット <filename>0.0.0.0/0</filename> として指定して、すべての IP アドレスからの UDP アクセスを許可します。<placeholder-1/>

source: Allow only IP addresses from other security groups (source groups) to access the specified port:
ja: 他のセキュリティグループからの IP アドレス (ソースグループ) のみが指定したポートにアクセスできるようにします。

source: Delete a security group rule
fr: supprimer une règle de groupe de sécurité
ja: セキュリティグループのルールの削除

source: To delete a security group rule, specify the same arguments that you used to create the rule.
fr: Pour supprimer une règle de groupe de sécurité, spécifiez les mêmes arguments que vous avez utilisé pour créer la règle.
ja: セキュリティグループのルールを削除するには、ルール作成に使用したものと同じ引数を指定します。

source: For example, to delete the security group rule that permits SSH access from all IP addresses, run the following command.
ja: 例えば、すべての IP アドレスからの SSH アクセスを許可するセキュリティグループルールを削除する場合、以下のコマンドを実行します。

source: Manage IP addresses
fr: Gérer les adresses IP
ja: IP アドレスの管理

source: Each instance has a private, fixed IP address and can also have a public, or floating, address. Private IP addresses are used for communication between instances, and public addresses are used for communication with networks outside the cloud, including the Internet.
ja: 各インスタンスは、プライベートな固定 IP アドレスを持ちます。また、パブリックな Floating IP アドレスも持てます。プライベート IP アドレスは、インスタンス間の通信に使用されます。パブリックアドレスは、インターネットなどのクラウド外のネットワークと通信するために使用されます。

source: When you launch an instance, it is automatically assigned a private IP address that stays the same until you explicitly terminate the instance. Rebooting an instance has no effect on the private IP address.
fr: Lorsque vous lancez une instance, il lui sera automatiquement assigné une adresse IP privée qui restera la même jusqu'à ce que vous terminiez explicitement l'instance. Un redemarrage de l'instance n'a pas d'effet sur l'adresse IP privée.
ja: インスタンスを起動すると、プライベート IP アドレスが割り当てられ、インスタンスを明示的に終了するまで、この IP アドレスは変わりません。インスタンスをリブートしても、プライベート IP アドレスには影響はありません。

source: A pool of floating IP addresses, configured by the cloud administrator, is available in OpenStack Compute. The project quota defines the maximum number of floating IP addresses that you can allocate to the project. After you allocate a floating IP address to a project, you can:
ja: Floating IP アドレスのプールは、クラウド管理者により設定され、OpenStack Compute で利用できます。プロジェクトのクォータが、プロジェクトに確保できる Floating IP アドレスの最大数を定義します。プロジェクトに Floating IP アドレスを確保した後、以下を実行できます。

source: Associate the floating IP address with an instance of the project. Only one floating IP address can be allocated to an instance at any given time.
ja: Floating IP アドレスをプロジェクトのインスタンスに割り当てます。Floating IP アドレスは、同時に 1 つだけインスタンスに割り当てられます。

source: Disassociate a floating IP address from an instance in the project.
fr: Dissocier une adresse IP flottante d'une instance d'un projet.
ja: プロジェクトのインスタンスから Floating IP アドレスの割り当てを解除します。

source: Delete a floating IP from the project; deleting a floating IP automatically deletes that IP's associations.
ja: プロジェクトから Floating IP アドレスを削除します。Floating IP アドレスの削除により、その IP の割り当てが自動的に解除されます。

source: Use the <placeholder-1/> commands to manage floating IP addresses.
fr: Utiliser la commande <placeholder-1/> pour gérer les adresses IP flottantes.
ja: Floating IP アドレスを管理するために、<placeholder-1/> コマンドを使用します。

source: List floating IP address information
fr: Liste des informations d'adresse IP flottante
ja: Floating IP アドレスの情報の表示

source: To list all pools that provide floating IP addresses, run:
ja: Floating IP アドレスを提供するプールをすべて表示するために、以下を実行します。

source: If this list is empty, the cloud administrator must configure a pool of floating IP addresses.
ja: これが空白の場合、クラウド管理者は Floating IP アドレスのプールを設定する必要があります。

source: To list all floating IP addresses that are allocated to the current project, run:
fr: Pour lister toutes les adresses IP flottantes qui sont allouées au projet courant exécuter :
ja: 現在のプロジェクトに確保されている、すべての Floating IP アドレスを一覧表示するために、以下を実行します。

source: For each floating IP address that is allocated to the current project, the command outputs the floating IP address, the ID for the instance to which the floating IP address is assigned, the associated fixed IP address, and the pool from which the floating IP address was allocated.
ja: 現在のプロジェクトに確保されている各 Floating IP アドレスに対して、このコマンドは、Floating IP アドレス、Floating IP アドレスが割り当てられたインスタンスの ID、関連付けられた固定 IP アドレス、Floating IP アドレスが確保されたプールを出力します。

source: Associate floating IP addresses
fr: Associer des adresses IP flottantes
ja: Floating IP アドレスの割り当て

source: You can assign a floating IP address to a project and to an instance.
fr: Vous pouvez assigner une adresse flottante à un projet et à une instance.
ja: Floating IP アドレスをプロジェクトやインスタンスに割り当てられます。

source: Run the following command to allocate a floating IP address to the current project. By default, the floating IP address is allocated from the <systemitem>public</systemitem> pool. The command outputs the allocated IP address.
ja: 現在のプロジェクトに Floating IP アドレスを確保するために、以下のコマンドを実行します。Floating IP はデフォルトで、<systemitem>public</systemitem> プールから確保されます。このコマンドは、確保した IP アドレスを出力します。

source: If more than one IP address pool is available, you can specify the pool from which to allocate the IP address, using the pool's name. For example, to allocate a floating IP address from the <literal>test</literal> pool, run:
ja: IP アドレスのプールが 1 つ以上利用可能な場合、どちらのプールから IP アドレスを確保するのかを、プールの名前を使用して指定します。例えば、Floating IP アドレスを <literal>test</literal> プールから確保するために、以下を実行します。

source: List all project instances with which a floating IP address could be associated:
ja: プロジェクトのすべてのインスタンス、割り当てられた Floating IP アドレスを一覧表示します。

source: Associate an IP address with an instance in the project, as follows:
ja: 以下のように、IP アドレスをプロジェクトのインスタンスに割り当てます。

source: For example:
fr: Par exemple :
ja: 例えば

source: Notice that the instance is now associated with two IP addresses:
ja: これで 2 つの IP アドレスがインスタンスに関連付けられていることに気が付くでしょう。

source: After you associate the IP address and configure security group rules for the instance, the instance is publicly available at the floating IP address.
ja: インスタンスに IP アドレスを割り当てて、セキュリティグループルールを設定してから、インスタンスを Floating IP アドレスで公開します。

source: If an instance is connected to multiple networks, you can associate a floating IP address with a specific fixed IP address using the optional <parameter>--fixed-address</parameter> parameter:
ja: インスタンスが複数のネットワークに接続されている場合、オプションの <parameter>--fixed-address</parameter> パラメーターを使用して、指定した固定 IP アドレスに Floating IP アドレスを関連付けられます。

source: Disassociate floating IP addresses
fr: Dé-associer les adresse IP flottantes
ja: Floating IP アドレスの割り当て解除

source: Release a floating IP address from an instance, as follows:
fr: Libérer une adresse IP flottante d'une instance, comme suit :
ja: 以下のように、Floating IP アドレスをインスタンスから割り当て解除します。

source: Release the floating IP address from the current project, as follows:
fr: Libérer une adresse IP flottante d'un projet courant, comme suit :
ja: 以下のとおり、現在のプロジェクトから Floating IP アドレスを解放します。

source: The IP address is returned to the pool of IP addresses that is available for all projects. If the IP address is still associated with a running instance, it is automatically disassociated from that instance.
ja: IP アドレスは、すべてのプロジェクトで利用できるように IP アドレスのプールに戻されます。IP アドレスが実行中のインスタンスにまだ割り当てられていると、そのインスタンスから自動的に割り当て解除されます。

source: Stop and start an instance
fr: Démarrer et arrêter une instance
ja: インスタンスの停止と起動

source: Use one of the following methods to stop and start an instance.
fr: Utilisez une des méthodes suivantes pour arrêter et démarrer une instance :
ja: 以下の手段の 1 つを使用して、インスタンスを停止して起動します。

source: Pause and unpause an instance
ja: インスタンスの一時停止と一時停止解除

source: To pause an instance, run the following command:
ja: インスタンスを一時停止するには以下のコマンドを実行します。

source: This command stores the state of the VM in RAM. A paused instance continues to run in a frozen state.
ja: このコマンドは、RAM に仮想マシンの状態を保存します。一時停止となったインスタンスは、一時停止した状態で実行が継続されます。

source: To unpause the instance, run the following command:
ja: インスタンスを一時停止解除するには以下のコマンドを実行します。

source: Suspend and resume an instance
fr: Suspend and Resume (suspendre et reprendre)
ja: インスタンスの休止と再開

source: Administrative users might want to suspend an instance if it is infrequently used or to perform system maintenance. When you suspend an instance, its VM state is stored on disk, all memory is written to disk, and the virtual machine is stopped. Suspending an instance is similar to placing a device in hibernation; memory and vCPUs become available to create other instances.
ja: 頻繁でない場合やシステムメンテナンスを実行する場合、管理ユーザーがインスタンスを休止したいかもしれません。インスタンスを休止すると、仮想マシンの状態はディスクに保存され、メモリーはすべてディスクに書き込まれて、仮想マシンが停止します。インスタンスの休止は、デバイスの休止状態に似ていますが、他のインスタンスを作成するために、メモリーや仮想 CPU が解放されます。

source: To initiate a hypervisor-level suspend operation, run the following command:
ja: ハイパーバイザーレベルの休止操作を開始するには、以下のコマンドを実行します。

source: To resume a suspended instance, run the following command:
ja: 休止中のインスタンスを再開するには以下のコマンドを実行します。

source: Shelve and unshelve an instance
ja: インスタンスの退避と復元

source: Shelving is useful if you have an instance that you are not using, but would like retain in your list of servers. For example, you can stop an instance at the end of a work week, and resume work again at the start of the next week. All associated data and resources are kept; however, anything still in memory is not retained. If a shelved instance is no longer needed, it can also be entirely removed.
ja: 使用していないけれど、サーバー一覧に残しておきたいインスタンスを退避することは有用です。例えば、仕事の週末にインスタンスを停止でき、翌週に再び再開できます。すべての関連するデータとリソースは保持されます。しかしながら、メモリーの内容は失われます。退避したインスタンスが必要なくなれば、完全に削除することもできます。

source: You can complete the following shelving tasks:
ja: 以下の退避作業を実行できます。

source: Shelve an instance
ja: インスタンスの退避

source: Shuts down the instance, and stores it together with associated data and resources (a snapshot is taken if not volume backed). Anything in memory is lost. Use the following command:
ja: インスタンスをシャットダウンし、関連するデータとリソース (ボリュームがバックアップされていなければ、スナップショットが取得されます) を一緒に保存します。メモリーの内容はすべて失われます。以下のコマンドを使用します。

source: Unshelve an instance
ja: インスタンスの復元

source: Restores the instance:
ja: インスタンスを復元します。

source: Remove a shelved instance
ja: 退避済みインスタンスの削除

source: Removes the instance from the server; data and resource associations are deleted. If an instance is no longer needed, you can move that instance off the hypervisor in order to minimize resource usage:
ja: サーバーからインスタンスを削除します。データとリソースの関連づけが削除されます。インスタンスが必要なくなれば、リソース使用量を最小化するために、ハイパーバイザーからインスタンスを削除できます。

source: Manage instances and hosts
fr: Gérer les instances et les hôtes
ja: インスタンスとホストの管理

source: Instances are virtual machines that run inside the cloud on physical compute nodes. The Compute service manages instances. A host is the node on which a group of instances resides.
fr: Les instances sont des machines virtuelles qui fonctionne dans le cloud sur des nœuds physique de calcul.
ja: インスタンスは、クラウド内の物理コンピュートノードで動作する仮想マシンです。Compute がインスタンスを管理します。ホストは、インスタンスのグループが属するノードです。

source: This section describes how to perform the different tasks involved in instance management, such as adding floating IP addresses, stopping and starting instances, and terminating instances. This section also discusses node management tasks.
ja: このセクションは、インスタンスの管理に関するさまざまな作業を実行する方法について説明します。Floating IP アドレスの追加、インスタンスの停止、開始、終了などがあります。また、このセクションはノード管理作業についても記載しています。

source: OpenStack End User Guide
fr: Guide Utilisateur Final d'OpenStack
ja: OpenStack エンドユーザーガイド

source: End User Guide
fr: Guide Utilisateur Final
ja: エンドユーザーガイド

source: current
fr: en cours
ja: カレント

source: OpenStack is an open-source cloud computing platform for public and private clouds. A series of interrelated projects deliver a cloud infrastructure solution. This guide shows OpenStack end users how to create and manage resources in an OpenStack cloud with the OpenStack dashboard and OpenStack client commands.
ja: OpenStack は、パブリッククラウドやプライベートクラウド向けの、オープンソースのクラウドコンピューティングプラットフォームです。一連の相互に関連するプロジェクトがクラウドインフラストラクチャーソリューションを提供します。このガイドは、OpenStack のユーザーが、OpenStack のダッシュボードやコマンドラインクライアントを用いて、OpenStack クラウドのリソースを作成および管理する方法について説明します。

source: This guide documents OpenStack Icehouse and OpenStack Havana releases.
ja: このガイドは OpenStack Icehouse と OpenStack Havana リリースについて記載しています。

source: Add a command line cheat sheet.
ja: コマンドラインのチートシートを追加しました。

source: For the Icehouse release, this guide has been updated with changes to the dashboard plus the moving of the command reference appendix as indicated below.
ja: このガイドは Icehouse リリース向けに、ダッシュボードを変更しました。また、以下に示したとおり、付録のコマンドリファレンスを移動しました。

source: Removed the command reference appendix. This information is now in the <link href="http://docs.openstack.org/cli-reference/content/"><citetitle>OpenStack Command-Line Interface Reference</citetitle></link>.
ja: 付録のコマンドリファレンスを削除しました。この情報は現在 <link href="http://docs.openstack.org/cli-reference/content/"><citetitle>OpenStack コマンドラインインターフェースリファレンス</citetitle></link>にあります。

source: Added the OpenStack Python SDK chapter.
fr: Ajouté le chapitre OpenStack Python SDK.
ja: OpenStack Python SDK に関する章を追加しました。

source: Havana release.
fr: Havana lancement.
ja: Havana リリース。

source: Editorial changes.
fr: Changement éditorial
ja: 編集上の変更。

source: First edition of this document.
fr: Première édition de ce document.
ja: このドキュメントの初版。

source: Use snapshots to migrate instances
fr: Utiliser les instantanés pour migrer des instances
ja: インスタンス移行のためのスナップショットの使用

source: To use snapshots to migrate instances from OpenStack projects to clouds, complete these steps.
fr: Pour utiliser les instantanés pour migrer les instances des projets OpenStack vers les clouds, veuillez compléter ces étapes:
ja: OpenStack プロジェクトからクラウドにインスタンスを移行するためにスナップショットを使用する場合、これらの手順を実行します。

source: In the source project, perform the following steps:
fr: Dans le projet source, réaliser les étapes suivantes :
ja: 移行元のプロジェクトで以下の手順を実行します。

source: Create a snapshot of the instance.
fr: Créer un instantané de l'instance.
ja: インスタンスのスナップショットを作成します。

source: Download the snapshot as an image.
fr: Télécharger l'instantané comme une image.
ja: スナップショットをイメージとしてダウンロードします。

source: In the destination project, perform the following steps:
fr: Dans le projet destination, réaliser les étapes suivantes :
ja: 移行先のプロジェクトで以下の手順を実行します。

source: Import the snapshot to the new environment.
fr: Importer l'instantané dans le nouvel environnement.
ja: スナップショットを新しい環境にインポートします。

source: Boot a new instance from the snapshot.
fr: Démarrer une nouvelle instance depuis un instantané.
ja: スナップショットから新しいインスタンスを起動します。

source: Some cloud providers allow only administrators to perform this task.
fr: Certains fournisseurs de cloud n'autorisent uniquement que les administrateurs à réaliser cette tâche.
ja: いくつかのクラウドプロバイダーは管理者のみがこの作業を実行できます。

source: Create a snapshot of the instance
fr: Créer un instantané de l'instance
ja: インスタンスのスナップショットの作成

source: Shut down the source VM before you take the snapshot to ensure that all data is flushed to disk. If necessary, list the instances to view get the instance name.
ja: 確実にすべてのデータをディスクに書き込むために、スナップショットを取得する前に、ソース仮想マシンをシャットダウンします。必要に応じて、インスタンスの名前を確認するために、インスタンスを一覧表示します。

source: Use the <placeholder-1/> command to confirm that the instance shows a <literal>SHUTOFF</literal> status.
ja: インスタンスが<literal>停止</literal>状態になっていることを確認するために、<placeholder-1/> コマンドを使用します。

source: Use the <placeholder-1/> command to take a snapshot. Use the <placeholder-2/> command to check the status until the status is <literal>ACTIVE</literal>:
fr: Utiliser la commande <placeholder-1/> pour prendre un instantané. Utiliser la commande <placeholder-2/> pour vérifier le status pendant que celui-ci est <literal>ACTIVE</literal>:
ja: スナップショットを取得するために <placeholder-1/> コマンドを使用します。<literal>実行中</literal>状態の間は、状態を確認するために <placeholder-2/> コマンドを使用します。

source: Download the snapshot as an image
fr: Télécharger l'instantané comme une image
ja: イメージとしてスナップショットのダウンロード

source: Get the image ID:
fr: Obtenir l'ID de l'image:
ja: イメージ ID を取得します。

source: Download the snapshot by using the image ID that was returned in the previous step:
fr: Télécharger l'instantané en utilisant l'ID de l'image fournie à l'étape précédente:
ja: 前の手順で返されたイメージ ID を使用してスナップショットをダウンロードします。

source: The <placeholder-1/> command requires the image ID and cannot use the image name.
fr: La commande <placeholder-1/> requiert l'ID de l'image et ne peut utiliser le nom de l'image.
ja: <placeholder-1/> コマンドは、イメージ ID を必要とし、イメージ名を使用しません。

source: Ensure there is sufficient space on the destination file system for the image file.
fr: S'assurer qu'il y a assez d'espace sur le système de destination du fichier pour le fichier image.
ja: イメージファイルの宛先ファイルシステムに十分な空き容量があることを確認します。

source: Make the image available to the new environment, either through HTTP or with direct upload to a machine (<placeholder-1/>).
ja: 新しい環境でイメージを利用可能にします。HTTP 経由、またはマシンに直接アップロード (<placeholder-1/>) します。

source: Import the snapshot to new environment
fr: Importer l'instantané dans le nouvel environnement
ja: 新しい環境へのスナップショットのインポート

source: In the new project or cloud environment, import the snapshot:
fr: Dans le nouveau projet ou nouveau environnement cloud, importer l'instantané:
ja: 新しいプロジェクトやクラウド環境で、スナップショットをインポートします。

source: Boot a new instance from the snapshot
fr: Démarrer une nouvelle instance depuis l'instantané
ja: スナップショットから新しいインスタンスを起動します。

source: In the new project or cloud environment, use the snapshot to create the new instance:
fr: Dans le nouveau projet ou le nouvel environnement cloud, utiliser un instantané pour créer une nouvelle instance:
ja: 新しいプロジェクトやクラウド環境で、新しいインスタンスを作成するためにスナップショットを使用します。

source: Store metadata on a configuration drive
fr: Store métadonnées sur un lecteur de configuration
ja: コンフィグドライブへのメタデータの保存

source: You can configure OpenStack to write metadata to a special configuration drive that attaches to the instance when it boots. The instance can mount this drive and read files from it to get information that is normally available through the <link href="http://docs.openstack.org/admin-guide-cloud/content/section_metadata-service.html">metadata service</link>. This metadata is different from the user data.
ja: OpenStack は、起動時にインスタンスに接続される特別な設定ドライブにメタデータを書き込むように設定することができます。インスタンスはこのディスクをマウントしてそこからファイルを読み込むことで、通常<link href="http://docs.openstack.org/admin-guide-cloud/content/section_metadata-service.html">メタデータサービス</link>から提供される情報を取得することができます。このメタデータは、ユーザーデータと異なります。

source: One use case for using the configuration drive is to pass a networking configuration when you do not use DHCP to assign IP addresses to instances. For example, you might pass the IP address configuration for the instance through the configuration drive, which the instance can mount and access before you configure the network settings for the instance.
ja: コンフィグドライブを使用するユースケースとして、インスタンスへの IP アドレスの割り当てに DHCP を使用しない場合に (IP アドレス、ネットマスク、ゲートウェイなどの) ネットワーク設定を config ドライブで渡すことなどが挙げられます。コンフィグドライブは、インスタンスのネットワーク設定が設定される前にマウント、アクセスできるため、コンフィグドライブを使用して IP アドレス設定を転送することができます。

source: Any modern guest operating system that is capable of mounting an ISO 9660 or VFAT file system can use the configuration drive.
ja: コンフィグドライブは、ISO 9660 または VFAT のファイルシステムをマウントできるゲストオペレーティングシステムからであればどれでも使用することができます。この機能は、最近のオペレーティングシステムのすべてで利用できるはずです。

source: Requirements and guidelines
fr: Configurations et conseils
ja: 要件とガイドライン

source: To use the configuration drive, you must follow the following requirements for the compute host and image.
ja: コンフィグドライブを使用するために、コンピュートホストとイメージに関する以下の要件を満たす必要があります。

source: Compute host requirements
fr: Configuration hôte requise
ja: コンピュートホストの要件

source: The following hypervisors support the configuration drive: libvirt, XenServer, Hyper-V, and VMware.
ja: 次のハイパーバイザーがコンフィグドライブをサポートします。libvirt、XenServer、Hyper-V、VMware。

source: To use configuration drive with libvirt, XenServer, or VMware, you must first install the <package>genisoimage</package> package on each compute host. Otherwise, instances do not boot properly.
ja: libvirt、XenServer、VMware でコンフィグドライブを使用するには、<package>genisoimage</package> プログラムを各コンピュートホストにインストールする必要があります。

source: Use the <literal>mkisofs_cmd</literal> flag to set the path where you install the <package>genisoimage</package> program. If <package>genisoimage</package> is in same path as the <systemitem class="service">nova-compute</systemitem> service, you do not need to set this flag.
fr: Utilisez le flag <literal>mkisofs_cmd</literal> pour définir le chemin sur lequel vous installez le programme <package>genisoimage</package>. Si <package>genisoimage</package> est dans le même chemin que le service <systemitem class="service">nova-compute</systemitem>, vous n'avez pas besoin de définir ce flag.
ja: <package>genisoimage</package> プログラムをインストールするパスを設定するために、<literal>mkisofs_cmd</literal> フラグを使用します。<package>genisoimage</package> が <systemitem class="service">nova-compute</systemitem> サービスと同じパスである場合、このフラグを設定する必要がありません。

source: To use configuration drive with Hyper-V, you must set the <literal>mkisofs_cmd</literal> value to the full path to an <literal>mkisofs.exe</literal> installation. Additionally, you must set the <literal>qemu_img_cmd</literal> value in the <literal>hyperv</literal> configuration section to the full path to an <literal>qemu-img</literal> command installation.
ja: Hyper-V でコンフィグドライブを使用する場合、<literal>mkisofs_cmd</literal> の値を <literal>mkisofs.exe</literal> のインストレーションへの完全パスに設定する必要があります。さらに、<literal>qemu-img</literal> コマンドのインストレーションへの完全パスに <literal>hyperv</literal> 設定セクションの <literal>qemu_img_cmd</literal> フラグの値を設定する必要があります。

source: Image requirements
fr: images requises
ja: イメージの要件

source: An image built with a recent version of the <package>cloud-init</package> package can automatically access metadata passed through the configuration drive. The <package>cloud-init</package> package version 0.7.1 works with Ubuntu and Fedora based images, such as Red Hat Enterprise Linux.
ja: <package>cloud-init</package> パッケージの最新版で構築したイメージは、自動的にコンフィグドライブを介してメタデータにアクセスできます。<package>cloud-init</package> パッケージのバージョン 0.7.1 は Ubuntu、Red Hat Enterprise Linux のような Fedora ベースのイメージで動作します。

source: If an image does not have the <package>cloud-init</package> package installed, you must customize the image to run a script that mounts the configuration drive on boot, reads the data from the drive, and takes appropriate action such as adding the public key to an account. See <xref linkend="config_drive_contents"/> for details about how data is organized on the configuration drive.
ja: イメージに <package>cloud-init</package> パッケージがインストールされていない場合、起動時に config ドライブをマウントしドライブからデータを読み込み公開鍵をアカウントに追加するなどといった適切なアクションをとれるようにスクリプトを実行するように、このイメージをカスタマイズする必要があります。データがコンフィグドライブでどのように整理されているかについての詳細は<xref linkend="config_drive_contents"/>を参照してください。

source: If you use Xen with a configuration drive, use the <literal>xenapi_disable_agent</literal> configuration parameter to disable the agent.
fr: si vous utilisez Xen avec un lecteur de configuration, utiliser le <literal>xenapi_disable_agent</literal> paramètre de configuration pour désactiver l'agent.
ja: Xen でコンフィグドライブを使用する場合、エージェントを無効化するために <literal>xenapi_disable_agent</literal> 設定パラメーターを使用します。

source: Guidelines
fr: Conseils
ja: ガイドライン

source: Do not rely on the presence of the EC2 metadata in the configuration drive, because this content might be removed in a future release. For example, do not rely on files in the <filename>ec2</filename> directory.
ja: コンフィグドライブにある EC2 メタデータに依存しないようにしてください。この内容は将来のリリースで削除される可能性があります。たとえば、<filename>ec2</filename> ディレクトリにあるファイルに依存しないでください。
