Repository: 25hours/openstack-manuals
Catalog: doc/user-guide/locale/*.po
Languages: fr, ja

source: The <literal>print_hosts</literal> method is defined in <filename>utils.py</filename> and prints the host object details:
fr: La méthode <literal>print_hosts</literal> est définie dans <filename>utils.py</filename> et décrit les détails de l'objet hôte :
ja: <literal>print_hosts</literal> メソッドは、<filename>utils.py</filename> で定義され、host オブジェクトの詳細を表示します。

source: List hosts by calling <literal>list()</literal> on <literal>nova_client.hosts</literal> object:
fr: Lister les hôtes en appelant <literal>list()</literal> sur l'objet <literal>nova_client.hosts</literal> :
ja: <literal>nova_client.hosts</literal> オブジェクトの <literal>list()</literal> を呼び出すことにより、ホストを一覧表示します。

source: Print the host object details by calling <literal>print_hosts(host_list)</literal>:
fr: Imprimer les détails de l'objet hôte en appelant <literal>print_hosts(host_list)</literal> :
ja: <literal>print_hosts(host_list)</literal> を呼び出すことにより、ホストオブジェクトの詳細を表示します。

source: List hosts code listing
ja: ホストの一覧表示のコード全体

source: Launch an instance
fr: Lancer une instance
ja: インスタンスの起動

source: When you launch an instance from an image, OpenStack creates a local copy of the image on the compute node where the instance starts.
fr: Quand vous démarrez une instance depuis une image, OpenStack crée une copie locale de l'image sur le nœud de calcul d'où l'instance démarre.
ja: イメージからインスタンスを起動するとき、OpenStack はインスタンスが起動するコンピュートノードにイメージのローカルコピーを作成します。

source: When you launch an instance from a volume, note the following steps:
fr: Quand vous lancez une instance depuis un volume, noter les étapes suivantes:
ja: ボリュームからインスタンスを起動するとき、以下の手順に注意してください。

source: To select the volume to from which to launch, launch an instance from an arbitrary image on the volume. The image that you select does not boot. Instead, it is replaced by the image on the volume that you choose in the next steps.
fr: Pour sélectionner le volume à partir duquel exécuter, lancer une instance d'une image arbitraire sur un volume. L'image que vous avez sélectionnée ne démarre pas, elle est remplacée par une image d'un volume que vous choisissez dans les étapes suivantes.
ja: 起動するボリュームを選択する場合、ボリュームにある任意のイメージからインスタンスを起動します。選択したイメージは起動しません。代わりに、次の手順で選択したボリュームにあるイメージにより置き換えられます。

source: To boot a Xen image from a volume, the image you launch in must be the same type, fully virtualized or paravirtualized, as the one on the volume.
fr: Pour démarrer une image Xen depuis une volume, l'image que vous lancez doit être du même type, en virtualisation complète ou paravirtualisé, que celle du volume.
ja: ボリュームから Xen イメージを起動するために、起動するイメージは、ボリュームにあるものと同じ形式、完全仮想化または準仮想化である必要があります。

source: Select the volume or volume snapshot from which to boot. Enter a device name. Enter <literal>vda</literal> for KVM images or <literal>xvda</literal> for Xen images.
fr: Sélectionnez le volume ou l'instantané de volume à partir duquel démarrer. Entrez un nom de périphérique. Entrez <literal>vda</literal> pour une image KVM ou <literal>xvda</literal> pour une image Xen.
ja: 起動するためのボリュームまたはボリュームのスナップショットを選択します。デバイス名を入力します。KVM イメージの場合は <literal>vda</literal>、Xen イメージの場合は <literal>xvda</literal> を入力します。

source: Log in to the dashboard, choose a project, and click <guilabel>Images</guilabel>.
fr: Se connecter au tableau de bord, choisir un projet et cliquer <guilabel>Images</guilabel>.
ja: ダッシュボードにログインし、プロジェクトを選択し、<guilabel>イメージ</guilabel>をクリックします。

source: The dashboard shows the images that have been uploaded to OpenStack Image Service and are available for this project.
fr: Le tableau de bord affiche les images qui ont été téléchargé sur le Service d'Image OpenStack et qui sont disponibles pour ce projet.
ja: ダッシュボードは、OpenStack Image Service にアップロードされた、このプロジェクトが利用可能なイメージを表示します。

source: For details on creating images, see <link href="http://docs.openstack.org/image-guide/content/ch_creating_images_manually.html">Creating images manually</link> in the <citetitle>OpenStack Virtual Machine Image Guide</citetitle>.
fr: Pour les détails sur la création d'images, voir <link href="http://docs.openstack.org/image-guide/content/ch_creating_images_manually.html">Création manuelle d'images</link> dans le <citetitle>Guide Image d'une Machine Virtuelle d'OpenStack</citetitle>.
ja: イメージの作成に関する詳細は、<citetitle>OpenStack Virtual 仮想マシンイメージガイド</citetitle>の<link href="http://docs.openstack.org/image-guide/content/ch_creating_images_manually.html">イメージの手動作成</link>を参照してください。

source: Select an image and click <guibutton>Launch</guibutton>.
fr: Sélectionner une image et cliquer <guibutton> Lancer </guibutton>.
ja: イメージを選択し、<guibutton>起動</guibutton>をクリックします。

source: In the Launch Instance dialog box, specify the following values:
fr: Dans la boite de dialogue Lancer une Instance, spécifier les valeurs suivantes:
ja: インスタンスの起動ダイアログボックスで、以下の値を指定します。

source: Details
fr: Détails
ja: 詳細

source: Availability Zone
fr: Zone de Disponibilité
ja: アベイラビリティゾーン

source: By default, this value is set to the availability zone given by the cloud provider (for example, <literal>us-west</literal> or <literal>apac-south</literal>). For some cases, it could be <literal>nova</literal>.
fr: Par défaut, cette valeur est positionnée à la zone de disponibilité donnée par le fournisseur du cloud (par exemple, <literal>us-west</literal> ou <literal>apac-south</literal>). Dans certains cas, cela peut être <literal>nova</literal>.
ja: この値はデフォルトで、クラウドプロバイダーにより指定されたアベイラビリティゾーンに設定されます (例えば、<literal>us-west</literal>、<literal>apac-south</literal>)。<literal>nova</literal> となっている場合もあります。

source: Instance Name
fr: Nom de l'Instance
ja: インスタンス名

source: Assign a name to the virtual machine.
fr: Assigner un nom à la machine virtuelle.
ja: 仮想マシンに名前を割り当てます。

source: The name you assign here becomes the initial host name of the server. After the server is built, if you change the server name in the API or change the host name directly, the names are not updated in the dashboard.
fr: Le nom que vous assignez ici devient le nom de l'hôte initial du serveur. Après la construction du serveur, si vous changez le nom du serveur dans l'API ou changez directement le nom de l'hôte, les noms ne sont pas mis à jour dans le tableau de bord.
ja: ここで割り当てた名前が、サーバーの初期ホスト名になります。サーバー稼働後、API でサーバー名を変更した場合、ホスト名を直接変更した場合、ダッシュボードに表示される名前は更新されません。

source: Server names are not guaranteed to be unique when created so you could have two instances with the same host name.
fr: Les noms de serveurs ne sont pas garantis d'êtres uniques quand ils sont créés alors vous pouvez avoir deux instances avec le même nom d'hôte.
ja: サーバー名は一意性が保証されていません。そのため、同じ名前を持つインスタンスを 2 つ起動する可能性があります。

source: Flavor
fr: Type d'instance
ja: フレーバー

source: Specify the size of the instance to launch.
fr: Spécifier la taille de l'instance à démarrer.
ja: 起動するインスタンスの大きさを指定します。

source: The flavor is selected based on the size of the image selected for launching an instance. For example, while creating an image, if you have entered the value in the <guilabel>Minimum RAM (MB)</guilabel> field as 2048, then on selecting the image, the default flavor is <guilabel>m1.small</guilabel>.
fr: Le type d'instance est sélectionnée sur la base de la taille d'image sélectionnée pour exécuter une instance. Par exemple, pendant la création d'une image, si vous avez entré une valeur de 2048 dans le champ <guilabel>RAM Minimum (Mo)</guilabel>, alors à la sélection de l'image, le type d'instance par défaut est <guilabel>m1.small</guilabel>.
ja: フレーバーは、インスタンスを起動するために選択したイメージの大きさに基づいて選択されます。例えば、イメージの作成時、<guilabel>最少メモリ (MB)</guilabel> の項目に 2048 という値を入力した場合、イメージを選択時に、デフォルトのフレーバーが <guilabel>m1.small</guilabel> になります。

source: Instance Count
fr: Nombre d'Instances
ja: インスタンス数

source: To launch multiple instances, enter a value greater than 1. The default is 1.
fr: Pour lancer plusieurs instances, entrer une valeur supérieure à 1. La valeur par défaut est 1.
ja: 複数のインスタンスを起動する場合、1 より大きな値を入力します。初期値は 1 です。

source: Instance Boot Source
fr: Source de l'instance de démarrage.
ja: インスタンスのブートソース

source: Your options are:
fr: Vos options sont:
ja: 以下のオプションがあります。

source: Boot from image
fr: Démarrage depuis une image
ja: イメージから起動

source: If you choose this option, a new field for <guilabel>Image Name</guilabel> displays. You can select the image from the list.
fr: Si vous choisissez cette option, un nouveau champ apparaît pour <guilabel>Nom de l'image</guilabel>. Vous pouvez sélectionner une image depuis la liste.
ja: このオプションを選択する場合、<guilabel>イメージ名</guilabel>の新項目が表示されます。この一覧からイメージを選択できます。

source: Boot from snapshot
fr: Démarrage depuis un instantané
ja: スナップショットから起動

source: If you choose this option, a new field for <guilabel>Instance Snapshot</guilabel> displays. You can select the snapshot from the list.
fr: Si vous choisissez cette option, un nouveau champ apparaît pour <guilabel>Instantané d'Instance</guilabel>. Vous pouvez sélectionner un instantané depuis la liste.
ja: このオプションを選択する場合、<guilabel>インスタンスのスナップショット</guilabel>の新項目が表示されます。この一覧からスナップショットを選択できます。

source: Boot from volume
fr: Démarrage depuis un volume
ja: ボリュームから起動

source: If you choose this option, a new field for <guilabel>Volume</guilabel> displays. You can select the volume from the list.
fr: Si vous choisissez cette option, un nouveau champ apparaît pour <guilabel>Volume</guilabel>. Vous pouvez sélectionner un volume depuis la liste.
ja: このオプションを選択する場合、<guilabel>ボリューム</guilabel>の新項目が表示されます。この一覧からボリュームを選択できます。

source: Boot from image (creates a new volume)
fr: Démarrage depuis une image (crée un nouveau volume)
ja: イメージから起動 (新しいボリュームを作成)

source: With this option, you can boot from an image and create a volume by entering the <guilabel>Device Size</guilabel> and <guilabel>Device Name</guilabel> for your volume. Click the <guilabel>Delete on Terminate</guilabel> option to delete the volume on terminating the instance.
fr: Avec cette option, vous pouvez démarrer à partir d'une image et créer un volume en entrant la <guilabel>Taille du périphérique</guilabel> et le <guilabel>Nom du périphérique</guilabel> pour votre volume. Cliquer l'option <guilabel>Supprimer à la Fin</guilabel> pour supprimer le volume à la terminaison de l'instance.
ja: このオプションを使用する場合、ボリュームの<guilabel>デバイス容量</guilabel>と<guilabel>デバイス名</guilabel>を入力して、イメージから起動し、ボリュームを作成できます。インスタンスの終了時に、ボリュームを削除する場合、<guilabel>終了時に削除</guilabel>オプションをクリックします。

source: Boot from volume snapshot (creates a new volume)
fr: Démarrage depuis un instantané de volume (crée un nouveau volume)
ja: ボリュームのスナップショットから起動 (新しいボリュームを作成)

source: Using this option, you can boot from a volume snapshot and create a new volume by choosing <guilabel>Volume Snapshot</guilabel> from a list and adding a <guilabel>Device Name</guilabel> for your volume. Click the <guilabel>Delete on Terminate</guilabel> option to delete the volume on terminating the instance.
fr: En utilisant cette option, vous pouvez démarrer à partir de l'instantané d'un volume et créer un nouveau volume en choisissant <guilabel>Instantané d'un Volume Snapshot</guilabel> depuisune liste et en ajoutant un <guilabel>Nom de périphérique</guilabel> pour votre volume. Cliquer sur l'option <guilabel>Supprimer à la fin</guilabel> pour supprimer le volume à la terminaison de l'instance.
ja: このオプションを使用する場合、<guilabel>ボリュームのスナップショット</guilabel>を一覧から選択し、ボリュームの<guilabel>デバイス名</guilabel>を追加することにより、ボリュームのスナップショットから起動し、新しいボリュームを作成できます。インスタンスの終了時に、ボリュームを削除する場合、<guilabel>終了時に削除</guilabel>オプションをクリックします。

source: Since you are launching an instance from an image, <guilabel>Boot from image</guilabel> is chosen by default.
fr: Puisque vous lancez une instance depuis une image, <guilabel>Démarrer depuis une image</guilabel>est choisi par défaut.
ja: イメージからインスタンスを起動するため、<guilabel>イメージから起動</guilabel>が初めから選択されています。

source: Image Name
fr: Nom de l'Image
ja: イメージ名

source: This field changes based on your previous selection. Since you have chosen to launch an instance using an image, the <guilabel>Image Name</guilabel> field displays. Select the image name from the dropdown list.
fr: Ce champ évolue suivant vos précédentes sélections. Puisque vous avez choisi de lancer une instance en utilisant une image le champ <guilabel>Nom de l'Image</guilabel> apparaît. Sélectionner le nom de l'image dans la liste déroulante.
ja: この項目は、前に選択したものに依存して変化します。イメージを使用してインスタンスを起動することを選択した場合、<guilabel>イメージ名</guilabel>の項目が表示されます。ドロップダウンリストからイメージ名を選択します。

source: Access &amp; Security
fr: Accès et Sécurité
ja: アクセスとセキュリティ

source: Keypair
fr: Paire de clés
ja: キーペア

source: Specify a key pair.
fr: Spécifier une paire de clés.
ja: キーペアを指定します。

source: If the image uses a static root password or a static key set (neither is recommended), you do not need to provide a key pair to launch the instance.
fr: Si l'image utilise un mot de passe root fixe ou des clés statiques (aucun des deux n'est recommandé), vous n'avez pas besoin de fournir une paire de clés pour lancer une instance.
ja: イメージが固定の root パスワードまたは固定のキーセットを使用する場合 (どちらも推奨されません)、インスタンスを起動するためにキーペアを提供する必要がありません。

source: Security Groups
fr: Groupes de Sécurité
ja: セキュリティグループ

source: Activate the security groups that you want to assign to the instance.
fr: Activer les groupes de sécurité que vous souhaitez attribuer à l'instance.
ja: インスタンスに割り当てたいセキュリティグループを有効化します。

source: Security groups are a kind of cloud firewall that define which incoming network traffic is forwarded to instances. For details, see <xref linkend="security_groups_add_rule"/>.
fr: Les groupes de sécurités sont une sorte de pare-feu cloud qui définissent quel flux réseau est transmis à l'instance. Pour plus de détails, voir <xref linkend="security_groups_add_rule"/>.
ja: セキュリティグループはある種のクラウドファイアウォールです。どの入力ネットワーク通信がインスタンスに転送されるのかを定義します。詳細は<xref linkend="security_groups_add_rule"/>を参照してください。

source: If you have not created any security groups, you can assign only the default security group to the instance.
fr: Si vous n'avez pas créer de groupe de sécurité, Vous ne pourrez pas affecter le groupe de sécurité par defaut à l'instance.
ja: セキュリティグループを何も作成していなければ、標準のセキュリティグループのみをインスタンスに割り当てられます。

source: Networking
fr: Réseaux
ja: ネットワーク

source: Selected Networks
fr: Réseaux sélectionnés
ja: 選択済みネットワーク

source: To add a network to the instance, click the <guibutton>+</guibutton> in the <guilabel>Available Networks</guilabel> field.
fr: Pour ajouter un réseau à une instance, cliquer sur le <guibutton>+</guibutton> dans le champs <guilabel>Réseaux Disponibles</guilabel>.
ja: インスタンスにネットワークを追加するために、<guilabel>利用可能なネットワーク</guilabel>欄にある <guibutton>+</guibutton> をクリックします。

source: Post-Creation
fr: Post-Création
ja: 作成後

source: Customization Script
fr: Script de Personnalisation
ja: カスタマイズ・スクリプト

source: Specify a customization script that runs after your instance launches.
fr: Spécifier un script personnalisé qui s'exécute après les lancements de votre instance.
ja: インスタンスの起動後に実行するカスタマイズスクリプトを指定します。

source: Advanced Options
fr: Options avancées
ja: 高度な設定

source: Disk Partition
fr: Partition Disque
ja: ディスクパーティション

source: Select the type of disk partition from the dropdown list.
fr: Sélectionner le type de partition de disque depuis la liste déroulante.
ja: ドロップダウンリストからディスクパーティションの種類を選択します。

source: Automatic
fr: Automatique
ja: 自動

source: Entire disk is single partition and automatically resizes.
fr: Le disque entier est une partition unique et automatiquement redimensionné.
ja: ディスク全体が単一パーティションになり、自動的にリサイズされます。

source: Manual
fr: Manuel
ja: 手動

source: Faster build times but requires manual partitioning.
fr: Temps de construction plus rapides mais nécessite un partitionnement manuel.
ja: 構築時間は早いですが、手動でパーティション作成する必要があります。

source: Click <guibutton>Launch</guibutton>.
fr: Cliquer <guibutton>Lancer</guibutton>.
ja: <guibutton>起動</guibutton>をクリックします。

source: The instance starts on a compute node in the cloud.
fr: L'instance démarre sur un nœud de calcul dans le cloud.
ja: インスタンスがクラウドのコンピュートノードで起動します。

source: The <guilabel>Instances</guilabel> tab shows the instance's name, its private and public IP addresses, size, status, task, and power state.
fr: L'onglet <guilabel>Instances</guilabel> affiche les noms des instances, leurs adresses privées et publiques, taille, status, tâches, et leur état.
ja: <guilabel>インスタンス</guilabel>タブに、インスタンス名、プライベート IP アドレス、パブリック IP アドレス、大きさ、状態、処理、電源状態が表示されます。

source: If you did not provide a key pair, security groups, or rules, users can access the instance only from inside the cloud through VNC. Even pinging the instance is not possible without an ICMP rule configured. To access the instance through a VNC console, see <xref linkend="instance_console"/>.
fr: Si vous ne fournissez pas une paire de clés, des groupes de sécurité ou des règles, les utilisateurs ne peuvent accéder à l'instance uniquement en interne du cloud à travers VNC. Effectuer un ping sur une instance n'est même pas possible sans une règle ICMP configurée. Pour accéder à l'instance à travers une console VNC, voir <xref linkend="instance_console"/>.
ja: キーペア、セキュリティグループ、ルールなどを指定していない場合、ユーザーは VNC 経由でクラウドの中からのみインスタンスにアクセスできます。ICMP のルールを設定していなければ、インスタンスに ping できないでしょう。VNC コンソールからインスタンスにアクセスする方法は、<xref linkend="instance_console"/>を参照してください。

source: Upload and manage images
fr: Téléchargez et gérez les images
ja: イメージのアップロードと管理

source: A virtual machine image, referred to in this document simply as an image, is a single file that contains a virtual disk that has a bootable operating system installed on it. Images are used to create virtual machine instances within the cloud. For information about creating image files, see the <link href="http://docs.openstack.org/image-guide/content/"><citetitle>OpenStack Virtual Machine Image Guide</citetitle></link>.
ja: 仮想マシンイメージは、このドキュメントでは単にイメージと言いますが、そこにインストールされたブート可能なオペレーティングシステムを持つ仮想ディスクを含む単一のファイルです。イメージは、クラウド内で仮想マシンインスタンスを作成するために使用されます。イメージファイルの作成に関する詳細は、<link href="http://docs.openstack.org/image-guide/content/"><citetitle>OpenStack Virtual Machine Image Guide</citetitle></link> を参照してください。

source: Depending on your role, you may have permission to upload and manage virtual machine images. Operators might restrict the upload and management of images to cloud administrators or operators only. If you have the appropriate privileges, you can use the dashboard to upload and manage images in the <guilabel>admin</guilabel> project.
ja: お使いのロールに応じて、仮想マシンイメージをアップロード、管理する権限があるかもしれません。運用者は、イメージのアップロードや管理をクラウド管理者や運用者のみに制限するかもしれません。適切な権限を持っていれば、ダッシュボードの <guilabel>admin</guilabel> プロジェクトで、イメージをアップロードおよび管理できます。

source: You can also use the <placeholder-1/> and <placeholder-2/> command-line clients or the Image Service and Compute APIs to manage images. See <xref linkend="cli_manage_images"/>.
fr: Vous pouvez également utiliser clients en ligne de commande <placeholder-1/> et <placeholder-2/> ou le Service d'Image et les API Compute pour gérer les images. Voir <xref linkend="cli_manage_images"/>.
ja: イメージを管理するために、<placeholder-1/> と <placeholder-2/> コマンドラインクライアントまたは Image Service API と Compute API を使用することもできます。<xref linkend="cli_manage_images"/>を参照してください。

source: Upload an image
fr: Téléchargez une image
ja: イメージのアップロード

source: Follow this procedure to upload an image to a project.
fr: Suivez cette procédure pour télécharger une image dans un projet.
ja: イメージをプロジェクトにアップロードするために、この手順に従います。

source: Log in to the dashboard.
fr: Connectez-vous au tableau de bord.
ja: ダッシュボードにログインします。

source: From the <guilabel>CURRENT PROJECT</guilabel> on the <guilabel>Project</guilabel> tab, select the appropriate project.
fr: Depuis <guilabel>PROJET COURANT</guilabel> sur l'onglet <guilabel>Projet</guilabel>, sélectionner le projet approprié.
ja: <guilabel>プロジェクト</guilabel>タブの<guilabel>現在のプロジェクト</guilabel>から、適切なプロジェクトを選択します。

source: On the <guilabel>Project</guilabel> tab, click <guilabel>Images</guilabel>.
fr: Dans l'onglet <guilabel>Projet</guilabel>, cliquer sur <guilabel>Images</guilabel>
ja: <guilabel>プロジェクト</guilabel> タブで、<guilabel>イメージ</guilabel>をクリックします。

source: Click <guibutton>Create Image</guibutton>.
fr: Cliquer <guibutton> Créer une Image </guibutton>.
ja: <guibutton>イメージの作成</guibutton>をクリックします。

source: The Create An Image dialog box appears.
fr: La boite de dialogue Créer Une Image apparaît.
ja: 「イメージの作成」ダイアログボックスが表示されます。

source: Enter the following values:
fr: Entrez les valeurs suivantes:
ja: 以下の値を入力します。

source: Name
fr: Nom
ja: 名前

source: Enter a name for the image.
fr: Entrer un nom pour l'image.
ja: イメージの名前を入力します。

source: Description
ja: 説明

source: Optionally, enter a brief description of the image.
fr: Optionnellement, entrez une brève description de l'image.
ja: オプションとして、イメージの簡単な説明を入力します。

source: Image Source
fr: Source de l'Image
ja: イメージソース

source: Choose the image source from the list. Your choices are <guilabel>Image Location</guilabel> and <guilabel>Image File</guilabel>.
fr: Choisissez dans la liste la source de l'image. Vos choix sont <guilabel>Emplacement Image</guilabel> et <guilabel>Fichier Image</guilabel>.
ja: 一覧からイメージのソースを選択します。<guilabel>イメージの場所</guilabel>と<guilabel>イメージファイル</guilabel>を選択できます。

source: <guilabel>Image File</guilabel> or <guilabel>Image Location</guilabel>
fr: <guilabel>Fichier Image</guilabel> ou <guilabel>Emplacement Image</guilabel>
ja: <guilabel>イメージファイル</guilabel>または<guilabel>イメージの場所</guilabel>

source: Based on your selection for <guilabel>Image Source</guilabel>, you either enter the location URL of the image in the <guilabel>Image Location</guilabel> field. or browse to the image file on your system and add it.
fr: Suivant votre sélection pour <guilabel>Source Image</guilabel>, vous pouvez soit entrer le chemin de l'URL de l'image dans le champs <guilabel>Emplacement Image</guilabel> ou naviguer sur votre système jusqu'au fichier image et l'ajouter.
ja: <guilabel>イメージのソース</guilabel>の選択内容に応じて、<guilabel>イメージの場所</guilabel>の項目にイメージの URL を入力するか、お使いのシステムにあるイメージファイルを参照して追加します。

source: Format
ja: 形式

source: Select the correct format (for example, QCOW2) for the image.
fr: Sélectionnez le format correct (par exemple, QCOW2) pour cette image.
ja: イメージの適切な形式 (例: QCOW2) を選択します。

source: Architecture
ja: アーキテクチャー

source: Specify the architecture. For example, <literal>i386</literal> for a 32-bit architecture or <literal>x86-64</literal> for a 64-bit architecture.
fr: Spécifier l'architecture. Par exemple, <literal>i386</literal> pour une architecture 32 bits ou <literal>x86-64</literal> pour une architecture 64 bits.
ja: アーキテクチャーを指定します。例えば、32 ビットアーキテクチャーは <literal>i386</literal>、64 ビットアーキテクチャーは <literal>x86-64</literal> です。

source: <guilabel>Minimum Disk (GB)</guilabel> and <guilabel>Minimum RAM (MB)</guilabel>
fr: <guilabel>Disque Minimum (Go)</guilabel> et <guilabel>RAM minimum (Mo)</guilabel>
ja: <guilabel>最小ディスク (GB)</guilabel> および<guilabel>最小メモリ (MB)</guilabel>

source: Leave these optional fields empty.
fr: Laisser ces champs optionnels vides.
ja: これらのオプション項目を空白のままにします。

source: Public
fr: Publique
ja: パブリック

source: Select this check box to make the image public to all users with access to the current project.
fr: Sélectionner cette case pour rendre l'image publique à tous les utilisateurs ayant accès au projet courant.
ja: 現在のプロジェクトにアクセス権を持つすべてのユーザーにイメージを公開する場合、このチェックボックスを選択します。

source: Protected
fr: Protégée
ja: 保護

source: Select this check box to ensure that only users with permissions can delete the image.
fr: Sélectionner cette case pour s'assurer que seuls les utilisateurs avec les permissions puissent supprimer cette image.
ja: 権限を持つユーザーのみがこのイメージを削除できるようにする場合、このチェックボックスを選択します。

source: The image is queued to be uploaded. It might take some time before the status changes from Queued to Active.
fr: L'image est dans une file d'attente pour être téléchargée. Cela peut prendre un peu de temps avant que le statut passe de En attente à Active
ja: イメージがアップロードのためにキューに入れられます。ステータスが Queued から Active に変更されるまでに少し時間がかかるかもしれません。

source: Update an image
fr: Mise à jour de l'image.
ja: イメージの更新
