Repository: 25hours/openstack-manuals
Catalog: doc/user-guide/locale/*.po
Languages: fr, ja

source: Upload file to a container
fr: Charger un fichier dans le conteneur
ja: コンテナーへのファイルのアップロード

source: List objects in container
fr: Lister les objets du conteneur
ja: コンテナーにあるオブジェクトの一覧表示

source: Download object from container
fr: Télécharger un objet du conteneur
ja: コンテナーからのオブジェクトのダウンロード

source: Upload with chunks, for large file
fr: Charger par morceaux pour un gros fichier
ja: チャンク化した大きなファイルのアップロード

source: Create and manage object containers
fr: Créer et gérer les conteneurs d'objets
ja: オブジェクトコンテナーの作成と管理

source: OpenStack Object Storage provides a distributed, API-accessible storage platform that can be integrated directly into an application or used to store any type of file, including VM images, backups, archives, or media files. In the OpenStack Dashboard, you can only manage containers and objects.
ja: OpenStack Object Storage は、API アクセス可能な、分散ストレージプラットフォームです。アプリケーションに直接統合できます。また、仮想マシンイメージ、バックアップ、アーカイブ、メディアファイルなど、あらゆる種類のファイルを保存するために使用されます。OpenStack Dashboard では、コンテナーとオブジェクトのみを管理できます。

source: In OpenStack Object Storage, containers provide storage for objects in a manner similar to a Windows folder or Linux file directory, though they cannot be nested. An object in OpenStack consists of the file to be stored in the container and any accompanying metadata.
ja: OpenStack Object Storage では、コンテナーがオブジェクト用のストレージを提供します。Windows のフォルダーや Linux のディレクトリと同じ方法で提供されますが、入れ子構造にできません。OpenStack におけるオブジェクトは、コンテナーに保存するためのファイルと、付随するメタデータから構成されます。

source: Log in to the dashboard, choose a project, and click <guilabel>Containers</guilabel>.
fr: Se connecter au tableau de bord, choisir un projet et cliquer <guilabel>Conteneurs</guilabel>.
ja: ダッシュボードにログインし、プロジェクトを選択し、<guilabel>コンテナー</guilabel>をクリックします。

source: Click <guibutton>Create Container</guibutton>.
fr: Cliquer <guibutton>Créer un Conteneur</guibutton>.
ja: <guibutton>コンテナーの作成</guibutton>をクリックします。

source: In the Create Container dialog box, enter a name for the container, and then click<guibutton>Create Container</guibutton>.
ja: コンテナーの作成ダイアログで、コンテナーの名前を入力し、<guibutton>コンテナーの作成</guibutton>をクリックします。

source: You have successfully created a container.
fr: Vous avez crée un conteneur avec succès.
ja: コンテナーが正常に作成されました。

source: To delete a container, click the <guibutton>More</guibutton> button and select <guilabel>Delete Container</guilabel>.
fr: Pour supprimer un conteneur, cliquer sur le bouton <guibutton>Plus</guibutton> et sélectionner <guilabel>Supprimer le conteneur</guilabel>.
ja: コンテナーを削除する場合、<guibutton>▼</guibutton>ドロップダウンボタンをクリックし、<guilabel>コンテナーの削除</guilabel>を選択します。

source: Upload an object
fr: Télécharger un objet
ja: オブジェクトのアップロード

source: Select the container in which you want to store your object.
fr: Sélectionner le conteneur dans lequel vous voulez stocker votre objet.
ja: オブジェクトを保存したいコンテナーを選択します。

source: Click <guibutton>Upload Object</guibutton>.
fr: Cliquer <guibutton>Charger l'Objet</guibutton>.
ja: <guibutton>オブジェクトのアップロード</guibutton>をクリックします。

source: The Upload Object To Container: <replaceable>&lt;name&gt;</replaceable> dialog box is displayed. <replaceable>&lt;name&gt;</replaceable> is the name of the container to which you are uploading the object.
ja: コンテナーへのオブジェクトのアップロード: <replaceable>&lt;name&gt;</replaceable> ダイアログボックスが表示されます。<replaceable>&lt;name&gt;</replaceable> は、オブジェクトをアップロードするコンテナーの名前です。

source: Enter a name for the object.
fr: Entrer un nom pour l'objet
ja: オブジェクトの名前を入力します。

source: Browse to and select the file that you want to upload.
fr: Naviguer et sélectionner le fichier que vous voulez charger.
ja: アップロードしたいファイルを選択します。

source: You have successfully uploaded an object to the container.
fr: Vous avez téléchargé un objet dans le conteneur avec succès.
ja: オブジェクトをコンテナーに正常にアップロードしました。

source: To delete an object, click the <guibutton>More</guibutton> button and select <guilabel>Delete Object</guilabel>.
fr: Pour détruire un objet, cliquer le bouton <guibutton>Plus</guibutton> et sélectionner <guilabel>Supprimer un Objet</guilabel>.
ja: オブジェクトを削除する場合、<guibutton>▼</guibutton>ボタンをクリックし、<guilabel>オブジェクトの削除</guilabel>を選択します。

source: Manage an object
fr: Gérer un objet
ja: オブジェクトの管理

source: To edit an object
fr: Pour éditer un objet
ja: オブジェクトの編集方法

source: Click <guibutton>More</guibutton> and choose <guilabel>Edit</guilabel> from the dropdown list.
fr: Cliquer <guibutton>Plus</guibutton> et choisir <guilabel>Editer</guilabel> dans la liste déroulante.
ja: <guibutton>▼</guibutton>をクリックし、ドロップダウンリストから<guilabel>編集</guilabel>を選択します。

source: The Edit Object dialog box is displayed.
fr: La boite de dialogue Éditer Objet est affichée.
ja: オブジェクトの編集ダイアログボックスが表示されます。

source: Click <guibutton>Update Object</guibutton>.
fr: Cliquer <guibutton>Mise à jour de l'Objet</guibutton>.
ja: <guibutton>オブジェクトの更新</guibutton>をクリックします。

source: To copy an object from one container to another
fr: Pour copier un objet depuis un conteneur dans un autre
ja: コンテナーから別のコンテナーへのオブジェクトのコピー方法

source: Click <guibutton>More</guibutton> and choose <guilabel>Copy</guilabel> from the dropdown list.
fr: Cliquer <guibutton>Plus</guibutton> et choisir <guilabel>Copier</guilabel> dans la liste déroulante.
ja: <guibutton>▼</guibutton>をクリックし、ドロップダウンリストから<guilabel>コピー</guilabel>を選択します。

source: In the Copy Object: launch dialog box, enter the following values:
fr: Dans Copier Objet : lancer la boite de dialogue, entrer les valeurs suivantes :
ja: オブジェクトのコピー: ダイアログボックスを起動し、以下の値を入力します。

source: <guilabel>Destination Container</guilabel>: Choose the destination container from the list.
fr: <guilabel>Conteneur de Destination</guilabel> : Choisir le conteneur de destination dans la liste.
ja: <guilabel>宛先コンテナー</guilabel>: 一覧から宛先コンテナーを選択します。

source: <guilabel>Path</guilabel>: Specify a path in which the new copy should be stored inside of the selected container.
fr: <guilabel>Chemin</guilabel> : Spécifier un chemin dans lequel la nouvelle copie devra être stockée dans le conteneur sélectionné.
ja: <guilabel>パス</guilabel>: 選択したコンテナー内に保存する新規コピーのパスを指定します。

source: <guilabel>Destination object name</guilabel>: Enter a name for the object in the new container.
fr: <guilabel>Nom de l'objet à Destination</guilabel> : Entrer un nom pour l'objet dans le nouveau conteneur.
ja: <guilabel>宛先オブジェクト名</guilabel>: 新しいコンテナーにおけるオブジェクトの名前を入力します。

source: Click <guibutton>Copy Object</guibutton>.
fr: Cliquer <guibutton>Copier Objet</guibutton>
ja: <guibutton>オブジェクトのコピー</guibutton>をクリックします。

source: To create a metadata-only object without a file
ja: ファイルなしのメタデータ専用オブジェクトの作成方法

source: You can create a new object in container without a file available and can upload the file later when it is ready. This temporary object acts a place-holder for a new object, and enables the user to share object metadata and URL info in advance.
ja: 利用可能なファイルを持たないコンテナーに新しいオブジェクトを作成できます。後から準備ができたときにファイルをアップロードできます。この一時的なオブジェクトは、新しいオブジェクトのプレースホルダーとして動作します。これにより、ユーザーがオブジェクトのメタデータを共有し、先に URL 情報を共有できるようになります。

source: To create a pseudo-folder
fr: Pour créer un pseudo-dossier
ja: 擬似フォルダーの作成方法

source: Pseudo-folders are similar to folders in your desktop operating system. They are virtual collections defined by a common prefix on the object's name.
ja: 擬似フォルダーは、お使いのデスクトップオペレーティングシステムにおけるフォルダーと同じようなものです。オブジェクトの名前にある共通の接頭辞により定義される仮想的なコレクションです。

source: Click <guibutton>Create Pseudo-folder</guibutton>.
fr: Cliquer <guibutton>Créer Pseudo-dossier</guibutton>
ja: <guibutton>擬似フォルダーの作成</guibutton>をクリックします。

source: The Create Pseudo-Folder in Container <replaceable>&lt;name&gt; </replaceable> dialog box is displayed. <replaceable>&lt;name&gt; </replaceable> is the name of the container to which you are uploading the object.
ja: コンテナー <replaceable>&lt;name&gt; </replaceable> における擬似フォルダーの作成ダイアログボックスが表示されます。<replaceable>&lt;name&gt; </replaceable> は、オブジェクトをアップロードするコンテナーの名前です。

source: Enter a name for the pseudo-folder.
fr: Entrer un nom pour le pseudo-dossier.
ja: 擬似フォルダーの名前を入力します。

source: A slash (/) character is used as the delimiter for pseudo-folders in the Object Store.
fr: Un caractère slash (/) est utilisé comme délimiteur pour les pseudo-dossiers dans le Stockage d'Objet.
ja: スラッシュ (/) 文字がオブジェクトストアの擬似フォルダーの区切り文字として使用されます。

source: Click <guibutton>Create</guibutton>.
fr: Cliquer <guibutton>Créer</guibutton>.
ja: <guibutton>作成</guibutton>をクリックします。

source: Authenticate against an Image Service endpoint
fr: S'authentifier sur un point d'accès du Service Image
ja: Image Service エンドポイントへの認証

source: To authenticate against an Image Service endpoint, instantiate a <link href="http://docs.openstack.org/developer/python-glanceclient/api/glanceclient.v2.client.html#glanceclient.v2.client.Client"> glanceclient.v2.client.Client</link> object:
fr: Pour s'authentifier sur un point d'accès Image Service, instancier un objet <link href="http://docs.openstack.org/developer/python-glanceclient/api/glanceclient.v2.client.html#glanceclient.v2.client.Client"> glanceclient.v2.client.Client</link>:
ja: Image Service エンドポイントに認証するために、<link href="http://docs.openstack.org/developer/python-glanceclient/api/glanceclient.v2.client.html#glanceclient.v2.client.Client"> glanceclient.v2.client.Client</link> オブジェクトのインスタンスを生成します。

source: As a cloud end user, you can use the OpenStack dashboard to provision your own resources within the limits set by administrators. You can modify the examples provided in this section to create other types and sizes of server instances.
fr: Comme un utilisateur final du cloud, vous pouvez utiliser le tableau de bord d'OpenStack pour approvisionner vos propres ressources dans les limites fixées par les administrateurs. Vous pouvez modifier les exemples fournis dans cette section pour créer d'autres types et tailles d'instances de serveur.
ja: あなたはクラウドのエンドユーザーとして、OpenStack Dashboard (ダッシュボード) を使用できます。管理者により設定された制限の範囲内で自身のリソースを展開できます。他の種類や大きさのサーバーインスタンスを作成するために、このセクションで提供される例を変更できます。

source: Authenticate against an Identity endpoint
fr: S'authentifier sur une point d'accès Identité.
ja: Identity エンドポイントへの認証

source: To authenticate against the Identity v2.0 endpoint, instantiate a <link href="http://docs.openstack.org/developer/python-keystoneclient/api/keystoneclient.v2_0.client.html#keystoneclient.v2_0.client.Client"> keystoneclient.v_20.client.Client</link> object:
fr: Pour s'authentifier sur une point d'accès de Identité v2.0, instancier un objet <link href="http://docs.openstack.org/developer/python-keystoneclient/api/keystoneclient.v2_0.client.html#keystoneclient.v2_0.client.Client"> keystoneclient.v_20.client.Client</link>:
ja: Identity v2.0 エンドポイントに認証するために、<link href="http://docs.openstack.org/developer/python-keystoneclient/api/keystoneclient.v2_0.client.html#keystoneclient.v2_0.client.Client"> keystoneclient.v_20.client.Client</link> オブジェクトのインスタンスを生成します。

source: After you instantiate a <classname>Client</classname> object, you can retrieve the token by accessing its <literal>auth_token</literal> attribute object:
fr: Après avoir instancié un objet <classname>Client</ classname>, vous pouvez récupérer le jeton en accédant à son objet d'attribut <literal> auth_token </ literal> :
ja: <classname>Client</classname> オブジェクトのインスタンスを生成した後、その <literal>auth_token</literal> 属性のオブジェクトにアクセスすることにより、トークンを取得できます。

source: If the OpenStack cloud is configured to use public-key infrastructure (PKI) tokens, the Python script output looks something like this:
fr: Si le cloud OpenStack est configuré pour utilisé les jetons d'infrastructure à clé publique (PKI), la sortie du script Python ressemble à ceci:
ja: OpenStack クラウドが PKI トークンを使用するよう設定されている場合、Python スクリプトの出力は以下のようになるでしょう。

source: This example shows a subset of a PKI token. A complete token is over 5000 characters long.
fr: Cet exemple montre un sous-ensemble d'un jeton de PKI. Un jeton complet fait plus de 5000 caractères.
ja: この例は PKI トークンの一部分を示します。完全なトークンは 5000 文字以上です。

source: Authenticate against a Networking endpoint
fr: S'authentifier sur un point d'accès réseau
ja: Networking エンドポイントへの認証

source: To authenticate against a Networking endpoint, instantiate a <classname>neutronclient.v_2_0.client.Client</classname> object:
fr: Pour s'authentifier sur un point d'accès réseau, instancier un objet <classname>neutronclient.v_2_0.client.Client</classname>:
ja: Networking エンドポイントに認証するために、<classname>neutronclient.v_2_0.client.Client</classname> オブジェクトのインスタンスを生成します。

source: You can also authenticate by explicitly specifying the endpoint and token:
fr: Vous pouvez également vous authentifier en spécifiant explicitement le point d'accès et le token:
ja: エンドポイントとトークンを明示的に指定して、認証することもできます。

source: Configure access and security for instances
fr: Configuration de l'accès et dela sécurité pour les instances
ja: インスタンスのアクセスとセキュリティの設定

source: When you launch a virtual machine, you can inject a <emphasis role="italic">key pair</emphasis>, which provides SSH access to your instance. For this to work, the image must contain the <literal>cloud-init</literal> package.
fr: Quand vous lancez une machine virtuelle, vous pouvez injecter une <emphasis>paire de clés</emphasis>, qui fournit un accès SSH à votre instance. Pour que cela fonctionne, l'image doit contenir le paquet <literal>clou-init</literal>.
ja: 仮想マシンの起動時、インスタンスに SSH アクセスできるようにするための、<emphasis role="italic">キーペア</emphasis>を注入できます。これを動作させるために、イメージに <literal>cloud-init</literal> パッケージをインストールしておく必要があります。

source: You create at least one key pair for each project. You can use the key pair for multiple instances that belong to that project. If you generate a key pair with an external tool, you can import it into OpenStack.
fr: Vous créez au moins une paire de clés pour chaque projet. Vous pouvez utiliser cette paire de clés pour des instances multiples appartenant à ce projet. Si vous générez une paire de clés avec un outil externe, vous pouvez l'importer avec OpenStack.
ja: 各プロジェクトに少なくとも 1 つのキーペアを作成します。そのプロジェクトに属する複数のインスタンスに対してそのキーペアを使用できます。外部ツールを用いてキーペアを生成した場合、OpenStack にインポートできます。

source: If an image uses a static root password or a static key setneither is recommendedyou must not provide a key pair when you launch the instance.
ja: イメージが固定の root パスワードまたは固定のキーセットを使用する場合、どちらも推奨されませんが、インスタンスを起動するためにキーペアを提供する必要がありません。

source: A <emphasis role="italic">security group</emphasis> is a named collection of network access rules that you use to limit the types of traffic that have access to instances. When you launch an instance, you can assign one or more security groups to it. If you do not create security groups, new instances are automatically assigned to the default security group, unless you explicitly specify a different security group.
ja: <emphasis role="italic">セキュリティグループ</emphasis> は、インスタンスへアクセスが可能なトラフィックの種別を制限するために使用するネットワークのアクセスルールを名前を付けてまとめたものです。インスタンスを起動して、1 つまたは複数のセキュリティグループをインスタンスに割り当てることができます。セキュリティグループを作成しない場合、新しいインスタンスには明示的に別のセキュリティグループを指定しない限り、自動的に Default のセキュリティグループが割り当てられます。

source: The associated <emphasis role="italic">rules</emphasis> in each security group control the traffic to instances in the group. Any incoming traffic that is not matched by a rule is denied access by default. You can add rules to or remove rules from a security group, and you can modify rules for the default and any other security group.
ja: セキュリティグループごとに割り当てた <emphasis role="italic">ルール</emphasis> は、グループ内のインスタンスへのトラフィックを制御します。デフォルトでは、ルールと合致しない受信トラフィックは、拒否されます。セキュリティグループへルールを追加することも、セキュリティグループからルールを削除することも可能です。デフォルトのルールやその他のセキュリティグループのルールを変更することができます。

source: You can modify the rules in a security group to allow access to instances through different ports and protocols. For example, you can modify rules to allow access to instances through SSH, to ping instances, or to allow UDP traffic; for example, for a DNS server running on an instance. You specify the following parameters for rules:
ja: セキュリティグループのルールを変更して、別のポートやプロトコルからインスタンスにアクセスすることができます。例えば、SSH 経由でのインスタンスへのアクセス、ping、UDP トラフィックの許可 (例: インスタンス上で実行中の DNS) などができるようにルールを変更することができます。ルールについては以下のパラメーターを指定します。

source: <emphasis role="bold">Source of traffic</emphasis>. Enable traffic to instances from either IP addresses inside the cloud from other group members or from all IP addresses.
fr: <emphasis role="bold">Source du trafic</emphasis>. Activer trafic vers les instances soit depuis les adresses à l'intérieur du cloud par les autres membres du groupe, soit de toutes les adresses IP.
ja: <emphasis role="bold">トラフィックソース</emphasis>。クラウドの IP アドレスから、他のグループメンバーから、あるいは全 IP アドレスからインスタンスへのトラフィックを可能にします。

source: <emphasis role="bold">Protocol</emphasis>. Choose TCP for SSH, ICMP for pings, or UDP.
fr: <emphasis role="bold">Protocol</emphasis>. Choisissez TCP pour SSH, ICMP pour des pings, ou UDP.
ja: <emphasis role="bold">プロトコル</emphasis>。SSH には TCP、ping には ICMP、あるいは UDP を選択します。

source: <emphasis role="bold">Destination port on virtual machine</emphasis>. Define a port range. To open a single port only, enter the same value twice. ICMP does not support ports; instead, you enter values to define the codes and types of ICMP traffic to be allowed.
ja: <emphasis role="bold">仮想マシンでの宛て先ポート番号</emphasis>。ポートの範囲を定義します。ポート 1 つのみを開くには、同じ値を 2 回入力します。ICMP はポートに対応していないため、許可する ICMP トラフィックのコードおよび種別を定義する値を代わりに入力します。

source: Rules are automatically enforced as soon as you create or modify them.
fr: Les règles sont automatiquement appliquées dès que vous créez ou modifiez.
ja: ルールは、作成または変更後すぐに自動的に有効になります。

source: Add a key pair
fr: Ajout d'une paire de clés.
ja: キーペアの追加

source: You can generate a key pair or upload an existing public key.
fr: Vous pouvez générer une paire de clés ou télécharger une clé publique existante.
ja: キーペアの生成や既存の公開鍵のアップロードが可能です。

source: To generate a key pair, run the following command:
fr: Pour générer une paire de clés, exécuter la commande suivante:
ja: キーペアを生成するために、以下のコマンドを実行します。

source: The command generates a key pair with the name that you specify fir <replaceable>KEY_NAME</replaceable>, writes the private key to the <filename>.pem</filename> file that you specify, and registers the public key at the Nova database.
fr: La commande génère une paire de clés avec le nom que vous avez donné <replaceable>KEY_NAME</replaceable>, écrivez la clé privée dans le fichier <filename>.pem</filename> que vous avez spécifié et enregistré la clef publique dans la base de donnée Nova.
ja: このコマンドは、指定した <replaceable>KEY_NAME</replaceable> という名前のキーペアを生成し、秘密鍵を <filename>.pem</filename> ファイルに書き込み、公開鍵を Nova データベースに登録します。

source: To set the permissions of the <filename>.pem</filename> file so that only you can read and write to it, run the following command:
fr: Pour fixer les permissions du fichier <filename>.pem</filename> afin que vous seul puissiez lire et écrire dans celui-ci, exécutez la commande suivante:
ja: あなただけが読み書きできるよう、<filename>.pem</filename> ファイルのパーミッションを設定するために、以下のコマンドを実行します。

source: Import a key pair
fr: Import d'une paire de clés.
ja: キーペアのインポート

source: If you have already generated a key pair and the public key is located at <filename>~/.ssh/id_rsa.pub</filename>, run the following command to upload the public key:
fr: Si vous avez déjà généré une paire de clés située dans <filename>~/.ssh/id_rsa.pub</filename>, exécutez la commande suivante pour télécharger la clé publique/
ja: すでにキーペアを生成し、公開鍵が <filename>~/.ssh/id_rsa.pub</filename> にある場合、以下のコマンドでこの公開鍵をアップロードします。

source: The command registers the public key at the Nova database and names the key pair the name that you specify for <literal><replaceable>KEY_NAME</replaceable></literal>.
fr: Les commandes enregistrent la clé publique dans la base de donnée Nova et nomment la paire de clés avec le nom que vous avez spécifié pour <literal><replaceable>KEY_NAME</replaceable></literal>.
ja: このコマンドは、Nova データベースに公開鍵を登録して、キーペアの名前を指定した <literal><replaceable>KEY_NAME</replaceable></literal> にします。

source: To ensure that the key pair has been successfully imported, list key pairs as follows:
fr: Pour s'assurer que la paire de clés a été importée avec succès, lister les paires de clés comme suit:
ja: キーペアが正常にインポートされたことを確認するために、以下のとおりキーペアを一覧表示します。

source: Create and manage security groups
fr: Créer et gérer un groupe de sécurité
ja: セキュリティグループの作成と管理

source: To list the security groups for the current project, including descriptions, enter the following command:
fr: Pour lister les groupes de sécurité pour le projet en cours, y compris les descriptions, entrez la commande suivante:
ja: 現在のプロジェクトのセキュリティグループと説明を一覧表示するために、以下のコマンドを入力します。

source: To create a security group with a specified name and description, enter the following command:
fr: Pour créer un groupe de sécurité avec un nom et une description spécifique, entrez la commande suivante:
ja: 指定された名前と説明を持つセキュリティグループを作成するために、以下のコマンドを入力します。

source: To delete a specified group, enter the following command:
fr: Pour supprimer un groupe spécifique, entrer la commande suivante:
ja: 指定されたグループを削除するために、以下のコマンドを入力します。

source: You cannot delete the default security group for a project. Also, you cannot delete a security group that is assigned to a running instance.
fr: Vous ne pouvez pas supprimer le groupe de sécurité par défaut d'un projet. Aussi, vous ne pouvez pas supprimer un groupe de sécurité qui est affecté à une instance en cours d'exécution.
ja: プロジェクトの Default のセキュリティグループは削除できません。また、実行中のインスタンスに割り当てられているセキュリティグループも削除できません。

source: Create and manage security group rules
fr: Créer et gérer une règle de groupe de sécurité
ja: セキュリティグループのルールの作成と管理

source: Modify security group rules with the <placeholder-1/> commands. Before you begin, source the OpenStack RC file. For details, see <xref linkend="cli_openrc"/>.
fr: Modifier les règles de groupes de sécurité avec les commandes <placeholder-1/>. Avant de commencer, lancer le fichier OpenStack RC. Pour les détails, voir <xref linkend="cli_openrc"/>.
ja: <placeholder-1/> コマンドを用いてセキュリティグループのルールを編集します。開始する前に、OpenStack RC ファイルを読み込みます。詳細は <xref linkend="cli_openrc"/> を参照してください。

source: To list the rules for a security group, run the following command:
fr: Pour lister les règles pour un groupe de sécurité, exécutez la commande suivante:
ja: セキュリティグループのルールを一覧表示するために、以下のコマンドを実行します。

source: To allow SSH access to the instances, choose one of the following options:
fr: Pour autoriser l'accès SSH aux instances, choisissez l'une des options suivantes:
ja: インスタンスへの SSH 接続を許可するために、以下のオプションのどれかを選択します。

source: Allow access from all IP addresses, specified as IP subnet <filename>0.0.0.0/0</filename> in CIDR notation:
fr: Autorise l'accès à partir de toutes les adresses IP, spécifiée en tant que sous réseau IP <filename>0.0.0.0/0</filename> en notation CIDR:
ja: CIDR 表記で IP サブネット <filename>0.0.0.0/0</filename> として指定して、すべての IP アドレスからのアクセスを許可します。

source: Allow access only from IP addresses from other security groups (source groups) to access the specified port:
fr: Autoriser l'accès uniquement depuis les adresses IP depuis d'autres groupes de sécurité (groupes source) pour accéder à des ports spécifiques :
ja: 他のセキュリティグループからの IP アドレス (ソースグループ) のみが指定したポートにアクセスできるようにします。

source: To allow pinging of the instances, choose one of the following options:
fr: Pour autoriser un pinging des instances, choisir une des options suivantes :
ja: インスタンスへの ping アクセスを許可するには、以下のオプションのどれかを選択します。

source: Allow pinging from all IP addresses, specified as IP subnet <filename>0.0.0.0/0</filename> in CIDR notation:
fr: Autoriser un pinging de toutes les adresses IP, spécifiées comme sous réseau IP <filename>0.0.0.0/0</filename> dans la notation CIDR :
ja: CIDR 表記で IP サブネット <filename>0.0.0.0/0</filename> として指定して、すべての IP アドレスからの ping を許可します。

source: This allows access to all codes and all types of ICMP traffic.
fr: Ceci autorise l'accès à tous les codes et à tous les types de trafic ICMP.
ja: これにより、すべてのコードとすべての種類の ICMP 通信が許可されます。

source: Allow only members of other security groups (source groups) to ping instances:
ja: 他のセキュリティグループ (ソースグループ) のメンバーのみがインスタンスに ping できるようにします。
