Repository: 25hours/openstack-manuals
Catalog: doc/user-guide/locale/*.po
Languages: fr, ja

source: When you create images that access configuration drive data and multiple directories are under the <filename>openstack</filename> directory, always select the highest API version by date that your consumer supports. For example, if your guest image supports the 2012-03-05, 2012-08-05, and 2013-04-13 versions, try 2013-04-13 first and fall back to a previous version if 2013-04-13 is not present.
ja: コンフィグドライブデータにアクセスするイメージを作成する際に、<filename>openstack</filename> ディレクトリに複数のディレクトリが存在する場合、常にコンシューマーのサポートがある日付で最新の API バージョンのものを選択するようにしてください。例えば、ゲストイメージがバージョン 2012-03-05、2012-08-05、2013-04-13 をサポートする場合、まず 2013-04-13 を試します。2013-04-13 がない場合は次に新しいバージョンを見ていきます。

source: Enable and access the configuration drive
fr: Activer et accéfer au lecteur de configuration.
ja: コンフィグドライブの有効化とアクセス

source: To enable the configuration drive, pass the <literal>--config-drive true</literal> parameter to the <placeholder-1/> command.
ja: <placeholder-1/> コマンドに <literal>--config-drive true</literal> パラメーターをつけ、コンフィグドライブを有効化します。

source: The following example enables the configuration drive and passes user data, two files, and two key/value metadata pairs, all of which are accessible from the configuration drive:
ja: 以下の例は、コンフィグドライブを有効化し、ユーザーデータを渡します。このデータはコンフィグドライブからアクセスできる、2 つのファイル、2 つのキーバリューメタデータペアです。

source: You can also configure the Compute service to always create a configuration drive by setting the following option in the <filename>/etc/nova/nova.conf</filename> file:
ja: <filename>/etc/nova/nova.conf</filename> ファイルに以下のオプションを設定することにより、常にコンフィグドライブを作成するよう、Compute サービスを設定することもできます。

source: If a user passes the <literal>--config-drive true</literal> flag to the <placeholder-1/> command, an administrator cannot disable the configuration drive.
ja: ユーザーが <placeholder-1/> コマンドに <literal>--config-drive true</literal> フラグを渡した場合、管理者はコンフィグドライブを無効化できません。

source: If your guest operating system supports accessing disk by label, you can mount the configuration drive as the <filename>/dev/disk/by-label/<replaceable>configurationDriveVolumeLabel</replaceable></filename> device. In the following example, the configuration drive has the <filename>config-2</filename> volume label.
ja: お使いのゲストオペレーティングシステムが、ラベルによるディスクアクセスをサポートしている場合、コンフィグドライブを <filename>/dev/disk/by-label/<replaceable>configurationDriveVolumeLabel</replaceable></filename> デバイスとしてマウントできます。以下の例は、コンフィグドライブが <filename>config-2</filename> ボリュームラベルを持ちます。

source: Ensure that you use at least version 0.3.1 of CirrOS for configuration drive support.
fr: Assurez-vous que vous utilisez au moins la version 0.3.1 de CirrOS pour le support du lecteur de configuration.
ja: 必ずコンフィグドライブをサポートする CirrOS バージョン 0.3.1 以降を利用してください。

source: If your guest operating system does not use <literal>udev</literal>, the <filename>/dev/disk/by-label</filename> directory is not present.
fr: Si votre système d'exploitation client n'utilise pas <literal>udev</literal>, le <filename>/dev/disk/by-label</filename> répertoire n'est pas présent.
ja: お使いのゲストオペレーティングシステムが <literal>udev</literal> を使用していなければ、<filename>/dev/disk/by-label</filename> ディレクトリが存在しません。

source: You can use the <placeholder-1/> command to identify the block device that corresponds to the configuration drive. For example, when you boot the CirrOS image with the <literal>m1.tiny</literal> flavor, the device is <filename>/dev/vdb</filename>:
fr: Vous pouvez utiliser la <placeholder-1/>commande pour identifier le dispositif de bloc qui correspond à la commande de configuration. Par exemple, quand vous démarrez l'image CirrOS avec le literal>m1.tiny</literal> version, le périphérique est <filename>/dev/vdb</filename>:
ja: コンフィグドライブに対応するブロックデバイスを識別するために、<placeholder-1/> コマンドを使用できます。たとえば、<literal>m1.tiny</literal> フレーバーで CirrOS イメージを起動するとき、このデバイスは <filename>/dev/vdb</filename> になります。

source: Once identified, you can mount the device:
fr: Une fois identifié, vous pouvez monter le dispositif:
ja: 認識されると、デバイスをマウントできます。

source: Configuration drive contents
fr: Contenu du disque de configuration
ja: コンフィグドライブの内容

source: In this example, the contents of the configuration drive are as follows:
fr: Dans cet exemple, les contenus du lecteur de configuration sont les suivants:
ja: この例では、コンフィグドライブの内容は以下のとおりです。

source: The files that appear on the configuration drive depend on the arguments that you pass to the <placeholder-1/> command.
fr: Les fichiers qui apparaissent sur le disque de configuration dépend sur les arguments que vous passez à la <placeholder-1/> commande.
ja: コンフィグドライブに表示されるファイルは、<placeholder-1/> コマンドに渡した引数に依存します。

source: OpenStack metadata format
fr: Formater métadonné OpenStack
ja: OpenStack メタデータの形式

source: The following example shows the contents of the <filename>openstack/2012-08-10/meta_data.json</filename> and <filename>openstack/latest/meta_data.json</filename> files. These files are identical. The file contents are formatted for readability.
fr: L'exemple suivant montre les contenus des fichiers <filename>openstack/2012-08-10/meta_data.json</filename> et <filename>openstack/latest/meta_data.json</filename>. Ces fichiers sont identiques. Le contenu des fichiers est formaté pour la lisibilité.
ja: <filename>openstack/2012-08-10/meta_data.json</filename>、<filename>openstack/latest/meta_data.json</filename> (これらのファイルは 2 つとも同じ内容です) の内容の例を以下に示しています。読みやすいようにフォーマットを少し改善しています。

source: Note the effect of the <literal>--file /etc/network/interfaces=/home/myuser/instance-interfaces</literal> argument that was passed to the <placeholder-1/> command. The contents of this file are contained in the <filename>openstack/content/0000</filename> file on the configuration drive, and the path is specified as <filename>/etc/network/interfaces</filename> in the <filename>meta_data.json</filename> file.
fr: Notez l'effet de l'argument <literal>--file /etc/network/interfaces=/home/myuser/instance-interfaces</literal> qui a été passé à la commande. Les contenus de ce fichier sont contenues dans le fichier <filename>openstack/content/0000</filename> sur le lecteur de configuration, et le chemin d'accès est spécifié en tant <filename>/etc/network/interfaces</filename> dans le fichier <filename>meta_data.json</filename>.
ja: <literal>--file /etc/network/interfaces=/home/myuser/instance-interfaces</literal> 引数の効果は、オリジナルの <placeholder-1/> コマンドに渡される点に注意してください。このファイルの内容は、コンフィグドライブの <filename>openstack/content/0000</filename> ファイルに含まれており、パスは <filename>meta_data.json</filename> ファイルに <filename>/etc/network/interfaces</filename> として指定されています。

source: EC2 metadata format
fr: EC2 format metadonnée
ja: EC2 メタデータの形式

source: The following example shows the contents of the <filename>ec2/2009-04-04/meta-data.json</filename> and the <filename>ec2/latest/meta-data.json</filename> files. These files are identical. The file contents are formatted to improve readability.
fr: L'exemple suivant montre le contenu des fichiers <filename>ec2/2009-04-04/meta-data.json</filename> et <filename>ec2/latest/meta-data.json</filename>. Ces ficheirs sont identiques. Le contenu des fichiers est formaté pour améliorer la lisibilité.
ja: <filename>ec2/2009-04-04/meta-data.json</filename>、<filename>ec2/latest/meta-data.json</filename> (これらのファイルは 2 つとも同じ内容です) の内容の例を以下に示しています。読みやすいようにフォーマットを少し改善しています。

source: User data
fr: Données utilisateur
ja: ユーザーデータ

source: The <filename>openstack/2012-08-10/user_data</filename>, <filename>openstack/latest/user_data</filename>, <filename>ec2/2009-04-04/user-data</filename>, and <filename>ec2/latest/user-data</filename> file are present only if the <literal>--user-data</literal> flag and the contents of the user data file are passed to the <placeholder-1/> command.
fr: Les fichiers <filename>openstack/2012-08-10/user_data</filename>, <filename>openstack/latest/user_data</filename>, <filename>ec2/2009-04-04/user-data</filename>, et <filename>ec2/latest/user-data</filename> sont présents seulement si le flag et le contenu du fichier de données de l'utilisateur sont transmis à la commande.
ja: <filename>openstack/2012-08-10/user_data</filename>、<filename>openstack/latest/user_data</filename>、<filename>ec2/2009-04-04/user-data</filename>、<filename>ec2/latest/user-data</filename> のファイルは、<literal>--user-data</literal> フラグを <placeholder-1/> コマンドに指定した場合のみ存在し、引数で指定したユーザーデータファイルの内容がこれらのファイルに含まれます。

source: Configuration drive format
fr: Format du lecteur de configuration.
ja: コンフィグドライブのフォーマット

source: The default format of the configuration drive as an ISO 9660 file system. To explicitly specify the ISO 9660 format, add the following line to the <filename>/etc/nova/nova.conf</filename> file:
fr: Le format par defaut du lecteur de configuration comme ISO 9660 le système de fichier. Pour spécifier explicitement le format ISO 9660, ajouter la ligne suivante au <filename>/etc/nova/nova.conf</filename> fichier:
ja: コンフィグドライブのデフォルトのフォーマットは、ISO 9660 ファイルシステムです。ISO 9660 フォーマットを明示的に指定する場合、以下の行を <filename>/etc/nova/nova.conf</filename> に含めます。

source: By default, you cannot attach the configuration drive image as a CD drive instead of as a disk drive. To attach a CD drive, add the following line to the <filename>/etc/nova/nova.conf</filename> file:
fr: Par défaut, vous ne pouvez pas joindre l'image du lecteur de configuration comme un lecteur de CD au lieu d'un lecteur de disque dur. Pour joindre un lecteur de CD, ajoutez la ligne suivante au fichier <filename>/etc/nova/nova.conf</filename>:
ja: デフォルトでは、ディスクドライブの代わりに CD ドライブとしてコンフィグドライブのイメージを接続することはできません。CD ドライブを接続する場合は、<filename>/etc/nova/nova.conf</filename> の以下の行を追加します。

source: For legacy reasons, you can configure the configuration drive to use VFAT format instead of ISO 9660. It is unlikely that you would require VFAT format because ISO 9660 is widely supported across operating systems. However, to use the VFAT format, add the following line to the <filename>/etc/nova/nova.conf</filename> file:
fr: Pour des raisons historiques, vous pouvez configurer le disque de configuration pour utiliser le format VFAT la place de la norme ISO 9660. Il est peu probable que vous auriez besoin de format VFAT parce ISO 9660 est largement soutenue dans les systèmes d'exploitation. Toutefois, pour utiliser le format VFAT, ajoutez la ligne suivante dans le fichier <filename>/etc/nova/nova.conf</filename>:
ja: レガシー関連の理由から、config ドライブを ISO 9660 ではなく VFAT フォーマットを使用するように設定できます。ISO 9660 は様々なオペレーティングシステムで幅広くサポートされているため、VFAT フォーマットが必要になる可能性は低いはずです。ただし、VFAT フォーマットを使用する場合は <filename>/etc/nova/nova.conf</filename> に以下の行を指定します。

source: If you choose VFAT, the configuration drive is 64MB.
fr: Si vous choisissez VFAT, le lecteur de configuration est de 64 Mo.
ja: VFAT を選択する場合、コンフィグドライブは 64MB になります。

source: Delete an instance
fr: Supprimer une instance
ja: インスタンスの削除

source: When you no longer need an instance, you can delete it.
fr: Lorsque vous n'avez plus besoin d'une instance, vous pouvez la supprimer.
ja: インスタンスが必要なくなった場合、インスタンスを削除できます。

source: List all instances:
fr: Listez tous les instances:
ja: すべてのインスタンスを一覧表示します。

source: Run the <placeholder-1/> command to delete the instance. The following example shows deletion of the <filename>newServer</filename> instance, which is in <literal>ERROR</literal> state:
ja: インスタンスを削除するには <placeholder-1/>コマンドを実行します。以下の例は、<literal>ERROR</literal> 状態の <filename>newServer</filename> インスタンスを削除しています。

source: The command does not notify that your server was deleted.
fr: Vous ne recevrez aucune notification indiquant la suppression du server.
ja: このコマンドでは、インスタンスの削除に関する通知はありません。

source: To verify that the server was deleted, run the <placeholder-1/> command:
ja: サーバーが削除されたことを検証するために、<placeholder-1/> コマンドを

source: The deleted instance does not appear in the list.
fr: L'instance qui a été supprimée ne s'affiche pas dans la liste.
ja: この一覧には、削除したインスタンスの表示がなくなっています。

source: Create and access a database
fr: Créer et accéder à une base de donnée
ja: データベースの作成とアクセス

source: Assume that you have installed the Database service and populated your data store with images for the type and versions of databases that you want, and that you can create and access a database.
fr: Vérifier que vous avez installé le service Base de donnée et rempli votre espace de stockage avec des images pour les types et les versions de bases de donnée que vous voulez et ensuite vous pouvez créer et accéder à une base de donnée.
ja: すでに Database がインストールしてあり、使用したいデータベースの種類とバージョンのイメージを用いて、データストアにデータを入力してあると仮定します。また、データベースを作成し、アクセスできると仮定します。

source: This example shows you how to create and access a MySQL 5.5 database.
fr: Cet exemple vous montre comment créer et accéder à une base de donnée MySQL 5.5.
ja: この例は MySQL 5.5 データベースを作成し、アクセスする方法を示します。

source: To create and access a database
fr: Pour créer et accéder à une base de donnée
ja: データベースの作成とアクセスの方法

source: Determine which flavor to use for your database
fr: Déterminer quel type d'instance à utiliser pour votre base de donnée
ja: データベースに使用するフレーバーの選択

source: When you create a database instance, you must specify a nova flavor. The flavor indicates various characteristics of the instance, such as RAM, root volume size, and so on. The default nova flavors are not sufficient to create database instances. You might need to create or obtain some new nova flavors that work for databases.
fr: Quand vous créez une instance de base de donnée, vous devez spécifier un type d'instance nova. Un type d'instance donnent plusieurs caractéristiques d'une instance, comme la RAM, la taille du volume root et plus encore. Les types d'instances nova par défaut ne sont pas suffisants pour créer des instances de base de donnée. Vous aurez peut-être besoin de créer ou d'obtenir de nouveaux types d'instance nova qui fonctionne pour des bases de donnée.
ja: データベース作成時、nova フレーバーを指定する必要があります。フレーバーは、メモリ、ルートボリューム容量などの、インスタンスのさまざまな特性を意味します。デフォルトの nova フレーバーは、データベースインスタンスを作成するために十分ではありません。データベース用にうまく動作する、いくつかの新しい nova フレーバーを作成または取得する必要があるかもしません。

source: The first step is to list flavors by using the nova <placeholder-1/> command.
fr: La première étape est de lister les types d'instance en utilisant la commande nova <placeholder-1/>.
ja: 最初の手順は、nova <placeholder-1/> コマンドを使用して、既存のフレーバーを一覧表示することです。

source: Here are the default flavors, although you may have additional custom flavors in your environment:
fr: Voici les types d'instance par défaut, bien que vous puissiez avoir en plus des types d'instance particulières par défaut dans votre environnement :
ja: これは、お使いの環境に追加のカスタムフレーバーを作成していない場合の、デフォルトのフレーバーです。

source: Now take a look at the minimum requirements for various database instances:
fr: Consulter maintenant les prérequis minimums pour les instances des diverses bases de donnée:
ja: さまざまなデータベースインスタンスの最小要件を確認します。

source: Database
fr: Base de données
ja: データベース

source: RAM (MB)
fr: RAM (Mo)
ja: メモリー (MB)

source: Disk (GB)
fr: Disque (Go)
ja: ディスク (GB)

source: VCPUs
ja: 仮想 CPU

source: If you have a custom flavor that meets the needs of the database that you want to create, proceed to <xref linkend="create-database-instance"/> and use that flavor.
fr: Si vous avez un type d'instance particulier correspondant aux besoins de la base de donnée que vous voulez créer, passer à <xref linkend="create-database-instance"/> et utiliser ce type d'instance.
ja: 作成したいデータベースの要件に適合するカスタムフレーバーがあれば、<xref linkend="create-database-instance"/> まで進み、そのフレーバーを使用します。

source: If your environment does not have a suitable flavor, an administrative user must create a custom flavor by using the nova <placeholder-1/> command.
fr: Si votre environnement ne possède pas un type d'instance qui convient, un utilisateur administratif doit créer un type d'instance particulier en utilisant la commande nova <placeholder-1/>.
ja: お使いの環境に適切なフレーバーがなければ、管理ユーザーが nova <placeholder-1/> コマンドを使用して、カスタムフレーバーを作成する必要があります。

source: MySQL example
fr: Exemple MySQL
ja: MySQL の例

source: This example creates a flavor that you can use with a MySQL database. This example has the following attributes:
fr: Cet exemple crée un type d'instance que vous pouvez utiliser avec une base de donnée MySQL. Cet exemple a les attributs suivants:
ja: この例は MySQL データベースで使用できるフレーバーを作成します。この例は以下の属性を持ちます。

source: Flavor name: <literal>mysql_minimum</literal>
fr: Nom de la base de donnée: <literal>mysql_minimum</literal>
ja: フレーバー名: <literal>mysql_minimum</literal>

source: Flavor ID: You must use an ID that is not already in use. In this example, IDs 1 through 5 are in use, so use ID <literal>6</literal>.
fr: ID du type d'instance : Vous devez utilisez une ID qui n'est pas encore utilisée. Dans cet exemple, les ID de 1 à 5 sont prises, alors prenez ID <literal>6</literal>.
ja: フレーバー ID: まだ使用されていない ID を使用する必要があります。この例では、ID 1 から 5 までが使用済みなので、ID <literal>6</literal> を使用します。

source: RAM: <literal>512</literal>
ja: メモリ: <literal>512</literal>

source: Root volume size in GB: <literal>5</literal>
fr: Taille du volume racine en Go: <literal>5</literal>
ja: ルートの GB 単位のボリューム容量: <literal>5</literal>

source: Virtual CPUs: <literal>1</literal>
fr: CPU virtuels: <literal>1</literal>
ja: 仮想 CPU: <literal>1</literal>

source: This example creates a database instance with the following characteristics:
fr: Cet exemple crée une instance de base de donnée avec les caractéristiques suivantes:
ja: この例は、以下の仕様を持つデータベースのインスタンスを作成します。

source: Name of the instance: <literal>mysql_instance_1</literal>
fr: Nom de l'instance: <literal>mysql_instance_1</literal>
ja: インスタンス名: <literal>mysql_instance_1</literal>

source: Database flavor: <literal>6</literal>
fr: Base de donnée d'un type d'instance: <literal>6</literal>
ja: データベースのフレーバー: <literal>6</literal>

source: In addition, this command specifies these options for the instance:
fr: De plus, cette commande spécifie ces options pour l'instance :
ja: さらに、このコマンドは、インスタンスにこれらのオプションを指定します。

source: A volume size of <literal>5</literal> (5 GB).
fr: Une taille de volume de <literal>5</literal> (5 Go).
ja: <literal>5</literal> (5 GB) のボリューム容量。

source: The <literal>myDB</literal> database.
fr: La base de donnée <literal>myDB</literal>.
ja: <literal>myDB</literal> データベース。

source: The database is based on the <literal>mysql</literal> data store and the <literal>mysql-5.5</literal> datastore_version.
fr: Cette base de donnée est basée sur le stockage de donnée <literal>mysql</literal> et sur le datastore_version <literal>mysql-5.5</literal>.
ja: このデータベースは、<literal>mysql</literal> データストア、<literal>mysql-5.5</literal> という datastore_version をベースにしています。

source: The <literal>userA</literal> user with the <literal>password</literal> password.
fr: L'utilisateur <literal>userA</literal> avec le mot de passe <literal>password</literal> .
ja: <literal>userA</literal> ユーザー、<literal>password</literal> パスワード。

source: Get the IP address of the database instance
fr: Obtenir l'adresse IP de l'instance de la base de donnée
ja: データベースインスタンスの IP アドレスの取得

source: First, use the trove <placeholder-1/> command to list all instances and their IDs:
fr: Premièrement, utiliser la commande trove <placeholder-1/> pour lister toutes les instances et leurs ID:
ja: まず、trove <placeholder-1/> コマンドを使用して、すべてのインスタンスとその ID を一覧表示します。

source: This command returns the instance ID of your new instance.
fr: Cette commande renvoie l'ID de l'instance de votre nouvelle instance.
ja: このコマンドは、新しいインスタンスのインスタンス ID を返します。

source: You can now pass in the instance ID with the trove <placeholder-1/> command to get the IP address of the instance. In this example, replace <replaceable>INSTANCE_ID</replaceable> with <literal>5599dad6-731e-44df-bb60-488da3da9cfe</literal>.
fr: Vous pouvez maintenant passer l'ID de l'instance avec la commande trove <placeholder-1/> pour obtenir l'adresse IP de l'instance. Dans cet exemple, remplacer <replaceable>ID_INSTANCE</replaceable> avec <literal>5599dad6-731e-44df-bb60-488da3da9cfe</literal>.
ja: これで、trove <placeholder-1/> コマンドにインスタンス ID を渡して、インスタンスの IP アドレスを取得できます。この例では、<replaceable>INSTANCE_ID</replaceable> を <literal>5599dad6-731e-44df-bb60-488da3da9cfe</literal> に置き換えます。

source: This command returns the IP address of the database instance.
fr: Cette commande retourne l'adresse IP de l'instance de la base de donnée.
ja: このコマンドは、データベースインスタンスの IP アドレスを返します。

source: Access the new database
fr: Accéder à la nouvelle base de donnée
ja: 新しいデータベースへのアクセス

source: You can now access the new database you just created (myDB) by using typical database access commands. In this MySQL example, replace <replaceable>IP_ADDRESS</replaceable> with <literal>172.16.200.2</literal>.
fr: Vous pouvez maintenant accéder à la nouvelle base de donnée que vous venez juste de créer (myDB) en utilisant les commandes typiques d'accès à une base de donnée. Dans cet exemple MySQL, remplacer <replaceable>ADRESSE_IP</replaceable> avec <literal>172.16.200.2</literal>.
ja: これで、一般的なデータベースアクセスコマンドを使用して、作成した新しいデータベース (myDB) にアクセスできます。この MySQL の例では、<replaceable>IP_ADDRESS</replaceable> を <literal>172.16.200.2</literal> に置き換えます。

source: Backup the database instance
fr: Sauvegarder l'instance de la base de donnée
ja: データベースインスタンスのバックアップ

source: As background, assume that you have <link linkend="create_db">created a database instance</link> with the following characteristics:
fr: Par ailleurs, vérifier que vous avez <link linkend="create_db">created a database instance</link> avec les caractéristiques suivantes :
ja: 背景として、以下の特性を持つ<link linkend="create_db">データベースインスタンスを作成</link>してあることを仮定しています。

source: Name of the database instance: <literal>guest1</literal>
fr: Nom de l'instance de la base de donnée: <literal>guest1</literal>
ja: データベースインスタンス名: <literal>guest1</literal>

source: Flavor ID: <literal>10</literal>
fr: ID d'un type d'instance: <literal>10</literal>
ja: フレーバー ID: <literal>10</literal>

source: Root volume size: <literal>2</literal>
fr: Taille du volume racine: <literal>2</literal>
ja: ルートボリューム容量: <literal>2</literal>

source: Databases: <literal>db1</literal> and <literal>db2</literal>
fr: Bases de données: <literal>db1</literal> et <literal>db2</literal>
ja: データベース: <literal>db1</literal>、<literal>db2</literal>

source: Users: The <literal>user1</literal> user with the <literal>password</literal> password
fr: Utilisateurs : L'utilisateur <literal>user1</literal> avec le mot de passe <literal>password</literal>
ja: ユーザー: <literal>user1</literal> ユーザー、<literal>password</literal> パスワード

source: First, get the ID of the <literal>guest1</literal> database instance by using the trove <placeholder-1/> command:
fr: Premièrement, obtenir l'ID de l'instance de la base de donnée en utilisant la commande trove <placeholder-1/>:
ja: まず、trove <placeholder-1/> コマンドを使用して、<literal>guest1</literal> データベースインスタンスの ID を取得します。

source: Back up the database instance by using the trove <placeholder-1/> command. In this example, the backup is called <literal>backup1</literal>. In this example, replace <replaceable>INSTANCE_ID</replaceable> with <literal>97b4b853-80f6-414f-ba6f-c6f455a79ae6</literal>:
fr: Sauvegarder l'instance de la base de donnée en utilisant la commande trove <placeholder-1/>. Dans cet exemple, la sauvegarde est appelée <literal>backup1</literal>. Dans cet exemple, remplacer <replaceable>ID_INSTANCE</replaceable> avec <literal>97b4b853-80f6-414f-ba6f-c6f455a79ae6</literal> :
ja: trove <placeholder-1/> コマンドを使用して、データベースインスタンスをバックアップします。この例では、バックアップは <literal>backup1</literal> という名前です。<replaceable>INSTANCE_ID</replaceable> を <literal>97b4b853-80f6-414f-ba6f-c6f455a79ae6</literal> に置き換えます。

source: This command syntax pertains only to python-troveclient version 1.0.6 and later. Earlier versions require you to pass in the backup name as the first argument.
ja: このコマンド構文は、python-troveclient のバージョン 1.0.6 以降のみ利用できます。これ以前のバージョンは、バックアップ名を最初の引数として渡す必要があります。
