Repository: 25hours/openstack-manuals
Catalog: doc/user-guide/locale/*.po
Languages: fr, ja

source: Reboot an instance
fr: Redémarrer une instance
ja: インスタンスの再起動

source: You can soft or hard reboot a running instance. A soft reboot attempts a graceful shut down and restart of the instance. A hard reboot power cycles the instance.
ja: 実行中のインスタンスのソフトリブートまたはハードリブートを行うことができます。ソフトリブートは、グレースフルシャットダウンの後インスタンスの再起動を試行します。ハードリブートは、インスタンスの電源を一旦切って再投入します。

source: By default, when you reboot a server, it is a soft reboot.
fr: Par défaut, quand vous redémarrez un serveur, c'est un redémarrage logiciel.
ja: デフォルトでは、サーバーをリブートする場合ソフトリブートとなっています。

source: To perform a hard reboot, pass the <parameter>--hard</parameter> parameter, as follows:
ja: ハードリブートを実行するには、以下のように <parameter>--hard</parameter> パラメーターを指定します。

source: Launch instances
fr: Lancer les instances
ja: インスタンスの起動

source: Instances are virtual machines that run inside the cloud.
fr: Les instances sont des machines virtuelles individuelles qui tournent dans le cloud.
ja: インスタンスはクラウド内で動作する仮想マシンです。

source: Before you can launch an instance, gather the following parameters:
fr: Avant de lancer une instance, ramassez les paramètres suivants:
ja: インスタンスを起動する前に、以下のパラメーターの情報を集めます。

source: The <emphasis role="bold">instance source</emphasis> can be an image, snapshot, or block storage volume that contains an image or snapshot.
ja: <emphasis role="bold">インスタンスのソース</emphasis>は、イメージやスナップショットを含む、イメージ、スナップショット、ブロックストレージです。

source: A <emphasis role="bold">name</emphasis> for your instance.
ja: お使いのインスタンスの<emphasis role="bold">名前</emphasis>。

source: The <emphasis role="bold">flavor</emphasis> for your instance, which defines the compute, memory, and storage capacity of nova computing instances. A flavor is an available hardware configuration for a server. It defines the size of a virtual server that can be launched.
ja: インスタンスの<emphasis role="bold">フレーバー</emphasis>。nova コンピューティングインスタンスのコンピュート、メモリー、ストレージ容量を定義します。フレーバーは、サーバーが使用可能なハードウェア設定で、起動可能な仮想サーバーのサイズを定義します。

source: Any <emphasis role="bold">user data</emphasis> files. A user data file is a special key in the metadata service that holds a file that cloud-aware applications in the guest instance can access. For example, one application that uses user data is the <link href="https://help.ubuntu.com/community/CloudInit">cloud-init</link> system, which is an open-source package from Ubuntu that is available on various Linux distributions and that handles early initialization of a cloud instance.
ja: 任意の<emphasis role="bold">ユーザーデータ</emphasis>。ユーザーデータファイルは、メタデータサービス内の特別キーで、ゲストインスタンスにあるクラウド対応アプリケーションがアクセス可能なファイルを保持します。例えば、ユーザーデータを使用するアプリケーションの 1 つは <link href="https://help.ubuntu.com/community/CloudInit">cloud-init</link> システムです。これは、さまざまな Linux ディストリビューションで利用可能な Ubuntu 発祥のオープンソースパッケージです。クラウドインスタンスの初期設定を処理します。

source: Access and security credentials, which include one or both of the following credentials:
ja: アクセス、セキュリティクレデンシャル。以下のクレデンシャルの 1 つまたは両方が含まれます。

source: A <emphasis role="bold">key pair</emphasis> for your instance, which are SSH credentials that are injected into images when they are launched. For the key pair to be successfully injected, the image must contain the <literal>cloud-init</literal> package. Create at least one key pair for each project. If you already have generated a key pair with an external tool, you can import it into OpenStack. You can use the key pair for multiple instances that belong to that project.
ja: インスタンスの<emphasis role="bold">キーペア</emphasis>。イメージ起動時にイメージに注入される SSH 認証情報です。キーペアを正常にインジェクトさせるためには、イメージに <literal>cloud-init</literal> パッケージがインストールされている必要があります。プロジェクトごとにキーペアを最低でも 1 つ作成します。すでに外部のツールでキーペアを生成している場合は、OpenStack にそのキーペアをインポートすることができます。プロジェクトに所属する複数のインスタンスに対して、キーペアを使用することができます。

source: A <emphasis role="bold">security group</emphasis> that defines which incoming network traffic is forwarded to instances. Security groups hold a set of firewall policies, known as <emphasis role="italic">security group rules</emphasis>.
ja: <emphasis role="bold">セキュリティグループ</emphasis>。どの受信ネットワークトラフィックがインスタンスに転送されるのかを定義します。セキュリティグループは、<emphasis role="italic">セキュリティグループルール</emphasis>と呼ばれるファイアウォールポリシーを保持しています。

source: If needed, you can assign a <emphasis role="bold">floating (public) IP address</emphasis> to a running instance.
ja: 必要に応じて、実行中のインスタンスに <emphasis role="bold">Floating (パブリック) IP アドレス</emphasis>を割り当てられます。

source: You can also attach a block storage device, or <emphasis role="bold">volume</emphasis>, for persistent storage.
ja: 永続ストレージ用に、ブロックストレージデバイス、<emphasis role="bold">ボリューム</emphasis>を接続することもできます。

source: Instances that use the default security group cannot, by default, be accessed from any IP address outside of the cloud. If you want those IP addresses to access the instances, you must modify the rules for the default security group.
ja: デフォルトのセキュリティグループを使用するインスタンスは、デフォルトでクラウド外の IP アドレスからアクセスできません。これらの IP アドレスがインスタンスにアクセスしたければ、デフォルトのセキュリティグループのルールを編集する必要があります。

source: You can also assign a floating IP address to a running instance to make it accessible from outside the cloud. See <xref linkend="manage_ip_addresses"/>.
fr: Vous pouvez aussi attribuer une adresse IP flottante à une instance en cours d'exécution pour la rendre accessible depuis l'extérieur du cloud. Voir <xref linkend="manage_ip_addresses"/>.
ja: また、実行中のインスタンスに Flating IP アドレスを割り当て、クラウド外からアクセスできるようにすることも可能です。<xref linkend="manage_ip_addresses"/>を参照してください。

source: After you gather the parameters that you need to launch an instance, you can launch it from an <link linkend="launch_from_image">image</link> or a <link linkend="boot_from_volume">volume</link>. You can launch an instance directly from one of the available OpenStack images or from an image that you have copied to a persistent volume. The OpenStack Image Service provides a pool of images that are accessible to members of different projects.
ja: インスタンスを起動するために必要なパラメーターを収集した後、<link linkend="launch_from_image">イメージ</link>や<link linkend="boot_from_volume">ボリューム</link>から起動できます。 利用可能な OpenStack イメージの 1 つまたは永続ボリュームにコピーしたイメージから直接インスタンスを起動することができます。OpenStack Image Service は、別のプロジェクトのメンバーがアクセスできるイメージのプールを提供します。

source: Gather parameters to launch an instance
fr: Pour lancer une instance, ramassez les paramètres
ja: インスタンスを起動するためのパラメーター情報の収集

source: Before you begin, source the OpenStack RC file.
ja: 開始前に OpenStack RC ファイルを読み込みます。

source: List the available flavors:
fr: Listez les types d'instances disponibles:
ja: 利用可能なフレーバーを表示します。

source: Note the ID of the flavor that you want to use for your instance:
ja: インスタンスに使用するフレーバーの ID をメモします。

source: List the available images:
fr: Lister les images disponibles:
ja: 利用可能なイメージを表示します。

source: Note the ID of the image from which you want to boot your instance:
ja: インスタンスを起動するイメージの ID をメモします。

source: You can also filter the image list by using <placeholder-1/> to find a specific image, as follows:
ja: 以下のように、<placeholder-1/> を使用してイメージ一覧をフィルタリングして、特定のイメージを検索することができます。

source: List the available security groups:
fr: Listez les groupes de sécurité disponibles:
ja: 利用可能なセキュリティグループを表示します。

source: If you are an admin user, specify the <parameter>--all-tenants</parameter> parameter to list groups for all tenants.
ja: 管理ユーザーの場合、<parameter>--all-tenants</parameter> パラメーターを指定してテナントすべてのグループを表示します。

source: Note the ID of the security group that you want to use for your instance:
ja: インスタンスに使用するセキュリティグループの ID をメモします。

source: If you have not created any security groups, you can assign the instance to only the default security group.
fr: Si vous n'avez pas créer de groupe de sécurité, vous ne pourrez qu'assigner l'instance au groupe de sécurité par défaut.
ja: セキュリティグループを作成していない場合、Default のセキュリティグループのみにインスタンスを割り当てることができます。

source: You can view rules for a specified security group:
ja: 指定したセキュリティグループのルールを表示できます。

source: List the available key pairs and note the name of the key pair that you use for SSH access.
ja: 利用可能なキーペアを一覧表示し、SSH アクセスに使用するキーペアの名前を記録します。

source: Launch an instance from an image
fr: Lancer une instance depuis une image
ja: イメージからのインスタンスの起動

source: After you gather required parameters, run the following command to launch an instance. Specify the server name, flavor ID, and image ID.
ja: 必要なパラメーターの収集後、インスタンスを起動するために、以下のコマンドを実行します。サーバー名、フレーバー ID、イメージ ID を指定します。

source: Optionally, you can provide a key name for access control and a security group for security. You can also include metadata key and value pairs. For example, you can add a description for your server by providing the <parameter>--meta description="My Server"</parameter> parameter.
ja: オプションで、セキュリティとしてアクセス制御やセキュリティグループのキー名を指定することができます。また、メタデータキーや値のペアを含めることも可能です。例えば、<parameter>--meta description="My Server"</parameter> パラメーターを指定してサーバーの説明を追加します。

source: You can pass user data in a local file at instance launch by using the <parameter>--user-data <replaceable>USER-DATA-FILE</replaceable></parameter> parameter.
ja: <parameter>--user-data <replaceable>USER-DATA-FILE</replaceable></parameter> パラメーターを使用して、インスタンスの起動時にローカルファイルのユーザーデータを指定することができます。

source: The following command launches the <literal>MyCirrosServer</literal> instance with the <literal>m1.small</literal> flavor (ID of <literal>1</literal>), <literal>cirros-0.3.2-x86_64-uec</literal> image (ID of <literal>397e713c-b95b-4186-ad46-6126863ea0a9</literal>), <literal>default</literal> security group, <literal>KeyPair01</literal> key, and a user data file called <filename>cloudinit.file</filename>:
ja: 以下のコマンドは、<literal>MyCirrosServer</literal> インスタンスを、<literal>m1.small</literal> フレーバー (ID <literal>1</literal>)、<literal>cirros-0.3.2-x86_64-uec</literal> イメージ (ID <literal>397e713c-b95b-4186-ad46-6126863ea0a9</literal>)、<literal>default</literal> セキュリティグループ、<literal>KeyPair01</literal> キー、<filename>cloudinit.file</filename> という名前のユーザーデータファイルで起動します。

source: Depending on the parameters that you provide, the command returns a list of server properties.
ja: 指定のパラメーターにより、コマンドはサーバーのプロパティ一覧を返します。

source: A status of <literal>BUILD</literal> indicates that the instance has started, but is not yet online.
fr: L'état <literal>BUILD</literal> indique que l'instance a demarré, mais qu'elle n'est pas en ligne.
ja: <literal>BUILD</literal> の状態は、インスタンスが起動しているがオンラインにはなっていないことを示しています。

source: A status of <literal>ACTIVE</literal> indicates that the instance is active.
fr: L'état <literal>ACTIVE</literal> indique que l'instance est active.
ja: <literal>ACTIVE</literal> の状態は、インスタンスがアクティブであることを示しています。

source: Copy the server ID value from the <literal>id</literal> field in the output. You use this ID to get details for or delete your server.
ja: 出力の <literal>id</literal> フィールドからサーバー ID の値をコピーします。この ID を使用して詳細を取得するか、サーバーを削除します。

source: Copy the administrative password value from the <literal>adminPass</literal> field. You use this value to log in to your server.
ja: <literal>adminPass</literal> フィールドから管理者パスワードの値をコピーして、この値を使用してサーバーにログインします。

source: You can also place arbitrary local files into the instance file system at creation time by using the <parameter>--file &lt;dst-path=src-path&gt;</parameter> option. You can store up to five files. For example, if you have a special authorized keys file named <filename>special_authorized_keysfile</filename> that you want to put on the instance rather than using the regular SSH key injection, you can use the <parameter>--file</parameter> option as shown in the following example:
ja: インスタンス作成時に <parameter>--file <dst-path=src-path></parameter> オプションを用いて、任意のローカルファイルをインスタンスのファイルシステムの中に置けます。5 ファイルまで保存できます。例えば、ある理由により通常の SSH 鍵の注入ではなく、インスタンスに置きたい <filename>special_authorized_keysfile</filename> という名前の特別な認証済み鍵を持っていれば、以下の例で示したように <parameter>--file</parameter> オプションを使用できます。

source: Check if the instance is online:
fr: Vérifier que l'instance est en ligne:
ja: インスタンスがオンラインになっているかどうかをチェックします。

source: The list shows the ID, name, status, and private (and if assigned, public) IP addresses for all instances in the project to which you belong:
ja: 覧では、所属するプロジェクトの全インスタンスの ID、名前、状態、プライベート (割り当てられている場合パブリックも) IP アドレスが表示されます。

source: If the status for the instance is ACTIVE, the instance is online.
fr: Si l'état de l'instance est actif, l'instance est en ligne.
ja: インスタンスの状態が ACTIVE の場合、インスタンスはオンラインです。

source: To view the available options for the <placeholder-1/> command, run the following command:
fr: Pour voir les options disponibles pour la <placeholder-1/> commande, exécutez la commande suivante:
ja: <placeholder-1/> コマンドで利用可能なオプションを確認するには、以下のコマンドを実行します。

source: If you did not provide a key pair, security groups, or rules, you can access the instance only from inside the cloud through VNC. Even pinging the instance is not possible.
ja: キーペア、セキュリティグループ、またはルールを指定しない場合、VNC 経由でクラウド内からしかインスタンスにアクセスすることができません。インスタンスの ping さえも不可となっています。

source: Manage bare-metal nodes
ja: ベアメタルノードの管理

source: The bare-metal driver for OpenStack Compute manages provisioning of physical hardware by using common cloud APIs and tools such as Orchestration (Heat). The use case for this driver is for single tenant clouds such as a high-performance computing cluster or for deploying OpenStack itself.
ja: OpenStack Compute のベアメタルドライバーは、Orchestration (Heat) のような、一般的なクラウド API やツールを使用することにより、物理サーバーへの配備を管理できます。このドライバーのユースケースは、HPC クラスターのような単一テナントクラウドや OpenStack 自身のデプロイメントの用途です。

source: If you use the bare-metal driver, you must create a network interface and add it to a bare-metal node. Then, you can launch an instance from a bare-metal image.
ja: ベアメタルドライバーを使用する場合、ネットワークインターフェースを作成し、それをベアメタルノードに追加する必要があります。その後、ベアメタルイメージからインスタンスを起動できます。

source: Development efforts are focused on moving the driver out of the Compute code base in the Icehouse release.
ja: 開発は、Icehouse リリースで Compute のコードからこのドライバーを外に出すことに注力しています。

source: You can list and delete bare-metal nodes. When you delete a node, any associated network interfaces are removed. You can list and remove network interfaces that are associated with a bare-metal node.
ja: ベアメタルノードの一覧表示や削除が可能です。ノードを削除すると、関連付けられているネットワークインターフェースも削除されます。ベアメタルノードに関連付けられているネットワークインターフェースを一覧表示、削除することができます。

source: Commands
fr: Commandes
ja: コマンド

source: The following commands can be used to manage bare-metal nodes.
ja: 以下のコマンドは、ベアメタルノードを管理するために使用できます。

source: <placeholder-1/>. Adds a network interface to a bare-metal node.
ja: <placeholder-1/>。ベアメタルノードにネットワークインターフェースを追加します。

source: <placeholder-1/>. Lists network interfaces associated with a bare-metal node.
ja: <placeholder-1/>。ベアメタルノードに関連付けられているネットワークインターフェースを表示します。

source: <placeholder-1/>. Removes a network interface from a bare-metal node.
ja: <placeholder-1/>。ベアメタルノードからネットワークインターフェースを削除します。

source: <placeholder-1/>. Creates a bare-metal node.
ja: <placeholder-1/>。ベアメタルノードを作成します。

source: <placeholder-1/>. Removes a bare-metal node and any associated interfaces.
ja: <placeholder-1/>。ベアメタルノードと関連付けられているインターフェースを削除します。

source: <placeholder-1/>. Lists available bare-metal nodes.
ja: <placeholder-1/>。使用可能なベアメタルノードを表示します。

source: <placeholder-1/>. Shows information about a bare-metal node.
ja: <placeholder-1/>。ベアメタルノードの情報を表示します。

source: Create a bare-metal node
ja: ベアメタルノードの作成

source: When you create a bare-metal node, your PM address, user name, and password should match those that are configured in your hardware's BIOS/IPMI configuration.
ja: ベアメタルノードの作成時、物理マシンのアドレス、ユーザー名、パスワードが、ハードウェアの BIOS/IPMI に設定されたものと一致する必要があります。

source: The following example shows the command and results from creating a node with the PM address <filename>1.2.3.4</filename>, the PM user name <systemitem class="username">ipmi</systemitem>, and password <literal>ipmi</literal>.
ja: 以下の例は、物理マシンアドレス <filename>1.2.3.4</filename>、ユーザー名 <systemitem class="username">ipmi</systemitem>、パスワード <literal>ipmi</literal> を持つノードを作成するコマンドと実行結果です。

source: Add a network interface to the node:
ja: ベアメタルノードにネットワークインターフェースを追加します。

source: For each NIC on the node, you must create an interface, specifying the interface's MAC address.
ja: ノードの各 NIC は、インターフェースの MAC アドレスを指定して、インターフェースを作成する必要があります。

source: Launch an instance from a bare-metal image:
ja: ベアメタルイメージからインスタンスを起動します。

source: A bare-metal instance is an instance created directly on a physical machine without any virtualization layer running underneath it. Nova retains power control via IPMI. In some situations, Nova may retain network control via Neutron and OpenFlow.
ja: ベアメタルインスタンスは、物理マシンに直接作成されたインスタンスです。基盤として仮想化レイヤーを持っていません。Nova は IPMI 経由で電源を制御します。いくつかの場合、Nova は Neutron や OpenFlow 経由でネットワークを制御するかもしれません。

source: Set the <parameter>--availability_zone</parameter> parameter to specify which zone or node to use to start the server. Separate the zone from the host name with a comma. For example:
ja: <parameter>--availability_zone</parameter> パラメーターを設定して、サーバーを起動するゾーンまたはノードを指定します。ホスト名とゾーンはコンマで区切ります。例えば以下のようになります。

source: <literal>host</literal> is optional for the <literal>--availability_zone</literal> parameter. You can specify simply <literal>zone:,node</literal>. You must still use the comma.
ja: <literal>host</literal> は <literal>--availability_zone</literal> パラメーターのオプションです。単に <literal>zone:,node</literal> と指定することもできます。コンマを使用することもできます。

source: List bare-metal nodes and interfaces:
ja: 以下のように、ベアメタルノードとインターフェースを一覧表示します。

source: Use the <placeholder-1/> command to view all bare-metal nodes and interfaces. When a node is in use, its status includes the UUID of the instance that runs on it:
ja: すべてのベアメタルノードとインターフェースを表示するために、<placeholder-1/> コマンドを使用します。ノードが使用中の場合、実行されているインスタンスの UUID もステータスに含められます。

source: Show details for a bare-metal node:
ja: ベアメタルノードの詳細を表示します。

source: Use the <placeholder-1/> command to view the details for a bare-metal node.
ja: ベアメタルノードの詳細を表示するために、<placeholder-1/> コマンドを使用します。

source: Create and manage stacks
fr: Créer et gérer des piles
ja: スタックの管理と作成

source: The Orchestration module enables you to orchestrate multiple composite cloud applications. This module supports use of both the Amazon Web Services (AWS) CloudFormation template format through both a Query API that is compatible with CloudFormation and the native OpenStack <glossterm>Heat Orchestration Template (HOT)</glossterm> format through a REST API.
fr: Le module Orchestration vous permet d'orchestrer de multiple composés d'applications cloud. Ces modules supportent l'utilisation à la fois du modèle de format d'Amazon Web Services (AWS) à travers une Query API compatible de CloudFormation et le format natif OpenStack <glossterm>Heat Orchestration Template (HOT)</glossterm> à travers une REST API.
ja: Orchestration モジュールにより、複数から構成されたクラウドアプリケーションを統合できます。このモジュールは、CloudFormation 互換の Query API 経由の Amazon Web Services (AWS) CloudFormation テンプレート形式、REST API 経由のネイティブ OpenStack <glossterm>Heat Orchestration Template (HOT)</glossterm> 形式の使用をサポートします。

source: These flexible template languages enable application developers to describe and automate the deployment of infrastructure, services, and applications. The templates enable creation of most OpenStack resource types, such as instances, floating IP addresses, volumes, security groups, and users. The resources, once created, are referred to as stacks.
fr: Ce modèle flexible de langages permet aux développeurs d'application de décrire et d'automatiser le déploiement d'infrastructure, de services et d'applications. Les modèles favorise la création de la plupart des types de ressource OpenStack, comme les instances, les adresses IP flottantes, les volumes, les groupes de sécurité et les utilisateurs. Les ressources, une fois créées, sont référencées comme des piles.
ja: これらの柔軟なテンプレート言語により、アプリケーション開発者は、インフラストラクチャ、サービス、アプリケーションの配備を記述し、自動化できます。テンプレートは、インスタンス、Floating IP アドレス、ボリューム、セキュリティグループ、ユーザーなどの、ほとんどの OpenStack リソースを作成できます。リソースが作成されると、スタックとして参照されます。

source: The template languages are described in <link href="http://docs.openstack.org/developer/heat/template_guide/index.html">the Template Guide</link> in the <link href="http://docs.openstack.org/developer/heat/">Heat developer documentation</link>.
fr: Les modèles de langages sont décrits dans <link href="http://docs.openstack.org/developer/heat/template_guide/index.html">Guide des Modèles</link> dans <link href="http://docs.openstack.org/developer/heat/">Documentation développeur Heat</link>.
ja: テンプレート言語は、<link href="http://docs.openstack.org/developer/heat/">Heat developer documentation</link> の <link href="http://docs.openstack.org/developer/heat/template_guide/index.html">the Template Guide</link> に記載されています。

source: Create a stack from an example template file
fr: Créer une pile depuis un modèle de fichier.
ja: サンプルテンプレートファイルからのスタックの作成

source: To create a stack, or template, from an <link href="https://github.com/openstack/heat-templates">example template file</link>, run the following command:
fr: Pour créer une pile, ou un modèle à partir d'un <link href="https://github.com/openstack/heat-templates">example template file</link>, exécuter la commande suivante:
ja: <link href="https://github.com/openstack/heat-templates">サンプルテンプレートファイル</link>からスタックまたはテンプレートを作成するために、以下のコマンドを実行します。

source: The <literal>--parameters</literal> values that you specify depend on the parameters that are defined in the template. If a website hosts the template file, you can specify the URL with the <literal>--template-url</literal> parameter instead of the <literal>--template-file</literal> parameter.
fr: Les valeurs des <literal>--paramètres</literal> que vous spécifiez dépendent des paramètres qui sont définis dans le modèle. Si un site héberge le fichier du modèle, vous pouvez spécifier l'URL avec le paramètre <literal>--template-url</literal> au lieu du paramètre <literal>--template-file</literal>.
ja: 指定する <literal>--parameters</literal> の値は、テンプレートで定義したパラメーターに依存します。ウェブサイトがテンプレートファイルを公開している場合、<literal>--template-file</literal> パラメーターの代わりに <literal>--template-url</literal> パラメーターを用いて URL を指定できます。

source: The command returns the following output:
fr: La commande renvoie la sortie suivante:
ja: このコマンドは以下の出力を返します。

source: You can also use the <placeholder-1/> command to validate a template file without creating a stack from it.
fr: Vous pouvez aussi utiliser la <placeholder-1/> commande pour valider le modèle de fichier sans créer une pile.
ja: テンプレートファイルからスタックを作成することなく、検証するために <placeholder-1/> コマンドを使用することもできます。

source: Previous versions of the heat client used <placeholder-1/> instead of <placeholder-2/>, but it has been deprecated in favor of <placeholder-3/>.
ja: 前のバージョンの heat クライアントは、<placeholder-2/> の代わりに <placeholder-1/> を使用しましたが、 <placeholder-3/> のために非推奨になりました。

source: To do so, run the following command:
fr: Pour ce faire, exécuter la commande suivante:
ja: そうするために、以下のコマンドを実行します。

source: If validation fails, the response returns an error message.
fr: Si la validation échoue, la réponse renvoie un message d'erreur.
ja: 検証に失敗した場合、応答がエラーメッセージを返します。

source: Get information about stacks
fr: Obtenir des informations sur les piles.
ja: スタック情報の取得

source: To explore the state and history of a particular stack, you can run a number of commands.
fr: Pour explorer l'état et l'historique des piles de particulier, vous pouvez éxécuter un certain nombre de commande.
ja: 特定のスタックの状態と履歴を調査するために、いろいろなコマンドを実行できます。

source: To see which stacks are visible to the current user, run the following command:
fr: Pour voir quels piles sont visibles à l'utilisateur actuel, éxecuter la commande suivante:
ja: どのスタックが現在のユーザーから参照できるかを確認するために、以下のコマンドを実行します。

source: To show the details of a stack, run the following command:
fr: Pour afficher les dérails de la pile, exécuter la commande suivante:
ja: スタックの詳細を表示するために、以下のコマンドを実行します。

source: A stack consists of a collection of resources. To list the resources and their status, run the following command:
fr: Une pile consiste en un ensemble de ressources. Pour lister les ressources et leurs status, exécuter la commande suivante:
ja: スタックはリソースの集合から構成されます。リソースとその状態を一覧表示するために、以下のコマンドを実行します。
