Repository: 25hours/openstack-manuals
Catalog: doc/user-guide/locale/*.po
Languages: fr, ja

source: Click <guibutton>Detach Volume</guibutton> and confirm your changes.
fr: Cliquer <guibutton> detacher le volume </guibutton> et confirmer vos modifications.
ja: <guibutton>ボリュームの切断</guibutton>をクリックし、変更を確認します。

source: A message indicates whether the action was successful.
fr: Un message indique quand l'action a été réussit
ja: 操作が成功したかどうかはメッセージでわかります。

source: Create a snapshot from a volume
fr: Créer un instantané à partir du volume
ja: ボリュームからのスナップショットの作成

source: Log in to the dashboard, choose a project, and click <guilabel>Volumes</guilabel>.
fr: Se connecter au tableau de bord, choisir un projet et cliquer <guilabel>Volumes</guilabel>.
ja: ダッシュボードにログインし、プロジェクトを選択し、<guilabel>ボリューム</guilabel>をクリックします。

source: Select a volume from which to create a snapshot.
fr: Sélectionner un volume à partir duquel créer une capture instantanée
ja: スナップショットを作成するボリュームを選択します。

source: From the <guilabel>More</guilabel> list, select <guilabel>Create Snapshot</guilabel>.
fr: Dans la liste <guilabel>Plus</guilabel>, sélectionner <guilabel>Créer un Instantané</guilabel>.
ja: <guilabel>▼</guilabel>リストから、<guilabel>スナップショットの作成</guilabel>を選択します。

source: In the dialog box that opens, enter a snapshot name and a brief description.
fr: Dans la boite de dialogue qui s'ouvre, entrer le nom de l'instantané et une brève description.
ja: 開いたダイアログボックスで、スナップショットの名前と簡単な説明を入力します。

source: Confirm your changes.
fr: Confirmer vos modifications
ja: 変更を確認します。

source: The dashboard shows the new volume snapshot in <guilabel>Volume Snapshots</guilabel> tab.
fr: Le tableau de bord montre l'instantané du nouveau volume dans l'onglet <guilabel></guilabel>.
ja: ダッシュボードの<guilabel>ボリュームのスナップショット</guilabel>に新しいボリュームのスナップショットが表示されます。

source: Edit a volume
fr: Éditer un volume
ja: ボリュームの編集

source: On the <guilabel>Project</guilabel> tab, click <guilabel>Volumes</guilabel>.
fr: Dans l'onglet <guilabel>Projet</guilabel>, cliquer <guilabel>Volumes</guilabel>.
ja: <guilabel>プロジェクト</guilabel> タブで、<guilabel>ボリューム</guilabel>をクリックします。

source: In the <guilabel>Actions</guilabel> column, click <guilabel>Edit Volume</guilabel>.
fr: Dans la colonne <guilabel>Actions</guilabel>, cliquer <guilabel>Éditer le Volume</guilabel>.
ja: <guilabel>操作</guilabel>の列で、<guilabel>ボリュームの編集</guilabel>をクリックします。

source: In the <guilabel>Edit Volume</guilabel> dialog box, update the name and description of the image.
fr: Dans la boite de dialogue <guilabel>Éditer le Volume</guilabel>, mise à jour du nom et de la description de l'image.
ja: <guilabel>ボリュームの編集</guilabel>ダイアログボックスで、イメージの名前と説明を更新します。

source: Click <guibutton>Edit Volume</guibutton>.
fr: Cliquer <guibutton>Éditer le Volume</guibutton>.
ja: <guibutton>ボリュームの編集</guibutton>をクリックします。

source: You can extend a volume by using the <guilabel>Extend Volume</guilabel> option available in the <guibutton>More</guibutton> dropdown list and entering the new value for volume size.
fr: Vous pouvez agrandir un volume en utilisant l'option <guilabel>Étendre le Volume</guilabel> disponible dans la liste déroulante <guibutton>Plus</guibutton> et en entrant la nouvelle valeur pour la taille du volume.
ja: <guibutton>▼</guibutton>ドロップダウンリストから利用できる、<guilabel>ボリュームの拡張</guilabel>を使用し、新しいボリュームサイズ値を入力して、ボリュームを拡張できます。

source: Delete a volume
fr: Supprimez un volume
ja: ボリュームの削除

source: When you delete an instance, the data in its attached volumes is not destroyed.
fr: Quand vous détruisez une instance, les données des volumes attachés ne sont pas supprimées.
ja: インスタンスの削除時、接続されたボリュームのデータは無くなりません。

source: Select the check boxes for the volumes that you want to delete.
fr: Sélectionner les cases à cocher correspondant aux volumes que vous voulez supprimer.
ja: 削除したいボリュームのチェックボックスを選択します。

source: Click <guibutton>Delete Volumes</guibutton> and confirm your choice.
fr: Cliquer <guibutton>Supprimer les Volumes</guibutton> et confirmer votre choix.
ja: <guibutton>ボリュームの切断</guibutton>をクリックし、選択内容を確認します。

source: When working with images in the SDK, you will call <literal>novaclient</literal> methods.
fr: Quand vous travaillerez avec les images du SDK, vous appellerez les méthodes <literal>novaclient</literal>.
ja: SDK でイメージを操作する場合、<literal>novaclient</literal> メソッドを呼び出します。

source: Add a keypair
fr: Ajouter une paire de clés
ja: キーペアの追加

source: To generate a keypair, call the <methodname><link href="http://docs.openstack.org/developer/python-novaclient/api/novaclient.v1_1.keypairs.html#novaclient.v1_1.keypairs.KeypairManager.create">novaclient.v1_1.keypairs.KeypairManager.create</link></methodname> method:
fr: Pour générer une paire de clés, appelez la méthode <methodname><link href="http://docs.openstack.org/developer/python-novaclient/api/novaclient.v1_1.keypairs.html#novaclient.v1_1.keypairs.KeypairManager.create">novaclient.v1_1.keypairs.KeypairManager.create</link></methodname>:
ja: キーペアを生成するために、<methodname><link href="http://docs.openstack.org/developer/python-novaclient/api/novaclient.v1_1.keypairs.html#novaclient.v1_1.keypairs.KeypairManager.create">novaclient.v1_1.keypairs.KeypairManager.create</link></methodname> メソッドを呼び出します。

source: The Python script output looks something like this:
fr: La sortie du script Python ressemble à ceci:
ja: Python スクリプトの出力は、このようになるでしょう。

source: You typically write the private key to a file to use it later. The file must be readable and writeable by only the file owner; otherwise, the SSH client will refuse to read the private key file. It is safest to create the file with the appropriate permissions, as shown in the following example:
ja: 一般的に、秘密鍵を後から使用するために、ファイルに保存します。このファイルは、ファイル所有者のみによりアクセス可能にしなければいけません。そうしなければ、SSH クライアントは秘密鍵ファイルの読み込みを拒否します。以下の例に示すとおり、適切なパーミッションを持つファイルを作成することが最も安全です。

source: Import a keypair
fr: Importer une paire de clés
ja: キーペアのインポート

source: If you have already generated a keypair with the public key located at <filename>~/.ssh/id_rsa.pub</filename>, pass the contents of the file to the <methodname><link href="http://docs.openstack.org/developer/python-novaclient/api/novaclient.v1_1.keypairs.html#novaclient.v1_1.keypairs.KeypairManager.create"> novaclient.v1_1.keypairs.KeypairManager.create</link></methodname> method to import the public key to Compute:
fr: Si vous avez déjà généré une paire de clé avec la clé publique située dans <filename>~/.ssh/id_rsa.pub</filename>, passer le contenu du fichier à la méthode <methodname><link href="http://docs.openstack.org/developer/python-novaclient/api/novaclient.v1_1.keypairs.html#novaclient.v1_1.keypairs.KeypairManager.create"> novaclient.v1_1.keypairs.KeypairManager.create</link></methodname> pour importer la clé publique vers Compute:
ja: すでにキーペアを生成してあり、公開鍵が <filename>~/.ssh/id_rsa.pub</filename> にある場合、公開鍵を Compute をインポートするために、そのファイルの内容を <methodname><link href="http://docs.openstack.org/developer/python-novaclient/api/novaclient.v1_1.keypairs.html#novaclient.v1_1.keypairs.KeypairManager.create"> novaclient.v1_1.keypairs.KeypairManager.create</link></methodname> メソッドに渡します。

source: List keypairs
fr: Liste paires de clés
ja: キーペアの一覧表示

source: To list keypairs, call the <methodname><link href="http://docs.openstack.org/developer/python-novaclient/api/novaclient.v1_1.keypairs.html#novaclient.v1_1.keypairs.KeypairManager.list">novaclient.v1_1.keypairs.KeypairManager.list</link></methodname> method:
fr: Pour lister les paires de clés, appeler la méthode: <methodname><link href="http://docs.openstack.org/developer/python-novaclient/api/novaclient.v1_1.keypairs.html#novaclient.v1_1.keypairs.KeypairManager.list">novaclient.v1_1.keypairs.KeypairManager.list</link></methodname>:
ja: キーペアを一覧表示するために、<methodname><link href="http://docs.openstack.org/developer/python-novaclient/api/novaclient.v1_1.keypairs.html#novaclient.v1_1.keypairs.KeypairManager.list">novaclient.v1_1.keypairs.KeypairManager.list</link></methodname> メソッドを呼び出します。

source: To list security groups for the current project, call the <methodname><link href="http://docs.openstack.org/developer/python-novaclient/api/novaclient.v1_1.security_groups.html#novaclient.v1_1.security_groups.SecurityGroupManager.list">novaclient.v_1.security_groups.SecurityGroupManager.list</link></methodname> method:
fr: Pour lister les groupes de sécurité pour le projet en cours, appeler la méthode <methodname><link href="http://docs.openstack.org/developer/python-novaclient/api/novaclient.v1_1.security_groups.html#novaclient.v1_1.security_groups.SecurityGroupManager.list">novaclient.v_1.security_groups.SecurityGroupManager.list</link></methodname>:
ja: 現在のプロジェクトのセキュリティグループを一覧表示するために、<methodname><link href="http://docs.openstack.org/developer/python-novaclient/api/novaclient.v1_1.security_groups.html#novaclient.v1_1.security_groups.SecurityGroupManager.list">novaclient.v_1.security_groups.SecurityGroupManager.list</link></methodname> メソッドを呼び出します。

source: To create a security group with a specified name and description, call the <methodname><link href="http://docs.openstack.org/developer/python-novaclient/api/novaclient.v1_1.security_groups.html#novaclient.v1_1.security_groups.SecurityGroupManager.create">novaclient.v_1.security_groups.SecurityGroupManager.create</link></methodname> method:
fr: Pour créer un groupe de sécurité avec un nom et une description spécifiés, appeler la méthode <methodname><link href="http://docs.openstack.org/developer/python-novaclient/api/novaclient.v1_1.security_groups.html#novaclient.v1_1.security_groups.SecurityGroupManager.create">novaclient.v_1.security_groups.SecurityGroupManager.create</link></methodname>:
ja: 指定した名前と説明のセキュリティグループを作成するために、<methodname><link href="http://docs.openstack.org/developer/python-novaclient/api/novaclient.v1_1.security_groups.html#novaclient.v1_1.security_groups.SecurityGroupManager.create">novaclient.v_1.security_groups.SecurityGroupManager.create</link></methodname> メソッドを呼び出します。

source: To delete a security group, call the <methodname><link href="http://docs.openstack.org/developer/python-novaclient/api/novaclient.v1_1.security_groups.html#novaclient.v1_1.security_groups.SecurityGroupManager.delete"> novaclient.v_1.security_groups.SecurityGroupManager.delete</link></methodname> method, passing either a <link href="http://docs.openstack.org/developer/python-novaclient/api/novaclient.v1_1.security_groups.html#novaclient.v1_1.security_groups.SecurityGroup">novaclient.v1_1.security_groups.SecurityGroup</link> object or group ID as an argument:
fr: Pour supprimer un groupe de sécurité, appeler la méthode <methodname><link href="http://docs.openstack.org/developer/python-novaclient/api/novaclient.v1_1.security_groups.html#novaclient.v1_1.security_groups.SecurityGroupManager.delete"> novaclient.v_1.security_groups.SecurityGroupManager.delete</link></methodname>, en passant soit un objet <link href="http://docs.openstack.org/developer/python-novaclient/api/novaclient.v1_1.security_groups.html#novaclient.v1_1.security_groups.SecurityGroup">novaclient.v1_1.security_groups.SecurityGroup</link> ou in ID de groupe en argument:
ja: セキュリティグループを削除するために、<link href="http://docs.openstack.org/developer/python-novaclient/api/novaclient.v1_1.security_groups.html#novaclient.v1_1.security_groups.SecurityGroup">novaclient.v1_1.security_groups.SecurityGroup</link> オブジェクトまたはグループ ID を引数として渡して、<methodname><link href="http://docs.openstack.org/developer/python-novaclient/api/novaclient.v1_1.security_groups.html#novaclient.v1_1.security_groups.SecurityGroupManager.delete"> novaclient.v_1.security_groups.SecurityGroupManager.delete</link></methodname> メソッドを呼び出します。

source: Access the security group rules from the <literal>rules</literal> attribute of a <link href="http://docs.openstack.org/developer/python-novaclient/api/novaclient.v1_1.security_groups.html#novaclient.v1_1.security_groups.SecurityGroup">novaclient.v1_1.security_groups.SecurityGroup</link> object:
fr: Accéder aux règles du groupe de sécurité à partir de l'attribut <literal>rules</literal> de l'objet <link href="http://docs.openstack.org/developer/python-novaclient/api/novaclient.v1_1.security_groups.html#novaclient.v1_1.security_groups.SecurityGroup">novaclient.v1_1.security_groups.SecurityGroup</link>:
ja: <link href="http://docs.openstack.org/developer/python-novaclient/api/novaclient.v1_1.security_groups.html#novaclient.v1_1.security_groups.SecurityGroup">novaclient.v1_1.security_groups.SecurityGroup</link> オブジェクトの <literal>rules</literal> 属性からセキュリティグループのルールにアクセスします。

source: To add a rule, to a security group, call the <methodname><link href="http://docs.openstack.org/developer/python-novaclient/api/novaclient.v1_1.security_group_rules.html#novaclient.v1_1.security_group_rules.SecurityGroupRuleManager.create">novaclient.v1_1.security_group_rules.SecurityGroupRuleManager.create</link></methodname> method:
fr: Pour ajouter une règle à un groupe de sécurité, appeler la méthode <methodname><link href="http://docs.openstack.org/developer/python-novaclient/api/novaclient.v1_1.security_group_rules.html#novaclient.v1_1.security_group_rules.SecurityGroupRuleManager.create">novaclient.v1_1.security_group_rules.SecurityGroupRuleManager.create</link></methodname>:
ja: セキュリティグループにルールを追加するために、<methodname><link href="http://docs.openstack.org/developer/python-novaclient/api/novaclient.v1_1.security_group_rules.html#novaclient.v1_1.security_group_rules.SecurityGroupRuleManager.create">novaclient.v1_1.security_group_rules.SecurityGroupRuleManager.create</link></methodname> メソッドを呼び出します。

source: translator-credits
fr: Olivier Buisson <olivier@obn.me>, 2012 | Cloudwatt Team <contact@cloudwatt.com>, 2013
ja: Tomoyuki KATO <tomo@dream.daynight.jp>, 2013-2014 myamamot <myamamot@redhat.com>, 2014 ykatabam <ykatabam@redhat.com>, 2014

source: SERVER
fr: SERVEUR

source: INSTANCE_NAME
fr: NOM_INSTANCE

source: USERNAME
fr: NOM D'UTILISATEUR

source: PASSWORD
fr: MOT DE PASSE

source: Get openStack credentials. See <xref linkend="sdk_compute_get_openstack_credentials_v2"/>.
fr: Pour obtenir les identifiants openStack. Voir <xref linkend="sdk_compute_get_openstack_credentials_v2"/>.

source: NAME
fr: NOM

source: TENANT
fr: PROJET

source: FLAVOR
fr: TYPE D'INSTANCE

source: USER
fr: UTILISATEUR

source: NETWORK_NAME
fr: NOM_RÉSEAU

source: ID_OR_NAME_OF_NETWORK
fr: ID_OU_NOM_DU_RÉSEAU

source: SIZE_IN_GB
fr: TAILLE_EN_Go

source: INSTANCE_ID
fr: ID_INSTANCE

source: VOLUME_ID
fr: ID_VOLUME

source: Object Storage (swift)
fr: Stockage d'Objet (rapide)

source: ACCOUNT
fr: COMPTE

source: CONTAINER
fr: CONTENEUR

source: OBJECT
fr: OBJET

source: CONTAINER_NAME
fr: NOM_CONTENEUR

source: FILE_NAME
fr: NOM_FICHIER

source: SIZE
fr: TAILLE

source: OpenStack dashboard
fr: Tableau de bord OpenStack

source: SECURITY_GROUP_NAME
fr: NOM_GROUPE_SECURITE

source: OpenStack Foundation
fr: Fondation OpenStack

source: Copyright details are filled in by the template.
fr: Les détails sur les droits d'auteurs sont remplis par le modèle.

source: To enable the configuration drive, pass the <literal>--config-drive=true</literal> parameter to the <placeholder-1/> command.
fr: Pour activer le lecteur de configuration, passer le <literal>--config-drive=true</literal> paramètre à la <placeholder-1/> commande.

source: IP_ADDRESS
fr: ADDRESSE_IP

source: BACKUP_ID
fr: ID_SAUVEGARDE

source: DATASTORE_VERSION_ID
fr: ID_VERSION_STOCKAGE_DONNÉE

source: VALUES
fr: VALEURS

source: DATASTORE_NAME
fr: NOM_STOCKAGE_DONNÉE

source: You can change a database's configuration by attaching a configuration group to a database instance. You do this by using the trove <placeholder-1/> command and passing in the ID of the configuration group and the ID of the database instance.
fr: Vous pouvez changer la configuration d'une base de donnée en attachant un groupe de configuration à une instance de base de donnée. Vous réalisez ceci en utilisant la commande trove <placeholder-1/> en y passant l'ID du groupe de configuration et l'ID de l'instance de la base de donnée.

source: CONFIG_GROUP_ID
fr: ID_GROUPE_CONFIGURATION

source: DB_INSTANCE_ID
fr: ID_INSTANCE_DB

source: password
fr: Mot de passe

source: IPADDRESS
fr: ADRESSE IP

source: InstanceType
fr: Type d'instance.

source: yourPrivateKey
fr: votre Clé Privée

source: OBJECT_FILENAME
fr: NOMFICHIER_OBJET

source: CHUNK_SIZE
fr: TAILLE_MORCEAU
