Repository: 25hours/openstack-manuals
Catalog: doc/user-guide/locale/*.po
Languages: fr, ja

source: To show the details for a specific resource in a stack, run the following command:
fr: Pour afficher les détails d'une ressource spécifique de la pile, exécuter la commande suivante:
ja: スタックにある特定のリソースの詳細を表示するために、以下のコマンドを実行します。

source: Some resources have associated metadata which can change throughout the life cycle of a resource. Show the metadata by running the following command:
fr: Certaines ressources sont associées aux métadonnées qui peuvent changer tout au long du cycle de vie d'une ressource. Afficher les métadonnées en exécutant la commande suivante:
ja: いくつかのリソースはリソースのライフサイクルを通して変更できるメタデータと関連づけられています。以下のコマンドを実行して、メタデータを表示します。

source: A series of events is generated during the life cycle of a stack. To display life cycle events, run the following command::
fr: Une série d’événements est généré durant le cycle de vie de la pile. Pour afficher les événements du cycle de vie, exécuter la commande suivante:
ja: 一連のイベントはスタックのライフサイクルを通して生成されます。ライフサイクルイベントを表示するために、以下のコマンドを実行します。

source: To show the details for a particular event, run the following command:
fr: Pour afficher les détails pour un évènement particulier, éxécuter la commande suivante:
ja: 特定のイベントの詳細を表示するために、以下のコマンドを実行します。

source: Update a stack
fr: Mise à jour d'une pile
ja: スタックの更新

source: To update an existing stack from a modified template file, run a command like the following command:
fr: Pour mettre à jour une pile existante à partir d'un modèle de fichier modifié, éxécuter une commande comme la commande suivante:
ja: 修正したテンプレートファイルから既存のスタックを更新する場合、以下のようなコマンドを実行します。

source: Some resources are updated in-place, while others are replaced with new resources.
fr: Certaines ressources sont mise à jour dans-lieu, tandis que d'autres sont remplacés avec de nouvelle ressources.
ja: いくつかのリソースはすぐに更新され、他のものは新しいリソースで置き換えられます。

source: Create and manage networks
fr: Créez et gérez des réseaux
ja: ネットワークの作成と管理

source: The OpenStack Networking service provides a scalable system for managing the network connectivity within an OpenStack cloud deployment. It can easily and quickly react to changing network needs (for example, creating and assigning new IP addresses).
fr: Le service Réseau OpenStack fournit un système évolutif pour la gestion de la connectivité réseau au sein du déploiement d'un cloud OpenStack. Il est facilement et rapidement réactif pour changer les besoins du réseau (par exemple, création et attribution de nouvelles adresses IP).
ja: OpenStack Networking は OpenStack クラウド環境にネットワーク接続性の管理のための拡張可能なシステムを提供します。これにより、必要に応じて簡単かつ迅速にネットワークを変更できます (例えば、新しい IP アドレスの作成および割り当て)。

source: Networking in OpenStack is complex. This section provides the basic instructions for creating a network and a router. For detailed information about managing networks, refer to the <link href="http://docs.openstack.org/admin-guide-cloud/content/ch_networking.html"><emphasis role="italic">OpenStack Cloud Administrator Guide</emphasis></link>.
fr: La gestion du réseau dans OpenStack est complexe. Cette section fournit les instructions de base pour créer un réseau et un routeur. Pour des informations détaillées à propos de la gestion de réseau, se référer à <link href="http://docs.openstack.org/admin-guide-cloud/content/ch_networking.html"><emphasis role="italic">Guide Administrateur Cloud OpenStack</emphasis></link>.
ja: OpenStack のネットワークは複雑です。このセクションは、ネットワークとルーターの作成に関する基本的な説明をします。ネットワークの管理の詳細は、<link href="http://docs.openstack.org/admin-guide-cloud/content/ch_networking.html"><emphasis role="italic">OpenStack Cloud Administrator Guide</emphasis></link> を参照してください。

source: Create a network
fr: Créer un réseau
ja: ネットワークの作成

source: Log in to the dashboard, choose a project, and click <guibutton>Networks</guibutton>.
fr: Se connecter au tableau de bord, choisir un projet et cliquer <guibutton>Réseaux</guibutton>.
ja: ダッシュボードにログインし、プロジェクトを選択し、<guibutton>ネットワーク</guibutton>をクリックします。

source: Click <guibutton>Create Network</guibutton>.
fr: Cliquer <guibutton> Créer un réseau </guibutton>.
ja: <guibutton>ネットワークの作成</guibutton>をクリックします。

source: In the Create Network dialog box, specify the following values.
fr: Dans la boite de dialogue Créer un Réseau, spécifier les valeurs suivantes.
ja: ネットワークの作成ダイアログに、以下の値を指定します。

source: Network
fr: Réseau
ja: ネットワーク

source: <placeholder-1/> tab
ja: <placeholder-1/> タブ

source: Network Name
fr: Nom du Réseau
ja: ネットワーク名

source: Specify a name to identify the network.
fr: Spécifier un nom pour identifier le réseau.
ja: ネットワークを識別するための名前を指定します。

source: Subnet
fr: Sous-réseau
ja: サブネット

source: Create Subnet
fr: Créer un Sous-Réseau
ja: サブネットの作成

source: Select this check box to create a subnet
fr: Sélectionner cette case pour créer un sous-réseau
ja: サブネットを作成する場合、このチェックボックスを選択します。

source: You do not have to specify a subnet when you create a network, but if you do not, any attached instance receives an Error status.
fr: Vous n'avez pas à spécifier un sous-réseau quand vous créez un réseau, mais si vous ne le faîtes pas, chaque instance attachée reçoit un statut Erreur.
ja: ネットワークの作成時にサブネットを指定する必要がありません。ただし、指定しない場合、インスタンス接続時にエラー状態になります。

source: Subnet Name
fr: Nom du Sous-Réseau
ja: サブネット名

source: Specify a name for the subnet.
fr: Spécifier un nom pour le sous-réseau
ja: サブネットの名前を指定します。

source: Network Address
fr: Adresse réseau
ja: ネットワークアドレス

source: Specify the IP address for the subnet.
fr: Spécifier une adresse IP pour le sous-réseau.
ja: サブネットの IP アドレスを指定します。

source: IP Version
fr: Version IP
ja: IP バージョン

source: Select IPv4 or IPv6.
fr: Sélectionner IPv4 ou IPv6.
ja: IPv4 または IPv6 を選択します。

source: Gateway IP
fr: IP de la passerelle
ja: ゲートウェイ IP

source: Specify an IP address for a specific gateway. This parameter is optional.
fr: Spécifier une adresse IP pour une passerelle spécifique. Ce paramètre est optionnel.
ja: 具体的なゲートウェイの IP アドレスを指定します。このパラメーターはオプションです。

source: Disable Gateway
fr: Désactiver la Passerelle
ja: ゲートウェイなし

source: Select this check box to disable a gateway IP address.
fr: Sélectionner cette case pour désactiver la passerelle d'adresse IP.
ja: ゲートウェイの IP アドレスを無効化する場合、このチェックボックスを選択します。

source: Subnet Detail
fr: Détail du Sous-Réseau
ja: サブネットの詳細

source: Enable DHCP
fr: Activer DHCP
ja: DHCP 有効

source: Select this check box to enable DHCP.
fr: Sélectionner cette case pour activer DHCP.
ja: DHCP を有効化する場合、このチェックボックスを選択します。

source: Allocation Pools
fr: Pools d'allocation
ja: IP アドレス割り当てプール

source: Specify IP address pools.
fr: Spécifier les pools d'adresses IP.
ja: IP アドレスプールを指定します。

source: DNS Name Servers
fr: Serveurs DNS
ja: DNS サーバー

source: Specify a name for the DNS server.
fr: Spécifier un nom pour le serveur DNS.
ja: DNS サーバーの名前を指定します。

source: Host Routes
fr: Routes d'hôte
ja: 追加のルート設定

source: Specify the IP address of host routes.
fr: Spécifier les adresses IP des itinéraires des hôtes.
ja: ホストルートの IP アドレスを指定します。

source: Click <guilabel>Create</guilabel>.
fr: Cliquer <guilabel>Créer</guilabel>.
ja: <guilabel>作成</guilabel>をクリックします。

source: The dashboard shows the network on the <guilabel>Networks</guilabel> tab.
fr: Le tableau de bord montre le réseau dans l'onglet <guilabel>Réseaux</guilabel>.
ja: ダッシュボードの<guibutton>ネットワーク</guibutton>タブにネットワークが表示されます。

source: Create a router
fr: Créer un routeur
ja: ルーターの作成

source: Log in to the dashboard, choose a project, and click <guibutton>Routers</guibutton>.
fr: Connectez-vous au tableau de bord, choisissez un projet et cliquez sur <guibutton>Routeurs</guibutton>.
ja: ダッシュボードにログインし、プロジェクトを選択し、<guibutton>ルーター</guibutton>をクリックします。

source: Click <guibutton>Create Router</guibutton>.
fr: Cliquer <guibutton>Créer un Routeur</guibutton>.
ja: <guibutton>ルーターの作成</guibutton>をクリックします。

source: In the Create Router dialog box, specify a name for the router and click <guibutton>Create Router</guibutton>.
fr: Dans la boite de dialogue Créer un Routeur, spécifiez un nom pour le routeur et cliquez sur <guibutton>Créer un Routeur</guibutton>.
ja: ルーターの作成ダイアログで、ルーターの名前を指定し、<guibutton>ルーターの作成</guibutton>をクリックします。

source: The new router is now displayed in the <guilabel>Routers</guilabel> tab.
fr: Le nouveau routeur est maintenant affiché dans l'onglet <guilabel>Routeurs</guilabel>.
ja: 新しいルーターが<guilabel>ルーター</guilabel>タブに表示されます。

source: Click the new router's <guibutton>Set Gateway</guibutton> button.
fr: Cliquer sur le bouton <guibutton>Positionner une passerelle</guibutton> du nouveau routeur.
ja: 新しいルーターの<guibutton>ゲートウェイの設定</guibutton>ボタンをクリックします。

source: In the <guilabel>External Network</guilabel> field, specify the network to which the router will connect, and then click <guibutton>Set Gateway</guibutton>.
fr: Dans le champ <guilabel>Réseau Externe</guilabel>, spécifier le réseau auquel le routeur va être connecté, et cliquer alors <guibutton>Positionner la passerelle</guibutton>.
ja: <guilabel>外部ネットワーク</guilabel>項目に、ルーターが接続するネットワークを指定し、<guibutton>ゲートウェイの設定</guibutton>をクリックします。

source: To connect a private network to the newly created router, perform the following steps:
fr: Pour connecter un réseau privé à un réseau nouvellement crée, réalisez les étapes suivantes:
ja: 新しく作成したルーターにプライベートネットワークを接続するために、以下の手順を実行します。

source: On the <guilabel>Routers</guilabel> tab, click the name of the router.
fr: Sur l'onglet <guilabel>Routeurs</guilabel>, cliquez le nom du routeur.
ja: <guilabel>ルーター</guilabel>タブで、ルーターの名前をクリックします。

source: On the Router Details page, click <guilabel>Add Interface</guilabel>.
fr: Sur la page Détails du Routeur, cliquez sur <guilabel>Ajout d'une Interface</guilabel>
ja: ルーターの詳細ページで、<guilabel>インターフェースの追加</guilabel>をクリックします。

source: In the Add Interface dialog box, specify the following information:
fr: Dans la boite de dialogue Ajout d'une Interface, spécifiez l'information suivante:
ja: インターフェースの追加ダイアログボックスで、以下の情報を指定します。

source: Select a subnet.
fr: Sélectionner un sous-réseau
ja: サブネットを選択します。

source: IP Address (optional)
fr: Adresse IP (facultatif)
ja: IP アドレス (省略可能)

source: Enter the router interface IP address for the selected subnet.
fr: Entrez l'adresse IP de l'interface du routeur pour le sous-réseau sélectionné.
ja: 選択したサブネット用のルーターのインターフェース IP アドレスを入力します。

source: Note: If this value is not set, then by default, the first host IP address in the subnet is used by OpenStack Networking.
fr: Remarque: Si la valeur n'est pas positionnée, alors par défaut, la première adresse IP hôte dans le sous-réseau est utilisée par OpenStack Networking.
ja: 注: この値が設定されていない場合、サブネットの最初のホスト IP アドレスが標準で OpenStack Networking により使用されます。

source: The <guilabel>Router Name</guilabel> and <guilabel>Router ID</guilabel> fields are automatically updated.
fr: Les champs de <guilabel>Nom Routeur</guilabel> et de <guilabel>ID du Routeur</guilabel> sont automatiquement mis à jour.
ja: <guilabel>ルーター名</guilabel>と<guilabel>ルーター ID</guilabel> の項目が自動的に更新されます。

source: Click <guilabel>Add Interface</guilabel>.
fr: Cliquer <guilabel>Ajout d'une Interface</guilabel>.
ja: <guibutton>インターフェースの追加</guibutton>をクリックします。

source: You have successfully created the router. You can view the new topology from the <guilabel>Network Topology</guilabel> tab.
fr: Vous avez créé avec succès un routeur. Vous pouvez voir la nouvelle topologie dans l'onglet <guilabel>Topologie du Réseau</guilabel>.
ja: 正常にルーターを作成しました。<guilabel>ネットワークトポロジー</guilabel>タブから新しいトポロジーを表示できます。

source: Compute
fr: Calcul
ja: コンピュート

source: To use the information in this section, you must be familiar with OpenStack Compute.
fr: Pour utiliser cette information dans cette partie, vous devez être familier avec OpenStack Compute.
ja: このセクションにある情報を使用する場合、OpenStack Compute に慣れている必要があります。

source: Set environment variables
fr: Positionner les variables d'environnement
ja: 環境変数の設定

source: To set up environmental variables and authenticate against Compute API endpoints, see <xref linkend="sdk_auth"/>.
fr: Pour positionner les variables environnementales et s'authentifier à travers les paramètres de l'API Calcul, voir <xref linkend="sdk_auth"/>.
ja: 環境変数をセットアップし、Compute API エンドポイントに対して認証するために、<xref linkend="sdk_auth"/> を参照してください。

source: Get OpenStack credentials (API v2)
fr: Obtenir les identifiants OpenStacks (API v2)
ja: OpenStack クレデンシャルの取得 (API v2)

source: These example use the <code>get_nova_credentials_v2</code> method:
fr: Cet exemple utilise la méthode <code>get_nova_credentials_v2</code>
ja: これらの例は <code>get_nova_credentials_v2</code> メソッドを使用します。

source: This code resides in the <filename>credentials.py</filename> file, which all samples import.
ja: このコードは <filename>credentials.py</filename> ファイルにあります。すべてのサンプルがこれをインポートします。

source: Use the <code>get_nova_credentials_v2()</code> method to populate and get a dictionary:
fr: Utiliser la méthode <code>get_nova_credentials_v2()</code> pour remplir et obtenir le dictionnaire:
ja: 辞書を生成し、取得するために、<code>get_nova_credentials_v2()</code> メソッドを使用します。

source: List servers (API v2)
fr: Liste des serveurs (API v2)
ja: サーバーの一覧表示 (API v2)

source: The following program lists servers by using the Compute API v2.
fr: Le programme suivant liste les serveurs en utilisant Compute API v2.
ja: 以下のプログラムは、Compute API v2 を用いてサーバーを一覧表示します。

source: To list servers
fr: Pour lister les serveurs
ja: サーバーの一覧表示方法

source: Import the following modules:
fr: Importer les modules suivants:
ja: 以下のモジュールをインポートします。

source: Get Nova credentials. See <xref linkend="sdk_compute_get_openstack_credentials_v2"/>.
fr: Pour obtenir les identifiants Nova. Voir <xref linkend="sdk_compute_get_openstack_credentials_v2"/>.
ja: Nova クレデンシャルを取得します。<xref linkend="sdk_compute_get_openstack_credentials_v2"/> を参照してください。

source: Instantiate the <literal>nova_client</literal> client object by using the <literal>credentials</literal> dictionary object:
fr: Instancier l'objet client <literal>nova_client</literal> en utilisant le l'objet dictionnaire <literal>credentials</literal>:
ja: <literal>credentials</literal> 辞書オブジェクトを使用して、<literal>nova_client</literal> クライアントオブジェクトのインスタンスを生成します。

source: List servers by calling <literal>servers.list</literal> on <literal>nova_client</literal> object:
fr: Lister les serveurs en appelant <literal>servers.list</literal> sur l'objet <literal>nova_client</literal>:
ja: <literal>nova_client</literal> オブジェクトの <literal>servers.list</literal> を呼び出し、サーバーを一覧表示します。

source: List servers code listing
ja: サーバーの一覧表示のコード全体

source: Create server (API v2)
fr: Créer un serveur (API v2)
ja: サーバーの作成 (API v2)

source: The following program creates a server (VM) by using the Compute API v2.
fr: Le programmes suivant crée un serveur (VM) en utilisant Compute API v2.
ja: 以下のプログラムは、Compute API v2 を用いてサーバー (VM) を作成します。

source: To create a server
fr: Pour créer un serveur
ja: サーバーの作成方法

source: Get OpenStack credentials. See <xref linkend="sdk_compute_get_openstack_credentials_v2"/>.
fr: Pour obtenir les identifiants OpenStack. Voir <xref linkend="sdk_compute_get_openstack_credentials_v2"/>.
ja: OpenStack クレデンシャルを取得します。<xref linkend="sdk_compute_get_openstack_credentials_v2"/> を参照してください。

source: Get the flavor and image to use to create a server. This code uses the <literal>cirros</literal> image, the <literal>m1.tiny</literal> flavor, and the <literal>private</literal> network:
fr: Obtenir le type d'instance et l'image à utiliser pour créer un serveur. Ce code utilise l'image <literal>cirros</literal>, le type d'instance <literal>m1.tiny</literal> et le réseau <literal>private</literal>:
ja: サーバーを作成するために、使用するフレーバーとイメージを取得します。このコードは、<literal>cirros</literal> イメージ、<literal>m1.tiny</literal> フレーバー、<literal>private</literal> ネットワークを使用します。

source: To create the server, use the network, image, and flavor:
fr: Pour créer le serveur, utiliser le réseau, l'image et le type d'instance.
ja: サーバーを作成し、ネットワーク、イメージ、フレーバーを使用する方法:

source: Sleep for five seconds and determine whether the server/vm was created by calling <literal>nova_client.servers.list()</literal>:
fr: S'endormir pendant cinq secondes et déterminer si le serveur/vm est créé en appelant <literal>nova_client.servers.list()</literal>:
ja: 5 秒間スリープします。そして、 <literal>nova_client.servers.list()</literal> を呼び出すことにより、サーバー/仮想マシンが作成されたかどうかを確認します。

source: Create server code listing
ja: サーバーの作成のコード全体

source: Delete server (API v2)
fr: Supprimer un serveur (API v2)
ja: サーバーの削除 (API v2)

source: The following program deletes a server (VM) by using the Compute API v2.
fr: Le programme suivant supprime un serveur (VM) en utilisant Compute API v2.
ja: 以下のプログラムは、Compute API v2 を用いてサーバー (VM) を削除します。

source: To delete a server
fr: Pour détruire un serveur
ja: サーバーの削除方法

source: Determine whether the <literal>vm1</literal> server exists:
fr: Déterminer si le serveur <literal>vm1</literal> existe:
ja: <literal>vm1</literal> サーバーが存在するかを確認します。

source: List servers: <literal>servers_list</literal>.
fr: Lister les serveurs: <literal>servers_list</literal>.
ja: サーバー一覧 <literal>servers_list</literal> を取得します。

source: Iterate over <literal>servers_list</literal> and compare name with <literal>vm1</literal>.
fr: Itérer sur <literal>servers_list</literal> et comparer le nom avec <literal>vm1</literal>.
ja: <literal>servers_list</literal> を反復し、名前を <literal>vm1</literal> と比較します。

source: If true, set the variable name <literal>server_exists</literal> to <literal>True</literal> and break from the for loop:
fr: Si vrai, positionner le nom de la variable <literal>server_exists</literal> à <literal>True</literal> et arrêter la boucle :
ja: 存在すると、<literal>server_exists</literal> 変数が <literal>True</literal> になり、for ループを抜けます。

source: If the server exists, run the <literal>delete</literal> method of the <literal>nova_client.servers</literal> object:
fr: Si le serveur existe, exécuter la méthode <literal>delete</literal> de l'objet <literal>nova_client.servers</literal> :
ja: サーバーが存在すると、<literal>nova_client.servers</literal> オブジェクトの <literal>delete</literal> メソッドを実行します。

source: Delete server code listing
ja: サーバーの削除のコード全体

source: Update server (API v2)
fr: Serveur mis à jour (API v2)
ja: サーバーの更新 (API v2)

source: The following program updates the name of a server (VM) by using the Compute API v2.
fr: Le programme suivant met à jour le nom d'un serveur (VM) en utilisant Compute API v2.
ja: 以下のプログラムは、Compute API v2 を用いてサーバー (VM) の名前を更新します。

source: To update a server
fr: Pour mettre à jour le serveur
ja: サーバーの更新方法

source: <literal>print_server</literal> is a method defined in <filename>utils.py</filename> and prints the server details as shown in the code listing below:
fr: <literal>print_server</literal> est une méthode définie dans <filename>utils.py</filename> et qui imprime les détails du serveur comme décrit dans le code en-dessous:
ja: <literal>print_server</literal> は <filename>utils.py</filename> で定義されたメソッドです。以下のコード全体に示されたとおり、サーバーの詳細を表示します。

source: Get OpenStack Credentials. See <xref linkend="sdk_compute_get_openstack_credentials_v2"/>.
fr: Pour obtenir les identifiants OpenStack. Voir <xref linkend="sdk_compute_get_openstack_credentials_v2"/>.
ja: OpenStack クレデンシャルを取得します。<xref linkend="sdk_compute_get_openstack_credentials_v2"/> を参照してください。

source: Get the server instance using <literal>server_id</literal> and print the details by calling <literal>print_server</literal> method:
fr: Obtenir l'instance du serveur en utilisant <literal>server_id</literal> et imprimer les détails en appelant la méthode <literal>print_server</literal>:
ja: <literal>server_id</literal> を使用してサーバーインスタンスを取得します。<literal>print_server</literal> メソッドを呼び出し、詳細を表示します。

source: Call <code>server.update</code> on the server object with the new value for <literal>name</literal> variable:
fr: Appeler <code>server.update</code> sur l'objet serveur avec la nouvelle valeur de la variable <literal>name</literal> :
ja: <literal>name</literal> 変数の新しい値を用いて、server オブジェクトの <code>server.update</code> を呼び出します。

source: Get the updated instance of the server:
fr: Obtenir l'instance mise à jour du serveur:
ja: サーバーの更新されたインスタンスを取得します。

source: Call <literal>print_server</literal> again to check the update server details:
fr: Appeler à nouveau <literal>print_server</literal> pour vérifier la mise à jour des détails du serveur:
ja: 更新したサーバーの詳細を確認するために、再度 <literal>print_server</literal> を呼び出します。

source: Update server code listing
ja: サーバーの更新のコード全体

source: List flavors (API v2)
fr: Liste des types d'instance (API v2)
ja: フレーバーの一覧表示 (API v2)

source: The following program lists flavors and their details by using the Compute API v2.
fr: Le programme suivant liste les spécifications et leurs détails en utilisant Compute API v2.
ja: 以下のプログラムは、Compute API v2 を用いてフレーバーとその詳細を一覧表示します。

source: To list flavors
fr: Pour lister les types d'instances.
ja: フレーバーの一覧表示方法

source: The <literal>print_flavors</literal> method is defined in <filename>utils.py</filename> and prints the flavor details:
fr: La méthode <literal>print_flavors</literal> est définie dans <filename>utils.py</filename> est imprime les détails d'un type d'instance.
ja: <literal>print_flavors</literal> メソッドは、<filename>utils.py</filename> で定義され、フレーバーの詳細を表示します。

source: List flavors by calling <literal>list()</literal> on <literal>nova_client.flavors</literal> object:
fr: Lister les types d'instance en appelant <literal>list()</literal> sur l'objet <literal>nova_client.flavors</literal>:
ja: <literal>nova_client.flavors</literal> オブジェクトの <literal>list()</literal> を呼び出し、フレーバーを一覧表示します。

source: Print the flavor details, id and name by calling <literal>print_flavors</literal>:
fr: Imprimer les détails, l'ID et le nom d'un type d'instance en appelant <literal>print_flavors</literal>:
ja: <literal>print_flavors</literal> を呼び出し、フレーバーの詳細、ID、名前を表示します。

source: List flavors code listing
ja: フレーバーの一覧表示のコード全体

source: List floating IPs (API v2)
fr: Liste des IP flottantes (API v2)
ja: Floating IP の一覧表示 (API v2)

source: The following program lists the floating IPs and their details by using the Compute API v2.
fr: Le programme suivant liste les adresses IP et leurs détails en utilisant Compute API v2.
ja: 以下のプログラムは、Compute API v2 を用いて Floating IP アドレスとその詳細を一覧表示します。

source: To list floating IPs
fr: Pour lister les IP flottantes
ja: Floating IP の一覧表示方法

source: The <literal>print_values_ip</literal> method is defined in <filename>utils.py</filename> and prints the floating_ip object details:
fr: La méthode <literal>print_values_ip</literal> est définie dans <filename>utils.py</filename> et affiche les détails de l'objet floating_ip :
ja: <literal>print_values_ip</literal> メソッドは、<filename>utils.py</filename> で定義され、floating_ip オブジェクトの詳細を表示します。

source: List floating IPs by calling <literal>list()</literal> on <literal>nova_client.floating_ips</literal> object:
fr: Lister les IP flottantes en appelant <literal>list()</literal> sur l'objet <literal>nova_client.floating_ips</literal> :
ja: <literal>nova_client.floating_ips</literal> オブジェクトの <literal>list()</literal> を呼び出すことにより、Floating IP を一覧表示します。

source: Print the floating IP object details by calling <literal>print_values_ip</literal>:
fr: Afficher les détails de l'objet IP flottante en appelant <literal>print_values_ip</literal> :
ja: <literal>print_values_ip</literal> を呼び出すことにより、Floating IP オブジェクトの詳細を表示します。

source: List floating IPs code listing
ja: Floating IP の一覧表示のコード全体

source: List hosts (API v2)
fr: Lister les hôtes (API v2)
ja: ホストの一覧表示 (API v2)

source: The following program lists the hosts by using the Compute API v2.
fr: Le programme suivant liste les hôtes en utilisant Compute API v2.
ja: 以下のプログラムは、Compute API v2 を用いてホストを一覧表示します。

source: To list hosts
fr: Pour lister les hôtes
ja: ホストの一覧表示方法
