Repository: 25hours/openstack-manuals
Catalog: doc/user-guide/locale/*.po
Languages: fr, ja

source: Follow this procedure to update an existing image.
fr: Suivez cette procédure pour mettre à jour une image existante.
ja: 既存のイメージを更新する場合、この手順を実行します。

source: Select the image that you want to edit.
fr: Sélectionner l'image que vous voulez éditer.
ja: 編集したいイメージを選択します。

source: In the <guilabel>Actions</guilabel> column, click <guilabel>More</guilabel> and then select <guilabel>Edit</guilabel> from the list.
fr: Dans la colonne <guilabel>Actions</guilabel>, cliquer <guilabel>Plus</guilabel> et ensuite sélectionner <guilabel>Editer</guilabel> dans la liste.
ja: <guilabel>アクション</guilabel>列の<guilabel>▼</guilabel>をクリックし、一覧から<guilabel>編集</guilabel>を選択します。

source: Change the name of the image.
fr: Changer le nom de l'image.
ja: イメージの名前を変更します。

source: Select the <guilabel>Public</guilabel> check box to make the image public.
fr: Sélectionner la case <guilabel>Public</guilabel> pour rendre l'image publique.
ja: イメージをパブリックにするために、<guilabel>パブリック</guilabel>チェックボックスを選択します。

source: Clear the <guilabel>Public</guilabel> check box to make the image private.
fr: Effacer la case <guilabel>Public</guilabel> pour rendre l'image privée.
ja: イメージをプライベートにするために、<guilabel>パブリック</guilabel>チェックボックスを選択解除します。

source: In the Update Image dialog box, you can perform the following actions: <placeholder-1/>
fr: Dans la boite de dialogue Mise à jour Image, vous pouvez réaliser les actions suivantes: <placeholder-1/>
ja: イメージの更新ダイアログボックスで、以下の操作を実行できます: <placeholder-1/>

source: Click <guibutton>Update Image</guibutton>.
fr: Cliquer <guibutton> mettre l'image </guibutton>.
ja: <guibutton>イメージの更新</guibutton>をクリックします。

source: Delete an image
fr: Supprimer une image
ja: イメージの削除

source: Deletion of images is permanent and <emphasis role="bold">cannot</emphasis> be reversed. Only users with the appropriate permissions can delete images.
fr: La suppression des images est définitive et <emphasis role="bold">n'est pas</emphasis> réversible. Seuls les utilisateurs avec les permissions appropriées peuvent supprimer des images.
ja: イメージの削除は、永続的であり、元に戻せ<emphasis role="bold">ません</emphasis>。適切なパーミッションを持つユーザーのみが、イメージを削除できます。

source: Select the images that you want to delete.
fr: Sélectionnez les images que vous souhaitez supprimer.
ja: 削除したいイメージを選択します。

source: Click <guibutton>Delete Images</guibutton>.
fr: Cliquer <guibutton> Supprimer l'image </guibutton>.
ja: <guibutton>イメージの削除</guibutton>をクリックします。

source: In the <guilabel>Confirm Delete Image</guilabel> dialog box, click <guibutton>Delete Images</guibutton> to confirm the deletion.
fr: Dans la boite de dialogue <guilabel>Confirmer la Suppression de l'Image</guilabel>, cliquer <guibutton>Suppresion des Images</guibutton> pour confirmer la suppression.
ja: <guilabel>イメージの削除の確認</guilabel>ダイアログボックスで、削除を確認するために<guibutton>イメージの削除</guibutton>をクリックします。

source: Create and manage databases
fr: Créer et gérer des base de données
ja: データベースの作成と管理

source: The Database service provides scalable and reliable cloud provisioning functionality for both relational and non-relational database engines. Users can quickly and easily use database features without the burden of handling complex administrative tasks.
ja: Database は、リレーショナルデータベースと非リレーショナルデータベースの両方のエンジン向けにスケール可能な信頼できるクラウド展開機能を提供します。ユーザーは、複雑な管理作業を実行することなく、迅速かつ容易にデータベース機能を利用できます。

source: Create a database instance
fr: Créer une instance de base de donnée
ja: データベースインスタンスの作成

source: Prerequisites
ja: 前提

source: Before you create a database instance, you need to configure a default datastore and make sure you have an appropriate flavor for the type of database instance you want.
ja: データベースインスタンスを作成する前に、デフォルトのデータストアを設定する必要があります。また、使用したいデータベースインスタンスの種類に応じた適切なフレーバーが必ず必要になります。

source: Configure a default datastore.
ja: デフォルトのデータストアを設定します。

source: Because the dashboard does not let you choose a specific datastore to use with an instance, you need to configure a default datastore. The dashboard then uses the default datastore to create the instance.
ja: ダッシュボードは、インスタンスで使用する特定のデータストアを選択できないため、デフォルトのデータストアを設定する必要があります。そして、ダッシュボードは、インスタンスを作成するためにデフォルトのデータストアを使用します。

source: Add the following line to <filename>/etc/trove/trove.conf</filename>:
ja: 以下の行を <filename>/etc/trove/trove.conf</filename> に追加します。

source: Replace <replaceable>DATASTORE_NAME</replaceable> with the name that the administrative user set when issuing the <placeholder-1/> command to create the datastore. You can use the trove <placeholder-2/> command to display the datastores that are available in your environment.
ja: データストアを作成するために <placeholder-1/> コマンドを実行するときに、設定する管理ユーザーで <replaceable>DATASTORE_NAME</replaceable> を置き換えます。trove <placeholder-2/> コマンドを使用して、お使いの環境で利用できるデータストアを表示できます。

source: For example, if your MySQL datastore name is set to <literal>mysql</literal>, your entry would look like this:
ja: 例えば、MySQL データストアの名前が <literal>mysql</literal> に設定されている場合、このようになるでしょう。

source: Restart Database services on the controller node:
ja: コントローラーノードで Database のサービスを再起動します。

source: Verify flavor.
ja: フレーバーを検証します。

source: Make sure an <link linkend="create_db">appropriate flavor exists</link> for the type of database instance you want.
ja: 使用したいデータベースインスタンスの種類に応じた<link linkend="create_db">適切なフレーバーが存在</link>することを確認してください。

source: Create database instance
ja: データベースインスタンスの作成

source: Once you have configured a default datastore and verified that you have an appropriate flavor, you can create a database instance.
ja: デフォルトのデータストアを設定し、適切なフレーバーがきちんとあると、データベースインスタンスを作成できます。

source: Log in to the dashboard, choose a project, and click <guilabel>Databases</guilabel>.
ja: ダッシュボードにログインし、プロジェクトを選択し、<guilabel>データベース</guilabel>をクリックします。

source: Click <guilabel>Database Instances</guilabel>. This lists the instances that already exist in your environment.
ja: <guilabel>データベースインスタンス</guilabel>をクリックします。お使いの環境にあるインスタンスが一覧表示されます。

source: Click <guibutton>Launch Instance</guibutton>.
ja: <guibutton>インスタンスの起動</guibutton>をクリックします。

source: In the <guilabel>Launch Database</guilabel> dialog box, specify the following values.
ja: <guilabel>データベースの起動</guilabel>ダイアログボックスに以下の値を指定します。

source: Database Name
ja: データベース名

source: Specify a name for the database instance.
ja: データベースインスタンスの名前を指定します。

source: Select an appropriate flavor for the instance.
ja: インスタンスに応じた適切なフレーバーを選択します。

source: Volume Size
ja: ボリュームサイズ

source: Select a volume size. Volume size is expressed in GB.
ja: ボリューム容量を選択します。ボリューム容量は GB 単位で表示されます。

source: Initialize Databases
ja: データベースの初期化

source: Initial Database
ja: 初期データベース

source: Optionally provide a comma separated list of databases to create, for example:
ja: オプションとして、作成するデータベースの一覧を CSV で指定します。例えば、

source: Initial Admin User
ja: 最初の管理ユーザー

source: Create an initial admin user. This user will have access to all the databases you create.
ja: 初期管理ユーザーを作成します。このユーザーは、作成するすべてのデータベースにアクセスできます。

source: Password
ja: パスワード

source: Specify a password associated with the initial admin user you just named.
ja: 名前をつけた初期管理ユーザーのパスワードを指定します。

source: Host
ja: ホスト

source: Optionally, allow the user to connect only from this host. If you do not specify a host, this user will be allowed to connect from anywhere.
ja: オプションとして、ユーザーがこのホストのみから接続できるようになります。ホストを指定しない場合、このユーザーはどこからでも接続できます。

source: Click the <guibutton>Launch</guibutton> button. The new database instance appears in the databases list.
ja: <guibutton>起動</guibutton>ボタンをクリックします。新しいデータベースインスタンスがデータベース一覧に表示されます。

source: Backup and restore a database
fr: Sauvegarder et restaurer une base de donnée
ja: データベースのバックアップとリストア

source: You can use Database services to backup a database and store the backup artifact in the Object Storage module. Later on, if the original database is damaged, you can use the backup artifact to restore the database. The restore process creates a database instance.
fr: Vous pouvez utiliser les services Base de donnée pour sauvegarder une base de donnée et stocker un objet sauvegarde dans le module Stockage d'Objet. Plus tard, si la base de donnée originale est endommagée, vous pouvez utiliser cet objet sauvegardé pour restaurer la base de donnée. Le processus de restauration crée une instance de base de donnée.
ja: データベースをバックアップし、Object Storage にバックアップを保存するために、Database を使用できます。後から、元のデータベースが破壊された場合、データベースをリストアするために、バックアップを使用できます。リストア処理は、データベースインスタンスを作成します。

source: This example shows you how to back up and restore a MySQL database.
fr: Cet exemple vous montre comment sauvegarder et restaurer une base de donnée MySQL
ja: この例は、MySQL データベースをバックアップし、リストアする方法を示します。

source: To backup and restore a database
fr: Pour sauvegarder et restaurer une base de donnée
ja: データベースのバックアップとリストアの方法

source: Backup the database instance.
ja: データベースインスタンスをバックアップします。

source: Click <guilabel>Database Instances</guilabel>. This displays the existing instances in your system.
ja: <guilabel>データベースインスタンス</guilabel>をクリックします。お使いのシステムに存在するインスタンスが表示されます。

source: Click <guibutton>Create Backup</guibutton>.
ja: <guibutton>バックアップの作成</guibutton>をクリックします。

source: In the Backup Database dialog box, specify the following values:
ja: データベースのバックアップダイアログボックスに以下の値を指定します。

source: Specify a name for the backup.
ja: バックアップの名前を指定します。

source: Database Instance
ja: データベースインスタンス

source: Select the instance you want to back up.
ja: バックアップしたいインスタンスを選択します。

source: Specify an optional description.
ja: オプションとして説明を記入します。

source: Click <guibutton>Backup</guibutton>. The new backup appears in the backup list.
ja: <guibutton>バックアップ</guibutton>をクリックします。新しいバックアップがバックアップ一覧に表示されます。

source: Restore a database instance.
ja: データベースインスタンスをリストアします。

source: Now assume that your original database instance is damaged and you need to restore it. You do the restore by using your backup to create a new database instance.
ja: ここで、元々のデータベースインスタンスが破損し、リストアする必要があると仮定します。新しいデータベースインスタンスを作成するために、バックアップを用いてリストアします。

source: Click <guilabel>Database Backups</guilabel>. This lists the available backups.
ja: <guilabel>データベースのバックアップ</guilabel>をクリックします。利用可能なバックアップが一覧表示されます。

source: Check the backup you want to use and click <guibutton>Restore Backup</guibutton>.
ja: 使用したいバックアップを確認し、<guibutton>バックアップのリストア</guibutton>をクリックします。

source: In the <guilabel>Launch Database</guilabel> dialog box, specify the <link linkend="dashboard_create_db_instance">values you want to use for the new database instance</link>. Click the <guilabel>Restore From Database</guilabel> tab and make sure that this new instance is based on the correct backup.
ja: <guilabel>データベースの起動</guilabel>ダイアログボックスに、<link linkend="dashboard_create_db_instance">新しいデータベースインスタンスに使用したい値</link>を指定します。<guilabel>データベースからのリストア</guilabel>タブをクリックし、この新しいインスタンスが適切なバックアップに基づいていることを確認します。

source: Click <guibutton>Launch</guibutton>. The new instance appears in the database instances list.
ja: <guibutton>起動</guibutton>をクリックします。新しいインスタンスがデータベースインスタンス一覧に表示されます。

source: Measure cloud resources
fr: Mesurer les ressources du cloud
ja: クラウドのリソースの測定

source: Telemetry measures cloud resources in OpenStack. It collects data related to billing. Currently, this metering service is available through only the <placeholder-1/> command-line client.
fr: Telemetry mesure les ressources du cloud dans OpenStack. Actuellement, le service de mesure est disponible uniquement avec la ligne de commande <placeholder-1/>.
ja: Telemetry は、OpenStack にあるクラウドリソースを計測します。課金に関連するデータを収集します。現在、このメータリングサービスは、<placeholder-1/> コマンドラインクライアントを通してのみ利用可能です。

source: To model data, Telemetry uses the following abstractions:
fr: Pour modéliser les données, Telemetry utilise les hypothèses suivantes:
ja: データをモデル化するために、Telemetry は以下の抽象化を使用します。

source: Meter
fr: Compteur
ja: メーター

source: Measures a specific aspect of resource usage, such as the existence of a running instance, or ongoing performance, such as the CPU utilization for an instance. Meters exist for each type of resource. For example, a separate <literal>cpu_util</literal> meter exists for each instance. The life cycle of a meter is decoupled from the existence of its related resource. The meter persists after the resource goes away.
fr: Mesure un aspect spécifique de l'utilisation des ressources, telles que l'existence d'une instance en cours d'exécution, l'exécution en cours ou encore l'utilisation du processeur pour une instance. Des compteurs existent pour chaque type de ressource. Par exemple, il existe un compteur séparé <literal> cpu_util </ literal> pour chaque instance. Le cycle de vie d'un appareil de mesure est découplé par l'existence de sa ressource. Le compteur persiste après que la ressource disparaît.
ja: リソース使用状況の具体的な側面を測定します。実行中のインスタンス数、インスタンスの CPU 使用率などのパフォーマンスなどがあります。メーターはリソースの各種別向けに存在します。例えば、それぞれの <literal>cpu_util</literal> メーターが各インスタンス向けに存在します。メーターのライフサイクルは、それに関連するリソースの存在と切り離されています。メーターは、リソースの消滅後も存在します。

source: A meter has the following attributes:
fr: Un compteur a les attributs suivants:
ja: メーターは以下の属性を持ちます。

source: String name
fr: Nom de la chaîne
ja: 名称文字列

source: A unit of measurement
fr: Une unité de mesure
ja: 測定単位

source: A type, which indicates whether values increase monotonically (cumulative), are interpreted as a change from the previous value (delta), or are stand-alone and relate only to the current duration (gauge)
ja: 種別。値が単調に増加するか (cumulative)、前の値からの変更量として解釈されるか (delta)、単独の値として現在の測定間隔のみであるか (gauge) を意味します。

source: Sample
fr: Echantillon
ja: サンプル

source: An individual data point that is associated with a specific meter. A sample has the same attributes as the associated meter, with the addition of time stamp and value attributes. The value attribute is also known as the sample <emphasis role="italic">volume</emphasis>.
ja: このデータは、特定のメーターに関連づけられた値を示します。サンプルは、関連づけられたメーターと同じ属性を持ち、タイムスタンプと値の属性も持ちます。値の属性は、サンプル<emphasis role="italic">ボリューム</emphasis>としても知られています。

source: Statistic
fr: Statistique
ja: 統計

source: A set of data point aggregates over a time duration. (In contrast, a sample represents a single data point.) The Telemetry service employs the following aggregation functions:
ja: データ群は、一定時間継続後に集約されます。（対照的に、サンプルはある単一のデータ点を表します。）Telemetry は、以下の集約関数を利用します。

source: <emphasis role="bold">count</emphasis>. The number of samples in each period.
fr: <emphasis role="bold">count</emphasis>. Le nombre d'échantillons dans chaque période.
ja: <emphasis role="bold">数量</emphasis>。各期間のサンプル数。

source: <emphasis role="bold">max</emphasis>. The maximum number of sample volumes in each period.
fr: <emphasis role="bold">max</emphasis>. Le nombre maximum de volumes d'échantillons dans chaque période.
ja: <emphasis role="bold">最大</emphasis>。各期間の最大サンプルボリューム数。

source: <emphasis role="bold">min</emphasis>. The minimum number of sample volumes in each period.
fr: <emphasis role="bold">min</emphasis>. Le nombre minimal de volumes d'échantillons dans chaque période.
ja: <emphasis role="bold">最小</emphasis>。各期間の最小サンプルボリューム数。

source: <emphasis role="bold">avg</emphasis>. The average of sample volumes over each period.
fr: <emphasis role="bold">avg</emphasis>. La moyenne des volumes d'échantillons sur chaque période.
ja: <emphasis role="bold">平均</emphasis>。各期間の平均サンプルボリューム数。

source: <emphasis role="bold">sum</emphasis>. The sum of sample volumes over each period.
fr: <emphasis role="bold">sum</emphasis>. La somme des volumes d'échantillons par période.
ja: <emphasis role="bold">合計</emphasis>。各期間の合計サンプルボリューム数。

source: Alarm
fr: Alerte
ja: アラーム

source: A set of rules that define a monitor and a current state, with edge-triggered actions associated with target states. Alarms provide user-oriented Monitoring-as-a-Service and a general purpose utility for OpenStack. Orchestration auto scaling is a typical use case. Alarms follow a tristate model of <literal>ok</literal>, <literal>alarm</literal>, and <literal>insufficient data</literal>. For conventional threshold-oriented alarms, a static threshold value and comparison operator govern state transitions. The comparison operator compares a selected meter statistic against an evaluation window of configurable length into the recent past.
ja: 監視項目と現在の状態を定義する一連のルール。指定した状態に関連づけられたエッジトリガー方式のアクションを持ちます。アラームは、ユーザー指向の Monitoring-as-a-Service、OpenStack の汎用的なユーティリティを提供します。アラートは、<literal>ok</literal>、<literal>alarm</literal>、<literal>insufficient data</literal> の 3 つの状態を持ちます。伝統的な閾値によるアラームのために、静的な閾値と比較演算子により、状態を遷移させられます。比較演算子は、選択したメーターの統計値を比較します。この比較間隔は、最近の範囲で設定可能な長さです。

source: This example uses the <placeholder-1/> client to create an auto-scaling stack and the <placeholder-2/> client to measure resources.
fr: Cet exemple utilise le client <placeholder-1/> pour créer un stack auto-scaling et le client <placeholder-2/> pour mesurer les ressources.
ja: この例は、オートスケールするスタックを作成するために <placeholder-1/> コマンドを使用し、リソースを計測するために <placeholder-2/> クライアントを使用します。

source: Create an auto-scaling stack by running the following command. The <literal>-f</literal> option specifies the name of the stack template file, and the <literal>-P</literal> option specifies the <literal>KeyName</literal> parameter as <literal>heat_key</literal>.
ja: 以下のコマンドを実行して、オートスケールするスタックを作成します。<literal>-f</literal> オプションは、スタックテンプレートファイルの名前を指定します。<literal>-P</literal> オプションは、<literal>KeyName</literal> パラメーターを <literal>heat_key</literal> に指定します。

source: List the heat resources that were created:
fr: Dressez la liste des ressources Heat qui ont été créés:
ja: 作成された heat リソースを一覧表示します。

source: List the alarms that are set:
fr: Liste des alarmes qui sont définis:
ja: 設定されたアラームを一覧表示します。

source: List the meters that are set:
fr: Liste des mètres qui sont définis:
ja: 設定されたメーターを一覧表示します。

source: List samples:
fr: Listes des exemples:
ja: サンプルを一覧表示します。

source: View statistics:
fr: Afficher les statistiques:
ja: 使用状況を表示します。

source: OpenStack command-line interface cheat sheet
ja: OpenStack CLI チートシート

source: The following tables give a quick reference of the most used command-line commands.
fr: Les tables suivantes donnent une référence rapide aux commandes en lignes les plus utilisées.
ja: 以下の表は、よく使われるコマンドの簡単なリファレンスです。

source: Command
fr: Commande
ja: コマンド

source: List all users
fr: Lister tous les utilisateurs
ja: すべてのユーザーの一覧表示

source: List Identity service catalog
ja: Identity サービスカタログの一覧表示

source: List all services in service catalog
ja: サービスカタログにある全サービスの一覧表示

source: Create new user
fr: Créer un nouveau utilisateur
ja: 新しいユーザーの作成

source: Create new tenant
fr: Créer un nouveau projet
ja: 新しいテナントの作成

source: List images you can access
fr: Liste d'images auxquelles vous pouvez accéder
ja: アクセス可能なイメージの一覧表示

source: Delete specified image
fr: Supprimer une image spécifique
ja: 指定したイメージの

source: Describe a specific image
fr: Décrire une image spécifique
ja: 指定したイメージの詳細表示

source: Update image
fr: Mise à jour de l'image
ja: イメージの更新

source: Manage images
fr: Gestion des images
ja: イメージの管理

source: Kernel image
fr: Image du Noyau
ja: カーネルイメージ

source: RAM image
fr: image RAM
ja: RAM イメージ

source: Three-part image
ja: 3 分割イメージ

source: Register raw image
fr: Enregistrer l'image brute
ja: raw イメージの登録

source: List instances, notice status of instance
fr: Liste des instances, notice des status des instances
ja: インスタンス、その状態の一覧表示

source: List images
fr: Liste des images
ja: イメージの一覧表示

source: List flavors
fr: Liste des types d'instances
ja: フレーバーの一覧表示

source: Boot an instance using flavor and image names (if names are unique)
fr: Démarrer une instance en utilisant les noms d'un type d'instance et d'une image (si les noms sont uniques)
ja: フレーバーとイメージ名 (名前が一意な場合) を用いたインスタンスの起動

source: Login to instance
fr: Connexion à une instance
ja: インスタンスへのログイン

source: Note, in CirrOS the password for user <literal>cirros</literal> is "cubswin:)" without the quotes.
fr: Notez que dans CirrOS le mot de passe pour l'utilisateur <literal>cirros</literal> est "cubswin:)" sans les guillemets.
ja: 注: CirrOS の <literal>cirros</literal> のパスワードは「cubswin:)」です。

source: Show details of instance
fr: Montrer les détails d'une instance
ja: インスタンスの詳細表示

source: View console log of instance
fr: Voir la console de log d'une instance
ja: インスタンスのコンソールログの表示

source: Set metadata on an instance
fr: Positionner une métadonnée sur une instance
ja: インスタンスのメタデータの設定

source: Create an instance snapshot
fr: Créer un instantané d'une instance
ja: インスタンスのスナップショットの作成

source: Pause, suspend, stop, rescue, resize, rebuild, reboot an instance
fr: Pause, suspendre, stop, secours, redimensionner, reconstruire, redémarrer une instance
ja: インスタンスの一時停止、休止、停止、レスキュー、リサイズ、再作成、リブート

source: Pause
ja: 一時停止

source: Unpause
fr: Reprendre
ja: 一時停止解除

source: Suspend
fr: Suspendre
ja: 休止

source: Unsuspend
fr: Reprendre
ja: 休止解除

source: Stop
ja: 停止

source: Start
fr: Démarrer
ja: 開始

source: Rescue
fr: Secours
ja: レスキュー

source: Resize
fr: Redimensionner
ja: リサイズ

source: Rebuild
fr: Reconstruire
ja: 再作成

source: Reboot
fr: Redémarrage
ja: リブート

source: Inject user data and files into an instance
fr: Injecte des données et des fichiers utilisateur dans une instance
ja: ユーザーデータとファイルのインスタンスへの注入

source: To validate that the file is there, ssh into the instance, and look in <filename>/var/lib/cloud</filename> for the file.
ja: ファイルが注入されたことを確認する場合、インスタンスに SSH し、<filename>/var/lib/cloud</filename> にあるファイルを探します。

source: Inject a keypair into an instance and access the instance with that keypair
fr: Injecter une paire de clés dans une instance et accéder à cette instance avec cette paire de clés.
ja: インスタンスへのキーペアの注入、キーペアを用いたインスタンスへのアクセス

source: Create keypair
fr: Créer une paire de clés
ja: キーペアの作成

source: Boot
fr: Démarrer
ja: 起動

source: Use ssh to connect to the instance
fr: Utiliser ssh pour se connecter à une instance
ja: インスタンスに接続するための SSH の利用

source: Manage security groups
fr: Gérer les groupes de sécurité
ja: セキュリティグループの管理

source: Add rules to default security group allowing ping and SSH between instances in the default security group
ja: default セキュリティグループでインスタンス間の ping と SSH を許可するルールの default セキュリティグループへの追加

source: Create network
fr: Créer un réseau
ja: ネットワークの作成

source: Create a subnet
fr: Créer un sous-réseau
ja: サブネットの作成

source: List network and subnet
fr: Liste du réseau et du sous-réseau
ja: ネットワークとサブネットの一覧表示

source: Examine details of network and subnet
fr: Examiner les détails du réseau et du sous-réseau
ja: ネットワークとサブネットの詳細表示

source: Manage volumes and volume snapshots
fr: Gérer les volumes et les instantanés des volumes
ja: ボリュームとボリュームスナップショットの管理

source: Create a new volume
fr: Créer un nouveau volume
ja: 新しいボリュームの作成

source: Boot an instance and attach to volume
fr: Démarrer une instance et l'attacher à un volume
ja: インスタンスの起動およびボリュームの接続

source: List volumes, notice status of volume
fr: Lister les volumes, notice les status des volumes
ja: ボリューム、その状態の一覧表示

source: Attach volume to instance after instance is active, and volume is available
fr: Attacher un volume à une instance après qu'ine instance soit active et que le volume soit disponible
ja: インスタンス起動後、ボリューム作成後のインスタンスへのボリュームの接続

source: Manage volumes after login into the instance
fr: Gérer les volumes après être connecter dans l'instance
ja: インスタンスへのログイン後のボリュームの管理

source: List storage devices
fr: Lister les périphériques de stockage
ja: ストレージデバイスの一覧表示

source: Make filesystem on volume
fr: Créer un système de fichier sur le volume
ja: ボリュームのファイルシステムの作成

source: Create a mountpoint
fr: Créer un point de montage
ja: マウントポイントの作成

source: Mount the volume at the mountpoint
fr: Monter le volume au point de montage
ja: マウントポイントへのボリュームのマウント

source: Create a file on the volume
fr: Créer un fichier dans le volume
ja: ボリュームへのファイルの作成

source: Unmount the volume
fr: Démonter le volume
ja: ボリュームのアンマウント

source: Display information for the account, container, or object
fr: Affiche les informations pour le compte, le conteneur ou l'objet
ja: アカウント、コンテナー、オブジェクトの情報表示

source: List containers
fr: Liste de conteneurs
ja: コンテナーの一覧表示

source: Create a container
fr: Créer un conteneur
ja: コンテナーの作成
