Repository: 25hours/openstack-manuals
Catalog: doc/user-guide/locale/*.po
Languages: fr, ja

source: As you can see, the <option>sync_binlog</option> option is now set to <literal>1</literal>, as specified in the <literal>group1</literal> configuration group.
fr: Comme vous pouvez le constater, l'option <option>sync_binlog</option> est maintenant positionnée à <literal>1</literal>, comme spécifié dans le groupe de configuration <literal>group1</literal>.
ja: 確認できるように、<literal>group1</literal> 設定グループに設定されているとおり、<option>sync_binlog</option> が <literal>1</literal> に設定されています。

source: Conclusion
ja: まとめ

source: Using a configuration group to set a single option on a single database is obviously a trivial example. However, configuration groups can provide major efficiencies when you consider that:
fr: Utiliser un groupe de configuration pour positionner une seule option sur une seule base de donnée est évidemment un exemple trivial. Cependant, les groupes de configuration peuvent fournir une efficacité majeure quand vous considérez ceci :
ja: 単一のオプションを単一のデータベースに設定するために、設定グループを使用することは、明らかにささいな例です。しかしながら、設定グループは、以下を検討する際に大きな効果があります。

source: A configuration group can specify a large number of option values.
fr: Un groupe de configuration peut spécifier un large nombre de valeurs optionnelles.
ja: 設定グループは、数多くのオプション値を指定できます。

source: You can apply a configuration group to hundreds or thousands of database instances in your environment.
fr: Vous pouvez appliquer un groupe de configuration à des centaines de milliers d'instances de base de données dans votre environnement.
ja: お使いの環境で数百～数千のデータベースインスタンスを処理するために、設定グループを適用できます。

source: Used in this way, configuration groups let you modify your database cloud configuration, on the fly, on a massive scale.
fr: Utilisés ainsi, les groupes de configuration vous laissent modifier votre configuration de base de donnée de cloud, à la volée, sur de grandes échelles.
ja: このように使用すると、設定グループにより、データベースクラウドの設定を、動的かつ大規模に変更できます。

source: Maintenance
ja: メンテナンス

source: There are also a number of useful maintenance features for working with configuration groups. You can:
fr: Il y a aussi un certain nombre de fonctionnalités utiles de maintenance pour travailler avec les groupes de configuration. Vous pouvez :
ja: 設定グループを用いて動作する、有用なメンテナンス機能がいろいろとあります。以下を実行できます。

source: Disassociate a configuration group from a database instance, using the trove <placeholder-1/> command.
fr: Dissocier un groupe de configuration d'une instance de base de donnée, en utilisant la commande trove <placeholder-1/>.
ja: trove <placeholder-1/> コマンドを使用して、データベースインスタンスから設定グループを解除します。

source: Modify a configuration group on the fly, using the trove <placeholder-1/> command.
fr: Modifier un groupe de configuration à la volée, en utilisant la commande trove <placeholder-1/>.
ja: trove <placeholder-1/> コマンドを使用して、設定グループを利用中に変更します。

source: Find out what instances are using a configuration group, using the trove <placeholder-1/> command.
fr: Découvrir quelles instances utilisent un groupe de configuration, en utilisant la commande trove <placeholder-1/>.
ja: trove <placeholder-1/> コマンドを使用して、どのインスタンスが設定グループを使用しているか見つけます。

source: Delete a configuration group, using the trove <placeholder-1/> command. You might want to do this if no instances use a group.
fr: Supprimer un groupe de configuration, en utilisant la commande trove <placeholder-1/>. Vous voudrez peut-être faire ceci si aucune instance utilise ce groupe.
ja: trove <placeholder-1/> コマンドを使用して、設定グループを削除します。グループを使用するインスタンスが無い場合、削除したいかもしれません。

source: Launch and manage instances
fr: Lancer et gérer l'instances
ja: インスタンスの起動と管理

source: You can <link linkend="dashboard_launch_instances_from_image">launch an instance</link> from the following sources:
fr: Vous pouvez <link linkend="dashboard_launch_instances_from_image">lancer une instance</link> à partir des sources suivantes:
ja: 以下のソースから<link linkend="dashboard_launch_instances_from_image">インスタンスを起動</link>できます。

source: Images uploaded to the OpenStack Image Service, as described in <xref linkend="dashboard_manage_images"/>.
fr: Les images chargées dans le Service Image d'OpenStack sont décrites dans <xref linkend="dashboard_manage_images"/>.
ja: <xref linkend="dashboard_manage_images"/>に記載されているとおり、OpenStack Image Service にアップロードされたイメージ。

source: Image that you have copied to a persistent volume. The instance launches from the volume, which is provided by the <systemitem class="service">cinder-volume</systemitem> API through iSCSI.
fr: Image que vous avez copiée dans une volume persistent. L'instance est lancée depuis un volume, qui est fourni par l'API <systemitem class="service">cinder-volume</systemitem> à travers iSCSI.
ja: 永続ストレージにコピーしたイメージ。インスタンスは、iSCSI 経由で <systemitem class="service">cinder-volume</systemitem> API により提供される、ボリュームから起動します。

source: Connect to your instance by using SSH
fr: Connectez-vous à votre instance en utilisant SSH
ja: インスタンスへの SSH 接続

source: To use SSH to connect to your instance, you use the downloaded keypair file.
fr: Pour utiliser SSH pour se connecter à votre instance, vous utilisez le fichier téléchargé de paire de clés.
ja: インスタンスに SSH 接続するために、ダウンロードしたキーペアファイルを使用します。

source: The user name is <literal>ubuntu</literal> for the Ubuntu cloud images on TryStack.
fr: Le nom d'utilisateur est <literal>ubuntu</literal> pour les images cloud Ubuntu sur TryStack
ja: TryStack の Ubuntu クラウドイメージのユーザー名は <literal>ubuntu</literal> です。

source: Copy the IP address for your instance.
fr: Copie l'adresse IP pour votre instance.
ja: インスタンスの IP アドレスをコピーします。

source: Use the <placeholder-1/> command to make a secure connection to the instance. For example:
fr: Utiliser la commande <placeholder-1/> pour effectuer une connexion sécurisée vers l'instance. Par exemple :
ja: インスタンスにセキュアに接続するために <placeholder-1/> コマンドを使用します。例:

source: At the prompt, type <literal>yes</literal>.
fr: Sur l'invite de commande, tappez <literal>yes</literal>.
ja: プロンプトに <literal>yes</literal> と入力します。

source: Track usage for instances
fr: Suivi de l'usage des instances
ja: インスタンスの使用状況の確認

source: You can track usage for instances for each project. You can track costs per month by showing metrics like number of vCPUs, disks, RAM, and uptime for all your instances.
fr: Vous pouvez suivre les utilisations des instances pour chaque projet. Vous pouvez suivre les coûts par mois en affichant les métriques comme le nombre de vCPU, de disques, de RAM et la durée de fonctionnement de toutes vos instances.
ja: プロジェクトごとのインスタンスの使用状況を確認できます。すべてのインスタンスの仮想 CPU 数、ディスク、メモリ、起動時間のような測定項目を表示することにより、月ごとのコストを確認できます。

source: Log in to the dashboard, choose a project, and click <guilabel>Overview</guilabel>.
fr: Se connecter au tableau de bord, choisir un projet et cliquer <guilabel>Aperçu</guilabel>.
ja: ダッシュボードにログインし、プロジェクトを選択し、<guibutton>概要</guibutton>をクリックします。

source: To query the instance usage for a month, select a month and click <guibutton>Submit</guibutton>.
fr: Pour afficher l'utilisation de l'instance pur un mois, sélectionnez un mois et cliquez sur <guibutton>Envoyer</guibutton>.
ja: ある月のインスタンス使用状況を問い合わせるために、月を選択し、<guibutton>送信</guibutton>をクリックします。

source: To download a summary, click <guibutton>Download CSV Summary</guibutton>.
fr: Pour télécharger un résumé, cliquez sur <guibutton>Télécharger le résumé CSV</guibutton>.
ja: 概要をダウンロードするために、<guibutton>概要 CSV のダウンロード</guibutton>をクリックします。

source: Log in to the dashboard, choose a project, and click <guilabel>Instances</guilabel>.
fr: Se connecter au tableau de bord, choisir un projet et cliquer <guilabel>Instances</guilabel>.
ja: ダッシュボードにログインし、プロジェクトを選択し、<guilabel>インスタンス</guilabel>をクリックします。

source: Select the instance from which to create a snapshot.
fr: Sélectionner une instance pour créer un instantané.
ja: スナップショットを作成するインスタンスを選択します。

source: In the <guilabel>Actions</guilabel> column, click <guilabel>Create Snapshot</guilabel>.
fr: Dans la colonne <guilabel>Actions</guilabel>, cliquer <guilabel>Créer un Instantané</guilabel>.
ja: <guilabel>操作</guilabel>の列で、<guilabel>スナップショットの作成</guilabel>をクリックします。

source: In the Create Snapshot dialog box, enter a name for the snapshot, and click <guibutton>Create Snapshot</guibutton>.
fr: Dans la boite de dialogue Créer un Instantané, entrer un nom pour l'instantané et cliquer <guibutton>Créer un Instantané</guibutton>.
ja: スナップショットの作成ダイアログボックスで、スナップショットの名前を入力し、<guibutton>スナップショットの作成</guibutton>をクリックします。

source: The <guilabel>Images</guilabel> category shows the instance snapshot.
fr: La catégorie <guilabel>Images</guilabel> affiche les instantanés d'instance.
ja: インスタンスのスナップショットが<guilabel>イメージ</guilabel>カテゴリーに表示されます。

source: To launch an instance from the snapshot, select the snapshot and click <guibutton>Launch</guibutton>. Proceed with <xref linkend="dashboard_launch_instances_from_image"/>.
fr: Pour lancer une instance depuis un instantané, sélectionnez l'instantané et cliquez sur <guibutton>Launch</guibutton>. Procéder à la section intitulée <xref linkend="dashboard_launch_instances_from_image"/>.
ja: スナップショットからインスタンスを起動するために、スナップショットを選択し、<guibutton>起動</guibutton>をクリックします。<xref linkend="dashboard_launch_instances_from_image"/>に進みます。

source: Manage an instance
fr: Manager une instance.
ja: インスタンスの管理

source: Select an instance.
fr: Sélectionner une instance.
ja: インスタンスを選択します。

source: In the <guilabel>More</guilabel> list in the <guilabel>Actions</guilabel> column, select the state.
fr: Dans la liste <guilabel>Plus</guilabel> dans la colonne <guilabel>Actions</guilabel>, sélectionner l'état.
ja: <guilabel>アクション</guilabel>列の<guilabel>▼</guilabel>ドロップダウンリストで状態を選択します。

source: You can resize or rebuild an instance. You can also choose to view the instance console log, edit instance or the security groups. Depending on the current state of the instance, you can pause, resume, suspend, soft or hard reboot, or terminate it.
fr: Vous pouvez redimensionner ou reconstruire une instance. Vous pouvez aussi choisir d'afficher le journal de la console de l'instance. Suivant l'état courant de l'instance, vous pouvez faire une pause, reprendre, suspendre, faire un redémarrage soft ou hard ou mettre fin à l'instance.
ja: インスタンスのリサイズや再構築をできます。インスタンスのコンソールログを表示するため、インスタンスやセキュリティグループを編集するためにも選択できます。インスタンスの現在の状態によって、インスタンスを一時停止、再開、サスペンド、ソフトリブート、ハードリブート、終了できます。

source: Provide user data to instances
ja: インスタンスへのユーザーデータの提供

source: A <glossterm baseform="user data">user data</glossterm> file is a special key in the metadata service that holds a file that cloud-aware applications in the guest instance can access. For example, one application that uses user data is the <link href="https://help.ubuntu.com/community/CloudInit">cloud-init</link> system, which is an open-source package from Ubuntu that is available on various Linux distributions and which handles early initialization of a cloud instance.
ja: <glossterm baseform="user data">ユーザーデータ</glossterm>ファイルは、メタデータサービス内の特別キーで、ゲストインスタンスにあるクラウド対応アプリケーションがアクセス可能なファイルを保持します。例えば、ユーザーデータを使用するアプリケーションの 1 つは <link href="https://help.ubuntu.com/community/CloudInit">cloud-init</link> システムです。これは、さまざまな Linux ディストリビューションで利用可能な Ubuntu 発祥のオープンソースパッケージです。クラウドインスタンスの初期設定を処理します。

source: You can place user data in a local file and pass it through the <parameter>--user-data &lt;user-data-file&gt;</parameter> parameter at instance creation:
ja: インスタンス作成時に <parameter>--user-data &lt;user-data-file&gt;</parameter> パラメーターを使用して、ローカルファイルのユーザーデータを渡すことができます。

source: Access an instance through a console
ja: コンソール経由のインスタンスへのアクセス

source: To access an instance through a VNC console, run the following command:
ja: VNC コンソール経由でインスタンスにアクセスするには、以下のコマンドを実行します。

source: The command returns a URL from which you can access your instance:
ja: このコマンドは、インスタンスにアクセスするための URL を返します。

source: To access an instance through a non-VNC console, specify the <parameter>novnc</parameter> parameter instead of the <parameter>xvpvnc</parameter> parameter.
ja: VNC 以外のコンソール経由でインスタンスにアクセスするために、<parameter>xvpvnc</parameter> パラメーターの代わりに <parameter>novnc</parameter> パラメーターを指定します。

source: OpenStack command-line clients
fr: Openstack line de commande clients
ja: OpenStack コマンドラインクライアント

source: To use the information in this section, you should have a general understanding of OpenStack Networking, OpenStack Compute, and the integration between the two. You should also have access to a plug-in that implements the Networking API v2.0.
fr: Pour utiliser l'information dans cette section, vous devez avoir connaissance générale de OpenStack Networking, OpenStack Compute et de l’intégration entre les deux. Vous devez avoir accès au plug-in qui implémente l'API Networking v2.0.
ja: このセクションにある情報を利用するために、OpenStack Networking、OpenStack Compute、それらの統合について基本を理解しておくべきです。また、Networking API v2.0 を実装するプラグインへのアクセス権を持つべきです。

source: Make sure that you set the relevant environment variables.
fr: Assurez-vous que vous avez positionné les variables d'environnement concernées.
ja: 関連する環境変数をきちんと設定します。

source: As an example, see the sample shell file that sets these variables to get credentials:
fr: A titre d'exemple, voir les fichiers shell qui positionnent ces variables pour obtenir les identifiants:
ja: 例として、クレデンシャルを取得するために、これらの変数を設定するサンプルシェルファイルを参照してください。

source: Get credentials
fr: Obtenir les identifiants
ja: クレデンシャルの取得

source: The examples in this section use the <code>get_credentials</code> method:
fr: Les exemples dans cette section utilise la méthode <code>get_credentials</code>:
ja: このセクションにある例は <code>get_credentials</code> メソッドを使用します。

source: Use the <code>get_credentials()</code> method to populate and get a dictionary:
fr: Utiliser la méthode <code>get_credentials()</code> pour remplir et obtenir un dictionnaire:
ja: 辞書を生成し、取得するために、<code>get_credentials()</code> メソッドを使用します。

source: Get Nova credentials
fr: Obtenir les identifiants Nova
ja: Nova クレデンシャルの取得

source: Few examples in this section use the <code>get_nova_credentials</code> method:
fr: Quelques exemples dans cette section utilise la méthode <code>get_nova_credentials</code>:
ja: このセクションにある例は <code>get_nova_credentials</code> メソッドを使用します。

source: Use the <code>get_nova_credentials()</code> method to populate and get a dictionary:
fr: Utiliser la méthode <code>get_nova_credentials()</code> pour remplir et obtenir un dictionnaire:
ja: 辞書を生成し、取得するために、<code>get_nova_credentials()</code> メソッドを使用します。

source: Print values
fr: Imprimer les valeurs
ja: 値の表示

source: The examples in this section use the <code>print_values</code> and <code>print_values_server</code> methods:
fr: Les exemples de cette section utilisent les méthodes <code>print_values</code> et <code>print_values_server</code>:
ja: このセクションにある例は <code>print_values</code> メソッドと <code>print_values_server</code> メソッドを使用します。

source: This code resides in the <filename>utils.py</filename> file, which all samples import.
ja: このコードは <filename>utils.py</filename> ファイルにあります。すべてのサンプルがこれをインポートします。

source: The following program creates a network:
fr: Les programmes suivant créent un réseau:
ja: 以下のプログラムはネットワークを作成します。

source: List networks
fr: Lister les réseaux
ja: ネットワークの一覧表示

source: The following program lists networks:
fr: Les programmes suivants listent les réseaux:
ja: 以下のプログラムはネットワークを一覧表示します。

source: For <code>print_values</code> see <xref linkend="sdk_neutron_print_values"/>.
fr: Pour <code>print_values</code> voir <xref linkend="sdk_neutron_print_values"/>.
ja: <code>print_values</code> は <xref linkend="sdk_neutron_print_values"/> を参照してください。

source: Create ports
fr: Créer des ports
ja: ポートの作成

source: The following program creates a port:
fr: Les programmes suivant créent un port:
ja: 以下のプログラムはポートを作成します。

source: For <code>get_nova_credentials</code> see <xref linkend="sdk_neutron_get_nova_credentials"/>.
fr: Pour <code>get_nova_credentials</code> voir <xref linkend="sdk_neutron_get_nova_credentials"/>.
ja: <code>get_nova_credentials</code> は <xref linkend="sdk_neutron_get_nova_credentials"/> を参照してください。

source: For <code>get_credentials</code> see <xref linkend="sdk_neutron_get_credentials"/>.
fr: Pour <code>get_credentials</code> voir <xref linkend="sdk_neutron_get_credentials"/>.
ja: <code>get_credentials</code> は <xref linkend="sdk_neutron_get_credentials"/> を参照してください。

source: List ports
fr: Liste de ports
ja: ポートの一覧表示

source: The following program lists ports:
fr: Les programmes suivants listent des ports:
ja: 以下のプログラムはポートを一覧表示します。

source: List server ports
fr: Liste des ports de serveur
ja: サーバーポートの一覧表示

source: The following program lists the ports for a server:
fr: Les programmes suivants listent les ports pour un serveur:
ja: 以下のプログラムがサーバーのポートを一覧表示します。

source: Create router and add port to subnet
fr: Créer un routeur et ajouter un port au sous-réseau
ja: ルーターの作成とサブネットへのポートの追加

source: This example queries OpenStack Networking to create a router and add a port to a subnet.
fr: Cet exemple demande à Gestion du Réseau OpenStack de créer un routeur et d'ajouter un port au sous-réseau.
ja: この例は、ルーターを作成し、サブネットにポートを追加するために、OpenStack Networking にクエリーを発行します。

source: To create a router and add a port to a subnet
fr: Pour créer un routeur et ajouter un port au sous-réseau.
ja: ルーターの作成とサブネットへのポートの追加の方法

source: Get Nova Credentials. See <xref linkend="sdk_neutron_get_nova_credentials"/>.
fr: Obtenir les identifiants Nova. Voir <xref linkend="sdk_neutron_get_nova_credentials"/>.
ja: Nova クレデンシャルを取得します。<xref linkend="sdk_neutron_get_nova_credentials"/> を参照してください。

source: Create a router and add a port to the subnet:
fr: Créer un routeur et ajouter un port au sous-réseau:
ja: ルーターを作成し、サブネットにポートを追加します。

source: Create router: complete code listing
fr: Créer un routeur: la liste complète du code
ja: ルーターの作成: コード全体

source: Delete a network
fr: Supprimer un réseau
ja: ネットワークの削除

source: This example queries OpenStack Networking to delete a network.
fr: Cet exemple demande à Gestion du Réseau OpenStack de supprimer un réseau.
ja: この例は、ネットワークを削除するために、OpenStack Networking にクエリーを発行します。

source: To delete a network
fr: Pour supprimer un réseau
ja: ネットワークの削除方法

source: Get credentials. See <xref linkend="sdk_neutron_get_credentials"/>.
fr: Pour obtenir les identifiants. Voir <xref linkend="sdk_neutron_get_credentials"/>.
ja: クレデンシャルを取得します。<xref linkend="sdk_neutron_get_credentials"/>を参照してください。

source: Instantiate the <literal>neutron</literal> client object by using the <literal>credentials</literal> dictionary object:
fr: Instancier l'objet client <literal>neutron</literal> en utilisant l'objet dictionnaire <literal>credentials</literal>:
ja: <literal>credentials</literal> 辞書オブジェクトを使用して、<literal>neutron</literal> クライアントオブジェクトのインスタンスを生成します。

source: Delete the network:
fr: Supprimer un réseau:
ja: ネットワークを削除します。

source: Delete network: complete code listing
fr: Supprimer un réseau: listing complet du code
ja: ネットワークの削除: コード全体

source: List routers
fr: Liste de routeurs
ja: ルーターの一覧表示

source: This example queries OpenStack Networking to list all routers.
fr: Cet exemple demande à Gestion du Réseau OpenStack de lister tous les routeurs.
ja: この例は、すべてのルーターを一覧表示するために、OpenStack Networking にクエリーを発行します。

source: To list routers
fr: Pour lister les routeurs
ja: ルーターの一覧表示方法

source: List the routers
fr: Liste les routeurs
ja: ルーターの一覧表示

source: List routers: complete code listing
fr: Liste des routeurs: listing complet du code
ja: ルーターの一覧表示: コード全体

source: List security groups
fr: Liste les groupes de sécurité
ja: セキュリティグループの一覧表示

source: This example queries OpenStack Networking to list security groups.
fr: Cet exemple demande à gestion du Réseau OpenStack de lister les groupes de sécurité.
ja: この例は、セキュリティグループを一覧表示するために、OpenStack Networking にクエリーを発行します。

source: To list security groups
fr: Pour lister les groupes de sécurité
ja: セキュリティグループの一覧表示方法

source: List Security groups
fr: Liste les groupes de Sécurité
ja: セキュリティグループの一覧表示

source: List security groups: complete code listing
fr: Liste des groupes de sécurité: listing complet du code
ja: セキュリティグループの一覧表示: コード全体

source: OpenStack Networking security groups are case-sensitive while the <systemitem class="service">nova-network</systemitem> security groups are case-insensitive.
fr: Les groupes de sécurité de Gestion du Réseau OpenStack sont sensibles à la casse alors que les groupes de sécurité de <systemitem class="service">nova-network</systemitem> ne sont pas sensibles à la casse.
ja: <systemitem class="service">nova-network</systemitem> のセキュリティグループは大文字小文字を区別しませんが、OpenStack Networking のセキュリティグループは区別します。

source: List subnets
fr: Liste des sous-réseaux
ja: サブネットの一覧表示

source: This example queries OpenStack Networking to list subnets.
fr: Cet exemple demande à gestion du Réseau OpenStack de lister les sous-réseaux.
ja: この例は、サブネットを一覧表示するために、OpenStack Networking にクエリーを発行します。

source: To list subnets
fr: Pour lister les sous-réseaux
ja: サブネットの一覧表示方法

source: List subnets:
fr: Liste des sous-réseaux:
ja: サブネットを一覧表示します。

source: List subnets: complete code listing
fr: Liste des sous-réseaux : listing complet du code
ja: サブネットの一覧表示: コード全体

source: Authenticate against a Compute endpoint
fr: S'authentifier sur un point d'accès Compute
ja: Compute エンドポイントへの認証

source: To authenticate against a Compute endpoint, instantiate a <link href="http://docs.openstack.org/developer/python-novaclient/api/novaclient.v1_1.client.html#novaclient.v1_1.client.Client"> novaclient.v_1_1.client.Client</link> object:
fr: Pour s'authentifier sur un point d'accès Compute, instanciez un objet <link href="http://docs.openstack.org/developer/python-novaclient/api/novaclient.v1_1.client.html#novaclient.v1_1.client.Client"> novaclient.v_1_1.client.Client</link> :
ja: Compute エンドポイントに認証するために、<link href="http://docs.openstack.org/developer/python-novaclient/api/novaclient.v1_1.client.html#novaclient.v1_1.client.Client"> novaclient.v_1_1.client.Client</link> オブジェクトのインスタンスを生成します。

source: Alternatively, you can instantiate a <classname>novaclient.client.Client</classname> object and pass the version number:
fr: Alternativement, vous pouvez instancier un objet <classname>novaclient.client.Client</classname> et passer le numéro de version:
ja: 代わりに、<classname>novaclient.client.Client</classname> オブジェクトのインスタンスを生成し、バージョン番号を渡すこともできます。

source: If you authenticate against an endpoint that uses a custom authentication back end, you must load the authentication plug-in and pass it to the constructor.
ja: カスタム認証バックエンドを使用するエンドポイントに対して認証する場合、その認証プラグインを読み込み、それをコンストラクターに渡す必要があります。

source: The Rackspace public cloud is an OpenStack deployment that uses a custom authentication back end. To authenticate against this cloud, you must install the <link href="https://pypi.python.org/pypi/rackspace-novaclient/"> rackspace-novaclient</link> library that contains the Rackspace authentication plug-in, called <literal>rackspace</literal>. The following Python code shows the additional modifications required to instantiate a <classname>Client</classname> object that can authenticate against the Rackspace custom authentication back end.
ja: Rackspace パブリッククラウドは、カスタム認証バックエンドを使用する OpenStack 環境です。このクラウドに対して認証するために、<literal>rackspace</literal> という Rackspace 認証プラグインを含む、<link href="https://pypi.python.org/pypi/rackspace-novaclient/"> rackspace-novaclient</link> ライブラリをインストールする必要があります。以下の Python コードは、Rackspace のカスタム認証バックエンドに対して認証できる、<classname>Client</classname> オブジェクトのインスタンスを生成するために、少し修正したものを示します。

source: If you set the <literal>OS_AUTH_SYSTEM</literal> environment variable, check for this variable in your Python script to determine whether you need to load a custom authentication back end:
ja: <literal>OS_AUTH_SYSTEM</literal> 環境変数を設定した場合、カスタム認証バックエンドを読み込む必要があるかどうかを判断するために、Python スクリプトでこの変数を確認します。

source: Search for an instance using IP address
ja: IP アドレスを用いたインスタンスの検索

source: You can search for an instance using the IP address parameter, <literal>--ip</literal>, with the <placeholder-1/> command.
ja: <placeholder-1/> コマンドの <literal>--ip</literal> オプションを用いて、IP アドレスをパラメーターにして、インスタンスを検索できます。
