Repository: 25hours/openstack-manuals
Catalog: doc/user-guide/locale/*.po
Languages: fr, ja

source: To change its permissions so that only you can read and write to the file, run the following command:
fr: Pour modifier ses permissions afin que vous seul puissiez lire et écrire dans le fichier, exécutez la commande suivante:
ja: あなただけがファイルを読み書きできるようにパーミッションを変更するために、以下のコマンドを実行します。

source: If you are using the dashboard from a Windows computer, use PuTTYgen to load the <filename>*.pem</filename> file and convert and save it as <filename>*.ppk</filename>. For more information see the <link href="http://winscp.net/eng/docs/ui_puttygen">WinSCP web page for PuTTYgen</link>.
fr: Si vous utilisez le tableau de bord depuis un ordinateur Windows, utilisez PuTTYgen pour charger le fichier <filename>*.pem</filename> ,le convertir et le sauver sous <filename>*.ppk</filename>. Pour plus d'information, voir <link href="http://winscp.net/eng/docs/ui_puttygen">WinSCP web page for PuTTYgen</link>.
ja: Windows コンピューターからダッシュボードを使用している場合、<filename>*.pem</filename> ファイルを読み込むために PuTTYgen を使用し、<filename>*.ppk</filename> に変換して保存します。詳細は <link href="http://winscp.net/eng/docs/ui_puttygen">WinSCP web page for PuTTYgen</link> を参照してください。

source: To make the key pair known to SSH, run the <placeholder-1/> command.
fr: Pour rendre la paire de clés visible de SSH, lancer la commande <placeholder-1/> .
ja: キーペアを SSH で利用するために、<placeholder-1/> コマンドを実行します。

source: The Compute database registers the public key of the key pair.
fr: La base de donnée Compute enregistre la clé publique dans la paire de clés.
ja: コンピュートのデータベースはキーペアの公開鍵を登録します。

source: The dashboard lists the key pair on the <guilabel>Access &amp; Security</guilabel> tab.
fr: Le tableau de bord liste les paires de clés dans l'onglet <guilabel>Accès &amp; Sécurité</guilabel>.
ja: ダッシュボードの<guibutton>アクセスとセキュリティ</guibutton>タブにキーペアが一覧表示されます。

source: Allocate a floating IP address to an instance
fr: Allouer une adresse IP flottante à une instance
ja: インスタンスへの Floating IP アドレスの割り当て

source: When an instance is created in OpenStack, it is automatically assigned a fixed IP address in the network to which the instance is assigned. This IP address is permanently associated with the instance until the instance is terminated.
fr: Quand une instance est créée dans OpenStack, il lui attribuée automatiquement une adresse IP fixe dans le réseau dans laquelle l'instance est assignée. Cette adresse IP est associée de façon permanente à l'instance jusqu'à la fermeture de cette dernière.
ja: インスタンスを OpenStack に作成したとき、インスタンスに割り当てられるネットワーク上の固定 IP アドレスが自動的に割り当てられます。この IP アドレスは、インスタンスが終了するまで、インスタンスに割り当てられたままです。

source: However, in addition to the fixed IP address, a floating IP address can also be attached to an instance. Unlike fixed IP addresses, floating IP addresses can have their associations modified at any time, regardless of the state of the instances involved. This procedure details the reservation of a floating IP address from an existing pool of addresses and the association of that address with a specific instance.
ja: しかしながら、固定 IP アドレスに加えて、Floating IP アドレスもインスタンスに割り当てられます。固定 IP アドレスと異なり、インスタンスの状態に関わらず、Floating IP アドレスはいつでも割り当てを変更できます。この手順は、既存のアドレスプールから Floating IP を予約し、このアドレスを特定のインスタンスに割り当てることを詳細に説明します。

source: Click the <guilabel>Floating IPs</guilabel> tab, which shows the floating IP addresses allocated to instances.
fr: Cliquer sur l'onglet <guilabel>IP Flottantes</guilabel>, pour montrer les adresses IP flottantes allouées aux instances.
ja: <guilabel>Floating IP</guilabel> タブをクリックします。ここにインスタンスに割り当てられた Floating IP アドレスが表示されます。

source: Click <guibutton>Allocate IP to Project</guibutton>.
fr: Cliquer <guibutton>Allouer une IP au Projet</guibutton>.
ja: <guibutton>Floating IP の確保</guibutton>をクリックします。

source: Choose the pool from which to pick the IP address.
fr: Choisir le groupe à partir duquel on prend les adresses IP.
ja: IP アドレスを確保するプールを選択します。

source: Click <guibutton>Allocate IP</guibutton>.
fr: Cliquer <guibutton>Allouer une IP</guibutton>.
ja: <guibutton>Floating IP の確保</guibutton>をクリックします。

source: In the <guilabel>Floating IPs</guilabel> list, click <guibutton> Associate</guibutton>.
fr: Dans la liste <guilabel>IP Flottantes</guilabel>, cliquer <guibutton>Associer</guibutton>.
ja: <guilabel>Floating IP</guilabel> 一覧で、<guibutton>割り当て</guibutton>をクリックします。

source: The <guilabel>IP Address</guilabel> field is filled automatically, but you can add a new IP address by clicking the <guibutton>+</guibutton> button.
fr: Le champ <guilabel>Adresse IP</guilabel> est rempli automatiquement mais vous pouvez ajouter une nouvelle adresse IP en cliquant sur le bouton <guibutton>+</guibutton>.
ja: <guilabel>IP アドレス</guilabel>の項目は自動的に入力されますが、<guibutton>+</guibutton> ボタンをクリックして、新しい IP アドレスを追加できます。

source: In the <guilabel>Ports to be associated</guilabel> field, select a port from the list.
fr: Dans le champs <guilabel>Ports à associer</guilabel>, sélectionner un port de la liste.
ja: <guilabel>割り当てるポート</guilabel>の項目で、ドロップダウンリストからポートを選択します。

source: The list shows all the instances with their fixed IP addresses.
fr: La liste montre toutes les instances avec leurs adresses IP fixes.
ja: ドロップダウンに固定 IP アドレスを持つインスタンスがすべて一覧表示されます。

source: In the Manage Floating IP Associations dialog box, choose the following options: <placeholder-1/>
fr: Dans la boite de dialogue Gérer les Associations IP Flottantes, choisir les options suivantes: <placeholder-1/>
ja: Floating IP の割り当ての管理ダイアログボックスで、以下のオプションを選択します。 <placeholder-1/>

source: Click <guibutton>Associate</guibutton>.
fr: Cliquer <guibutton>Associer</guibutton>.
ja: <guibutton>割り当て</guibutton>をクリックします。

source: To disassociate an IP address from an instance, click the <guibutton>Disassociate</guibutton> button.
fr: Pour dissocier une adresse IP d'une instance, cliquer sur le bouton <guibutton>Dissocier</guibutton>.
ja: IP アドレスをインスタンスから割り当て解除する場合、<guibutton>割り当て解除</guibutton>ボタンをクリックします。

source: To release the floating IP address back into the pool of addresses, click the <guibutton>More</guibutton> button and select the <guilabel>Release Floating IP</guilabel> option.
ja: Floating IP アドレスを開放してアドレスプールに戻すために、<guibutton>▼</guibutton>ボタンをクリックし、<guilabel>Floating IP の開放</guilabel>オプションを選択します。

source: Use the OpenStack Python Software Development Kit (SDK) to write Python automation scripts that create and manage resources in your OpenStack cloud. The SDK implements Python bindings to the OpenStack API, which enables you to perform automation tasks in Python by making calls on Python objects rather than making REST calls directly. All OpenStack command-line tools are implemented using the Python SDK.
fr: Utilisez le OpenStack Python Software Development Kit (SDK) pour écrire des scripts d'automatisation en Python qui créent et gèrent les ressources de votre cloud OpenStack. Le SDK implémente des liaisons Python pour l'API OpenStack, qui vous permet d'effectuer des tâches d'automatisation en Python en faisant des appels sur des objets Python plutôt que de faire des appels REST directement. Tous les outils de ligne de commande OpenStack sont mises en œuvre à l'aide du SDK Python.
ja: OpenStack クラウドでリソースの作成や管理を自動化する Python ツールを作成するために、OpenStack Python ソフトウェア開発キット (SDK) を使用します。SDK は OpenStack API への Python バインドを実装します。これにより、直接 REST コールを発行する代わりに、Python オブジェクトでコールを発行することにより、Python で自動化タスクを実行できます。すべての OpenStack コマンドラインツールは Python SDK を使用して実装されています。

source: You should also be familiar with:
fr: Vous devez également être familiarisé avec:
ja: 以下にも慣れているとよいでしょう。

source: RESTful web services
fr: Services web RESTful
ja: RESTful Web サービス

source: JSON and XML data serialization formats
fr: Formats de sérialisation des données JSON et XML
ja: JSON および XML データシリアライズ形式

source: Change the size of your server
fr: Changez la taille de votre serveur
ja: サーバーの大きさの変更

source: You change the size of a server by changing its flavor.
fr: Vous changez la taille d'un serveur en changeant son type d'instance.
ja: フレーバーを変更することでサーバーの大きさを変更します。

source: Show information about your server, including its size, which is shown as the value of the flavor property.
ja: サーバーの情報 (大きさなど) を表示します。フレーバーのプロパティ値として表示されます。

source: The size (flavor) of the server is <literal>m1.small (2)</literal>.
ja: サーバーの大きさ (フレーバー) は <literal>m1.small (2)</literal> です。

source: List the available flavors with the following command:
ja: 以下のコマンドを用いて、利用可能なフレーバーを一覧表示します。

source: To resize the server, pass the server ID or name and the new flavor to the <placeholder-1/> command. Include the <literal>--poll</literal> parameter to report the resize progress.
ja: サーバーのリサイズには、サーバー ID または名前、新しいフレーバーを <placeholder-1/> コマンドに指定します。リサイズの進捗をレポートさせるには、<literal>--poll</literal> パラメーターを含めます。

source: Show the status for your server:
fr: Montrer l'état de votre serveur:
ja: サーバーの状態を表示します。

source: When the resize completes, the status becomes VERIFY_RESIZE.
ja: リサイズが完了すると、状態が VERIFY_RESIZE に変わります。

source: Confirm the resize:
ja: リサイズされたことを確認します。

source: The server status becomes ACTIVE.
ja: サーバーの状態が ACTIVE に変わります。

source: If the resize fails or does not work as expected, you can revert the resize:
ja: リサイズに失敗した場合や予想通りにリサイズが行われなかった場合、リサイズを元に戻すことができます。

source: Manage objects and containers
fr: Gérer les objets et conteneurs
ja: オブジェクトとコンテナーの管理

source: The OpenStack Object Storage service provides the <placeholder-1/> client, which is a command-line interface (CLI). Use this client to list objects and containers, upload objects to containers, and download or delete objects from containers. You can also gather statistics and update metadata for accounts, containers, and objects.
fr: Le service Stockage Objet OpenStack fournit le client <placeholder-1/>, qui est une interface en ligne de commande (CLI). Utilisez ce client pour lister les objets et les conteneurs, charger les objets vers les conteneurs et télécharger ou supprimer des objets de conteneurs. Vous pouvez aussi recueillir des statistiques et mettre à jour les métadonnées pour les comptes, les conteneurs et les objets.
ja: OpenStack Object Storage は <placeholder-1/> クライアントを提供します。これはコマンドラインインターフェース (CLI) です。オブジェクトやコンテナーの一覧表示、オブジェクトのコンテナーへのアップロード、オブジェクトのコンテナーからのダウンロードや削除を実行するために、このクライアントを使用します。アカウント、コンテナー、オブジェクトに関する統計情報の収集、メタデータの更新なども実行できます。

source: This client is based on the native swift client library, <literal>client.py</literal>, which seamlessly re-authenticates if the current token expires during processing, retries operations multiple times, and provides a processing concurrency of 10.
fr: Ce client est basé sur la bibliothèque native du client Swift, <literal>client.py</literal>, qui ré-authentifie de manière transparente si le jeton actuel expire au cours du traitement, réessaie les opérations plusieurs fois, et fournit un accès simultané de traitement de 10.
ja: このクライアントは、ネイティブの swift クライアントライブラリ (<literal>client.py</literal>) をベースとしており、処理中に現在のトークンが失効した場合や、複数回オペレーションを中断した場合、10 個同時に並行処理する場合、シームレスに再認証します。

source: Create and manage containers
fr: Créer et gérer des conteneurs
ja: コンテナーの作成と管理

source: To create a container, run the following command and replace <replaceable>CONTAINER</replaceable> with the name of your container.
fr: Pour créer un conteneur, exécuter la commande suivante et remplacer <replaceable>CONTENEUR</replaceable> par le nom de votre conteneur.
ja: コンテナーを作成するために、以下のコマンドを実行します。<replaceable>CONTAINER</replaceable> をお使いのコンテナーの名前で置き換えます。

source: To list all containers: run the following command:
fr: Pour lister tous les conteneurs: exécuter la commande suivante:
ja: すべてのコンテナーを一覧表示するために、以下のコマンドを実行します。

source: To check the status of containers, run the following command:
fr: Pour vérifier le status des conteneurs, exécuter la commande suivante:
ja: コンテナーの状態を確認するために、以下のコマンドを実行します。

source: You can also use the <placeholder-1/> command with the <replaceable>ACCOUNT</replaceable> or <replaceable>CONTAINER</replaceable> names as parameters.
fr: Vous pouvez aussi utiliser la commande <placeholder-1/> avec les noms <replaceable>COMPTE</replaceable> ou <replaceable>CONTENEUR</replaceable> comme paramètres.
ja: <placeholder-1/> コマンドを使用することもできます。パラメーターとして <replaceable>ACCOUNT</replaceable> や <replaceable>CONTAINER</replaceable> の名前を使用できます。

source: Manage access
fr: Gérer les accès
ja: アクセス権の管理

source: Users have roles on accounts. For example, a user with the admin role has full access to all containers and objects in an account. You can set access control lists (ACLs) at the container level and support lists for read and write access, which you set with the <literal>X-Container-Read</literal> and <literal>X-Container-Write</literal> headers.
ja: ユーザーにはアカウントに対してロールが割り当てられます。例えば、管理者ロールがあると、アカウント内のコンテナーやオブジェクトすべてに完全にアクセスすることができます。 コンテナーレベルでアクセス制御リスト (ACL) を設定できます。読み取り権と書き込み権の一覧表示がサポートされます。<literal>X-Container-Read</literal> と <literal>X-Container-Write</literal> ヘッダーを用いて設定します。

source: To give a user read access, use the <placeholder-1/> command with the <parameter>-r</parameter> parameter. To give a user write access, use the <parameter>-w</parameter> parameter.
fr: Pour donner un accès en lecture de l'utilisateur, utilisez la commande <placeholder-1/> avec le paramètre <parameter>-r</parameter>. Pour donner un accès utilisateur d'écriture, utilisez le paramètre <parameter>-w</parameter>.
ja: ユーザーに読み取り権を与える場合、<placeholder-1/> コマンドを <parameter>-r</parameter> パラメーターとともに使用します。ユーザーに書きこみ権を与える場合、<parameter>-w</parameter> パラメーターを使用します。

source: The following example enables the <literal>testuser</literal> user to read objects in the container:
fr: L'exemple suivant permet à l'utilisateur <literal>testuser</literal> de lire des objets dans le conteneur:
ja: 以下の例は、<literal>testuser</literal> ユーザーがコンテナー内でオブジェクトを読み取りできるようにします。

source: You can also use this command with a list of users.
fr: Vous pouvez aussi utiliser les commandes avec une liste d'utilisateurs
ja: また、このコマンドをユーザー一覧とあわせて使用することもできます。

source: If you use StaticWeb middleware to enable Object Storage to serve public web content, use <literal>.r:</literal>, followed by a list of allowed referrers.
fr: Si vous utilisez StaticWeb middleware pour permettre à l'Object Storage de servir du contenu Web public, utilisez <literal>.r:</literal>, suivie d'une liste de référents autorisés.
ja: StaticWeb ミドルウェアを使用して Object Storage を有効にし、パブリックの Web コンテンツにサービスを提供する場合、アクセス可能な参照元に対する構文は <literal>.r:</literal> の後に許可済みの参照元の一覧を指定します。

source: The following command gives object access to all referring domains:
fr: La commande suivante donne accès aux objets de tous les domaines référant:
ja: 以下のコマンドは、参照しているドメインすべてにオブジェクトがアクセスできるようにします。

source: Manage objects
fr: Gérer les objets
ja: オブジェクトの管理

source: To upload an object to a container, run the following command:
fr: Pour charger un objet dans un conteneur, exécuter la commande suivante:
ja: コンテナーにオブジェクトをアップロードするために、以下のコマンドを実行します。

source: To upload in chunks, for large files, run the following command:
fr: Pour charger par morceaux, pour les gros fichiers, exécuter la commande suivante:
ja: チャンク化した大きなファイルをアップロードするために、以下のコマンドを実行します。

source: To check the status of the object, run the following command:
fr: Pour vérifier le status des objets, exécuter la commande suivante:
ja: オブジェクトの状態を確認するために、以下のコマンドを実行します。

source: To list the objects in a container, run the following command:
fr: Pour lister les objets du conteneur, exécuter la commande suivante:
ja: コンテナーにあるオブジェクトを一覧表示するために、以下のコマンドを実行します。

source: To download an object from a container:, run the following command:
fr: Pour télécharger un objet depuis le conteneur, exécuter la commande suivante:
ja: コンテナーからオブジェクトをダウンロードするために、以下のコマンドを実行します。

source: Create and manage volumes
fr: Créer et gérer des volumes
ja: ボリュームの作成と管理

source: Volumes are block storage devices that you attach to instances to enable persistent storage. You can attach a volume to a running instance or detach a volume and attach it to another instance at any time. You can also create a snapshot from or delete a volume. Only administrative users can create volume types.
fr: Les volumes sont des dispositifs de stockage de bloc que vous attachez à des instances pour permettre un stockage persistant. Vous pouvez attaché un volume à une instance en cours d'exécution ou détacher un volume et l'attacher à une autre instance à tout moment. Vous pouvez également créer un instantané de volume ou supprimer un volume. Seuls les administrateurs peuvent créer des types de volume.
ja: ボリュームは、永続ストレージを使用するためにインスタンスに接続するブロックストレージデバイスです。ボリュームを稼働中のインスタンスに接続したり切断したりできます。また、いつでも別のインスタンスに接続できます。ボリュームからスナップショットを作成したり、削除したりできます。管理ユーザーのみがボリューム種別を作成できます。

source: Create a volume
fr: Créer un volume
ja: ボリュームの作成

source: Log in to the dashboard, choose a project, and click <guibutton>Volumes</guibutton>.
fr: Connectez-vous au tableau de bord, choisissez un projet et cliquez <guibutton>Volumes</guibutton>.
ja: ダッシュボードにログインし、プロジェクトを選択し、<guibutton>ボリューム</guibutton>をクリックします。

source: Click <guibutton>Create Volume</guibutton>.
fr: Cliquer <guibutton> Créer un volume </guibutton>.
ja: <guibutton>ボリュームの作成</guibutton>をクリックします。

source: In the dialog box that opens, enter or select the following values.
fr: Dans la boite de dialogue ouverte, entrer et sélectionner les valeurs suivantes.
ja: 表示されたダイアログボックスで、以下の値を入力または選択します。

source: Volume Name
fr: Nom du Volume
ja: ボリューム名

source: Specify a name for the volume.
fr: Spécifiez un nom pour le volume.
ja: ボリュームの名前を指定します。

source: Optionally, provide a brief description for the volume.
fr: Optionnellement, fournissez une courte description pour le volume.
ja: オプションとして、ボリュームの簡単な説明を入力します。

source: Type
ja: 種別

source: Leave this field blank.
fr: Laisser ce champ vide
ja: この項目は空白にしておきます。

source: Size (GB)
fr: Taille (Go)
ja: 容量 (GB)

source: The size of the volume in gigabytes.
fr: La taille du volume en gigaoctets.
ja: ギガバイト単位のボリュームサイズ。

source: Volume Source
ja: ボリュームソース

source: Select one of the following options:
fr: Sélectionnez une des options suivantes:
ja: 以下のオプションを選択します。

source: No source, empty volume
fr: Aucune source, volume vide
ja: ソースを指定しなければ、ボリュームが空になります

source: Creates an empty volume.
fr: Crée un volume vide.
ja: 空のボリュームを作成します。

source: An empty volume does not contain a file system or a partition table.
fr: Un volume vide ne contient pas de système de fichier ou de table de partition.
ja: 空のボリュームは、ファイルシステムやパーティションテーブルを含みません。

source: Snapshot
fr: Instantané
ja: スナップショット

source: If you choose this option, a new field for <guilabel>Use snapshot as a source</guilabel> displays. You can select the snapshot from the list.
fr: Si vous choisissez cette option, un nouveau champ s'affiche pour <guilabel>Utiliser un instantané comme source</guilabel>. Vous pouvez sélectionner un instantané depuis la liste.
ja: このオプションを選択する場合、<guilabel>ソースとしてスナップショットの利用</guilabel>の新項目が表示されます。この一覧からスナップショットを選択できます。

source: Image
ja: イメージ

source: If you choose this option, a new field for <guilabel>Use image as a source</guilabel> displays. You can select the image from the list.
fr: Si vous choisissez cette option, un nouveau champ apparaît pour <guilabel>Utiliser une image comme source</guilabel>. Vous pouvez sélectionner une image depuis la liste.
ja: このオプションを選択する場合、<guilabel>ソースとしてイメージの利用</guilabel>の新項目が表示されます。この一覧からイメージを選択できます。

source: Select the <guilabel>Availability Zone</guilabel> from the list. By default, this value is set to the availability zone given by the cloud provider (for example, <literal>us-west</literal> or <literal>apac-south</literal>). For some cases, it could be <literal>nova</literal>.
fr: Sélectionner <guilabel>Zone de Disponibilité</guilabel> depuis la liste. Par défaut cette valeur est positionnée à la zone de disponibilité donnée par le fournisseur du cloud (par exemple, <literal>us-west</literal> ou <literal>apac-south</literal>). Dans certains cas, cela peut être <literal>nova</literal>.
ja: <guilabel>アベイラビリティゾーン</guilabel>を一覧から選択します。この値はデフォルトで、クラウドプロバイダーにより指定されたアベイラビリティゾーンに設定されます (例えば、<literal>us-west</literal>、<literal>apac-south</literal>)。<literal>nova</literal> となっている場合もあります。

source: Volume
ja: ボリューム

source: If you choose this option, a new field for <guilabel>Use volume as a source</guilabel> displays. You can select the volume from the list.
fr: Si vous choisissez cette option, un nouveau champ apparaît pour <guilabel>Utiliser un volume comme source</guilabel>. Vous pouvez sélectionner un volume depuis la liste.
ja: このオプションを選択する場合、<guilabel>ソースとしてボリュームの利用</guilabel>の新項目が表示されます。この一覧からボリュームを選択できます。

source: Options to use a snapshot or a volume as the source for a volume are displayed only if there are existing snapshots or volumes.
fr: Les options pour utiliser un instantané ou un volume comme source pour un volume sont affichées seulement s'ils existent des instantanés ou des volumes.
ja: ソースとしてスナップショットの利用、ソースとしてボリュームの利用のオプションは、既存のスナップショットやボリュームが存在する場合のみ表示されます。

source: The dashboard shows the volume on the <guilabel>Volumes</guilabel> tab.
fr: Le tableau de bord montre le volume dans l'onglet <guilabel>Volumes</guilabel>.
ja: ダッシュボードの<guilabel>ボリューム</guilabel>タブにボリュームが表示されます。

source: Attach a volume to an instance
fr: Joindre un volume à l'instance
ja: ボリュームのインスタンスへの接続

source: After you create one or more volumes, you can attach them to instances. You can attach a volume to one instance at a time.
fr: Après avoir créer un ou plusieurs volumes, vous pouvez les joindre aux instances. Vous pouvez joindre un volume à chaque instance à chaque instant.
ja: ボリュームを作成した後、それらをインスタンスに接続できます。ボリュームは、同時に 1 つのインスタンスに接続できます。

source: Select the volume to add to an instance and click <guibutton>Edit Attachments</guibutton>.
fr: Sélectionner le volume à ajouter l'instance et cliquer <guibutton> modifier les pièces joints </guibutton>.
ja: インスタンスに追加するボリュームを選択し、<guibutton>接続の編集</guibutton>をクリックします。

source: In the <guilabel>Manage Volume Attachments</guilabel> dialog box, select an instance.
fr: Dans la boite de dialogue <guilabel>Gérer les Pièces Jointes du Volume </guilabel>, sélectionner une instance.
ja: <guilabel>ボリュームの接続の管理</guilabel>ダイアログボックスで、インスタンスを選択します。

source: Enter the name of the device from which the volume is accessible by the instance.
fr: Entrer le nom du périphérique à partir duquel le volume est accessible par une instance.
ja: インスタンスがボリュームにアクセスできる、デバイスの名前を入力します。

source: The actual device name might differ from the volume name because of hypervisor settings.
fr: Le nom du périphérique actuel peut différer du nom de volume suivant les paramètres de l'hyperviseur.
ja: 実際のデバイス名は、ハイパーバイザーの設定により、ボリューム名と異なるかもしれません。

source: Click <guibutton>Attach Volume</guibutton>.
fr: Cliquer <guibutton>Joindre le Volume</guibutton>.
ja: <guibutton>ボリュームの接続</guibutton>をクリックします。

source: The dashboard shows the instance to which the volume is now attached and the device name.
fr: Le tableau de bord affiche l'instance à laquelle le volume est maintenant attribué et le nom du périphérique.
ja: ボリュームが接続されたインスタンスとデバイス名がダッシュボードに表示されます。

source: You can view the status of a volume in the <guilabel>Volumes</guilabel> tab of the dashboard. The volume is either Available or In-Use.
fr: Vous pouvez voir le statut d'un volume dans l'onglet <guilabel>Volumes</guilabel> du tableau de bord. Le volume est soit disponible où en cours d'utilisation.
ja: ダッシュボードの<guilabel>ボリューム</guilabel>にボリュームの状態を表示できます。ボリュームは、利用可能または使用中になります。

source: Now you can log in to the instance and mount, format, and use the disk.
fr: Maintenant, vous pouvez vous connecter, formater, et utiliser le disque.
ja: これでインスタンスにログインでき、ディスクをマウント、フォーマット、利用できます。

source: Detach a volume from an instance
fr: Détacher un volume à partir d'un exemple
ja: ボリュームのインスタンスからの切断

source: Select the volume and click <guibutton>Edit Attachments</guibutton>.
fr: Sélectionner le volume et cliquer <guibutton> modifier les pièces joints </guibutton>.
ja: ボリュームを選択し、<guibutton>接続の編集</guibutton>をクリックします。
