Repository: 25hours/openstack-manuals
Catalog: doc/user-guide/locale/*.po
Languages: fr, ja

source: Note that the command returns both the ID of the original instance (<literal>instance_id</literal>) and the ID of the backup artifact (<literal>id</literal>).
fr: Noter que la commande retourne à la fois l'ID de l'instance originale (<literal>instance_id</literal>) et l'ID de l'artefact de la sauvegarde (<literal>id</literal>).
ja: このコマンドは、元のインスタンス ID (<literal>instance_id</literal>) とバックアップの ID (<literal>id</literal>) を返します。

source: Later on, use the trove <placeholder-1/> command to get this information:
fr: Plus tard, utiliser la commande trove <placeholder-1/> pour obtenir cette information :
ja: 後ほど、trove <placeholder-1/> コマンドを使用して、この情報を取得します。

source: You can get additional information about the backup by using the trove <placeholder-1/> command and passing in the <replaceable>BACKUP_ID</replaceable>, which is <literal>8af30763-61fd-4aab-8fe8-57d528911138</literal>.
fr: Vous pouvez obtenir des informations complémentaires sur la sauvegarde en utilisant la sommande trove <placeholder-1/> et en passant dans le <replaceable>BACKUP_ID</replaceable>, qui vaut <literal>8af30763-61fd-4aab-8fe8-57d528911138</literal>.
ja: trove <placeholder-1/> コマンドを使用して、<replaceable>BACKUP_ID</replaceable> を渡すことにより、追加の情報を取得できます。ここでは <literal>8af30763-61fd-4aab-8fe8-57d528911138</literal> です。

source: Restore a database instance
fr: Restaurer l'instance d'une base de donnée
ja: データベースインスタンスのリストア

source: Now assume that your <literal>guest1</literal> database instance is damaged and you need to restore it. In this example, you use the trove <placeholder-1/> command to create a new database instance called <literal>guest2</literal>.
fr: Supposons maintenant que l'instance de votre base de donnée <literal>guest1</literal> est abimée et que vous avez besoin de la restaurer. Dans cet exemple, vous utilisez la commande trove <placeholder-1/> pour créer une nouvelle instance de base de donnée appelée <literal>guest2</literal>.
ja: ここで <literal>guest1</literal> データベースインスタンスが破壊され、リストアする必要があると仮定します。この例では、<literal>guest2</literal> という名前の新規データベースインスタンスを作成するために、trove <placeholder-1/> コマンドを使用します。

source: You specify that the new <literal>guest2</literal> instance has the same flavor (<literal>10</literal>) and the same root volume size (<literal>2</literal>) as the original <literal>guest1</literal> instance.
fr: Vous spécifiez que la nouvelle instance <literal>guest2</literal> a le même type d'instance (<literal>10</literal>) et la même taille de volume racine (<literal>2</literal>) que l'instance originale <literal>guest1</literal>.
ja: 新しい <literal>guest2</literal> インスタンスが同じフレーバー (<literal>10</literal>) を持ち、元の <literal>guest1</literal> インスタンスと同じ容量のルートボリューム (<literal>2</literal>) を持つことを指定します。

source: You use the <code>--backup</code> argument to indicate that this new instance is based on the backup artifact identified by <replaceable>BACKUP_ID</replaceable>. In this example, replace <replaceable>BACKUP_ID</replaceable> with <literal>8af30763-61fd-4aab-8fe8-57d528911138</literal>.
fr: Vous utilisez l'argument <code>--backup</code> pour indiquer que cette nouvelle instance est basée sur un objet de sauvegarde identifié par <replaceable>BACKUP_ID</replaceable>. Dans cet exemple, remplacer <replaceable>BACKUP_ID</replaceable> par <literal>8af30763-61fd-4aab-8fe8-57d528911138</literal>.
ja: この新しいインスタンスは、<replaceable>BACKUP_ID</replaceable> により識別されるバックアップに基づくことを指定するために、<code>--backup</code> 引数を使用します。この例では、<replaceable>BACKUP_ID</replaceable> を <literal>8af30763-61fd-4aab-8fe8-57d528911138</literal> を置き換えます。

source: Verify backup
fr: Vérifier la sauvegarde
ja: バックアップの検証

source: Now check that the new <literal>guest2</literal> instance has the same characteristics as the original <literal>guest1</literal> instance.
fr: Vérifier maintenant que l'instance du nouveau <literal>guest2</literal> a les mêmes caractéristiques que l'instance originale <literal>guest1</literal>.
ja: 新しい <literal>guest2</literal> インスタンスが、元の <literal>guest1</literal> インスタンスと同じ特性を持つことを確認します。

source: Start by getting the ID of the new <literal>guest2</literal> instance.
fr: Commencer en obtenant l'ID de la nouvelle instance <literal>guest2</literal>.
ja: まず新しい <literal>guest2</literal> インスタンスの ID を取得します。

source: Use the trove <placeholder-1/> command to display information about the new guest2 instance. Pass in guest2's <replaceable>INSTANCE_ID</replaceable>, which is <literal>ac7a2b35-a9b4-4ff6-beac-a1bcee86d04b</literal>.
fr: Utiliser la commande trove <placeholder-1/> pour afficher les informations sur la nouvelle instance guest2. Remplacer dans guest2 <replaceable>INSTANCE_ID</replaceable>, par <literal>ac7a2b35-a9b4-4ff6-beac-a1bcee86d04b</literal>.
ja: 新しい guest2 インスタンスの情報を表示するために、trove <placeholder-1/> コマンドを使用します。guest2 の <replaceable>INSTANCE_ID</replaceable> を渡します。ここでは、<literal>ac7a2b35-a9b4-4ff6-beac-a1bcee86d04b</literal> です。

source: Note that the data store, flavor ID, and volume size have the same values as in the original <literal>guest1</literal> instance.
fr: Veuillez noter que le stockage de donnée, l'ID du type d'instance et la taille du volume ont les mêmes valeurs que dans l'instance originale <literal>guest1</literal>.
ja: データストア、フレーバー ID、ボリューム容量が、元の <literal>guest1</literal> インスタンスと同じ値を持つことに注意します。

source: Use the trove <placeholder-1/> command to check that the original databases (<literal>db1</literal> and <literal>db2</literal>) are present on the restored instance.
fr: Utiliser la commande trove <placeholder-1/> pour vérifier que les bases de données originelles (<literal>db1</literal> et <literal>db2</literal>) sont présents dans l'instance restaurée.
ja: trove <placeholder-1/> コマンドを使用して、元のデータベース (<literal>db1</literal>、<literal>db2</literal>) がリストアされたインスタンスに存在することを確認します。

source: Use the trove <placeholder-1/> command to check that the original user (<literal>user1</literal>) is present on the restored instance.
fr: Utiliser la commande trove <placeholder-1/> pour vérifier que l'utilisateur originel (<literal>user1</literal>) est présent dans l'instance restaurée.
ja: trove <placeholder-1/> コマンドを使用して、元のユーザー (<literal>user1</literal>) がリストアされたインスタンスに存在することを確認します。

source: Notify users
fr: Notifier les utilisateurs
ja: ユーザーへの通知

source: Tell the users who were accessing the now-disabled <literal>guest1</literal> database instance that they can now access <literal>guest2</literal>. Provide them with <literal>guest2</literal>'s name, IP address, and any other information they might need. (You can get this information by using the trove <placeholder-1/> command.)
fr: Dites aux utilisateurs accédant à l'instance de la base de donnée <literal>guest1</literal> maintenant désactivée qu'ils peuvent accéder à <literal>guest2</literal>. Leur fournir le nom de <literal>guest2</literal>, adresse IP et toutesles informations dont ils pourraient avoir besoin. (Vous pouvez obtenir ces informations en utilisant la commande trove <placeholder-1/>.)
ja: いま無効化されている <literal>guest1</literal> データベースインスタンスにアクセスしていたユーザーに、<literal>guest2</literal> にアクセスできることを通知します。<literal>guest2</literal> の名前、IP アドレス、他の必要な情報を提供します。(trove <placeholder-1/> コマンドを使用して、この情報を取得できます。)

source: Clean up
fr: Nettoyage
ja: クリーンアップ

source: At this point, you might want to delete the disabled <literal>guest1</literal> instance, by using the trove <placeholder-1/> command.
fr: A cet instant, vous voudrez peut-être supprimer l'instance désactivée <literal>guest1</literal>, en utilisant la commande trove <placeholder-1/>.
ja: この時点で、trove <placeholder-1/> コマンドを使用して、無効化された <literal>guest1</literal> インスタンスを削除したいかもしれません。

source: Use incremental backups
fr: Utiliser les sauvegardes incrémentales
ja: 増分バックアップの使用

source: Incremental backups let you chain together a series of backups. You start with a regular backup. Then, when you want to create a subsequent incremental backup, you specify the parent backup.
fr: Les sauvegardes incrémentales vous permettent de chaîner ensemble une série de sauvegardes. Vous commencez avec une sauvegarde habituelle. Ensuite, quand vous voulez créer la sauvegarde incrémentale suivante, vous spécifiez le parent de la sauvegarde.
ja: 増分バックアップにより、一連のバックアップを一つにつなげられます。通常のバックアップで始めます。そして、後続となる増分バックアップを作成したいときに、親となるバックアップを指定します。

source: Restoring a database instance from an incremental backup is the same as creating a database instance from a regular backupthe Database service handles the complexities of applying the chain of incremental backups.
fr: Restaurer une instance de base de donnée à partir d'une sauvegarde incrémentale est identique à créer une instance de base de donnée à partir d'une sauvegarde régulière. Le service Base de donnée traite la complexité du chaînage des sauvegardes incrémentales.
ja: 増分バックアップからデータベースインスタンスをリストアすることは、通常のバックアップからデータベースインスタンスを作成することと同じです。Database は、一連の増分バックアップの複雑な適用を処理してくれます。

source: This example shows you how to use incremental backups with a MySQL database.
fr: Cet exemple vous montre comment utiliser les sauvegardes incrémentales avec une base de donnée MySQL.
ja: この例は、MySQL データベースで増分バックアップを使用する方法です。

source: Assumptions
fr: Hypothèses
ja: 前提

source: Assume that you have <link linkend="backup_db">created a regular backup</link> for the following database instance:
fr: S'assurer que vous avez <link linkend="backup_db">created a regular backup</link> pour l'instance de la base de donnée qui suit:
ja: 以下のデータベースインスタンスに対して、<link linkend="backup_db">バックアップが作成されている</link>ことを仮定しています。

source: Instance name: <literal>guest1</literal>
fr: Nom de l'instance : <literal>guest1</literal>
ja: インスタンス名: <literal>guest1</literal>

source: ID of the instance (<replaceable>INSTANCE_ID</replaceable>): <literal>792a6a56-278f-4a01-9997-d997fa126370</literal>
fr: ID de l'instance (<replaceable>INSTANCE_ID</replaceable>) : <literal>792a6a56-278f-4a01-9997-d997fa126370</literal>
ja: インスタンスの ID (<replaceable>INSTANCE_ID</replaceable>): <literal>792a6a56-278f-4a01-9997-d997fa126370</literal>

source: ID of the regular backup artifact (<replaceable>BACKUP_ID</replaceable>): <literal>6dc3a9b7-1f3e-4954-8582-3f2e4942cddd</literal>
fr: ID d'un artefact d'une sauvegarde régulière (<replaceable>BACKUP_ID</replaceable>): <literal>6dc3a9b7-1f3e-4954-8582-3f2e4942cddd</literal>
ja: 通常バックアップの ID (<replaceable>BACKUP_ID</replaceable>): <literal>6dc3a9b7-1f3e-4954-8582-3f2e4942cddd</literal>

source: To create and use incremental backups
fr: Pour créer et utiliser des sauvegardes incrémentales
ja: 増分バックアップの作成方法と使用方法

source: Create your first incremental backup
fr: Créer votre première sauvegarde incrémentale
ja: 最初の増分バックアップの作成

source: Use the trove <placeholder-1/> command and specify:
fr: Utiliser la commande trove <placeholder-1/> et spécifier:
ja: trove <placeholder-1/> コマンドを使用して、以下のとおり指定します。

source: The <replaceable>INSTANCE_ID</replaceable> of the database instance you are doing the incremental backup for (in this example, <literal>792a6a56-278f-4a01-9997-d997fa126370</literal>)
fr: L' <replaceable>INSTANCE_ID</replaceable> de l'instance de la base de donnée pour laquelle vous créez la sauvegarde incrémentale (dans cette exemple, <literal>792a6a56-278f-4a01-9997-d997fa126370</literal>)
ja: 増分バックアップを実行するデータベースインスタンスの <replaceable>INSTANCE_ID</replaceable> (この例は <literal>792a6a56-278f-4a01-9997-d997fa126370</literal>)

source: The name of the incremental backup you are creating: <literal>backup1.1</literal>
fr: Le nom de la sauvegarde incrémentale que vous êtes en train de créer: <literal>backup1.1</literal>
ja: 作成する増分バックアップの名前: <literal>backup1.1</literal>

source: The <replaceable>BACKUP_ID</replaceable> of the parent backup. In this case, the parent is the regular backup, with an ID of <literal>6dc3a9b7-1f3e-4954-8582-3f2e4942cddd</literal>
fr: Le <replaceable>BACKUP_ID</replaceable> de la sauvegarde parent. Dans ce cas, le parent est la sauvegarde régulière, avec un ID de <literal>6dc3a9b7-1f3e-4954-8582-3f2e4942cddd</literal>
ja: 親バックアップの <replaceable>BACKUP_ID</replaceable>。この場合、親が通常バックアップで、その ID が <literal>6dc3a9b7-1f3e-4954-8582-3f2e4942cddd</literal> です。

source: Note that this command returns both the ID of the database instance you are incrementally backing up (<literal>instance_id</literal>) and a new ID for the new incremental backup artifact you just created (<literal>id</literal>).
fr: Noter que la commande retourne à la fois l'ID de l'instance de la base de donnée que vous sauvegardez de façon incrémentielle (<literal>instance_id</literal>) et la nouvelle ID de l'artefact de la nouvelle sauvegarde incrémentale que vous venez juste de créer (<literal>id</literal>).
ja: このコマンドは、増分バックアップを取得するデータベースインスタンスの ID (<literal>instance_id</literal>)、新しく作成した増分バックアップの新規 ID (<literal>id</literal>) を返すことに注意してください。

source: Create your second incremental backup
fr: Créer votre seconde sauvegarde incrémentale
ja: 2 個目の増分バックアップの作成

source: The name of your second incremental backup is <literal>backup1.2</literal>. This time, when you specify the parent, pass in the ID of the incremental backup you just created in the previous step (<literal>backup1.1</literal>). In this example, it is <literal>1d474981-a006-4f62-b25f-43d7b8a7097e</literal>.
fr: Le nom de votre seconde sauvegarde incrémentale est <literal>backup1.2</literal>. Cette fois, quand vous spécifiez le parent, passez dans l'ID de la sauvegarde incrémentale que vous avez créée dans l'étape précédente (<literal>backup1.1</literal>). Dans cet exemple, c'est <literal>1d474981-a006-4f62-b25f-43d7b8a7097e</literal>.
ja: 2 個目の増分バックアップの名前は <literal>backup1.2</literal> です。このとき、親を指定するときに、前の手順で作成した増分バックアップの ID (<literal>backup1.1</literal>) を渡します。この例では <literal>1d474981-a006-4f62-b25f-43d7b8a7097e</literal> です。

source: Restore using incremental backups
fr: Restaurer en utilisant les sauvegardes incrémentales
ja: 増分バックアップを用いたリストア

source: Now assume that your <literal>guest1</literal> database instance is damaged and you need to restore it from your incremental backups. In this example, you use the trove <placeholder-1/> command to create a new database instance called <literal>guest2</literal>.
fr: Supposons maintenant que l'instance de votre base de donnée <literal>guest1</literal> est abimée et que vous avez besoin de la restaurer à partir de vos sauvegardes incrémentales. Dans cet exemple, vous utilisez la commande trove <placeholder-1/> pour créer une nouvelle instance de base de donnée appelée <literal>guest2</literal>.
ja: ここで <literal>guest1</literal> データベースインスタンスが破壊され、増分バックアップからリストアする必要があると仮定します。この例では、<literal>guest2</literal> という名前の新規データベースインスタンスを作成するために、trove <placeholder-1/> コマンドを使用します。

source: To incorporate your incremental backups, you simply use the <code>--backup</code> parameter to pass in the <replaceable>BACKUP_ID</replaceable> of your most recent incremental backup. The Database service handles the complexities of applying the chain of all previous incremental backups.
fr: Pour incorporer vos sauvegardes incrémentales, vous utilisez simplement le paramètre <code>--backup</code> pour passer dans <replaceable>BACKUP_ID</replaceable> de votre sauvegarde incrémentale la plus récente. Le service Base de donnée de charge de la complexité de l'application du chaînage de toutes les sauvegardes incrémentales.
ja: 増分バックアップを合体させる場合、最新の増分バックアップの <replaceable>BACKUP_ID</replaceable> を <code>--backup</code> パラメーターに渡します。Database は、これまでのすべての増分バックアップを適用する複雑な処理を実行します。

source: Manage database configuration
fr: Gestion de la configuration de la base de donnée
ja: データベース設定の管理

source: You can manage database configuration tasks by using configuration groups. Configuration groups let you set configuration options, in bulk, on one or more databases.
fr: Vous pouvez gérer les tâches de configuration de la base de donnée en utilisant les groupes de configuration. Les groupes de configuration vous laissent positionner les options de configurations, par morceaux sur une ou plusieurs bases de donnée.
ja: 設定グループを使用することにより、データベースの設定作業を管理できます。設定グループにより、複数のデータベースを一括で設定オプションを設定できます。

source: This example assumes you have <link linkend="create_db">created a MySQL database</link> and shows you how to use a configuration group to configure it. Although this example sets just one option on one database, you can use these same procedures to set multiple options on multiple database instances throughout your environment. This can provide significant time savings in managing your cloud.
fr: Cet exemple suppose que vous avez <link linkend="create_db">created a MySQL database</link> et vous affiche comment utiliser un groupe de configuration pour le configurer. Bien que cet exemple positionne juste une option sur une seule base de donnée, vous pouvez utiliser les mêmes procédures pour positionner plusieurs options sur plusieurs instance de base de donnée dans tout votre environnement. Ceci peut vous fournir un gain de temps significatif dans la gestion de votre cloud.
ja: この例は、<link linkend="create_db">MySQL データベースを作成済み</link>であると仮定しています。MySQL を設定するために、設定グループを使用する方法について説明します。この例は、1 つのデータベースに 1 つのオプションを設定しますが、これらの手順を同じように使用して、お使いの環境で複数のデータベースに複数のオプションを設定できます。これにより、クラウド管理において大幅な時間節約になります。

source: To bulk-configure a database or databases
fr: Pour configurer par morceaux une base de donnée ou des bases de donnée
ja: データベースの一括設定方法

source: List available options
fr: Lister les options disponibles
ja: 利用可能なオプションの一覧表示

source: First, determine which configuration options you can set. Different data store versions have different configuration options.
fr: Premièrement, déterminer quelles options de configuration vous pouvez positionner. Différentes versions du stockage de donnée ont différentes options de configuration.
ja: まず、どの設定オプションを設定できるのかを確認します。異なるデータストアのバージョンは、異なる設定オプションを持ちます。

source: List the names and IDs of all available versions of the <literal>mysql</literal> data store:
fr: Lister les noms et les ID de toutes les versions disponibles du stockage de donnée <literal>mysql</literal> :
ja: <literal>mysql</literal> データストアの利用可能な全バージョンの名前と ID を一覧表示します。

source: Pass in the data store version ID with the trove <placeholder-1/> command to get the available options:
fr: Passer l'ID de la version du stockage de donnée avec la commande trove <placeholder-1/> pour obtenir les options disponibles :
ja: trove <placeholder-1/> コマンドにデータストアのバージョン ID を渡して、利用可能なオプションを取得します。

source: In this example, the <placeholder-1/> command returns a list of options that work with MySQL 5.5.
fr: Dans cet exemple, la commande <placeholder-1/> retourne une liste d'options qui fonctionne avec MySQL 5.5.
ja: この例では、<placeholder-1/> コマンドが MySQL 5.5 で動作するオプションの一覧を返します。

source: Create a configuration group
fr: Créer un groupe de configuration
ja: 設定グループの作成

source: A configuration group contains a comma-separated list of key-value pairs. Each pair consists of a configuration option and its value.
fr: Un groupe de configuration contient une liste de paires de clés séparées par des virgules. Chaque paires consiste en une option de configuration et sa valeur.
ja: 設定グループは、キーと値のペアのカンマ区切り一覧を含みます。各ペアは、設定オプションとその値から構成されます。

source: You can create a configuration group by using the trove <placeholder-1/> command. The general syntax for this command is:
fr: Vous pouvez créer un groupe de configuration en utilisant la commande trove <placeholder-1/>. La syntaxe générale de cette commande est :
ja: trove <placeholder-1/> コマンドを使用して、設定グループを作成できます。このコマンドの一般的な構文は、以下のとおりです。

source: <replaceable>NAME</replaceable>. The name you want to use for this group.
fr: <replaceable>NOM</replaceable>. Le nom que vous voulez utiliser pour ce groupe.
ja: <replaceable>NAME</replaceable>。このグループに使用したい名前。

source: <replaceable>VALUES</replaceable>. The list of key-value pairs.
fr: <replaceable>VALEURS</replaceable>. La liste des valeurs de paires de clés .
ja: <replaceable>VALUES</replaceable>。キーと値のペアの一覧。

source: <replaceable>DATASTORE_NAME</replaceable>. The name of the associated data store.
fr: <replaceable>DATASTORE_NAME</replaceable>. Le nom associé au stockage de donnée.
ja: <replaceable>DATASTORE_NAME</replaceable>。関連付けられるデータストアの名前。

source: Set <replaceable>VALUES</replaceable> as a JSON dictionary, for example:
fr: Positionner <replaceable>VALUES</replaceable> comme un dictionnaire JSON, par exemple :
ja: <replaceable>VALUES</replaceable> を JSON 辞書として設定します。例:

source: This example creates a configuration group called <literal>group1</literal>. <literal>group1</literal> contains just one key and value pair, and this pair sets the <option>sync_binlog</option> option to <literal>1</literal>.
fr: Cet exemple crée un groupe de configuration appelé <literal>group1</literal>. <literal>group1</literal> contient juste une clé et une valeur et cette paire positionne l'option <option>sync_binlog</option> à <literal>1</literal>.
ja: この例は、<literal>group1</literal> という名前の設定グループを作成します。<literal>group1</literal> は、1 つのキーと値のペアを持ちます。このペアは、<option>sync_binlog</option> オプションを <literal>1</literal> に設定します。

source: Examine your existing configuration
fr: Examiner votre configuration existante
ja: 既存の設定の検査

source: Before you use the newly-created configuration group, look at how the <option>sync_binlog</option> option is configured on your database. Replace the following sample connection values with values that connect to your database:
fr: Avant que vous n'utilisiez le groupe de configuration nouvellement créé, regarder comment l'option <option>sync_binlog</option> est configurée sur votre base de donnée. Remplacer les valeurs suivantes d'exemple de connexion avec les valeurs qui vous connectent à votre base de donnée.
ja: 新しく作成した設定グループを使用する前に、<option>sync_binlog</option> オプションがデータベースでどのように設定されているかを確認します。以下の接続例の値をお使いのデータベースに接続できる値に置き換えます。

source: As you can see, the <option>sync_binlog</option> option is currently set to <literal>0</literal> for the <literal>myDB7</literal> database.
fr: Comme vous pouvez le voir, l'option <option>sync_binlog</option> est couramment positionnée à <literal>0</literal> pour la base de donnée <literal>myDB7</literal>.
ja: 確認できるように、<literal>myDB7</literal> データベースの <option>sync_binlog</option> オプションが <literal>0</literal> に設定されています。

source: Change the database configuration using a configuration group
fr: Changer la configuration de la base de donnée en utilisant un groupe de configuration
ja: 設定グループを用いたデータベース設定の変更

source: You can change a database's configuration by attaching a configuration group to a database instance. You do this by using the trove <placeholder-1/> command and passing in the ID of the database instance and the ID of the configuration group.
ja: 設定グループをデータベースインスタンスに割り当てることにより、データベースの設定を変更できます。このために、trove <placeholder-1/> コマンドを使用して、データベースインスタンスの ID と設定グループの ID を渡します。

source: Get the ID of the database instance:
fr: Obtenir l'ID de l'instance de la base de donnée :
ja: データベースインスタンスの ID を取得します。

source: Get the ID of the configuration group:
fr: Obtenir l'ID du groupe de configuration :
ja: 設定グループの ID を取得します。

source: Attach the configuration group to the database instance:
fr: Attacher un groupe de configuration à une instance de base de donnée :
ja: 設定グループをデータベースインスタンスに接続します。

source: This command syntax pertains only to python-troveclient version 1.0.6 and later. Earlier versions require you to pass in the configuration group ID as the first argument.
ja: このコマンド構文は、python-troveclient のバージョン 1.0.6 以降のみ利用できます。これ以前のバージョンは、設定グループ ID を最初の引数として渡す必要があります。

source: Re-examine the database configuration
fr: Ré-examiner la configuration de la base de donnée
ja: データベース設定の再検査

source: Display the <option>sync_binlog</option> setting again:
fr: Affiche encore les réglages de <option>sync_binlog</option> :
ja: <option>sync_binlog</option> 設定を再表示します。
