Repository: 25hours/openstack-manuals
Catalog: doc/user-guide/locale/*.po
Languages: fr, ja

source: The following example shows the results of a search on <filename>10.0.0.4</filename>.
ja: 以下の例は、<filename>10.0.0.4</filename> の検索結果です。

source: Launch and manage stacks
fr: Lancer et gérer des piles
ja: スタックの起動と管理

source: OpenStack Orchestration is a service that you can use to orchestrate multiple composite cloud applications. This service supports use of both the Amazon Web Services (AWS) CloudFormation template format through both a Query API that is compatible with CloudFormation and the native OpenStack <glossterm>Heat Orchestration Template (HOT)</glossterm> format through a REST API.
ja: OpenStack Orchestration は、複数から構成されたクラウドアプリケーションを統合するために使用できるサービスです。このサービスは、CloudFormation 互換の Query API 経由の Amazon Web Services (AWS) CloudFormation テンプレート形式、REST API 経由のネイティブ OpenStack <glossterm>Heat Orchestration Template (HOT)</glossterm> 形式の使用をサポートします。

source: Launch a stack
fr: Lancer une pile
ja: スタックの起動

source: Log in to the dashboard, choose a project, and click <guibutton>Stacks</guibutton> in the <guilabel>Orchestration</guilabel> category on the <guilabel>Projects</guilabel> tab.
fr: Se connecter au tableau de bord, choisir un projet et cliquer <guibutton>Piles</guibutton> dans la catégorie <guilabel>Orchestration</guilabel> de l'onglet <guilabel>Projets</guilabel>.
ja: ダッシュボードにログインし、プロジェクトを選択し、<guilabel>プロジェクト</guilabel>タブにある<guilabel>オーケストレーション</guilabel>カテゴリーの<guibutton>スタック</guibutton>をクリックします。

source: Click <guibutton>Launch Stack</guibutton>.
fr: Cliquer <guibutton> Lancer la pile </guibutton>.
ja: <guibutton>スタックの起動</guibutton>をクリックします。

source: In the <guilabel>Select Template</guilabel> dialog box, specify the following values.
fr: Dans la boite dialogue <guilabel>Modèle Sélectionné</guilabel>, spécifiez les valeurs suivantes:
ja: <guilabel>テンプレートの選択</guilabel>ダイアログボックスで以下の値を指定します。

source: Template Source
fr: Source du modèle
ja: テンプレートの指定方法

source: Choose the source of the template from the list.
fr: Choisissez la source du modèle dans la liste.
ja: テンプレートのソースを一覧から選択します。

source: Template URL/File/Data
fr: Modèle URL/Fichier/Donnée
ja: テンプレート URL/ファイル/データ

source: Depending on the source that you selected, enter the URL, browse to the file location, or directly include the template.
fr: Suivant la source que vous avez sélectionnée, entrer l'URL, naviguer jusqu'à l'emplacement du fichier ou inclure directement le modèle.
ja: 選択したソースに応じて、URL を入力する、ファイルの場所を指定する、テンプレートを直接取り込みます。

source: Environment Source
fr: Source de l'environnement
ja: 環境設定の指定方法

source: Choose the source of the environment from the list. The environment files contain additional settings for the stack.
fr: Choisissez la source de l'environnement dans la liste. Les fichiers d'environnement contiennent des paramètres additionnels pour la pile.
ja: 環境のソースを一覧から選択します。環境ファイルは、スタック向けの追加の文字列を含みます。

source: Environment URL/File/Data
fr: Environnement URL/Fichier/Donnée
ja: 環境 URL/ファイル/データ

source: Depending on the source that you selected, enter the URL, browse to the file location, or directly include the environment.
fr: Suivant la source que vous avez sélectionné, entrer l'URL, accéder à l'emplacement du fichier ou inclure directement l'environnement.
ja: 選択したソースに応じて、URL を入力する、ファイルの場所を指定する、環境を直接取り込みます。

source: Click <guibutton>Next</guibutton>.
fr: Cliquer <guibutton>Prochain</guibutton>.
ja: <guibutton>次へ</guibutton>をクリックします。

source: In the <guilabel>Launch Stack</guilabel> dialog box, specify the following values.
fr: Dans la boite de dialogue <guilabel>Lancer une Pile</guilabel>, spécifier les valeurs suivantes.
ja: <guilabel>スタックの起動</guilabel>ダイアログボックスで以下の値を指定します。

source: Stack Name
fr: Nom de la Pile
ja: スタック名

source: Enter a name to identify the stack.
fr: Entrer un nom pour identifier la pile.
ja: スタックを識別するための名前を入力します。

source: Creation Timeout (minutes)
fr: Délai d'attente à la création (minutes)
ja: 作成タイムアウト時間 (分単位)

source: Specify the number of minutes that can elapse before the launch of the stack times out.
fr: Spécifier le nombre de minutes qui peut s'écouler avant que le lancement de la pile ne s'interrompt.
ja: スタック起動のタイムアウトまでの経過時間を分単位で指定します。

source: Rollback On Failure
fr: Retour arrière en cas d'échec
ja: 失敗時のロールバック

source: Select this check box if you want if you want the service to roll back changes if the stack fails to launch.
fr: Sélectionner cette case si vous voulez que le service revienne aux derniers changements en cas d'échec du lancement de la pile.
ja: スタックの起動に失敗した場合に、サービスの変更をロールバックしたければ、このチェックボックスを選択します。

source: Password for user "demo"
fr: mot de passe pour l'utilisateur "demo"
ja: 「demo」ユーザーのパスワード

source: Specify the password that the default user uses when the stack is created.
fr: Spécifier le mot de passe de l'utilisateur par défaut quand la pile est créée.
ja: スタックが作成したデフォルトユーザーが使用するパスワードを指定します。

source: DBUsername
ja: データベースユーザー名

source: Specify the name of the database user.
fr: Spécifier le nom de la base de donnée de l'utilisateur.
ja: データベースのユーザー名を指定します。

source: LinuxDistribution
ja: Linux ディストリビューション

source: Specify the Linux distribution that is used in the stack.
fr: Spécifier la distribution Linux qui est utilisée dans la pile.
ja: スタックで使用される Linux ディストリビューションを指定します。

source: DBRootPassword
ja: データベース root パスワード

source: Specify the root password for the database.
fr: Spécifier le mot de passe root pour la base de donnée.
ja: データベースのルートパスワードを指定します。

source: KeyName
fr: Nom de la clé
ja: キー名

source: Specify the name of the key pair to use to log in to the stack.
fr: Spécifier le nom de la paire de clés utilisée pour se connecter à la pile.
ja: スタックにログインするために使用するキーペアの名前を指定します。

source: DBName
ja: データベース名

source: Specify the name of the database.
fr: Spécifier un nom pour la base de donnée.
ja: データベースの名前を指定します。

source: Specify the password for the database.
fr: Spécifier un mot de passe pour la base de donnée.
ja: データベースのパスワードを指定します。

source: Specify the flavor for the instance.
fr: Spécifier les spécifications de cette instance.
ja: インスタンスのフレーバーを指定します。

source: Click <guilabel>Launch</guilabel> to create a stack.
fr: Cliquer <guilabel> lancer </guilabel> pour créer une pile
ja: スタックを作成するために<guilabel>起動</guilabel>をクリックします。

source: The <guilabel>Stacks</guilabel> tab shows the stack.
fr: L'onglet <guilabel>Piles</guilabel> montre la pile.
ja: スタックが<guilabel>スタック</guilabel>タブに表示されます。

source: After the stack is created, click on the stack name to see the following details:
fr: Après que la pile soit créée, cliquez sur le nom de la pile pour voir les détails suivants:
ja: スタックの作成後、スタック名をクリックして、以下の詳細を参照できます。

source: Topology
fr: Topologie
ja: トポロジー

source: The topology of the stack.
fr: La topologie de la pile.
ja: スタックのトポロジー。

source: Overview
fr: Vue d'ensemble
ja: 概要

source: The parameters and details of the stack.
fr: Les paramètres et détails de la pile.
ja: スタックのパラメーターと詳細。

source: Resources
fr: Ressources
ja: リソース

source: The resources used by the stack.
fr: Les ressources utilisée par la pile.
ja: スタックにより使用されたリソース。

source: Events
fr: Événements
ja: イベント

source: The events related to the stack.
fr: Les évènements liés à la pile.
ja: スタックに関連するイベント。

source: Manage a stack
fr: Gérer une pile
ja: スタックの管理

source: Log in to the dashboard, choose a project, and click <guilabel>Stacks</guilabel>.
fr: Connectez-vous au tableau de bord, choisissez un projet et cliquez sur <guilabel>Piles</guilabel>.
ja: ダッシュボードにログインし、プロジェクトを選択し、<guilabel>スタック</guilabel>をクリックします。

source: Select the stack that you want to update.
fr: Sélectionner la pile que vous voulez mettre à jour.
ja: 更新したいスタックを選択します。

source: Click <guibutton>Change Stack Template</guibutton>.
fr: Cliquer <guibutton>Changer Modèle de Pile</guibutton>.
ja: <guibutton>スタックテンプレートの変更</guibutton>をクリックします。

source: In the <guilabel>Select Template</guilabel> dialog box, select the new template source or environment source.
fr: Dans la boite de dialogue <guilabel>Sélectionnner un Modèle</guilabel>, sélectionnez la source du nouveau modèle ou du nouvel environnement.
ja: <guilabel>テンプレートの選択</guilabel>ダイアログボックスで、新しいテンプレートのソースまたは環境のソースを選択します。

source: The <guilabel>Update Stack Parameters</guilabel> window appears.
fr: La fenêtre <guilabel>Mise à jour des Paramètres de la Pile</guilabel> apparaît.
ja: <guilabel>スタックパラメーターの更新</guilabel>ウィンドウが表示されます。

source: Enter new values for any parameters that you want to update.
fr: Entrer les nouvelles valeurs pour chaque paramètre que vous voulez mettre à jour.
ja: 更新したいパラメーターの新しい値を入力します。

source: Click <guibutton>Update</guibutton>.
fr: Cliquer <guibutton>Mise à jour</guibutton>.
ja: <guibutton>更新</guibutton>をクリックします。

source: Delete a stack
fr: Supprimer une pile
ja: スタックの削除

source: When you delete a stack, you cannot undo this action.
fr: Quand vous supprimez une pile, vous ne pouvez pas annuler cette action.
ja: スタックを削除するとき、この操作を取り消しできません。

source: Select the stack that you want to delete.
fr: Sélectionner la pile que vous souhaitez supprimer.
ja: 削除したいスタックを選択します。

source: Click <guibutton>Delete Stack</guibutton>.
fr: Cliquer <guibutton> Supprimer la Pile </guibutton>.
ja: <guibutton>スタックの削除</guibutton>をクリックします。

source: In the confirmation dialog box, click <guibutton>Delete Stack</guibutton> to confirm the deletion.
fr: Dans la boite de dialogue de confirmation, cliquez sur <guilabel>Supprimer Pile</guilabel> pour confirmer la suppression.
ja: 確認ダイアログで、削除を確認するために、<guibutton>スタックの削除</guibutton>をクリックします。

source: Authenticate
fr: Authentifier
ja: 認証

source: When using the SDK, you must authenticate against an OpenStack endpoint before you can use OpenStack services. Each project uses a slightly different syntax for authentication.
ja: SDK を使用する際、OpenStack のサービスを利用する前に、OpenStack のエンドポイントに対して認証する必要があります。各プロジェクトは、認証の構文が微妙に異なります。

source: You must typically authenticate against a specific version of a service. For example, a client might need to authenticate against Identity v2.0.
fr: Vous devez normalement vous authentifier à une version spécifique d'un service. Par exemple, un client pourrait avoir besoin de s'authentifier sur Identity v2.0.
ja: 一般的に、サービスの特定のバージョンに対して認証する必要があります。例えば、クライアントが Identity v2.0 に対して認証する必要があるかもしれません。

source: Python scripts that use the OpenStack SDK must have access to the credentials contained in the <link linkend="cli_openrc">OpenStack RC file</link>. Because credentials are sensitive information, do not include them in your scripts. This guide assumes that users source the <filename><replaceable>PROJECT</replaceable>-openrc.sh</filename> file and access the credentials by using the environment variables in the Python scripts.
fr: Le scripts Python qui utilisent le SDK OpenStack doivent avoir accès aux identifiants contenus dans le <link linkend="cli_openrc">fichier RC OpenStack</link>. Parce que les identifiants sont des informations sensibles, il ne faut pas les inclure dans vos scripts. Ce guide présume que les utilisateurs source le fichier <filename><replaceable>PROJET</replaceable>-openrc.sh</filename> et accèdent aux identifiants en utilisant les variables d'environnements dans les scripts Python.
ja: OpenStack SDK を使用する Python スクリプトは、<link linkend="cli_openrc">OpenStack RC ファイル</link>に含まれるクレデンシャルにアクセスする必要があります。クレデンシャルは取り扱いに注意を要する情報であるため、スクリプトに含めてはいけません。このガイドは、ユーザーが <filename><replaceable>PROJECT</replaceable>-openrc.sh</filename> ファイルを読み込み、Python スクリプトで環境変数を使用してクレデンシャルにアクセスすることを仮定しています。

source: When working with images in the SDK, you will call both <literal>glance</literal> and <literal>nova</literal> methods.
fr: En travaillant avec les images du SDK, vous appellerez à la fois les méthodes <literal>glance</literal> et <literal>nova</literal>.
ja: SDK でイメージを操作する場合、<literal>glance</literal> メソッドと <literal>nova</literal> メソッドを呼び出します。

source: To list the available images, call the <methodname>glanceclient.v2.images.Controller.list</methodname> method:
fr: Pour lister les images disponibles, appeler la méthode <methodname>glanceclient.v2.images.Controller.list</methodname> :
ja: 利用可能なイメージを一覧表示するために、<methodname>glanceclient.v2.images.Controller.list</methodname> メソッドを呼び出します。

source: The <methodname>images</methodname> method returns a Python generator, as shown in the following interaction with the Python interpreter:
fr: La méthode <methodname>images</methodname> retourne un générateur Python, comme le montre l'interaction suivante avec l'interpréteur python:
ja: <methodname>images</methodname> メソッドは、以下の Python インタープリターとのやりとりにあるとおり、Python ジェネレーターを返します。

source: Get image by ID
fr: Obtenir une image par ID
ja: ID によるイメージの取得

source: To retrieve an image object from its ID, call the <methodname> glanceclient.v2.images.Controller.get</methodname> method:
fr: Pour récupérer un objet image à partir de son ID, appelez la méthode <methodname> glanceclient.v2.images.Controller.get</methodname>:
ja: ID からイメージオブジェクトを取得するために、<methodname> glanceclient.v2.images.Controller.get</methodname> メソッドを呼び出します。

source: Get image by name
fr: Obtenir une image par nom
ja: 名前によるイメージの取得

source: The Image Service Python bindings do not support the retrieval of an image object by name. However, the Compute Python bindings enable you to get an image object by name. To get an image object by name, call the <methodname> novaclient.v1_1.images.ImageManager.find</methodname> method:
fr: Les liaisons du Service d'Image Python ne ​​prennent pas en charge la récupération d'un objet de l'image par son nom. Toutefois, les liaisons Compute Python vous permettent d'obtenir un objet de l'image par son nom. Pour obtenir un objet de l'image par son nom, appelez la méthode <methodname> novaclient.v1_1.images.ImageManager.find</methodname> :
ja: Image Service Python バインディングは、名前によるイメージオブジェクトの取得をサポートしません。しかしながら、Compute Python バインディングは、名前によりイメージオブジェクトを取得できます。名前によりイメージオブジェクトを取得するために、<methodname> novaclient.v1_1.images.ImageManager.find</methodname> メソッドを呼び出します。

source: To upload an image, call the <methodname> glanceclient.v2.images.ImageManager.create</methodname> method:
fr: Pour télécharger une image, appelez la méthode <methodname> glanceclient.v2.images.ImageManager.create</methodname> :
ja: イメージをアップロードするために、<methodname> glanceclient.v2.images.ImageManager.create</methodname> メソッドを呼び出します。

source: Install the OpenStack SDK
fr: Installer le SDK OpenStack
ja: OpenStack SDK のインストール

source: Each OpenStack project has its own Python library. These libraries are bundled with the command-line clients. For example, the Python bindings for the Compute API are bundled with the <package>python-novaclient</package> package.
fr: Chaque projet OpenStack dispose de sa propre bibliothèque Python. Ces bibliothèques sont livrés avec les clients en ligne de commande. Par exemple, les liaisons Python pour l'API Compute sont livrés avec le paquet <package>python-novaclient</package>.
ja: 各 OpenStack プロジェクトは自身の Python ライブラリを持ちます。これらのライブラリはコマンドラインクライアントに同梱されています。たとえば、Compute API の Python バインドは <package>python-novaclient</package> パッケージに同梱されています。

source: For details about how to install the clients, see <link linkend="install_clients">install the OpenStack command-line clients</link>.
fr: Pour plus de détails sur la façon d'installer les clients, voir <link linkend="install_clients">install the OpenStack command-line clients</link>.
ja: クライアントのインストール方法の詳細は<link linkend="install_clients">OpenStack コマンドラインクライアントのインストール</link>を参照してください。

source: Before you launch an instance, you should add security group rules to enable users to ping and use SSH to connect to the instance. Security groups are sets of IP filter rules that define networking access and are applied to all instances within a project. To do so, you either <link linkend="security_groups_add_rule">add rules to the default security group</link> or add a new security group with rules.
ja: インスタンスの起動前に、ユーザーがインスタンスに ping と SSH を実行できるよう、セキュリティグループのルールを追加すべきです。セキュリティグループは、ネットワークアクセスを定義し、プロジェクト内のすべてのインスタンスに適用される、IP フィルタールール群です。そうする場合、<link linkend="security_groups_add_rule">default セキュリティグループにルールを追加する</link> か、ルールを持つ新しいセキュリティグループを追加します。

source: Key pairs are SSH credentials that are injected into an instance when it is launched. To use key pair injection, the image that the instance is based on must contain the <literal>cloud-init</literal> package. Each project should have at least one key pair. For more information, see <xref linkend="keypair_add"/>.
fr: Les paires de clés sont des identifiants SSH qui sont injectés dans les instances lorsqu'elles sont lancées. Pour utiliser cette injection de paire de clés, l'image sur laquelle est basée l'instance doit contenir le paquet <literal>cloud-init</literal>. Chaque projet doit avoir au moins une paire de clés. Pour plus d'informations, voir <xref linkend="keypair_add"/>.
ja: キーペアは、インスタンスの起動時に、インスタンスに注入される SSH クレデンシャルです。キーペアを注入するために、インスタンスがベースとするイメージは、<literal>cloud-init</literal> パッケージを含める必要があります。各プロジェクトは、少なくとも 1 つのキーペアを持つべきです。詳細は <xref linkend="keypair_add"/> を参照してください。

source: If you have generated a key pair with an external tool, you can import it into OpenStack. The key pair can be used for multiple instances that belong to a project. For more information, see <xref linkend="dashboard_import_keypair"/>.
ja: 外部ツールを用いてキーペアを作成しても、OpenStack にインポートできます。キーペアは同じプロジェクトの複数のインスタンスに使用できます。詳細は<xref linkend="dashboard_import_keypair"/>を参照してください。

source: When an instance is created in OpenStack, it is automatically assigned a fixed IP address in the network to which the instance is assigned. This IP address is permanently associated with the instance until the instance is terminated. However, in addition to the fixed IP address, a floating IP address can also be attached to an instance. Unlike fixed IP addresses, floating IP addresses are able to have their associations modified at any time, regardless of the state of the instances involved.
ja: インスタンスを OpenStack に作成したとき、インスタンスに割り当てられるネットワーク上の固定 IP アドレスが自動的に割り当てられます。この IP アドレスは、インスタンスが終了するまで、インスタンスに割り当てられたままです。しかしながら、固定 IP アドレスに加えて、Floating IP アドレスもインスタンスに割り当てられます。固定 IP アドレスと異なり、Floating IP アドレスは、インスタンスの状態に関わらず、いつでも関連付けを変更できます。

source: Add a rule to the default security group
fr: Ajouter une règle au groupe de sécurité par défaut
ja: default セキュリティグループへのルールの追加

source: This procedure enables SSH and ICMP (ping) access to instances. The rules apply to all instances within a given project, and should be set for every project unless there is a reason to prohibit SSH or ICMP access to the instances.
ja: この手順により、インスタンスに SSH と ICMP (ping) アクセスできるようになります。ルールは、指定されたプロジェクト内のすべてのインスタンスに適用されます。インスタンスへの SSH や ICMP アクセスを禁止する理由がなければ、すべてのプロジェクトに対して設定すべきです。

source: This procedure can be adjusted as necessary to add additional security group rules to a project, if your cloud requires them.
fr: Cette procédure peut être améliorée si nécessaire, afin d'ajouter des règles additionnelles au groupe de sécurité d'un projet, si votre cloud le nécessite.
ja: この手順は、追加のセキュリティグループのルールをプロジェクトに追加するために、必要に応じて調整できます。

source: Log in to the dashboard, choose a project, and click <guilabel>Access &amp; Security</guilabel>. The <guilabel>Security Groups</guilabel> tab shows the security groups that are available for this project.
fr: Se connecter au tableau de bord, choisir un projet et cliquer <guilabel>Accès &amp; Sécurité</guilabel>. L'onglet <guilabel>Groupes de Sécurité</guilabel> affiche les groupes de sécurité disponible pour ce projet.
ja: ダッシュボードにログインし、プロジェクトを選択し、<guilabel>アクセスとセキュリティ</guilabel>をクリックします。<guilabel>セキュリティグループ</guilabel>タブに、このプロジェクトで利用できるセキュリティグループが表示されます。

source: Select the <guilabel>default</guilabel> security group and click <guibutton>Edit Rules</guibutton>.
fr: Sélectionner le groupe de sécurité <guilabel>default</guilabel> et cliquer <guibutton>Éditer les règles</guibutton>.
ja: <guilabel>default</guilabel> セキュリティグループを選択し、<guibutton>ルールの編集</guibutton>をクリックします。

source: To allow SSH access, click <guibutton>Add Rule</guibutton>.
fr: Pour autoriser l'accès ssh, cliquer <guibutton>Ajouter une règle</guibutton>.
ja: SSH アクセスを許可するために、<guibutton>ルールの追加</guibutton>をクリックします。

source: In the Add Rule dialog box, enter the following values:
fr: Dans la boite de dialogue Ajouter une Règle, entrer les valeurs suivantes:
ja: ルールの追加ダイアログボックスで、以下の値を入力します。

source: Rule
fr: Règle
ja: ルール

source: Remote
fr: Distant
ja: 接続相手

source: To accept requests from a particular range of IP addresses, specify the IP address block in the <guilabel>CIDR</guilabel> box.
fr: Pour accepter les demandes d'une plage d'adresse particulière, indiquer le bloc d'adresse dans la <guilabel>CIDR</guilabel> liste
ja: 特定の IP アドレス範囲からのリクエストを許可する場合、<guilabel>CIDR</guilabel> ボックスに IP アドレスブロックを指定します。

source: Click <guibutton>Add</guibutton>.
fr: Cliquer <guibutton> Ajouter </guibutton>.
ja: <guibutton>追加</guibutton>をクリックします。

source: Instances will now have SSH port 22 open for requests from any IP address.
fr: Les instances auront maintenant le port SSH 22 ouvert pour les requêtes de n'importe quelle adresse IP.
ja: インスタンスは、すべての IP アドレスからのリクエストに対して、SSH ポート 22 番をオープンします。

source: To add an ICMP rule, click <guibutton>Add Rule</guibutton>.
fr: Pour ajouter une règle ICMP, cliquer <guibutton> Ajouter une Règle </guibutton>.
ja: ICMP ルールを追加するために、<guibutton>ルールの追加</guibutton>をクリックします。

source: Direction
ja: 方向

source: Ingress
fr: Entrée
ja: 受信

source: Instances will now accept all incoming ICMP packets.
fr: Les instances accepteront maintenant les paquets ICMP entrants.
ja: インスタンスは、すべての ICMP 入力パケットを受け付けます。

source: Create at least one key pair for each project.
fr: Créer au moins une paire de clés pour chaque projet.
ja: プロジェクトごとに少なくとも 1 つのキーペアを作成します。

source: Log in to the dashboard, choose a project, and click <guilabel>Access &amp; Security</guilabel>.
fr: Se connecter au tableau de bord, choisir un projet et cliquer <guilabel>Accès &amp; Sécurité</guilabel>.
ja: ダッシュボードにログインし、プロジェクトを選択し、<guilabel>アクセスとセキュリティ</guilabel>をクリックします。

source: Click the <guilabel>Keypairs</guilabel> tab, which shows the key pairs that are available for this project.
fr: Cliquer sur l'onglet <guilabel>Paire de Clés</guilabel>, qui affiche les paires de clés disponibles pour ce projet.
ja: <guilabel>キーペア</guilabel>タブをクリックします。このプロジェクトで利用可能なキーペアが表示されます。

source: Click <guibutton>Create Keypair</guibutton>.
fr: Cliquer <guibutton> Créer une paire de clés </guibutton>.
ja: <guibutton>キーペアの作成</guibutton>をクリックします。

source: In the Create Keypair dialog box, enter a name for your key pair, and click <guibutton>Create Keypair</guibutton>.
fr: Dans la boite de dialogue Créer une Paire de clés, entrer un nom pour votre paire de clés et cliquer <guibutton>Créer une Paire de Clés</guibutton>.
ja: キーペアの作成ダイアログボックスに、キーペアの名前を入力し、<guibutton>キーペアの作成</guibutton>をクリックします。

source: Respond to the prompt to download the key pair.
fr: Répondre au prompt pour télécharger la paire de clés.
ja: キーペアをダウンロードするために、プロンプトに応答します。

source: Click <guibutton>Import Keypair</guibutton>.
fr: Cliquer <guibutton> Importer la paire de clés </guibutton>.
ja: <guibutton>キーペアのインポート</guibutton>をクリックします。

source: In the Import Keypair dialog box, enter the name of your key pair, copy the public key into the <guilabel>Public Key</guilabel> box, and then click <guibutton>Import Keypair</guibutton>.
fr: Dans la boite de dialogue Importer la Paire de clés, entrer le nom de votre paire de clés et copier la clé publique dans la boite <guilabel>Clé Publique</guilabel> et ensuite cliquer <guibutton>Importer Paire de clés</guibutton>.
ja: キーペアのインポートのダイアログボックスで、キーペアの名前を入力します。<guilabel>公開鍵</guilabel>ボックスに公開鍵をコピーします。そして、<guibutton>キーペアのインポート</guibutton>をクリックします。

source: Save the <filename>*.pem</filename> file locally.
fr: Sauve localement le fichier <filename>*.pem</filename>.
ja: ローカルに <filename>*.pem</filename> ファイルを保存します。
