Repository: 25hours/openstack-manuals
Catalog: doc/glossary/locale/*.po
Languages: es

source: The Compute component that runs on each compute node and manages the VM instance life cycle, including run, reboot, terminate, attach/detach volumes, and so on. Provided by the <systemitem class="service">nova-compute</systemitem> daemon.
es: El componente Compute que se ejecuta en cada nodo de cómputo y gestiona el ciclo de vida de la instancia VM incluyendo carrera, reiniciar, cerrar, conexión / desconexión de volúmenes, y así sucesivamente. Proporcionada por el demonio <clase systemitem = "service"> nova-compute </ systemitem>

source: concatenated object
es: objeto concatenado

source: objects
es: objetos

source: concatenated objects
es: objetos concatenado

source: A set of segment objects that Object Storage combines and sends to the client.
es: Un conjunto de objetos de segmentos que Object Storage combina e envía al cliente.

source: conductors
es: conductures

source: In Compute, conductor is the process that proxies database requests from the compute process. Using conductor improves security because compute nodes do not need direct access to the database.
es: En Compute, el conductor es el proceso que procura peticiones de base de datos desde el proceso de cómputo. Utilizando el conductor mejora la seguridad, ya que los nodos de cómputo no necesitan tener acceso directo a la base de datos.

source: consistency window
es: periodo de consistencia

source: The amount of time it takes for a new Object Storage object to become accessible to all clients.
es: La cantidad de tiempo que toma para que un nuevo objeto de Object Storage para ser accesible a todos los clientes.

source: console log
es: registro de consola

source: console logs
es: registros de consola

source: Contains the output from a Linux VM console in Compute.
es: Contiene la salida de consola Linux VM en Compute.

source: container
es: contenedor

source: containers
es: contenedores

source: container auditor
es: auditor de contenedor

source: container auditors
es: auditores de contenendor

source: Checks for missing replicas or incorrect objects in specified Object Storage containers through queries to the SQLite back-end database.
es: Comprueba si falta réplicas u objetos incorrectos en los contenedores de Object Storage especificados a través de consultas a la base de datos back-end SQLite.

source: container database
es: base de datos de contenedores

source: container databases
es: bases de datos de contenedores

source: A SQLite database that stores Object Storage containers and container metadata. The container server accesses this database.
es: Una base de datos SQLite que almacena contenedores de Object Storage y metadatos del contenedor. El servidor de contenedor tiene acceso a esta base de datos.

source: container format
es: formato de contenedor

source: container server
es: servidor de contenedor

source: container servers
es: servidores de contenedor

source: An Object Storage server that manages containers.
es: Un servidor de Object Storage que maneja contenedores.

source: container service
es: servicio de contenedor

source: The Object Storage component that provides container services, such as create, delete, list, and so on.
es: El componente de Object Storage que proporciona servicios de contenedores, tales como crear, eliminar, lista, y así sucesivamente.

source: content delivery network (CDN)
es: content delivery network(CDN) - red de distribución de contenidos

source: A content delivery network is a specialized network that is used to distribute content to clients, typically located close to the client for increased performance.
es: Una red de distribución de contenidos es una red especializada que se utiliza para distribuir contenido a clientes, normalmente se encuentra cerca del cliente para un mayor rendimiento.

source: controller node
es: nodo del controlador

source: controller nodes
es: nodos del controlador

source: under cloud computing
es: bajo la computación en nube

source: Alternative term for a cloud controller node.
es: Término alternativo para un nodo controlador de nube.

source: core API
es: API básico

source: core project
es: proyecto básico

source: cost
es: costo

source: Under the Compute distributed scheduler, this is calculated by looking at the capabilities of each host relative to the flavor of the VM instance being requested.
es: Bajo el planificador de Compute distribuido, este se calcula mirando las capacidades de cada huésped en relación con el tipo de la instancia de VM pedida.

source: credentials
es: cartas credenciales

source: Data that is only known to or accessible by a user and used to verify that the user is who he says he is. Credentials are presented to the server during authentication. Examples include a password, secret key, digital certificate, and fingerprint.
es: Los datos que sólo se sabe que o son accesibles por un usuario y se utilizan para comprobar que el usuario es quien dice ser. Los credenciales se presentan en el servidor durante la autenticación. Los ejemplos incluyen una contraseña, clave secreta, certificado digital, y la huella digital.

source: A mechanism that allows many resources (for example, fonts, JavaScript) on a web page to be requested from another domain outside the domain from which the resource originated. In particular, JavaScript's AJAX calls can use the XMLHttpRequest mechanism.
es: Un mecanismo que permite que muchos recursos (por ejemplo, tipos de letra, JavaScript) de una página web que se podrá solicitar otro dominio fuera del dominio desde el que se originó el recurso. En particular, las llamadas JavaScript AJAX pueden utilizar el mecanismo de XMLHttpRequest.

source: An open source community project by Dell that aims to provide all necessary services to quickly deploy clouds.
es: Un proyecto de la comunidad de código abierto por parte de Dell que tiene como objetivo proporcionar todos los servicios necesarios para implementar rápidamente las nubes.

source: current workload
es: carga de trabajo actual

source: An element of the Compute capacity cache that is calculated based on the number of build, snapshot, migrate, and resize operations currently in progress on a given host.
es: Un elemento del caché de la capacidad de cómputo que se calcula en función del número de construccion, snapshot, migrar, y operaciondes de cambio de tamaño en curso en un huésped determinado.

source: customer
es: cliente

source: customers
es: clientes

source: tenants
es: inquilinos

source: Alternative term for tenant.
es: Término alternativo para el inquilino.

source: customization module
es: módulo de personalización

source: A user-created Python module that is loaded by horizon to change the look and feel of the dashboard.
es: Un módulo de Python creado por el usuario que se carga por Horizon para cambiar la apariencia del panel de instrumentos.

source: daemon
es: demonio

source: daemons
es: demonios

source: A process that runs in the background and waits for requests. May or may not listen on a TCP or UDP port. Do not confuse with a worker.
es: Un proceso que se ejecuta en segundo plano y espera peticiones. Puede o no puede escuchar en un puerto TCP o UDP. No debe confundirse con un trabajador.

source: DAC (discretionary access control)
es: DAC (control de acceso discrecional)

source: Discretionary access control. Governs the ability of subjects to access objects, while enabling users to make policy decisions and assign security attributes. The traditional UNIX system of users, groups, and read-write-execute permissions is an example of DAC.
es: Control de acceso discrecional. Gobierna la capacidad de los sujetos para acceder a objetos, al tiempo que permite a los usuarios tomar polizas de decisiones y asignar atributos de seguridad. El sistema tradicional de UNIX de usuarios, grupos y permisos de lectura-escritura-ejecución son un ejemplo de DAC.

source: dashboard
es: panel de instrumentos

source: The web-based management interface for OpenStack. An alternative name for horizon.
es: La interfaz de gestión basada en web para OpenStack. Un nombre alternativo para el horizon.

source: data encryption
es: cifrado de datos

source: database ID
es: ID de base de datos

source: databases
es: base de datos

source: A unique ID given to each replica of an Object Storage database.
es: Un identificador único dado a cada réplica de una base de datos de Object Storage.

source: database replicator
es: replicador de base de datos

source: database replicators
es: replicadores de bases de datos

source: An Object Storage component that copies changes in the account, container, and object databases to other nodes.
es: Un componente de Object Storage que copia los cambios en la cuenta, contenedores, y bases de datos de objetos a otros nodos.

source: Data processing service
es: Servicio de proceso de data

source: OpenStack project that provides a scalable data-processing stack and associated management interfaces. The code name for the project is sahara.
es: Proyecto OpenStack que ofrece una pila de procesamiento de datos escalable e interfaces de gestión asociados. El nombre en clave del proyecto es sahara.

source: deallocate
es: dealocar

source: deallocate, definition of
es: dealocar, definicion de

source: The process of removing the association between a floating IP address and a fixed IP address. Once this association is removed, the floating IP returns to the address pool.
es: El proceso de eliminación de la asociación entre una dirección IP flotante y una dirección IP fija. Una vez que se elimina esta asociación, la IP flotante devuelve al conjunto de direcciones.

source: deduplication
es: deduplicación

source: The process of finding duplicate data at the disk block, file, and/or object level to minimize storage usecurrently unsupported within OpenStack.
es: El proceso de encontrar datos duplicados en el bloque de disco, archivo, y / o el nivel de objeto de reducir al mínimo el uso de almacenamiento actualmente no soportado dentro de OpenStack.

source: default panel
es: panel predeterminado

source: default panels
es: paneles predeterminados

source: The default panel that is displayed when a user accesses the horizon dashboard.
es: El panel predeterminado que se muestra cuando un usuario accede al panel de instrumento horizon.

source: default tenant
es: inquilino predeterminado

source: default tenants
es: inquilinos predeterminado

source: default token
es: token predeterminado

source: default tokens
es: tokens predeterminados

source: basics of
es: conceptos básicos de

source: DHCP agent
es: agente DHCP

source: direct consumer
es: consumidor directo

source: direct consumers
es: consumidores directos

source: direct exchange
es: intercambio directo

source: direct exchanges
es: intercambios directos

source: direct publisher
es: publicador directo

source: direct publishers
es: publicadores directos

source: disassociate
es: desasociar

source: disk encryption
es: cifrado de disco

source: disk format
es: formato de disco

source: DNS (Domain Name Server, Service or System)
es: DNS (Servidor de Nombre de Dominio, servicio o sistema)

source: definitions of
es: definicion de

source: DNS record
es: registro DNS

source: DNS records
es: registros DNS

source: Daemon that provides DNS, DHCP, BOOTP, and TFTP services for virtual networks.
es: Demonio que proporciona servicios de DNS, DHCP, BOOTP, y TFTP para redes virtuales.

source: domain
es: dominio

source: domain, definition of
es: dominio, definicion de

source: Domain Name Service (DNS)
es: Servidor de Nomber de Dominio (DNS)

source: Domain Name System (DNS)
es: Servidor de Nomber de Dominio (DNS)

source: download
es: descarga

source: download, definition of
es: descarga, definicion de

source: durable exchange
es: cambio duradero

source: durable queue
es: file duradera

source: east-west traffic
es: tráfico este-oeste

source: EBS boot volume
es: Volumen de inicio EBS

source: EC2 API
es: API de EC2

source: EC2 Compatibility API
es: API de Compatibilidad EC2

source: EC2 compatibility API
es: API de Compatibilidad EC2

source: encryption
es: cifrado

source: encryption, definition of
es: cifrado, definicion de

source: endpoint
es: punto final

source: See API endpoint.
es: Vea punto final de API

source: endpoint registry
es: registro de punto final

source: encapsulation
es: encapsulación

source: endpoint template
es: plantilla de punto final

source: endpoint templates
es: plantillas de punto final

source: entity
es: Entidad

source: entity, definition of
es: entidad, definicion de

source: ephemeral image
es: imagen efímera

source: ephemeral images
es: imagenes efímeras

source: ephemeral volume
es: volumen efímero

source: ESX hypervisor
es: Hipervisor ESX

source: An OpenStack-supported hypervisor.
es: Un hipervisor compatible con OpenStack.

source: ESXi hypervisor
es: Hipervisor ESX

source: evacuate
es: evacuar

source: evacuation, definition of
es: evacuación, definición de

source: exchange
es: intercambio

source: exchange type
es: tipo de intercambio

source: exchange types
es: tipo de intercambios

source: extension
es: extensión

source: extensions
es: extensiónes

source: external network
es: red externa

source: external network, definition of
es: red externa, definicion de

source: extra specs
es: características adicionales

source: extra specs, definition of
es: características adicionales, definicion de

source: federated identity
es: identidad federada

source: Fibre Channel
es: Fibre Channel - Canal de Fibra

source: filter
es: filtro

source: filtering
es: filtración

source: firewall
es: contrafuego

source: firewalls
es: contrafuegos

source: fixed IP address
es: dirección IP fijo

source: IP addresses
es: dirección IP

source: fixed
es: fijo

source: fixed IP addresses
es: direcciónes IP fijos

source: flat mode injection
es: inyección modo plano

source: flat network
es: red plana

source: flavor
es: tipo

source: flavor ID
es: ID de tipo

source: floating IP address
es: dirección IP flotante

source: floating
es: flotante

source: gateway
es: entrada

source: glance registry
es: registro glance

source: golden image
es: imagen base

source: Graphics Processing Unit (GPU)
es: Unidad de procesamiento gráfico (GPU)

source: horizon plug-in
es: plug-in de horizon

source: horizon plug-ins
es: plug-ins de horizon

source: host
es: huesped

source: hosts, definition of
es: huesped, definicion de

source: HTTP (Hypertext Transfer Protocol)
es: HTTP (Protocolo de Transferencia Hypertext)

source: HTTPS (Hypertext Transfer Protocol Secure)
es: HTTPS (Protocolo de Transferencia Hypertext Seguro)

source: Hypertext Transfer Protocol (HTTP)
es: HTTP (Protocolo de Transferencia Hypertext)

source: Hypertext Transfer Protocol Secure (HTTPS)
es: HTTPS (Protocolo de Transferencia Hypertext Seguro)

source: hypervisor
es: hipervisor

source: hypervisors
es: hipervisores

source: hypervisor pool
es: piscina de hipervisor

source: hypervisor pools
es: piscinas de hipervisores

source: IaaS
es: IaaS - Abrevacion de Infrastructure As A Service

source: ID number
es: número de ID

source: Identity API
es: API de Identity

source: Intrusion Detection System.
es: Sistema de detección de intrusiones.

source: image
es: imagen

source: images
es: imagenes

source: Image API
es: API de Image

source: image cache
es: caché de imágenes

source: image ID
es: ID de imagen

source: image membership
es: membresia de imagen

source: image owner
es: propietario de imagen

source: image registry
es: registro de imagen

source: image status
es: estado de la imagen

source: image store
es: lmacén de imágenes

source: image UUID
es: UUID de imagen

source: incubated project
es: proyecto incubado

source: incubated projects
es: proyecto incubados

source: injection
es: inyección

source: instance
es: instancia

source: instances
es: instancias

source: instance ID
es: ID de instancia

source: instance state
es: estado de instancia

source: instance type
es: tipo de instancia

source: instance type ID
es: ID de tipo de instancia

source: Alternative term for a flavor ID.
es: Término alternativo para un ID de tipo.

source: instance UUID
es: UUID de instancia

source: interface
es: interfaz

source: interface ID
es: ID de interfaz

source: Internet protocol (IP)
es: Protocolo Internet (IP)

source: Internet Service Provider (ISP)
es: Proveedor de servicios de Internet (ISP)

source: IP address
es: Dirección IP

source: IPL (Initial Program Loader)
es: IPL (Initial Program Loader) - Cagador De Programa Inicial.

source: Initial Program Loader.
es: Cargador De Programa Inicial.

source: ISO9960 format
es: formato ISO9960

source: A programming language that is used to create systems that involve more than one computer by way of a network.
es: Un Lenguaje de programación que es usado para crear sistemas que involucran más de una computadora a modo de una red.

source: jumbo frame
es: fragmentos jumbo

source: large object
es: objeto grande

source: Layer-2 network
es: Red de capa-2

source: Layer-3 network
es: Red de capa-3

source: Layer-2 (L2) agent
es: Agente de Capa-2(L2)

source: Layer-3 (L3) agent
es: Agente de Capa-3(L3)

source: Linux bridge
es: Linux bridge - Puente Linux

source: Linux Bridge
es: Linux Bridge - Puente Linux

source: Linux containers (LXC)
es: Contenidores Linux(LXC)

source: live migration
es: migración en vivo

source: load balancer
es: equilibrador de carga

source: load balancing
es: balanceo de carga

source: management API
es: API de gestión

source: management network
es: red de gestión

source: manager
es: gestor

source: manifest
es: manifiesto

source: manifests
es: manifiestos

source: maximum transmission unit (MTU)
es: unidad de transmisión máxima (MTU)

source: membership
es: membresia

source: membership list
es: lista de miembros

source: membership lists
es: listas de miembros

source: message queue
es: fila de mensajes

source: Metadata agent
es: Agente de metadata

source: migration
es: migración

source: multi-host
es: multi-huesped

source: multi-factor authentication
es: autenticación de múltiples factores

source: network namespace
es: espacio de nombres de red

source: network
es: red

source: networks
es: redes

source: network controller
es: controlador de red

source: network controllers
es: controladores de redes

source: A Compute daemon that orchestrates the network configuration of nodes, including IP addresses, VLANs, and bridging. Also manages routing for both public and private networks.
es: Un demonio Compute que orquesta la configuración de red de nodos, incluyendo direcciones IP, VLAN y puente. También gestiona el enrutamiento para redes públicas y privadas.

source: Network File System (NFS)
es: Network File System (NFS) - Sistema de archivos de red

source: network ID
es: ID de red

source: network IDs
es: IDs de redes

source: network manager
es: gestor de la red

source: network managers
es: gestores de la redes

source: network node
es: nodo de red

source: network nodes
es: nodos de redes

source: Any compute node that runs the network worker daemon.
es: Cualquier nodo de cómputo que se ejecuta el demonio red trabajador.

source: network segment
es: segmento de las red

source: network segments
es: segmentos de las redes

source: network UUID
es: UUID de red

source: network worker
es: trabajador de red

source: network workers
es: trabajadores de redes

source: The <literal>nova-network</literal> worker daemon; provides services such as giving an IP address to a booting nova instance.
es: El demonio trabajador <literal> nova-network <literal />; proporciona servicios tales como dar una dirección IP a una instancia nova arrancando.

source: Networking
es: Redes

source: Networking API
es: API de Redes

source: neutron API
es: API de neutron

source: neutron manager
es: gestor de neutron

source: neutron plug-in
es: plug-in de neutron

source: node
es: nodo

source: nodes
es: nodos

source: messages
es: mensajes

source: non-durable exchanges
es: intercambios no duradero

source: non-durable queue
es: fila no duraderas

source: non-durable queues
es: filas no duraderas

source: non-persistent volume
es: volumen no persistente

source: Alternative term for an ephemeral volume.
es: Término alternativo para un volumen efímero.

source: north-south traffic
es: tráfico de norte-sur

source: Nova API
es: API de Nova

source: object
es: objeto

source: object auditor
es: auditor de objecto

source: object auditors
es: autitores de objetos

source: object expiration
es: expiración de objeto

source: object hash
es: hash de objecto

source: object replicator
es: replicador de objeto

source: object replicators
es: replicadores de objetos

source: object server
es: servidor de objetos

source: object servers
es: servidores de objetos

source: Object Storage API
es: API de Object Storage

source: The Ceph storage daemon.
es: El demonio de almacenamiento en Ceph.

source: object versioning
es: versiones de objeto

source: Open vSwitch neutron plug-in
es: Plug-in de Open vSwitch neutron

source: OpenStack code name
es: Nombre código de OpenStack

source: code name
es: nombre código

source: operator
es: operador

source: Orchestration
es: Orquestación

source: orphan
es: huérfano

source: orphans
es: huérfanos

source: parent cell
es: célula madre

source: parent cells
es: células madre

source: partition
es: partición

source: partitions
es: particiónes

source: partition index
es: índice de partición

source: partition shift value
es: valor de desplazamiento de partición

source: partition index value
es: valor del índice de partición

source: Mechanism in IP networks to detect end-to-end MTU and adjust packet size accordingly.
es: Mecanismo en redes IP para detectar end-to-end MTU y ajustar el tamaño de los paquetes da manera acorde.

source: pause
es: pausa

source: persistent message
es: mensaje persistente

source: persistent messages
es: mensajes persistentes

source: persistent volume
es: volumen persistente

source: Changes to these types of disk volumes are saved.
es: Los cambios realizados a estos tipos de volúmenes de disco son guardados.

source: personality file
es: archivo de personalidad

source: plug-ins, definition of
es: plug-ins, definicion de

source: policy service
es: servicio de póliza

source: pool
es: piscina

source: pool member
es: miembro de la piscina

source: An application that runs on the back-end server in a load-balancing system.
es: Una aplicación que corre en el servidor de back-end en un sistema de balanceo de carga.

source: port
es: puerto

source: ports
es: puertos

source: port UUID
es: UUID de puerto

source: preseed, definition of
es: preseed, definicion de

source: private image
es: imagen privada

source: private IP address
es: direcion IP privado

source: private
es: privado

source: private network
es: red privada

source: private networks
es: redes privadas

source: project
es: proyecto

source: projects
es: proyectos

source: project ID
es: ID de proyecto

source: project VPN
es: proyecto VPN

source: promiscuous mode
es: modo promiscuo

source: protected property
es: propiedad protegida

source: provider
es: proveedor

source: An administrator who has access to all hosts and instances.
es: Un administrador que tiene acceso a todos los anfitriones e instancias.

source: proxy node
es: nodo de procuración

source: proxy nodes
es: nodos de procuración

source: A node that provides the Object Storage proxy service.
es: Un nodo que ofrece el servicio de proxy de Object Storage .

source: proxy server
es: servidor de procuración

source: proxy servers
es: servidores de procuración

source: public API
es: API publico

source: public APIs
es: APIs publicos

source: public image
es: imagen publica

source: public images
es: imagenes publicas

source: public IP address
es: direccion IP publico

source: public
es: publico
