Repository: 25hours/openstack-manuals
Catalog: doc/glossary/locale/*.po
Languages: es

source: OpenStack glossary
es: Glosario OpenStack

source: Use this glossary to get definitions of OpenStack-related words and phrases.
es: Utiliza este glosario para obtener definiciones de palabras o frases relacionadas con OpenStack

source: To add to this glossary follow the <link href="https://wiki.openstack.org/wiki/Documentation/HowTo"> OpenStack Documentation HowTo</link>.
es: Para agregar a este glosario siga el <link href="https://wiki.openstack.org/wiki/Documentation/HowTo"> OpenStack Documentacion HowTo</link>.

source: Glossary
es: Glosario

source: Licensed under the Apache License, Version 2.0 (the "License"); you may not use this file except in compliance with the License. You may obtain a copy of the License at
es: Licenciado bajo la licencia Apache , Versión 2.0 ( la "Licencia" ) ; usted no puede utilizar este archivo excepto en cumplimiento de la Licencia. Usted puede obtener una copia de la Licencia en

source: Unless required by applicable law or agreed to in writing, software distributed under the License is distributed on an "AS IS" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied. See the License for the specific language governing permissions and limitations under the License.
es: A menos que lo requiera la ley aplicable o se acuerdo por escrito, el software distribuido bajo la licencia se distribuye " TAL CUAL" , SIN GARANTÍAS NI CONDICIONES DE NINGÚN TIPO, ya sea expresa o implícita. Consulte la licencia para el idioma específico que rige los permisos y limitaciones en la licencia .

source: This glossary offers a list of terms and definitions to define a vocabulary for OpenStack-related concepts.
es: Este glosario ofrece una lista de terminos y definiciones para definir el vocabulario para los conceptos relacionados a OpenStack.

source: Numbers
es: Numeros

source: 6to4
es: 6a4

source: A mechanism that allows IPv6 packets to be transmitted over an IPv4 network, providing a strategy for migrating to IPv6.
es: Un mecanismo que permite que los paquetes IPv6 que sean transmitidos a través de una red IPv4 , proporcionando una estrategia para migrar a IPv6.

source: absolute limit
es: limite absoluto

source: Impassable limits for guest VMs. Settings include total RAM size, maximum number of vCPUs, and maximum disk size.
es: Límites infranqueables para VMs huéspedes . Los ajustes incluyen tamaño total de memoria RAM , el número máximo de CPU virtuales , y el tamaño máximo del disco .

source: access control list
es: lista de control de acceso

source: access control list (ACL)
es: lista de control de acces (LCA)

source: A list of permissions attached to an object. An ACL specifies which users or system processes have access to objects. It also defines which operations can be performed on specified objects. Each entry in a typical ACL specifies a subject and an operation. For instance, the ACL entry <code>(Alice, delete)</code> for a file gives Alice permission to delete the file.
es: Una lista de permisos unidos a un objeto. Un ACL especifica qué usuarios o procesos del sistema tienen acceso a objetos. También define qué operaciones se pueden realizar en los objetos especificados. Cada entrada en una ACL típica especifica un sujeto y una operación. Por ejemplo , la entrada de ACL < code> ( Alice , delete) < / code> para un archivo da permiso Alice para eliminar el archivo .

source: Alternative term for an Amazon EC2 access key. See EC2 access key.
es: Término alternativo para una clave de acceso Amazon EC2. Ver clave de acceso EC2.

source: account
es: cuenta

source: accounts
es: cuentas

source: The Object Storage context of an account. Do not confuse with a user account from an authentication service, such as Active Directory, /etc/passwd, OpenLDAP, OpenStack Identity Service, and so on.
es: El contexto de Object Storage de una cuenta . No se debe confundir con una cuenta de usuario de un servicio de autenticación , como Active Directory, / etc / passwd , OpenLDAP , OpenStack Identity Service , y así sucesivamente.

source: account auditor
es: auditor de cuentas

source: Checks for missing replicas and incorrect or corrupted objects in a specified Object Storage account by running queries against the back-end SQLite database.
es: Comprueba si falta réplicas y objetos incorrectos o dañados en una cuenta de Object Storage especificado ejecutando consultas en la base de datos SQLite.

source: account database
es: bases de dato para cuentas

source: A SQLite database that contains Object Storage accounts and related metadata and that the accounts server accesses.
es: Una base de datos SQLite que continene cuentas de Object Storage y metadata relacionada que el servidor de cuentas accede.

source: account reaper
es: cuenta reaper

source: An Object Storage worker that scans for and deletes account databases and that the account server has marked for deletion.
es: Un trabajador de almacenamiento de objetos que escanea y elimina la cuenta de bases de datos y que el servidor cuenta ha marcado para eliminación.

source: account server
es: servidor de cuentas

source: Lists containers in Object Storage and stores container information in the account database.
es: Listas de contenedores en Object Storage y almacena información de contenedores en la base de datos cuenta.

source: account service
es: servicio de cuentas

source: An Object Storage component that provides account services such as list, create, modify, and audit. Do not confuse with OpenStack Identity Service, OpenLDAP, or similar user-account services.
es: Un componente de Object Storage que proporciona servicios de la cuenta como la lista, crear, modificar y auditoría. No debe confundirse con OpenStack Identity Service, OpenLDAP, o servicios por cuenta de usuario similares.

source: accounting
es: contabilidad

source: The Compute service provides accounting information through the event notification and system usage data facilities.
es: El servicio Compute proporciona información contable a través de las instalaciones de notificación de eventos y facilidades de uso del sistema.

source: See access control list.
es: Vea la lista de control de acceso

source: active/active configuration
es: configuracion activa/activa

source: In a high-availability setup with an active/active configuration, several systems share the load together and if one fails, the load is distributed to the remaining systems.
es: En una configuración de alta disponibilidad con una configuración activa / activa, varios sistemas comparten la carga juntos y si uno falla, la carga se distribuye a los sistemas restantes.

source: Authentication and identity service by Microsoft, based on LDAP. Supported in OpenStack.
es: Servicio de autenticacion y identidad de Microsoft, basado en LDAP. Apoyado en OpenStack.

source: active/passive configuration
es: configuracion activa/pasiva

source: In a high-availability setup with an active/passive configuration, systems are set up to bring additional resources online to replace those that have failed.
es: En una configuración de alta disponibilidad con una configuración activa / pasiva, los sistemas están preparados para aportar recursos adicionales en línea para reemplazar a los que han fallado.

source: address pool
es: conjunto de direcciones

source: A group of fixed and/or floating IP addresses that are assigned to a project and can be used by or assigned to the VM instances in a project.
es: Un grupo de direcciones IP fijas y / o flotantes que son asignados a un proyecto y puede ser utilizado por o asignado a las instancias de máquina virtual en un proyecto.

source: admin API
es: API administrativo

source: A subset of API calls that are accessible to authorized administrators and are generally not accessible to end users or the public Internet. They can exist as a separate service (keystone) or can be a subset of another API (nova).
es: Un subconjunto de llamadas a la API que sean accesibles a los administradores autorizados y generalmente no son accesibles a los usuarios comunes o la Internet pública. Pueden existir como un servicio separado (keystone) o pueden ser un subconjunto de otro API (nova).

source: admin server
es: servidor administrativo

source: In the context of the Identity Service, the worker process that provides access to the admin API.
es: En el contexto del Identity Service, el proceso de trabajo que proporciona acceso al API administrativo.

source: Advanced Message Queuing Protocol (AMQP)
es: Advanced Message Queuing Protocol(AMQP) - Protocolo Avanzado De Mensajes En Fila

source: The open standard messaging protocol used by OpenStack components for intra-service communications, provided by RabbitMQ, Qpid, or ZeroMQ.
es: El protocolo estándar abierto de mensajería utilizado por los componentes de OpenStack para comunicaciones de intra-servicio, proporcionado por RabbitMQ, Qpid o ZeroMQ.

source: Advanced RISC Machine (ARM)
es: Advanced RISC Machine (ARM) - Maquina Avanzada RISC

source: Lower power consumption CPU often found in mobile and embedded devices. Supported by OpenStack.
es: CPU de bajo consumo encontrado que a menudo se encuentran en los dispositivos móviles y embebidos. Con el apoyo de OpenStack.

source: alert
es: alerta

source: alerts
es: alertas

source: definition of
es: definicion de

source: The Compute service can send alerts through its notification system, which includes a facility to create custom notification drivers. Alerts can be sent to and displayed on the horizon dashboard.
es: El servicio Compute puede enviar alertas a través de su sistema de notificación, que incluye una ayuda para crear controladores de notificación personalizados. Las alertas pueden enviarse a y se muestran en el panel de control de Horizon.

source: allocate
es: asignar

source: allocate, definition of
es: asignar, definición de

source: The process of taking a floating IP address from the address pool so it can be associated with a fixed IP on a guest VM instance.
es: El proceso de tomar una dirección de IP flotante del conjunto de direcciones por lo que puede estar asociado con una dirección de IP fija en una instancia de VM huésped.

source: Amazon Kernel Image (AKI)
es: Amazon Kernel Image(AKI) - Imagen Kernel De Amazon

source: Both a VM container format and disk format. Supported by Image Service.
es: Tanto un formato contenedor VM y el formato de disco. Con el apoyo de Image Service.

source: Amazon Machine Image (AMI)
es: Amazon Machine Image (AMI) - Imagen de Maquina de Amazon.

source: Amazon Ramdisk Image (ARI)
es: Amazon Ramdisk Image (ARI) - Imagen de Ramdisk de Amazon.

source: A project that ports the shell script-based project named DevStack to Python.
es: Un proyecto que los puertos del proyecto basada en comandos de shell llamado DevStack a Python.

source: The Apache Software Foundation supports the Apache community of open-source software projects. These projects provide software products for the public good.
es: La Apache Software Foundation apoya a la comunidad Apache de proyectos de software de código abierto. Estos proyectos ofrecen productos de software para el bien público.

source: Apache License 2.0
es: Licencia Apache 2.0

source: All OpenStack core projects are provided under the terms of the Apache License 2.0 license.
es: Todos los proyectos básicos OpenStack se proporcionan bajo los términos de la licencia Apache License 2.0.

source: Apache Web Server
es: Servidor Web Apache

source: The most common web server software currently used on the Internet.
es: El software de servidor web más común utilizado actualmente en Internet.

source: Application programming interface.
es: Application programming interface - Interfaz de programación de aplicaciones.

source: API endpoint
es: Punto final del API

source: endpoints
es: punto final

source: API (application programming interface)
es: API (application programming interface) - Interfaz de programación de aplicaciones.

source: The daemon, worker, or service that a client communicates with to access an API. API endpoints can provide any number of services, such as authentication, sales data, performance metrics, Compute VM commands, census data, and so on.
es: El demonio, trabajador, o servicio que un cliente se comunica con el acceso a un API. Puntos finales de API pueden proporcionar cualquier número de servicios, como la autenticación, los datos de ventas, métricas de rendimiento, los comandos de Compute VM, los datos del censo, y así sucesivamente.

source: API extension
es: Extension de API

source: Custom modules that extend some OpenStack core APIs.
es: Módulos personalizados que se extienden algunas APIs básicas OpenStack.

source: API extension plug-in
es: Extensión API plug-in

source: Alternative term for a Networking plug-in or Networking API extension.
es: Término alternativo para un plug-in de redes o API de extensión de redes.

source: API key
es: clave API

source: Alternative term for an API token.
es: Termino alternativo para token de API.

source: API server
es: Servidor de API

source: Any node running a daemon or worker that provides an API endpoint.
es: Cualquier nodo que ejecuta un demonio o un trabajador que proporciona un punto final del API.

source: API token
es: token API

source: Passed to API requests and used by OpenStack to verify that the client is authorized to run the requested operation.
es: Pasadas a solicitudes de el API y utilizada por OpenStack para verificar que el cliente está autorizado para ejecutar la operación solicitada.

source: API version
es: version API

source: In OpenStack, the API version for a project is part of the URL. For example, <filename>example.com/nova/v1/foobar</filename>.
es: En Openstack, la version del API de un proyecto hace parte del URL. Por ejemplo, <filename>example.com/nova/v1/foobar</filename>.

source: A Java program that can be embedded into a web page.
es: Un programa Java que puede ser embebido en una página web.

source: Application Programming Interface (API)
es: Interfaz de programación de aplicaciones (API)

source: A collection of specifications used to access a service, application, or program. Includes service calls, required parameters for each call, and the expected return values.
es: Una colección de especificaciones utilizada para acceder a un servicio, aplicación o programa. Incluye llamadas de servicio, parámetros requeridos para cada llamada, y los valores de retorno esperadas.

source: application server
es: servidor de aplicacion

source: servers
es: servidor

source: application servers
es: servidores de aplicacion

source: A piece of software that makes available another piece of software over a network.
es: Una pieza de software que pone a disposición de otra pieza de software a través de una red.

source: Application Service Provider (ASP)
es: Proveedor de servicios de aplicaciones (ASP)

source: Companies that rent specialized applications that help businesses and organizations provide additional services with lower cost.
es: Empresas que alquilan aplicaciones especializadas que ayudan a las empresas y organizaciones a que ofrezcan servicios adicionales con un costo menor.

source: Address Resolution Protocol (ARP)
es: Address Resolution Protocol (ARP) - Protocolo de Resolucion de Direcciónes.

source: The protocol by which layer-3 IP addresses are resolved into layer-2 link local addresses.
es: El protocolo por el cual las direcciones de capa-3 de IP se resuelven en direcciones locales de capa-2.

source: Tool used for maintaining Address Resolution Protocol packet filter rules in the Linux kernel firewall modules. Used along with iptables, ebtables, and ip6tables in Compute to provide firewall services for VMs.
es: Herramienta utilizada para el mantenimiento de reglas del protocolo de resolución de direcciones en el filtrado de paquetes en los módulos de servidor de seguridad del kernel de Linux . Se utiliza junto con iptables, ebtables y ip6tables en Compute para proporcionar servicios de cortafuegos para las máquinas virtuales.

source: associate
es: asociado

source: associate, definition of
es: asociado, definición de

source: The process associating a Compute floating IP address with a fixed IP address.
es: El proceso de asociar una dirección IP flotante de Compute con una dirección IP fija.

source: Asynchronous JavaScript and XML (AJAX)
es: Asynchronous JavaScript y XML (AJAX)

source: A group of interrelated web development techniques used on the client-side to create asynchronous web applications. Used extensively in horizon.
es: Un grupo de técnicas de desarrollo web utilizados en el lado del cliente para crear aplicaciones web asíncronos. Se utiliza ampliamente en Horizon.

source: ATA over Ethernet (AoE)
es: ATA sobre Ethernet (AoE)

source: A disk storage protocol tunneled within Ethernet.
es: Un protocolo de almacenamiento en disco tunelizado dentro de Ethernet

source: attach
es: adjuntar

source: attach, definition of
es: adjuntar, definición de

source: The process of connecting a VIF or vNIC to a L2 network in Networking. In the context of Compute, this process connects a storage volume to an instance.
es: El proceso de conectar una VIF o vNIC a una red L2 en Redes. En el contexto de Compute, este proceso se conecta un volumen de almacenamiento a una instancia.

source: attachment (network)
es: accesorio (red)

source: Association of an interface ID to a logical port. Plugs an interface into a port.
es: Asociación de un ID de interfaz a un puerto lógico. Se conecta una interfaz a un puerto.

source: auditing
es: auditoría

source: Provided in Compute through the system usage data facility.
es: Ofrecido en Compute a través de la instalación de los datos de uso del sistema.

source: A worker process that verifies the integrity of Object Storage objects, containers, and accounts. Auditors is the collective term for the Object Storage account auditor, container auditor, and object auditor.
es: Un proceso de trabajo que verifica la integridad de los objetos de Object Storage , contenedores, y las cuentas . Auditor es el término colectivo para el auditor de cuentas de Object Storage , auditor de contenedor y auditor de objecto.

source: The code name for the initial release of OpenStack. The first design summit took place in Austin, Texas, US.
es: El nombre clave de la versión inicial de OpenStack . La primera cumbre de diseño se llevó a cabo en Austin, Texas, Estados Unidos.

source: auth node
es: nodo de autenticación

source: Alternative term for an Object Storage authorization node.
es: Término alternativo para un nodo de la autorización de almacenamiento de objetos o Object Storage.

source: authentication
es: autenticación

source: The process that confirms that the user, process, or client is really who they say they are through private key, secret token, password, fingerprint, or similar method.
es: El proceso que confirma que el usuario, el proceso o el cliente es realmente quien dice ser a través de la clave privada, elemento secreto, contraseña, huella digital, o un método similar.

source: authentication token
es: token de autenticación

source: authentication tokens
es: tokens de autenticación

source: A string of text provided to the client after authentication. Must be provided by the user or process in subsequent requests to the API endpoint.
es: Una cadena de texto proporcionada al cliente tras la autenticación. Debe ser proporcionada por el usuario o proceso en las solicitudes posteriores a final de la API .

source: The Identity Service component that provides authentication services.
es: El Identity Service es el componente que proporciona servicios de autenticación.

source: authorization
es: autorización

source: The act of verifying that a user, process, or client is authorized to perform an action.
es: El acto de verificar que un usuario, el proceso o el cliente está autorizado a realizar una acción.

source: authorization node
es: nodo de autorización

source: An Object Storage node that provides authorization services.
es: Un nodo de almacenamiento de objetos que proporciona servicios de autorización

source: The Identity Service component that provides high-level authorization services.
es: El componente de Identity Service que proporciona servicios de autorización de alto nivel.

source: Auto ACK
es: ACK Automatico

source: Configuration setting within RabbitMQ that enables or disables message acknowledgment. Enabled by default.
es: Ajustes de configuración dentro RabbitMQ que activa o desactiva el mensaje de confirmación. Habilitada por defecto.

source: auto declare
es: auto declarar

source: A Compute RabbitMQ setting that determines whether a message exchange is automatically created when the program starts.
es: Un ajuste de RabbitMQ en Compute que determina si un intercambio de mensajes se crea automáticamente cuando se inicia el programa.

source: availability zone
es: zona de disponibilidad

source: An Amazon EC2 concept of an isolated area that is used for fault tolerance. Do not confuse with an OpenStack Compute zone or cell.
es: Un concepto de Amazon EC2 de una zona aislada que se utiliza para la tolerancia a fallos . No debe confundirse con una zona de OpenStack Compute o celula.

source: AWS CloudFormation template
es: Plantilla de AWS CloudFormation

source: AWS CloudFormation allows AWS users to create and manage a collection of related resources. The Orchestration module supports a CloudFormation-compatible format (CFN).
es: AWS CloudFormation permite a los usuarios de AWS para crear y administrar una colección de recursos relacionados. El módulo de Orquestación soporta un formato compatible con CloudFormation (CFN).

source: back-end interactions
es: interraciones del back-end

source: Interactions and processes that are obfuscated from the user, such as Compute volume mount, data transmission to an iSCSI target by a daemon, or Object Storage object integrity checks.
es: Las interacciones y procesos que son ofuscado por parte del usuario , como el montaje de volumen Compute, la transmisión de datos a un destino iSCSI por un demonio, o comprobaciones de integridad objeto en Object Storage.

source: back-end catalog
es: catalogo del back-end

source: catalog
es: catalogo

source: The storage method used by the Identity Service catalog service to store and retrieve information about API endpoints that are available to the client. Examples include a SQL database, LDAP database, or KVS back end.
es: El método de almacenamiento utilizado por el servicio de catálogo del Identity Service para almacenar y recuperar información acerca de los puntos finales del API que están disponibles para el cliente . Los ejemplos incluyen una base de datos SQL , la base de datos LDAP , o al respaldo de KVS.

source: back-end store
es: almacén de back-end

source: store
es: almacén

source: bandwidth
es: ancho de banda

source: The amount of available data used by communication resources, such as the Internet. Represents the amount of data that is used to download things or the amount of data available to download.
es: La cantidad de datos disponibles utilizados por los recursos de comunicación, tales como Internet. Representa la cantidad de datos que se utiliza para descargar cosas o la cantidad de datos disponibles para descargar.

source: Code name of the key management service for OpenStack.
es: Nombre de código del servicio de gestión de claves para OpenStack.

source: bare
es: simple

source: bare, definition of
es: simple, definicion de

source: Bare metal service
es: servicio de metal plano

source: OpenStack project that provisions bare metal, as opposed to virtual, machines. The code name for the project is ironic.
es: Proyecto de OpenStack que hace disposiciones bare-metal, al contratrio de maquinas virtuales. El nombre clave de este proyecto es ironic.
