Repository: 25hours/openstack-manuals
Catalog: doc/glossary/locale/*.po
Languages: es

source: base image
es: imagen base

source: An OpenStack-provided image.
es: Una imagen proporcionada por OpenStack.

source: Bell-LaPadula model
es: Modelo Bell-LaPadula

source: A security model that focuses on data confidentiality and controlled access to classified information. This model divide the entities into subjects and objects. The clearance of a subject is compared to the classification of the object to determine if the subject is authorized for the specific access mode. The clearance or classification scheme is expressed in terms of a lattice.
es: Un modelo de seguridad que se centra en la confidencialidad de los datos y el acceso controlado a la información clasificada. Este modelo divide las entidades en sujetos y objetos. El aclaramiento de un sujeto se compara con la clasificación del objeto para determinar si el sujeto está autorizado para el modo de acceso específico. El esquema de separación o clasificación se expresa en términos de una celosía.

source: A grouped release of projects related to OpenStack that came out in February of 2011. It included only Compute (nova) and Object Storage (swift).
es: Un comunicado agrupadas de proyectos relacionados con OpenStack que salió en febrero de 2011. Se incluyó sólo Compute (nova) y Object Storage (swift).

source: Bexar is the code name for the second release of OpenStack. The design summit took place in San Antonio, Texas, US, which is the county seat for Bexar county.
es: Bexar es el nombre en clave de la segunda versión de OpenStack. La cumbre del diseño se llevó a cabo en San Antonio, Texas, Estados Unidos, que es la sede del condado de condado de Bexar.

source: binary
es: binario

source: Information that consists solely of ones and zeroes, which is the language of computers.
es: La información que consta únicamente de unos y ceros, que es el lenguaje de los computadores.

source: bits, definition of
es: bits, definicion de

source: A bit is a single digit number that is in base of 2 (either a zero or one). Bandwidth usage is measured in bits per second.
es: Un bit es un solo número que se encuentra en la base de 2 (ya sea un cero o uno). El uso de ancho de banda se mide en bits por segundo.

source: bits per second (BPS)
es: bits per second (BPS) - bits por segundo

source: The universal measurement of how quickly data is transferred from place to place.
es: La medición universal de cómo los datos son transferidos mas rapido de un lugar a otro.

source: block device
es: dispositivo de bloques

source: A device that moves data in the form of blocks. These device nodes interface the devices, such as hard disks, CD-ROM drives, flash drives, and other addressable regions of memory.
es: Un dispositivo que mueve los datos en forma de bloques. Estos nodos dispositivos hacen interfaz con otros dispositivos, como discos duros, unidades de CD-ROM, unidades flash, y otras regiones direccionables de memoria.

source: block migration
es: migracion de bloques

source: A method of VM live migration used by KVM to evacuate instances from one host to another with very little downtime during a user-initiated switchover. Does not require shared storage. Supported by Compute.
es: Un método de migración de VM en vivo utilizado por KVM para evacuar a instancias de un host a otro con muy poco tiempo de inactividad durante una conmutación iniciada por el usuario. No requiere almacenamiento compartido. Apoyado por Compute.

source: Block Storage
es: Block Storage - Almacén de Bloques

source: The OpenStack core project that enables management of volumes, volume snapshots, and volume types. The project name of Block Storage is cinder.
es: El proyecto OpenStack núcleo que permite la administración de volúmenes, instantáneas de volumen y tipos de volumen. El nombre del proyecto de Block Storage es cinder.

source: Block Storage API
es: API de Almacén De Bloques.

source: An API on a separate endpoint for attaching, detaching, and creating block storage for compute VMs.
es: Una API en un punto final diferente para unir, separar, y crear almacenamiento de bloques para máquinas virtuales de computación.

source: BMC (Baseboard Management Controller)
es: BMC (Baseboard Management Controller) - Controlador de Gestión De Placa.

source: Baseboard Management Controller. The intelligence in the IPMI architecture, which is a specialized micro-controller that is embedded on the motherboard of a computer and acts as a server. Manages the interface between system management software and platform hardware.
es: Controlador de Gestión De Placa. La inteligencia en la arquitectura IPMI, que es un micro-controlador especializado que está incrustado en la placa base de un computador y actúa como un servidor. Administra la interfaz entre el software de administración de sistemas y hardware de la plataforma .

source: bootable disk image
es: imagen de disco de arranque

source: A type of VM image that exists as a single, bootable file.
es: Un tipo de imagen VM que existe como un solo archivo, de arranque.

source: Bootstrap Protocol (BOOTP)
es: Protocolo Bootstrap (BOOTP)

source: A network protocol used by a network client to obtain an IP address from a configuration server. Provided in Compute through the dnsmasq daemon when using either the FlatDHCP manager or VLAN manager network manager.
es: Un protocolo de red utilizado por un cliente de red para obtener una dirección IP de un servidor de configuración. Ofrecido en Compute través del demonio dnsmasq cuando se utiliza el gestor FlatDHCP o VLAN administrador de red encargado.

source: The Border Gateway Protocol is a dynamic routing protocol that connects autonomous systems. Considered the backbone of the Internet, this protocol connects disparate networks to form a larger network.
es: El Border Gateway Protocol es un protocolo de enrutamiento dinámico que conecta los sistemas autónomos. Considerada como la columna vertebral de la Internet, este protocolo se conecta redes dispares para formar una red más grande.

source: browser
es: navegador

source: browsers, definition of
es: navegador, definicion de

source: Any client software that enables a computer or device to access the Internet.
es: Cualquier software de cliente que permite a un computador o dispositivo para acceder a Internet.

source: builder file
es: archivo constructor

source: builder files
es: archivos contructor

source: Contains configuration information that Object Storage uses to reconfigure a ring or to re-create it from scratch after a serious failure.
es: Contiene información de configuración que Object Storage utiliza para reconfigurar un anillo o para volver a crear desde cero después de un fallo grave.

source: bursting
es: estallido

source: The practice of utilizing a secondary environment to elastically build instances on-demand when the primary environment is resource constrained.
es: La práctica de utilizar un entorno de secundaria para construir elásticamente instancias bajo demanda cuando el entorno primario está limitado de recursos.

source: button class
es: clase botón

source: button classes
es: clases botón

source: A group of related button types within horizon. Buttons to start, stop, and suspend VMs are in one class. Buttons to associate and disassociate floating IP addresses are in another class, and so on.
es: Un grupo de tipos de botones relacionados dentro Horizon. Botones para iniciar, detener y suspender máquinas virtuales están en una clase. Botones para asociar y disociar flotando direcciones IP están en otra clase, y así sucesivamente.

source: bytes, definition of
es: bytes, definicion de

source: Set of bits that make up a single character; there are usually 8 bits to a byte.
es: Conjunto de bits que componen un único carácter; por lo general hay 8 bits a un byte.

source: CA (Certificate/Certification Authority)
es: CA (Certificate/Certification Authority) - Autoridad de Certificación

source: Certificate Authority or Certification Authority. In cryptography, an entity that issues digital certificates. The digital certificate certifies the ownership of a public key by the named subject of the certificate. This enables others (relying parties) to rely upon signatures or assertions made by the private key that corresponds to the certified public key. In this model of trust relationships, a CA is a trusted third party for both the subject (owner) of the certificate and the party relying upon the certificate. CAs are characteristic of many public key infrastructure (PKI) schemes.
es: Autoridad de certificación. En criptografía, una entidad que emite certificados digitales. El certificado digital certifica la posesión de una clave pública por el sujeto llamado del certificado. Esto permite a los demás (partes de confianza) para confiar en firmas o afirmaciones hechas por la clave privada que corresponde a la clave pública certificada. En este modelo de relaciones de confianza, un CA es una tercera parte de confianza, tanto para el sujeto (propietario) del certificado y la parte que confía en el certificado. CA son característicos de muchos esquemas de infraestructura pública (PKI) clave.

source: cache pruner
es: podadora de caché

source: cache pruners
es: podadoras de caché

source: Cactus is a city in Texas, US and is the code name for the third release of OpenStack. When OpenStack releases went from three to six months long, the code name of the release changed to match a geography nearest the previous summit.
es: Cactus es una ciudad en Texas, Estados Unidos y es el nombre en clave de la tercera versión de OpenStack. Cuando los lanzamientos de OpenStack pasaron de tres a seis meses largos, el nombre en clave de la liberación cambió para que coincida con una geografía más cercana a la cumbre anterior.

source: Cloud Auditing Data Federation (CADF) is a specification for audit event data. CADF is supported by OpenStack Identity.
es: Nube Auditoría Federación de Datos (CADF) es una especificación para los datos de eventos de auditoría. CADF es apoyado por Openstack Identity.

source: CALL
es: CALL - LLAMADA

source: One of the RPC primitives used by the OpenStack message queue software. Sends a message and waits for a response.
es: Una de las primitivas RPC utilizados por el software de fila de mensajes en OpenStack. Envía un mensaje y no espera una respuesta.

source: capability
es: capabilidad

source: Defines resources for a cell, including CPU, storage, and networking. Can apply to the specific services within a cell or a whole cell.
es: Define los recursos para una célula, incluyendo CPU, almacenamiento y redes. Se puede aplicar a los servicios específicos dentro de una célula o una célula completa.

source: capacity cache
es: caché capacidad

source: A Compute back-end database table that contains the current workload, amount of free RAM, and number of VMs running on each host. Used to determine on which VM a host starts.
es: Una tabla de bases de datos en Compute que contiene la carga de trabajo actual, la cantidad de memoria RAM libre, y el número de máquinas virtuales que se ejecutan en cada anfitrión . Utilizada para determinar en qué VM un anfitrión inicia.

source: capacity updater
es: actualizador capacidad

source: A notification driver that monitors VM instances and updates the capacity cache as needed.
es: Un conductor de notificaciones que monitorea instancias VM y actualiza el caché de capacidad según sea necesario.

source: One of the RPC primitives used by the OpenStack message queue software. Sends a message and does not wait for a response.
es: Una de las primitivas RPC utilizados por el software de fila de mensajes en OpenStack. Envía un mensaje y no espera una respuesta.

source: A list of API endpoints that are available to a user after authentication with the Identity Service.
es: Una lista de puntos finales de API que están disponibles para un usuario después de la autenticación con el Servicio de Identidad.

source: catalog service
es: servicio de catalogo

source: An Identity Service that lists API endpoints that are available to a user after authentication with the Identity Service.
es: Un Servicio de Identidad que enumera los puntos finales de el API que están disponibles para un usuario después de la autenticación con el Servicio de Identidad.

source: The project name for the Telemetry service, which is an integrated project that provides metering and measuring facilities for OpenStack.
es: El nombre del proyecto para el servicio de telemetría, que es un proyecto integrado que ofrece servicios de medición y medidas de OpenStack.

source: cell
es: célula

source: cells
es: células

source: Provides logical partitioning of Compute resources in a child and parent relationship. Requests are passed from parent cells to child cells if the parent cannot provide the requested resource.
es: Proporciona partición lógica de los recursos Compute en una relación de padre e hijo. Las solicitudes se pasan de células madre a las células del niño si el padre no puede proveer el recurso solicitado.

source: cell forwarding
es: reenvío celular

source: A Compute option that enables parent cells to pass resource requests to child cells if the parent cannot provide the requested resource.
es: Una opción en Compute que permite células madre que pasen las solicitudes de recursos a las células niñas si el padre no puede proveer el recurso solicitado.

source: cell manager
es: gerente celular

source: cell managers
es: gerentes celular

source: The Compute component that contains a list of the current capabilities of each host within the cell and routes requests as appropriate.
es: El componente Compute que contiene una lista de las capacidades actuales de cada huesped dentro de las solicitudes de células y rutas según el caso.

source: A Linux distribution that is compatible with OpenStack.
es: Una distribucion Linux que es compatible con OpenStack.

source: Massively scalable distributed storage system that consists of an object store, block store, and POSIX-compatible distributed file system. Compatible with OpenStack.
es: Sistema masivamente escalable de almacenamiento distribuido que consiste de un almacén de objetos, tienda bloque, y el sistema de archivos distribuido compatible con POSIX. Compatible con OpenStack.

source: The POSIX-compliant file system provided by Ceph.
es: Un systema de archivos compatible con POSIX proporcionado por Ceph.

source: certificate authority
es: autoridad de certificación

source: certificate authority (Compute)
es: autoridad de certificación (Compute)

source: A simple certificate authority provided by Compute for cloudpipe VPNs and VM image decryption.
es: Una autoridad de certificación sencilla proporcionada por Compute para VPNs cloudpipe y VM imagen descifradas.

source: Challenge-Handshake Authentication Protocol (CHAP)
es: Protocolo de autenticación por desafío mutuo (CHAP)

source: An iSCSI authentication method supported by Compute.
es: Un método de autenticación iSCSI apoyado por Compute.

source: chance scheduler
es: planificador oportunidad

source: A scheduling method used by Compute that randomly chooses an available host from the pool.
es: Un método de programación utilizado por Compute que elige al azar un huesped disponible en la piscina.

source: changes since
es: cambios desde

source: A Compute API parameter that downloads changes to the requested item since your last request, instead of downloading a new, fresh set of data and comparing it against the old data.
es: Un parámetro API Compute que descarga cambios en el elemento solicitado desde su última solicitud, en lugar de descargar un nuevo conjunto, fresca de datos y comparandolo con los datos antiguos.

source: An operating system configuration management tool supporting OpenStack deployments.
es: Una herramienta de gestión de la configuración del sistema operativo compatible con despliegues OpenStack.

source: child cell
es: célula hija

source: child cells
es: células hijas

source: If a requested resource such as CPU time, disk storage, or memory is not available in the parent cell, the request is forwarded to its associated child cells. If the child cell can fulfill the request, it does. Otherwise, it attempts to pass the request to any of its children.
es: Si un recurso solicitado tales como tiempo de CPU, almacenamiento en disco, o en la memoria no está disponible en la célula madre, la solicitud se transmitirá a sus células hijas asociadas. Si la célula niña puede cumplir con la solicitud, lo hace. De lo contrario, intenta pasar la solicitud a cualquiera de sus hijos.

source: A core OpenStack project that provides block storage services for VMs.
es: Un proyecto OpenStack central que proporciona servicios de almacenamiento de bloques para máquinas virtuales.

source: A minimal Linux distribution designed for use as a test image on clouds such as OpenStack.
es: Una distribución Linux mínima diseñada para su uso como imagen de prueba en las nubes como OpenStack.

source: Cisco neutron plug-in
es: Plug-in de neutron Cisco

source: A Networking plug-in for Cisco devices and technologies, including UCS and Nexus.
es: Un plug-in de red para los dispositivos y tecnologías de Cisco, incluyendo UCS y Nexus.

source: cloud architect
es: Arquitecto de Nubes

source: A person who plans, designs, and oversees the creation of clouds.
es: Una persona que planifica, diseña y supervisa la creación de nubes.

source: cloud computing
es: la computación en nube

source: A model that enables access to a shared pool of configurable computing resources, such as networks, servers, storage, applications, and services, that can be rapidly provisioned and released with minimal management effort or service provider interaction.
es: Un modelo que permite el acceso a un conjunto compartido de recursos informáticos configurables, tales como redes, servidores, almacenamiento, aplicaciones y servicios, que pueden ser rápidamente aprovisionados y liberados con mínimo esfuerzo de administración o la interacción proveedor de servicios.

source: cloud controller
es: controlador de la nube

source: cloud controllers
es: controladores de la nube

source: Collection of Compute components that represent the global state of the cloud; talks to services, such as Identity Service authentication, Object Storage, and node/storage workers through a queue.
es: Colección de componentes Compute que representan el estado global de la nube; comunica a servicios, como la autenticación de Identity Service, almacenamiento de objetos, y los trabajadores nodo / almacenamiento a través de una fila.

source: cloud controller node
es: nodo del controlador nube

source: cloud controller nodes
es: nodos del controlador nube

source: A node that runs network, volume, API, scheduler, and image services. Each service may be broken out into separate nodes for scalability or availability.
es: Un nodo que ejecuta los servicios de red, volumen, API, planificador, y de imagen. Cada servicio puede ser divididos en nodos separados para escalabilidad o disponibilidad.

source: Cloud Data Management Interface (CDMI)
es: Cloud Data Management Interface (CDMI) - Interfaz de Gestion de Data Nube

source: SINA standard that defines a RESTful API for managing objects in the cloud, currently unsupported in OpenStack.
es: SINA estándar que define una API REST para la gestión de los objetos en la nube, actualmente no soportado en OpenStack.

source: Cloud Infrastructure Management Interface (CIMI)
es: Cloud Infrastructure Management Interface (CIMI) - Interfaz de Gestion de Infrastructura Nube

source: An in-progress specification for cloud management. Currently unsupported in OpenStack.
es: Una especificación en curso para la gestión de la nube. Actualmente no soportado en OpenStack.

source: A package commonly installed in VM images that performs initialization of an instance after boot using information that it retrieves from the metadata service, such as the SSH public key and user data.
es: Un paquete comúnmente instalada en imágenes de VM que realiza la inicialización de una instancia después de arrancar utilizando la información que se recupera del servicio de metadatos, tales como la clave pública SSH y datos de usuario.

source: One of the default roles in the Compute RBAC system. Grants complete system access.
es: Uno de los roles por defecto en el sistema RBAC de Compute. Provee acceso al sistema completo.

source: A Windows project providing guest initialization features, similar to cloud-init.
es: Un proyecto de Windows proporciona funciones de inicialización de huéspedes, similar a la cloud-init.

source: A compute service that creates VPNs on a per-project basis.
es: Un servicio de cómputo que crea VPNs en una base por proyecto.

source: cloudpipe image
es: imagen cloudpipe

source: A pre-made VM image that serves as a cloudpipe server. Essentially, OpenVPN running on Linux.
es: Una imagen pre-hecha VM que sirve como un servidor cloudpipe. Esencialmente, OpenVPN se ejecuta en Linux.

source: CMDB (Configuration Management Database)
es: CMDB (Base de Datos de Gestión de la Configuración)

source: Configuration Management Database.
es: Base de Datos de Gestión de la Configuración

source: command filter
es: filtro de comandos

source: command filters
es: filtros de comando

source: Lists allowed commands within the Compute rootwrap facility.
es: Lista comandos permitidos dentro de la instalación rootwrap Compute.

source: community project
es: proyecto comunitario

source: community projects
es: proyectos comunitarios

source: A project that is not officially endorsed by the OpenStack Foundation. If the project is successful enough, it might be elevated to an incubated project and then to a core project, or it might be merged with the main code trunk.
es: Un proyecto que no está oficialmente aprobada por la Fundación OpenStack. Si el proyecto tiene el éxito suficiente, podría ser elevado a un proyecto incubado y luego a un proyecto básico, o podría fusionarse con el código tronco principal.

source: compression
es: compresión

source: The OpenStack core project that provides compute services. The project name of Compute service is nova.
es: El proyecto básico OpenStack que ofrece servicios informáticos. El nombre del proyecto de servicio Compute es nova.

source: Compute API
es: API de Compute

source: The <systemitem class="service">nova-api</systemitem> daemon provides access to nova services. Can communicate with other APIs, such as the Amazon EC2 API.
es: El <systemitem class="service">nova-api</systemitem> demonio proporciona acceso a servicios nova. Puede comunicarse con otros APIs, como la API de Amazon EC2.

source: compute controller
es: controlador de cómputo

source: The Compute component that chooses suitable hosts on which to start VM instances.
es: El componente Compute que elige huéspedes adecuados en los que para iniciar las instancias de VM.

source: compute host
es: huesped de cómputo

source: Physical host dedicated to running compute nodes.
es: Huesped físico dedicado a la ejecución nodos de cómputo.

source: compute node
es: nodo de cómputo

source: compute nodes
es: nodos de cómputo

source: A node that runs the <systemitem class="service">nova-compute</systemitem> daemon that manages VM instances that <phrase role="keep-together">provide</phrase> a wide range of services, such as web applications and analytics.
es: Un nodo que ejecuta el demonio <clase systemitem = "service"> nova-compute </ systemitem> que maneja instancias de VM que <función phrase = "keep-together"> proporcionan</ phrase> una amplia gama de servicios, como la aplicaciones web y de análisis.

source: Compute service
es: Servicio Compute

source: Name for the Compute component that manages VMs.
es: Nombre para el componente Compute que maneja las máquinas virtuales.

source: compute worker
es: trabajador compute
