Repository: 25hours/openstack-manuals
Catalog: doc/glossary/locale/*.po
Languages: es

source: An IP address that is accessible to end-users.
es: Una dirección IP que sea accesible a los usuarios.

source: public key authentication
es: autenticación de clave pública

source: Authentication method that uses keys rather than passwords.
es: Método de autenticación que utiliza claves en lugar de las contraseñas .

source: public network
es: red publica

source: quarantine
es: cuarentena

source: The router advertisement daemon, used by the Compute VLAN manager and FlatDHCP manager to provide routing services for VM instances.
es: El demonio de anuncio de enrutador, que utiliza el gestor Compute VLAN y FlatDHCPmanager para proporcionar servicios de enrutamiento para las instancias de VM.

source: RAM filter
es: filtro de RAM

source: rate limit
es: límite de velocidad

source: rate limits
es: límites de velocidad

source: raw
es: crudo

source: raw format
es: formato crudo

source: reboot
es: reiniciar

source: hard vs. soft
es: duro vs suave

source: rebuild
es: reconstruir

source: rebuilding
es: reconstrucción

source: record
es: registro

source: records
es: registros

source: record ID
es: registro de ID

source: record IDs
es: registros de ID

source: reference architecture
es: arquitectura de referencia

source: registry
es: registro

source: registry server
es: servidor de registro

source: registry servers
es: servidores de registros

source: replica
es: réplica

source: replication
es: replicación

source: replica count
es: recuento de réplica

source: replicator
es: replicador

source: replicators
es: replicadores

source: resize
es: cambiar el tamaño

source: resizing
es: cambiando el tamaño

source: ring
es: anillo

source: rings
es: anillos

source: role
es: papel

source: roles
es: papeles

source: RPC driver
es: Controlador RPC

source: drivers
es: controladores

source: RPC drivers
es: Controladores RPC

source: RXTX cap
es: Tope RXTX

source: RXTX quota
es: Cuota RXTX

source: S3 storage service
es: Servicio de almacenamiento S3

source: secret key
es: clave secreta

source: security group
es: grupo de seguridad

source: security groups
es: grupos de seguridad

source: segmented object
es: objeto segmentado

source: segmented objects
es: objetos segmentados

source: server
es: servidor

source: server image
es: imagen de servidor

source: Alternative term for a VM image.
es: Término alternativo para una imagen de una máquina virtual.

source: server UUID
es: UUID de servidor

source: service
es: servicio

source: services
es: servicios

source: service catalog
es: catalogo de servicios

source: service ID
es: ID de servicio

source: service provider
es: proveedor de servicio

source: service registration
es: registro de servicio

source: service tenant
es: inquilino de servicio

source: service token
es: token de servicio

source: sessions
es: sesiones

source: session storage
es: almacenamiento de sesión

source: shared IP address
es: direccion IP compartido

source: shared
es: compartido

source: shared IP group
es: grupo de IP compartido

source: shared IP groups
es: grupos de IP compartidos

source: shared storage
es: almacenamiento compartido

source: static IP address
es: direccion IP estático

source: static
es: estático

source: static IP addresses
es: direcciones IP estáticos

source: storage node
es: nodo de almacenamiento

source: storage nodes
es: nodos de almacenamiento

source: storage manager
es: gestor de almacenamiento

source: storage
es: almacenamiento

source: storage services
es: servicios de almacenamiento

source: strategy
es: estrategia

source: subdomain
es: subdominio

source: subdomains
es: subdominios

source: subnet
es: subred

source: suspend
es: suspender

source: swap, definition of
es: swap, definicion de

source: sysadmin
es: administrador de sistemas

source: token services
es: servicios de token

source: updater
es: actualizador

source: updaters
es: actualizadores

source: user
es: usuario

source: user data
es: data de usuario

source: virtual IP
es: IP virtual

source: virtual machine (VM)
es: maquina virtual

source: virtual network
es: red virtual

source: virtual port
es: puerto virtual

source: virtual server
es: servidor virtual

source: virtual servers
es: servidores virtuales

source: virtual VLAN
es: VLAN virtual

source: VLAN network
es: red VLAN

source: VM image
es: imagen VM

source: VMware API
es: API de VMware

source: volume
es: volumen

source: volume controller
es: controlador de volumen

source: volume ID
es: ID de volumen

source: A Block Storage node that runs the <systemitem class="service">cinder-volume</systemitem> daemon.
es: Un nodo de Block Storage que ejecuta el demonio <systemitem class="service">cinder-volume</systemitem>.

source: volume worker
es: trabajador de volumen

source: volume workers
es: trabajadores de volumen

source: A cinder component that interacts with back-end storage to manage the creation and deletion of volumes and the creation of compute volumes, provided by the <systemitem class="service">cinder-volume</systemitem> daemon.
es: Un componente de Cinder que interactúa con el back-end de almacenamiento para gestionar la creación y eliminación de volúmenes y la creación de volúmenes de cómputo, proporcionado por el demonio de <systemitem class="service">cinder-volume</systemitem>.

source: worker
es: trabajador

source: workers
es: trabajadores

source: Xen API
es: API de Xen

source: XenServer hypervisor
es: Hipervisor XenServer

source: translator-credits
es: Creditos de traductores.
