Repository: 25hours/openstack-manuals
Catalog: doc/common/locale/*.po
Languages: fr

source: OpenStack dashboard
fr: Tableau de bord OpenStack

source: The OpenStack dashboard is a modular <link href="https://www.djangoproject.com/">Django web application</link> that provides a graphical interface to OpenStack services.
fr: Le tableau de bord OpenStack est une <link href="https://www.djangoproject.com/">Django web application</link> modulaire qui fournit une interface graphique pour les services OpenStack.

source: The dashboard is usually deployed through <link href="http://code.google.com/p/modwsgi/">mod_wsgi</link> in Apache. You can modify the dashboard code to make it suitable for different sites.
fr: Le tableau de bord est généralement déployé par <link href="http://code.google.com/p/modwsgi/">mod_wsgi</link> dans Apache. Vous pouvez modifier le code du tableau de bord pour qu'il convienne des autres sites web.

source: From a network architecture point of view, this service must be accessible to customers and the public API for each OpenStack service. To use the administrator functionality for other services, it must also connect to Admin API endpoints, which should not be accessible by customers.
fr: Du point de vue de l'architecture réseau, ce service doit être accessible aux clients et à l'API publique pour chaque service d’OpenStack). Pour utiliser la fonctionnalité d'administrateur pour d'autres services, il faut aussi se connecter aux terminaisons de l'API d'administration, qui ne doivent pas être accessibles par les clients.

source: Configure the dashboard for HTTP
fr: Configurer le tableau de bord pour HTTP

source: The following example shows this setting:
fr: L'exemple suivant décrit ce paramètre :

source: Restart Apache http server. For Ubuntu/Debian/SUSE:
fr: Redémarrer la serveur Apache http. Pour Ubuntu/Debian/SUSE:

source: or for Fedora/RHEL/CentOS:
fr: ou pour Fedora/RHEL/CentOS:

source: User management
fr: Gestion des utilisateurs

source: The main components of Identity user management are:
fr: Les trois concepts majeurs de la gestion des utilisateurs sont :

source: <emphasis role="bold">User</emphasis>. Represents a human user. Has associated information such as user name, password, and email. This example creates a user named <literal>alice</literal>:
fr: Un <emphasis role="bold">User</emphasis> représente un utilisateur humain, et possède des informations associées telles que le nom d'utilisateur, un mot de passe, et un email. Par exemple, la création de l'utilisateur nommé <literal>alice</literal> :

source: <emphasis role="bold">Role</emphasis>. Captures the operations that a user can perform in a given tenant.
fr: Un <emphasis role="bold">Role</emphasis> récapitule quelles opérations un utilisateur est en droit d'effectuer dans un ensemble donné. Cet exemple est la création d'un rôle nommé « compute-user » :

source: The Identity Service assigns a tenant and a role to a user. You might assign the <literal>compute-user</literal> role to the <literal>alice</literal> user in the <literal>acme</literal> tenant:
fr: Le service Identité associe un utilisateur à un ensemble et un rôle. Pour continuer nos exemples précédents, nous allons vouloir associer à l'utilisateur <literal>alice</literal> le rôle <literal>compute-user</literal> dans l'ensemble <literal>acme</literal> :

source: A user can have different roles in different tenants. For example, Alice might also have the <literal>admin</literal> role in the <literal>Cyberdyne</literal> tenant. A user can also have multiple roles in the same tenant.
fr: Un utilisateur peut se voir attribuer des rôles différents dans des ensembles différents : Par exemple, Alice peut aussi avoir le rôle <literal>admin</literal> dans l'ensemble <literal>Cyberdyne</literal>. On peut aussi attribuer à un individu plusieurs rôles dans le même ensemble.

source: The <filename>/etc/<replaceable>[SERVICE_CODENAME]</replaceable>/policy.json</filename> file controls the tasks that users can perform for a given service. For example, <filename>/etc/nova/policy.json</filename> specifies the access policy for the Compute service, <filename>/etc/glance/policy.json</filename> specifies the access policy for the Image service, and <filename>/etc/keystone/policy.json</filename> specifies the access policy for the Identity Service.
fr: Le <filename>/etc/<replaceable>[SERVICE_CODENAME]</replaceable>/policy.json</filename> contrôle ce que les utilisateurs ont le droit de faire dans un service donné. Par exemple,<filename>/etc/<replaceable>[SERVICE_CODENAME]</replaceable>/policy.json</filename> spécifie la politique d'accès au service Calcul, <filename>/etc/glance/policy.json</filename>spécifie la politique d'accès au service Image,et <filename>/etc/keystone/policy.json</filename> spécifie la politique d'accès au service d'Identité.

source: The default <filename>policy.json</filename> files in the Compute, Identity, and Image service recognize only the <literal>admin</literal> role: all operations that do not require the <literal>admin</literal> role are accessible by any user that has any role in a tenant.
fr: Les fichiers par défaut <filename>policy.json</filename> dans les services Calcul, Identité, et Image reconnaissent seulement le rôle <literal>admin</literal> . Toutes les opérations qui ne nécessitent pas le rôle <literal>admin</literal> seront accessibles par tout utilisateur ayant n'importe quel rôle dans un ensemble.

source: If you wish to restrict users from performing operations in, say, the Compute service, you need to create a role in the Identity Service and then modify <filename>/etc/nova/policy.json</filename> so that this role is required for Compute operations.
fr: Si vous voulez restreindre les permissions des utilisateurs d'effectuer des opérations dans par exemple le service Calcul, vous devez créer un rôle dans le service Identité, et modifier <filename>/etc/nova/policy.json</filename> pour que ce rôle soit nécessaire afin d'effectuer des opérations de Calcul.

source: For example, this line in <filename>/etc/nova/policy.json</filename> specifies that there are no restrictions on which users can create volumes: if the user has any role in a tenant, they can create volumes in that tenant.
fr: Par exemple, cette ligne dans <filename>/etc/nova/policy.json</filename> spécifies qu'il n'y a aucune restriction concernant la création de volumes par les utilisateurs : si l'utilisateur a un rôle quelconque dans un ensemble, il sera capable de créer des volumes dans cet ensemble.

source: To restrict creation of volumes to users who had the <literal>compute-user</literal> role in a particular tenant, you would add <literal>"role:compute-user"</literal>, like so:
fr: Si on souhaite restreindre la création de volume aux utilisateurs qui ont le rôle <literal>compute-user</literal> dans un ensemble particulier, il faudrait ajouter <literal>"role:compute-user"</literal>, ainsi :

source: To restrict all Compute service requests to require this role, the resulting file would look like:
fr: Si on souhaite que toutes les requêtes de Calcul soient soumise à la possession de ce rôle, le fichier qu'il en résulterait ressemblerait à ceci :

source: Manage Compute service quotas
fr: Gérer les quotas du service Calcul

source: Number of floating IP addresses allowed per tenant.
fr: Nombre d'adresses IP flottantes allouées par projet.

source: Number of key pairs allowed per user.
fr: Nombre de paires de clefs alloué par utilisateur.

source: Number of security groups per tenant.
fr: Nombre de groupes de sécurité par projet.

source: Number of rules per security group.
fr: Nombre de règles par groupe de sécurité.

source: To view and update default quota values
fr: Pour voir et mettre à jour les valeurs par défaut des quotas

source: For example:
fr: Par exemple :

source: key
fr: clé

source: value
fr: valeur

source: tenantName
fr: Nom du locataire

source: Obtain the tenant ID, as follows:
fr: Obtenir l'identité du locataire, comme suit:

source: Update a particular quota value, as follows:
fr: Mettre à jour une valeur de quota particulier, comme suit:

source: quotaName
fr: Nom du quota

source: tenantID
fr: Identifiant du locataire

source: userName
fr: Nom d'utilisateur

source: User data
fr: Données utilisateur

source: User data is the mechanism by which a user can pass information contained in a local file to an instance at launch time. The typical use case is to pass something like a shell script or a configuration file as user data.
fr: User data est le mécanisme par lequel un utilisateur peut faire passer des informations contenues dans un fichier local à une instance au lancement de celle-ci. Le cas d'utilisation typique est de faire passer quelque chose comme un script shell ou un fichier de configuration en tant que user data.

source: User data is sent using the <literal>--user-data <replaceable>/path/to/filename</replaceable></literal> option when calling <placeholder-1/>. This example creates a text file and sends its contents as user data to the instance:
fr: User data est envoyé en utilisant l'option <literal>--user-data <replaceable>/path/to/filename</replaceable></literal> à l'appel de <placeholder-1/>. L'exemple suivant créé un fichier texte et ensuite envoie le contenu de ce fichier en tant que user data à l'instance.

source: The instance can get user data by querying the metadata service through either the OpenStack metadata API or the EC2 compatibility API:
fr: L'instance peut retrouver user data en interrogeant le service de métadonnées à utiliser soit l'API de métadonnées OpenStack soit l'API de compatibilité EC2:

source: The Compute service treats user data as a blob. While the previous example uses a text file, user data can be in any format.
fr: Notez que le service Compute traite user data tel un blob. Tandis que l'exemple ci dessus utilise un fichier texte, user data peut être dans n'importe quel format.

source: To do something useful with the user data, you must configure the virtual machine image to run a service on boot that gets user data from the metadata service and takes some action based on the contents of the data. The <package>cloud-init</package> package does exactly this. This package is compatible with the Compute metadata service and the Compute configuration drive.
fr: Pour faire quelque chose d'utile avec les données utilisateur , l'image de la machine virtuelle doit être configurée pour exécuter un service au lancement qui retrouve les données utilisateur depuis le service métadonnées et faire quelque actions basées sur le contenu des données. Le paquet <package>cloud-init</package> a été inventé pour faire exactement cela. En particulier, cloud-init est compatible avec le service de métadonnées Compute ainsi que le Compute config drive..

source: The <package>cloud-init</package> package supports multiple cloud providers. You can use the same virtual machine image in different clouds without modification. The <package>cloud-init</package> package is an open source project and the source code is available on <link href="http://launchpad.net/cloud-init">Launchpad</link>. It is maintained by Canonical, the company that runs the Ubuntu project. All Ubuntu cloud images come pre-installed with <package>cloud-init</package>. However, <package>cloud-init</package> is not designed to be Ubuntu-specific and has been successfully ported to several other platforms including Fedora.
fr: Notez que <package>cloud-init</package> n'est pas une technologie OpenStack. Plutôt, il s'agit d'un paquet qui est fait pour supporter plusieurs fournisseurs de cloud, de sorte que la même image de machine virtuelle peut être utilisée dans différents clouds sans modification. <package>cloud-init</package> est un projet open source, et le code source est disponible sur <link href="http://launchpad.net/cloud-init">Launchpad</link>. Il est maintenu par Canonical, L'entreprise qui travaille sur le projet Ubuntu. Toutes les images Ubuntu sont distribuées avec <package>cloud-init</package> pré-installé. Cependant, <package>cloud-init</package> n'est pas fait pour être spécifique à Ubuntu, et a été porté avec succès sur Fedora.

source: Even if you do not use user data to configure instance behavior at boot time, install <package>cloud-init</package> on images that you create because this package provides useful functionality. For example, the <package>cloud-init</package> package enables you to copy the public key to an account (the <literal>ubuntu</literal> account by default on Ubuntu instances, the <literal>ec2-user</literal> by default in Fedora instances).
fr: Nous recommandons d'installer <package>cloud-init</package> sur les images que vous créez pour simplifier la tâche de configuration de vos instances au lancement. Même si vous ne voulez pas utiliser de données utilisateur pour configurer le comportement de l'instance au lancement, <package>cloud-init</package> fournit des fonctionnalités utiles tels que copier la clé public dans un compte (le compte <literal>ubuntu</literal> par défaut sur les instances Ubuntu,le <literal>ec2-user</literal> par défaut dans les instances Fedora).

source: If you do not have <package>cloud-init</package> installed, you must manually configure your image to get the public key from the metadata service on boot and copy it to the appropriate account.
fr: Si vous n'avez pas installé <package>cloud-init</package>, vous devrez configurer votre image manuellement pour retrouver la clé publique depuis le service métadonnées au lancement et le copier dans le compte approprié.

source: <package>cloud-init</package> supported formats and documentation
fr: Documentation et formats supportés par <package>cloud-init</package>

source: Look at the <package>cloud-init</package><link href="http://bazaar.launchpad.net/~cloud-init-dev/cloud-init/trunk/view/head:/doc/userdata.txt">doc/userdata.txt</link> file the <link href="http://bazaar.launchpad.net/~cloud-init-dev/cloud-init/trunk/files/head:/doc/examples/">examples</link> directory and the <link href="https://help.ubuntu.com/community/CloudInit">Ubuntu community documentation</link> for details about how to use <package>cloud-init</package>. Some basic examples are provided here.
fr: Nous recommandons d'aller jeter un œil au fichier <package>cloud-init</package> <link href="http://bazaar.launchpad.net/~cloud-init-dev/cloud-init/trunk/view/head:/doc/userdata.txt">doc/userdata.txt</link>, des<link href="http://bazaar.launchpad.net/~cloud-init-dev/cloud-init/trunk/files/head:/doc/examples/">examples</link> ainsi que la <link href="https://help.ubuntu.com/community/CloudInit">Ubuntu community documentation</link> pour des détails concernant comment utiliser <package>cloud-init</package>. Nous proposons quelques exemples basiques ici.

source: Shell scripts (starts with <literal>#!</literal>)
fr: Scripts Shell (<literal>#!</literal>)

source: Cloud config files (starts with <literal>#cloud-config</literal>)
fr: Fichiers de configuration de cloud(commence par <literal>#cloud-config</literal>)

source: Run a shell script on boot
fr: Exécuter un script shell au boot

source: Assuming you have <package>cloud-init</package> installed, the simplest way to configure an instance on boot is to pass a shell script as user data. The shell file must begin with <literal>#!</literal> in order for <package>cloud-init</package> to recognize it as a shell script. This example shows a script that creates a <literal>clouduser</literal> account:
fr: En supposant que vous avez installé <package>cloud-init</package>, le moyen le plus simple pour configurer une instance durant le boot est de faire passer un script shell en tant que données utilisateur. Le fichier shell doit commencer par <literal>#!</literal> pour que <package>cloud-init</package> le reconnaisse comme script shell. Voici un exemple de script qui créée un compte nommé <literal>clouduser</literal>.

source: Sending a shell script as user data has a similar effect to writing an <filename>/etc/rc.local</filename> script: it executes very late in the boot sequence as root.
fr: Envoyer un script shell en tant que données utilisateur a un effet similaire à écrire un script <filename>/etc/rc.local</filename>:il sera exécuté très tard dans la séquence de boot en tant que root.

source: Cloud-config format
fr: Format Cloud-config

source: <package>cloud-init</package> supports a YAML-based config format that allows the user to configure a large number of options on a system. User data that begins with <literal>#cloud-config</literal> will be interpreted by <package>cloud-init</package> as cloud-config format.
fr: <package>cloud-init</package> supporte un format de configuration basé sur YAML qui permet à l'utilisateur de configurer un grand nombre d'options sur un système. Les données utilisateur commençant par <literal>#cloud-config</literal> seront interprétées par <package>cloud-init</package> en tant que format de configuration de cloud.

source: Example: Set the host name
fr: <package>cloud-init</package>

source: This <package>cloud-init</package> user data example sets the hostname and the FQDN, as well as updating <filename>/etc/hosts</filename> on the instance:
fr: Cet exemple de données utilisateur <package>cloud-init</package> fixe un nom d'hôte et le FQDN, et met à jour <filename>/etc/hosts</filename> dans l'instance:

source: Example: Configure instances with Puppet
fr: Exemple: Configurer des instances avec Puppet

source: Example: Configure instances with Chef
fr: Exemple : Configurer les instances avec Chef

source: Conceptual architecture
fr: Principe de l’architecture

source: The following diagram shows the relationships among the OpenStack services:
fr: Le diagramme suivant montre une vue schématisée et simplifiée de l’architecture d’OpenStack du point de vue de l’utilisateur.

source: OpenStack conceptual architecture
fr: Principe de l’architecture de l'OpenStack

source: Service management
fr: Gestion des services

source: The Identity Service provides identity, token, catalog, and policy services. It consists of:
fr: Le service d'identité met à disposition des services d'identité, jeton, catalogue, et politique. Il s'agit de:

source: The Identity Service also maintains a user that corresponds to each service, such as, a user named <emphasis>nova</emphasis> for the Compute service, and a special service tenant called <emphasis>service</emphasis>.
fr: Le service d'identité conserve également un utilisateur qui correspond à chaque service, par exemple, un utilisateur qui s'appelle <emphasis>nova</emphasis> qui correspond avec le service Calcul, et un locataire de service en particulier qui s'appelle <emphasis>service</emphasis>.

source: Manage images with the nova client
fr: Gérer les images avec le client nova

source: The safest approach is to shut down the instance before you take a snapshot.
fr: L'approche le plus sûr, c'est d'arrêter l'instance avant de prendre l'instantané.

source: You cannot create a snapshot from an instance that has an attached volume. Detach the volume, create the image, and re-mount the volume.
fr: Vous ne pouvez pas créer un instantané d'une unstance qui a un volume attaché. Détachez le volume, créez l'image, et puis remonter le volume.

source: To create an image
fr: Pour créer un image

source: To create the image, list instances to get the server ID:
fr: Pour créer l'image, listez les instances pour trouver l'ID du serveur:

source: Get details for your image to check its status:
fr: Trouver les détails de votre image pour vérifier son état:

source: To launch an instance from your image
fr: Pour lancer une instance depuis votre image

source: To launch an instance from your image, include the image ID and flavor ID, as follows:
fr: Pour lancer une instance depuis votre image, inclure l'ID de l'image et l'ID du type d'instance, comme suite:

source: Troubleshoot image creation
fr: Résoudre les problèmes de la création des images

source: Create and manage networks
fr: Créez et gérez des réseaux

source: Create networks
fr: Créez des réseaux

source: Create a network:
fr: Créez un réseau

source: Create subnets
fr: Créez des sous-réseaux

source: Create a subnet:
fr: Créez un sous-réseau

source: Create routers
fr: Créer des routeurs

source: ROUTER
fr: ROUTEUR

source: NETWORK
fr: RESEAU

source: Link the router to the subnet:
fr: Liez le routeur au sous-réseau:

source: Create ports
fr: Créer des ports

source: Create a port with specified IP address:
fr: Créer un port avec une adresse IP précisée:

source: Create a port without specified IP address:
fr: Créer un port sans une adresse IP précisée:

source: Storage nodes
fr: Noeuds de stockage

source: Object Storage (swift)
fr: Stockage d'Objet (rapide)

source: For example, you can run the <placeholder-1/> and <placeholder-2/> commands, as follows:
fr: Par exemple, vous pouvez exécuter les commandes <placeholder-1/> et <placeholder-2/>, comme suit:

source: token
fr: jeton

source: endpoint
fr: Point de terminaison

source: Use the <filename>/etc/keystone/logging.conf</filename> file to configure the location of log files.
fr: Utilisez le fichier <filename>/etc/keystone/logging.conf</filename> pour configurer la location des fichiers journaux.

source: Debug PKI middleware
fr: Déboguer l'intergiciel PKI.

source: This command fetches the signing certificate:
fr: Cette commande récupère le certificat de signature:

source: Note the expiration dates of the certificate:
fr: Notez les dates d'expiration du certificat:

source: Check the version:
fr: Vérifiez la version:

source: Troubleshoot Compute
fr: Résoudre les problèmes Calcul

source: Common problems for Compute typically involve misconfigured networking or credentials that are not sourced properly in the environment. Also, most flat networking configurations do not enable <placeholder-1/> or <placeholder-2/> from a compute node to the instances that run on that node. Another common problem is trying to run 32-bit images on a 64-bit compute node. This section shows you how to troubleshoot Compute.
fr: Les erreurs fréquentes avec Calcul impliquent généralement un réseau mal configuré ou des identifiants qui ne sont pas correctement sourcés dans l'environnement. De plus, la plupart des configurations de réseaux plats ne permettent pas de <placeholder-1/> or <placeholder-2/> à partir d'un nœud de calcul pour les instances en cours d'exécution sur ce nœud. Un autre problème fréquent est d'essayer d'exécuter des images 32 bits sur un nœud de calcul 64-bit. Cette section propose plus d'informations sur la façon de résoudre les problèmes de Calcul.

source: Compute stores a log file for each service in <filename>/var/log/nova</filename>. For example, <filename>nova-compute.log</filename> is the log for the <systemitem class="service">nova-compute</systemitem> service. You can set the following options to format log strings for the nova.log module in the <filename>nova.conf</filename> file:
fr: Les fichiers Log sont stockés dans <filename>/var/log/nova</filename> et il y a un fichier log pour chaque service, par exemple <filename>nova-compute.log</filename>. Vous pouvez formater les chaines log en utilisant les options pour le nova.log module. Les options utilisées pour définir les chaînes de format sont :
