Repository: 25hours/openstack-manuals
Catalog: doc/common/locale/*.po
Languages: fr

source: Example: 10GB first disk, 30GB/core second disk
fr: Exemple: 10GB premier disque, 30GB/core second disque

source: Example: 1TB "extra hard drive"
fr: Exemple: 1TB "disque dur supplémentaire"

source: Example: 10s of TBs of data set storage
fr: Exemple: Des dizaines de TB de stockage destiné aux données

source: Add security group and rules
fr: Ajouter un groupe de sécurité et des règles

source: The following procedure shows you how to add security groups and add rules to the default security group.
fr: Le procédure suivant vous montre comment ajouter les groupes de sécurité et ajouter des règles au groupe de sécurité par défaut.

source: Add or delete a security group
fr: Ajouter ou supprimer un groupe de sécurité

source: All the traffic originated by the instances (outbound traffic) is allowed
fr: Tout trafic créé par des instances (trafic sortant) est autorisé.

source: All the traffic destined to instances (inbound traffic) is denied
fr: Tout trafic à destination des instances (trafic entrant) est refusé.

source: All the instances inside the group are allowed to talk to each other
fr: Tous les instances dans le groupe peuvent communiquer entre elles.

source: You can add extra rules into the default security group for handling the egress traffic. Rules are ingress only at this time.
fr: Vous pouvez ajouter des règles supplémentaires dans le groupe de sécurité par défaut afin de gérer le trafic de sortie. Les règles concerne le trafic d'entrée uniquement à ce stade-là.

source: Modify security group rules
fr: Modifier les règles du groupe de sécurité

source: Port at start of range.
fr: Port au début de la gamme.

source: Port at end of range.
fr: Port à la fin de la gamme.

source: The CIDR notation
fr: La notation CIDR

source: User
fr: Utilisateur

source: Credentials
fr: Information d'Authentification

source: Token
fr: Jeton/Token

source: Tenant
fr: Ensemble/Tenant

source: Endpoint
fr: Destination

source: Role
fr: Rôle

source: Features and benefits
fr: Traits et avantages

source: Features
fr: Traits

source: Benefits
fr: Avantages

source: Unlimited storage
fr: Stockage illimité

source: Integration with Compute
fr: Intégration avec calcul

source: No shared storage across processes or workers.
fr: Aucun stockage possible au niveau des processus ou des nœuds d'exécutions.

source: No persistence after a process terminates.
fr: Aucun persistance après la terminaison du processus.

source: Requirements:
fr: Exigences:

source: Memcached service running and accessible.
fr: Le service en Memcache tourne et est accessible.

source: Enabled by:
fr: Activé par:

source: Enter the MySQL root user's password when prompted.
fr: Entrez le mot de passe super-utilisateur de mysql lorsqu'on vous le demande

source: Enter quit at the <literal>mysql&gt;</literal> prompt to exit MySQL.
fr: tapez quit au chevron <literal>mysql</literal> pour quitter MySQL.

source: Enable KVM
fr: Activer KVM

source: For AMD, run this command:
fr: Pour AMD, exécutez cette commande:

source: If KVM acceleration is not supported, configure Compute to use a different hypervisor, such as <link href="http://docs.openstack.org/trunk/config-reference/content/qemu.html">QEMU</link> or <link href="http://docs.openstack.org/trunk/config-reference/content/introduction-to-xen.html">Xen</link>.
fr: Dans le cas où l'accélération KVM n'est pas supportée, Compute devra être configuré pour utiliser un autre hyperviseur comme <link href="http://docs.openstack.org/trunk/config-reference/content/qemu.html">QEMU</link> ou <link href="http://docs.openstack.org/trunk/config-reference/content/introduction-to-xen.html">Xen</link>.

source: These procedures help you load the kernel modules for Intel-based and AMD-based processors if they do not load automatically during KVM installation.
fr: Ces procédures décrit comment charger les modules de noyau pour les processeurs Intel et AMD, s'ils n'ont pas été chargés automatiquement par le processus d'installation de KVM de votre distribution.

source: Intel-based processors
fr: Processeurs Intel

source: If your compute host is Intel-based, run these commands as root to load the kernel modules:
fr: Si votre ordinateur hôte est basé sur Intel, lancez en tant qu'utilisateur root les modules de noyau :

source: Add these lines to the <filename>/etc/modules</filename> file so that these modules load on reboot:
fr: Ajoutez les lignes suivantes à <filename>/etc/modules</filename> pour que ces modules soient chargés au redémarrage :

source: AMD-based processors
fr: Processeurs AMD

source: If your compute host is AMD-based, run these commands as root to load the kernel modules:
fr: Si votre ordinateur hôte est basé sur AMD, lancez en tant qu'utilisateur root les modules de noyau :

source: Add these lines to <filename>/etc/modules</filename> file so that these modules load on reboot:
fr: Ajoutez les lignes suivantes à <filename>/etc/modules</filename> pour que ces modules soient chargés au redémarrage :

source: None
fr: Aucun

source: False
fr: Faux

source: (IntOpt) Minimum number of SQL connections to keep open in a pool.
fr: (IntOpt) Nombre minimum de connexions SQL à garder ouvertes dans un pool

source: local
fr: locale

source: stack
fr: pile

source: (StrOpt) OpenStack metadata service manager
fr: (StrOpt) Gestionnaire du service des métadonnées d’OpenStack

source: (StrOpt) Fixed IPv6 address block
fr: (StrOpt) Bloc d’adresses IPv6 fixe

source: (StrOpt) Default IPv6 gateway
fr: (StrOpt) Passerelle IPv6 par défaut

source: (StrOpt) Backend to use for IPv6 generation
fr: (StrOpt) Backend à utiliser pour la génération IPv6

source: none
fr: aucun

source: (BoolOpt) Permit instance snapshot operations.
fr: (BoolOpt) Autorise les opérations de snapshots des instances

source: (StrOpt) Default driver to use for quota checks
fr: (StrOpt) pilote par défaut à utiliser pour vérifications de quota

source: OVERLAY
fr: SUPERPOSITION

source: on
fr: sur

source: (StrOpt) Directory where nova binaries are installed
fr: (StrOpt) Répertoire où les binaires nova sont installées

source: (StrOpt) Top-level directory for maintaining nova's state
fr: (StrOpt) Répertoire de haut niveau pour maintenir l'état de nova

source: Prefix to use when automatically creating accounts
fr: Préfixe à utiliser avec la création automatique des comptes

source: enabled
fr: activé

source: (StrOpt) Public IP for the cloudpipe VPN servers
fr: Adresse IP publique des serveurs VPN cloudpipe

source: (StrOpt) Suffix to add to project name for vpn key and secgroups
fr: (StrOpt) Suffixe à ajouter au nom du projet pour les clés et secgroups de VPN

source: (IntOpt) First Vpn port for private networks
fr: (IntOpt) Premier port VPN des réseaux privés

source: subdomain
fr: sous domaine

source: (StrOpt) Name of this cell
fr: (StrOpt) Nom de cette cellule

source: (StrOpt) Mount options passed to the nfs client. See section of the nfs man page for details.
fr: (StrOpt) Options de montage passées au client NFS. Voir la section sur le NFS, page principale pour les détails.

source: (StrOpt) File name of clean sqlite db
fr: (StrOpt) Nom de fichier de clean sqlite db

source: (BoolOpt) Treat X-Forwarded-For as the canonical remote address. Only enable this if you have a sanitizing proxy.
fr: (BoolOpt) Traiter X-Forwarded-For comme l'adresse distante canonique. Seulement activer cette option si vous avez un proxy de désinfection.

source: disabled
fr: désactivé

source: Maximum length of a name
fr: Longueur maximum d'un nom

source: Maximum duration for an HTTP request
fr: Durée maximum d'une requête HTTP

source: (StrOpt) Where we keep our root CA
fr: (StrOpt) Où nous conservons notre CA racine

source: (StrOpt) Filename of root Certificate Revocation List
fr: (StrOpt) Nom de fichier de la liste de révocation de certificat racine

source: (StrOpt) Filename of private key
fr: (StrOpt) Nom de fichier de la clé privée

source: (StrOpt) Where we keep our keys
fr: (StrOpt) Où nous conservons nos clés

source: (StrOpt) Subject for certificate for projects, %s for project, timestamp
fr: (StrOpt) Objet de certificat pour les projets,% s pour le projet, timestamp

source: (StrOpt) SSL certificate of API server
fr: (StrOpt) Certificat SSL de l'API du serveur

source: (StrOpt) SSL private key of API server
fr: (StrOpt) Clé SSL privée de l'API du serveur

source: (StrOpt) Subject for certificate for users, %s for project, user, timestamp
fr: (StrOpt) Objet de certificat pour les utilisateurs, % s pour le projet, utilisateur, timestamp

source: (IntOpt) Number of failed auths before lockout.
fr: (IntOpt) Nombre d’échecs d’authentification avant blocage.

source: (IntOpt) Number of minutes to lockout if triggered.
fr: (IntOpt) Nombre de minutes de blocage si déclenché.

source: (IntOpt) Number of minutes for lockout window.
fr: (IntOpt) Nombre de minutes pour fenêtre de blocage.

source: (StrOpt) File name for the paste.deploy config for nova-api
fr: (StrOpt) Nom du fichier pour la config paste.deploy de nova-api

source: (StrOpt) A python format string that is used as the template to generate log lines. The following values can be formatted into it: client_ip, date_time, request_line, status_code, body_length, wall_seconds.
fr: (StrOpt) Une chaîne de formatage Python utilisée en tant que template pour générer les journaux. Les valeurs suivantes peuvent être utilisées : client_ip, date_time, request_line, status_code, body_length, wall_seconds.

source: Member
fr: Membre

source: translator-credits
fr: Olivier Buisson <olivier@obn.me>, 2012
