Repository: 25hours/openstack-manuals
Catalog: doc/common/locale/*.po
Languages: fr

source: Logical architecture
fr: Architecture du logiciel

source: OpenStack modules are one of the following types:
fr: Les modules sont classés selon l'un des types suivants :

source: The following diagram shows the most common, but not the only, architecture for an OpenStack cloud:
fr: le schéma ci-dessous illustre l'architecture la plus courante pour un cloud basé sur OpenStack, mais ne représente pas la seule architecture possible :

source: As in <xref linkend="concept_arch"/>, end users can interact through the dashboard, CLIs, and APIs. All services authenticate through a common Identity Service and individual services interact with each other through public APIs, except where privileged administrator commands are necessary.
fr: Comme dans <xref linkend="concept_arch"/>, les utilisateurs finaux peuvent interagir à travers le tableau de bord, les CLI, ou directement via les API, tous les services s'authentifient via un service d'identité commune, et les services individuels interagissent les uns avec les autres via des API publiques, sauf là où des privilèges d’administrateur sont nécessaires pour une commande.

source: Basic quota configuration
fr: Configurations basic des quotas

source: Host aggregates
fr: Agrégats d'hôtes

source: Command-line interface
fr: Interface de ligne de commande

source: Print a list of all aggregates.
fr: Imprimer une liste de tous les agrégats.

source: Delete an aggregate with id <replaceable>&lt;id&gt;</replaceable>.
fr: Supprimer un agrégat ayant l'id <replaceable>&lt;id&gt;</replaceable>.

source: Show details of the aggregate with id <replaceable>&lt;id&gt;</replaceable>.
fr: Montrer les détails de l'agrégat ayant l'id <replaceable>&lt;id&gt;</replaceable>..

source: Add host with name <replaceable>&lt;host&gt;</replaceable> to aggregate with id <replaceable>&lt;id&gt;</replaceable>.
fr: Ajouter l'hôte nommé <replaceable>&lt;host&gt;</replaceable> à l'agrégat ayant l'id <replaceable>&lt;id&gt;</replaceable>.

source: Remove the host with name <replaceable>&lt;host&gt;</replaceable> from the aggregate with id <replaceable>&lt;id&gt;</replaceable>.
fr: Supprimer l'hôte nommé <replaceable>&lt;host&gt;</replaceable> de l'agrégat ayant l'id <replaceable>&lt;id&gt;</replaceable>.

source: Add or update metadata (key-value pairs) associated with the aggregate with id <replaceable>&lt;id&gt;</replaceable>.
fr: Ajouter ou modifier des méta données (paires de valeurs-clés) associées à l'agrégat ayant l'id <replaceable>&lt;id&gt;</replaceable>.

source: List all hosts by service.
fr: Lister tous les hôtes par service.

source: Put/resume host into/from maintenance.
fr: Mettre/retirer les hôtes en/de la maintenance.

source: The <placeholder-1/> command-line tool supports the following aggregate-related commands. <placeholder-2/>
fr: L'outil de ligne de commande <placeholder-1/> supporte les commandes relatives aux agrégats suivantes. <placeholder-2/>

source: Configure scheduler to support host aggregates
fr: Configurer le planificateur pour qu'il supporte les agrégats d'hôtes

source: One common use case for host aggregates is when you want to support scheduling instances to a subset of compute hosts because they have a specific capability. For example, you may want to allow users to request compute hosts that have SSD drives if they need access to faster disk I/O, or access to compute hosts that have GPU cards to take advantage of GPU-accelerated code.
fr: Généralement, les agrégats d'hôtes sont utilisés lorsque vous souhaitez supporter les instances de planifications pour un sous-ensemble d'ordinateurs hôtes du fait de leur capacité spécifique. Par exemple, vous pourrez vouloir autoriser les utilisateurs à demander aux ordinateurs hôtes ayant des disques SSD s'ils nécessitent un accès à un disque I/O plus rapide ou un accès à des ordinateurs hôtes qui ont des cartes GPU tirant partie des codes GPU avancés.

source: XenServer hypervisor pools to support live migration
fr: Pools de l'hyperviseur XenServeur pour supporter la live migration

source: Replication
fr: Réplication

source: Evacuate instances
fr: Evacuation d'une instance

source: Data processing service
fr: Service de traitement des données

source: OpenStack Block Storage
fr: Stockage par Bloc d'OpenStack

source: Modify the <literal>width</literal> and <literal>height</literal> parameters, as follows:
fr: Modifiez les paramètres width (largeur) et height (hauteur), comme suit :

source: Get an access URL
fr: obtenez une URL d’accès :

source: To request a web browser URL:
fr: Pour demander une URL de navigateur web:

source: <literal>xvpvncproxy_port</literal>=<replaceable>[port]</replaceable> - port to bind (defaults to 6081)
fr: <literal>xvpvncproxy_port</literal>=<replaceable>[port]</replaceable> - port à attacher (par défaut à 6081)

source: <literal>xvpvncproxy_host</literal>=<replaceable>[host]</replaceable> - host to bind (defaults to 0.0.0.0)
fr: <literal>xvpvncproxy_host</literal>=<replaceable>[host]</replaceable> - hôte à attacher (par défaut à 0.0.0.0)

source: To create a session, request an access URL by using <placeholder-1/>. Then, run the client as follows.
fr: Pour créer une session, demander une URL d'accès en utilisant <placeholder-1/>. Puis exécutez le client comme suit.

source: To get an access URL:
fr: Pour obtenir une URL d'accès:

source: To run the client:
fr: Accéder aux consoles VNC avec un client Java

source: Retrieving an access_url for a web browser is similar to the flow for the Java client.
fr: Récupérer une URL d’accès pour un navigateur web est similaire à la procédure pour le client Java.

source: To get the access URL, run the following command:
fr: Pour obtenir l'URL d'accès, exécutez la commande :

source: Paste the URL into your web browser.
fr: Collez l'URL dans votre navigateur web.

source: Additionally, you can use the OpenStack dashboard, known as horizon, to access browser-based VNC consoles for instances.
fr: Collez l'URL dans votre navigateur web.

source: Add keypair
fr: Ajouter une paire de clés

source: Create a key.
fr: Créez une clé.

source: Certificates for PKI
fr: Certificats pour PKI

source: The values that specify where to read the certificates are under the <literal>[signing]</literal> section of the configuration file. The configuration values are:
fr: Les valeurs qui spécifient où lire les certificats sont dans la section <literal>[signing]</literal> du fichier de configuration. Les valeurs de configuration sont :

source: <literal>certfile</literal> - Location of certificate used to verify tokens. Default is <literal>/etc/keystone/ssl/certs/signing_cert.pem</literal>.
fr: <literal>certfile</literal> – Emplacement du certificat utilisé pour vérifier les jetons. Par défaut <literal>/etc/keystone/ssl/certs/signing_cert.pem</literal>.

source: <literal>keyfile</literal> - Location of private key used to sign tokens. Default is <literal>/etc/keystone/ssl/private/signing_key.pem</literal>.
fr: <literal>keyfile</literal> – Emplacement de la clé privée utilisée pour signer les jetons. Par défaut <literal>/etc/keystone/ssl/private/signing_key.pem</literal>

source: <literal>ca_certs</literal> - Location of certificate for the authority that issued the above certificate. Default is <literal>/etc/keystone/ssl/certs/ca.pem</literal>.
fr: <literal>ca_certs</literal> – Emplacement du certificat pour l'autorité ayant émis le certificat précédent. Par défaut <literal>/etc/keystone/ssl/certs/ca.pem</literal>.

source: <literal>valid_days</literal> - Default is <literal>3650</literal>.
fr: <literal>valid_days</literal> - Par défaut <literal>3650</literal>.

source: Sign certificate issued by external CA
fr: Signer un Certificat émis par une CA externe

source: all certificate and key files must be in Privacy Enhanced Mail (PEM) format
fr: Tous les fichiers certificats et clés doivent êtres en format PEM [original](Privacy Enhanced Mail)[/original]

source: private key files must not be protected by a password
fr: Les fichiers de clés privées ne doivent pas être protégés par un mot de passe

source: The basic workflow for using a signing certificate issued by an external CA involves:
fr: Le flux de travail basique lorsqu'on utilise un certificat de signature émis par une CA externe implique :

source: Request Signing Certificate from External CA
fr: Demander un Certificat de Signature à une CA externe

source: Convert certificate and private key to PEM if needed
fr: Convertir le Certificat et la clé privée en PEM si nécessaire

source: Install External Signing Certificate
fr: Installer le Certificat de Signature Externe

source: Request a signing certificate from an external CA
fr: Demander un Certificat de Signature à une CA externe

source: One way to request a signing certificate from an external CA is to first generate a PKCS #10 Certificate Request Syntax (CRS) using OpenSSL CLI.
fr: Un façon de demander un certificat de signature à une CA externe est de d'abord générer une Syntaxe pou Requête de Certification (CRS-Certificate Request Syntax) en PKCS #10 via OpenSSL CLI.

source: Then generate a CRS with OpenSSL CLI. <emphasis role="strong">Do not encrypt the generated private key. Must use the -nodes option.</emphasis>
fr: Puis générez une CRS avec OpenSSL CLI. <emphasis role="strong">N'encryptez pas la clé privée générée. Vous devez utiliser l'option -nodes.</emphasis>

source: Install an external signing certificate
fr: Installer un Certificat de Signature Externe

source: Assuming you have the following already:
fr: En supposant que vous possédez déjà les suivants :

source: <filename>signing_cert.pem</filename> - (Keystone token) signing certificate in PEM format
fr: <filename>signing_cert.pem</filename> – (jeton Keystone) certificat de signature au format PEM

source: <filename>signing_key.pem</filename> - corresponding (non-encrypted) private key in PEM format
fr: <filename>signing_key.pem</filename> – Clé privée (non-cryptée) correspondante au format PEM

source: <filename>cacert.pem</filename> - trust CA certificate chain in PEM format
fr: • <filename>cacert.pem</filename> – Chaîne de certificat de CA de confiance au format PEM

source: Copy the above to your certificate directory. For example:
fr: Copiez ce qui précède dans votre dossier de certificats. Par exemple :

source: Make sure the certificate directory is only accessible by root.
fr: Assurez-vous que le dossier de certificats n’est accessible que par root (racine).

source: If your certificate directory path is different from the default <filename>/etc/keystone/ssl/certs</filename>, make sure it is reflected in the <literal>[signing]</literal> section of the configuration file.
fr: Si le chemin de votre dossier de certificats diffère du chemin par défaut <filename>/etc/keystone/ssl/certs</filename>, assurez-vous que ce changement soit reflété dans la section <literal>[signing]</literal> du fichier de configuration.

source: Introduction to Object Storage
fr: Introduction au Stockage d'Objets

source: Launch an instance from a volume
fr: Lancer une instance d'un volume

source: Task
fr: Tâche

source: List volumes:
fr: Listez les volumes:

source: Create volume from image and boot instance
fr: Créez un volume depuis une image et démarrer une instance.

source: List the available images:
fr: Lister les images disponibles:

source: List the available flavors:
fr: Listez les types d'instances disponibles:

source: To create a bootable volume from an image and launch an instance from this volume, use the <parameter>--block-device</parameter> parameter.
fr: Pour créer un volume démarrable depuis une image et pour lancer une instance depuis ce volume, utilisez le paramètre <parameter>--block-device</parameter>.

source: FLAVOR
fr: TYPE D'INSTANCE

source: SIZE
fr: TAILLE

source: NAME
fr: NOM

source: The parameters are:
fr: Les paramètres sont:

source: Create a bootable volume from an image, before the instance boots. The volume is not deleted when the instance is terminated:
fr: Créez un volume démarrable depuis une image avant le lancement de l'instance. Le volume n'est pas supprimé quand l'instance est terminée:

source: List volumes to see the bootable volume and its attached <literal>myInstanceFromVolume</literal> instance:
fr: Listez les volumes pour voir l'instance démarrable et son instance <literal>myInstanceFromVolume</literal> jointe:

source: Log in to the dashboard
fr: Connectez-vous au tableau de bord

source: On the <guilabel>Log In</guilabel> page, enter your user name and password, and click <guibutton>Sign In</guibutton>.
fr: Au page <guilabel>Log In</guilabel>, entrez votre nom d'utilisateur et mot de passe, et cliquez sur <guibutton>Sign In</guibutton>.

source: View, create, edit, and delete volumes.
fr: Voir, créer, éditer et supprimer des columes.

source: Volume Snapshots
fr: Instantanés du volume

source: Access &amp; Security
fr: Accès et Sécurité

source: Security Groups
fr: Groupes de sécurité

source: Key Pairs
fr: Paires de Clefs

source: Floating IPs
fr: IP flottantes

source: API Access
fr: Accès API

source: View API endpoints.
fr: Voir des points de terminaison d'API.

source: Network
fr: Réseau

source: Network Topology
fr: Topologie du Réseau

source: View the network topology.
fr: Voir la topologie du réseau

source: Networks
fr: Réseaux

source: Create and manage public and private networks.
fr: Créer et gérer les réseaux publics et privés.

source: Routers
fr: Routeurs

source: Create and manage subnets.
fr: Créez et gérez des sous-réseaux.

source: Object Store
fr: Stockage d'objet

source: Containers
fr: Conteneurs

source: Admin tab
fr: Onglet d'administration

source: System Panel
fr: Gestion Système

source: Resource Usage
fr: Usage de ressource

source: Daily Report
fr: Rapport journalier

source: View the daily report.
fr: Voir la rapport journalier.

source: Hypervisors
fr: Hyperviseurs

source: View the hypervisor summary.
fr: Voir le résumé d'hyperviseur.

source: Host Aggregates
fr: Agrégations d'hôte.

source: System Info
fr: Informations Système

source: View a list of the services.
fr: Voir une liste de toutes les services.

source: Compute Services
fr: Services de calcul

source: View a list of all Compute services.
fr: Voir une liste de toutes les services calcul.

source: Network Agents
fr: Agents réseau.

source: View the network agents.
fr: Voir les agents réseau.

source: Default Quotas
fr: Quotas par défaut

source: Identity Panel
fr: Gestion des Identités

source: Projects
fr: Projets

source: Users
fr: Utilisateurs

source: Show usage statistics for hosts and instances
fr: Afficher les statistiques d'utilisation des hôtes et des instances

source: Get summary statistics for each tenant:
fr: obtenir des statistiques sommaires pour chaque [original]tenant[/original] :

source: username
fr: nom d'utilisateur

source: password
fr: Mot de passe

source: PASSWORD
fr: MOT DE PASSE

source: Components
fr: Composants

source: Proxy servers
fr: Serveurs proxy

source: Proxy servers are the public face of Object Storage and handle all of the incoming API requests. Once a proxy server receives a request, it determines the storage node based on the object's URL, for example, https://swift.example.com/v1/account/container/object. Proxy servers also coordinate responses, handle failures, and coordinate timestamps.
fr: Les serveurs proxy sont la face publique de l'Object Storage et gèrent toutes les requêtes de l'API entrantes. Une fois qu'un serveur proxy reçoit une requête, il détermine le nœud de stockage basée sur l'URL de l'objet, par exemple, https://swift.example.com/v1/account/container/object. Les serveurs proxy coordonnent également les réponses, gèrent les échecs, et coordonnent les horodateurs.

source: Upload
fr: Mettre en ligne

source: Download
fr: Télécharger

source: Manage volumes
fr: Gérer les volumes

source: Create a volume
fr: Créer un volume

source: To verify that your volume was created successfully, list the available volumes:
fr: Pour vérifier que votre volume a été bien créé, listez les volumes disponibles:

source: Attach a volume to an instance
fr: Joindre un volume à l'instance

source: Note the ID of your volume.
fr: Notez l'identité de votre volume.

source: Note that the volume is now available.
fr: Notez que le volume est maintenant disponible.

source: Delete a volume
fr: Supprimez un volume

source: When the volume is fully deleted, it disappears from the list of volumes:
fr: Quand le volume a été complètement supprimé, il ne s'affiche plus dans la liste des volumes:

source: Transfer a volume
fr: Transférer un volume

source: VOLUME_ID
fr: ID_VOLUME

source: Delete the volume:
fr: Supprimez le volume:

source: Networking for VMs
fr: Réseaux pour les machines virtuelles

source: Console interface
fr: Interface Console

source: Other components
fr: Autres Composants

source: SQL database
fr: Base de données SQL

source: Available networks
fr: Réseaux disponibles

source: Groups
fr: Groupes

source: Create a group
fr: Créez un groupe

source: Delete a group
fr: Supprimez un groupe

source: Update a group (change its name or description)
fr: Mettre à jour (changer le nom ou la description)

source: Add a user to a group
fr: Ajoutez un utilisateur à un groupe

source: Remove a user from a group
fr: Supprimez un utilisateur d'un groupe

source: List group members
fr: Listez les membres d'un groupe.

source: List groups for a user
fr: Lister des groupes pour un utilisateur

source: Prerequisite software
fr: Logiciels Prérequis

source: Prerequisite
fr: Prérequis

source: Installed by default on Mac OS X.
fr: Installé par défaut sur Mac OS X.

source: Install the clients
fr: Installez les clients

source: For Mac OS X or Linux:
fr: Pour Mac OS X ou Linux:

source: For Microsoft Windows:
fr: Pour Microsoft Windows:

source: Contains most configuration options. If the documentation for a configuration option does not specify its section, assume that it appears in this section.
fr: Presque toutes les options de configuration sont organisées dans cette section. Si la documentation concernant une option de configuration ne stipule pas cette section, il faudra supposer qu'elle concernera celle-ci.

source: To include whitespace in a configuration value, use a quoted string. For example:
fr: Pour insérer un espace dans une valeur de configuration, utiliser une chaîne entre guillement. Par exemple

source: Database
fr: Base de données

source: Get started with OpenStack
fr: Débuter avec OpenStack

source: OpenStack services
fr: Les services d'OpenStack

source: Project name
fr: Nom du projet

source: Dashboard
fr: Tableau de Bord

source: Storage
fr: Stockage

source: Shared services
fr: Les Services partagés

source: Identity service
fr: Service d'identification

source: Feedback
fr: remarques

source: Fibre Channel support in Compute
fr: Support de Fibre Channel en Calcul

source: In the Grizzly release, Fibre Channel supported only the KVM hypervisor.
fr: Fibre Channel supporte l'hyperviseur KVM uniquement dans l'édition grizzly.

source: KVM host requirements
fr: Il n'y a pas de support de zonage automatique dans Nova ou Cinder pour Fibre Channel. Les matrices Fibre Channel doivent être pré-zonées ou directement rattachées aux hôtes KVM.

source: You must install these packages on the KVM host:
fr: L'hôte KVM doit contenir les packs suivants:

source: Installing the <package>multipath-tools</package> package is optional.
fr: L'installation du pack <package>sginfo</package> est optionnel.

source: Install required packages
fr: Installations des Packs Nécessaires

source: Use these commands to install the system packages:
fr: Utilisez les commandes suivantes pour installer les packs système.

source: For systems running Red Hat:
fr: Pour les systèmes fonctionnant sous Red Hat:

source: For systems running Ubuntu:
fr: Pour les systèmes fonctionnants sous Ubuntu:

source: Customize the dashboard
fr: Personalisez le tableau de bord

source: On Ubuntu: <placeholder-1/>
fr: Sur Ubuntu: <placeholder-1/>

source: On Fedora, RHEL, CentOS: <placeholder-1/>
fr: Sur Fedora, RHEL, CentOS: <placeholder-1/>

source: On openSUSE: <placeholder-1/>
fr: Sur openSUSE: <placeholder-1/>

source: OpenStack Compute supports API rate limiting for the OpenStack API. The rate limiting allows an administrator to configure limits on the type and number of API calls that can be made in a specific time interval.
fr: OpenStack Compute supporte la limitation du nombre d’API pour l’API OpenStack. La limitation permet à un administrateur de configurer des limites sur le type et le nombre d’appels API qui peuvent être lancés dans un certain intervalle de temps.

source: Rate limiting is not available for the EC2 API.
fr: La limitation n’est pas disponible pour l’API EC2.

source: The <emphasis role="bold">HTTP method</emphasis> used in the API call, typically one of GET, PUT, POST, or DELETE.
fr: La <emphasis role="bold">méthode HTTP</emphasis> utilisée dans l’appel API, généralement GET, PUT, POST, ou DELETE.

source: A <emphasis role="bold">human readable URI</emphasis> that is used as a friendly description of where the limit is applied.
fr: Une <emphasis role="bold">URI lisible par un humain</emphasis qui est utilisée en tant que description amicale concernant ce à quoi la limite s’applique.

source: A <emphasis role="bold">limit value </emphasis> that specifies the maximum count of units before the limit takes effect.
fr: Une <emphasis role="bold">valeur limite</emphasis> qui spécifie le nombre maximum d’unités avant que la limite ne prenne effet.

source: HTTP method
fr: Méthode HTTP

source: API URI
fr: URI de l’API

source: API regular expression
fr: Expression régulière API

source: Limit
fr: Limite

source: any URI (*)
fr: toute URI (*)

source: Configure and change limits
fr: Configurez et changez des limites

source: Configure the dashboard
fr: Configurer le tableau de bord

source: You can configure the dashboard for a simple HTTP deployment.
fr: Vous pouvez configurer le tableau de bord pour un déploiement HTTP simple.

source: Storage concepts
fr: Concepts de stockage

source: The OpenStack stack uses the following storage types:
fr: La pile OpenStack utilise diverses formes de stockage, ce qui peut troubler même les ingénieurs cloud expérimentés. Le tableau suivant décrit les types de stockage :

source: Storage types
fr: La pile OpenStack utilise diverses formes de stockage, ce qui peut troubler même les ingénieurs cloud expérimentés. Le tableau suivant décrit les types de stockage :

source: On-instance / ephemeral
fr: Sur-instance / éphémère

source: Runs operating systems and provides scratch space
fr: Exécute les systèmes d’exploitation et fournit de l’espace scratch

source: Used for adding additional persistent storage to a virtual machine (VM)
fr: Utilisé pour ajouter du stockage persistant additionnel à une machine virtuelle (VM)

source: Used for storing virtual machine images and data
fr: Utilisé pour stocker des images de machines virtuelles et des données

source: Persists until VM is terminated
fr: Persiste jusqu’à ce que la VM soit éteinte

source: Persists until deleted
fr: Persiste jusqu’à l’effacement

source: Access associated with a VM
fr: Accès associé à une VM

source: Available from anywhere
fr: Disponible depuis partout

source: Implemented as a filesystem underlying OpenStack Compute
fr: Implémenté en tant que système de fichiers sous-jacent à OpenStack Compute

source: Administrator configures size setting, based on flavors
fr: Administrateur configure le paramètre de taille, en se basant sur les types d'instances

source: Sizings based on need
fr: Dimensionnements basés sur le besoin

source: Easily scalable for future growth
fr: Facilement redimensionnable en vue d’une croissance future
