Repository: 25hours/openstack-manuals
Catalog: doc/common/locale/*.po
Languages: fr

source: If the log level is set to <literal>debug</literal>, you can also specify <literal>logging_debug_format_suffix</literal> to append extra formatting. For information about what variables are available for the formatter see: <link href="http://docs.python.org/library/logging.html#formatter">http://docs.python.org/library/logging.html#formatter</link>.
fr: Si le niveau de journalisation est défini sur <literal>debug</literal>, vous pouvez également spécifier <literal>logging_debug_format_suffix</literal> pour ajouter du formatage supplémentaire. Pour des informations à propos de quelles variables sont disponibles pour le formatteur : <link href="http://docs.python.org/library/logging.html#formatter">http://docs.python.org/library/logging.html#formatter</link>.

source: Common errors and fixes for Compute
fr: Erreurs Fréquentes et Solutions pour Calcul

source: Credential errors, 401, and 403 forbidden errors
fr: Erreurs références, 401, 403 [original] forbidden erreurs

source: Instance errors
fr: Erreurs Instance

source: disk
fr: disque

source: disk-raw
fr: disk en format brut

source: kernel
fr: noyau

source: After the instance starts, <filename>console.log</filename>
fr: Après le démarrage de l'instance, <filename>console.log</filename>

source: Reset the state of an instance
fr: Réinitialiser manuellement l'état d'une instance

source: If an instance remains in an intermediate state, such as <literal>deleting</literal>, you can use the <placeholder-1/> command to manually reset the state of an instance to an error state. You can then delete the instance. For example:
fr: Si une instance est bloquée dans un état intermédiaire <literal>deleting</literal>, vous prouver réinitialiser manuellement l'état d'une instance en utilisant la commande <placeholder-1/> . Cela va le réinitialiser à l'état d'erreur, que vous pouvez ensuite supprimer. Par example :

source: You can also use the <parameter>--active</parameter> parameter to force the instance back to an active state instead of an error state. For example:
fr: Vous pouvez également utiliser le --active pour forcer l'instance à retourner à un état actif au lieu d'un état d'erreur, par exemple :

source: Injection problems
fr: Problèmes avec Injection

source: If instances do not boot or boot slowly, investigate file injection as a cause.
fr: Si vous diagnostiquez un problème avec des instances qui ne démarrent pas, ou lentement, considérez le fichier injection la cause et vérifiez le.

source: Configure the EC2 API
fr: Configurer l’API EC2

source: You can set options in the <filename>nova.conf</filename> configuration file to control which network address and port the EC2 API listens on, the formatting of some API responses, and authentication related options.
fr: Vous pouvez utiliser les options de configuration de <filename>nova.conf</filename> pour contrôler à quelle adresse réseau et sur quel port l’API EC2 écoutera, le formatage de certaines réponses API et des options ayant trait à l’authentification.

source: To configure the keystone client with an authentication token
fr: Pour configurer le client keystone avec un jeton d'authentification

source: Alternatively, you can specify these parameters on any keystone client command:
fr: Alternativement, vous pouvez spécifier ces paramètres sur un client de commande keystone:

source: To configure the keystone client with a user name and password
fr: Pour configurer le client keystone avec un nom d'utilisateur et un mot de passe

source: The VNC proxy is an OpenStack component that enables compute service users to access their instances through VNC clients.
fr: Le proxy VNC est un composant OpenStack qui permet aux utilisateurs du service Compute d’accéder à leurs instances via des clients VNC.

source: The VNC console connection works as follows:
fr: La connexion à la console VNC fonctionne comme suit :

source: A user connects to the API and gets an <literal>access_url</literal> such as, <literal>http://<replaceable>ip:port</replaceable>/?token=xyz</literal>.
fr: Un utilisateur se connecte à l’API et obtient une <literal>access_url</literal> telle que <literal>http://<replaceable>ip:port</replaceable>/?token=xyz</literal>.

source: The user pastes the URL in a browser or uses it as a client parameter.
fr: L'utilisateur colle l'URL dans le navigateur ou il l'utilise comme paramètre client.

source: The browser or client connects to the proxy.
fr: Le navigateur ou le client se connecte au proxy.

source: Mediates token authentication.
fr: fournit les jetons d’authentification.

source: noVNC process
fr: Processus noVNC

source: About nova-consoleauth
fr: A propos de nova-consoleauth

source: Do not confuse the <systemitem class="service">nova-consoleauth</systemitem> shared service with <literal>nova-console</literal>, which is a XenAPI-specific service that most recent VNC proxy architectures do not use.
fr: Il ne faut pas confondre le service partagé <systemitem class="service">nova-consoleauth</systemitem> avec <literal>nova-console</literal>, qui est un service spécifique à XenAPI que la plupart des architectures proxy récentes n’utilisent pas.

source: Typical deployment
fr: Déploiement typique

source: A <systemitem class="service">nova-consoleauth</systemitem> process. Typically runs on the controller host.
fr: Un processus <systemitem class="service">nova-consoleauth</systemitem>. Tourne généralement sur le contrôleur hôte.

source: One or more compute hosts. These compute hosts must have correctly configured options, as follows.
fr: Un ou plusieurs hôtes Compute. Ces hôtes Compute doivent avoir leurs options correctement configurées, comme suit :

source: VNC configuration options
fr: Un ou plusieurs hôtes Compute. Ces hôtes Compute doivent avoir leurs options correctement configurées, comme suit :

source: For all-in-one XenServer domU deployments, set this to 169.254.0.1.
fr: Pour des déploiements domU XenServer tout-en-un, définissez-la sur 169.254.0.1.

source: For multi-host XenServer domU deployments, set to a dom0 management IP on the same network as the proxies.
fr: Pour des déploiements domU XenServer multi-hôtes, définissez-la sur une IP de gestion dom0 sur le même réseau que les proxies.

source: For multi-host libvirt deployments, set to a host management IP on the same network as the proxies.
fr: Pour des déploiements libvirt multi-hôtes, définissez-la sur une IP de gestion d’hôtes sur le même réseau que les proxies.

source: The service starts automatically on installation.
fr: Le service démarre automatiquement lors de l’installation

source: The configuration option parameter should point to your <filename>nova.conf</filename> file, which includes the message queue server address and credentials.
fr: Le paramètre d’option de configuration doit pointer vers votre fichier <filename>nova.conf</filename>, qui contient les informations d’identification et l’adresse du serveur de file d’attente de messagerie.

source: By default, <systemitem class="service">nova-novncproxy</systemitem> binds on <literal>0.0.0.0:6080</literal>.
fr: Par défaut, <systemitem class="service">nova-novncproxy</systemitem> s’attache à <literal>0.0.0.0:6080</literal>.

source: Specifies the address on which the VNC service should bind. Make sure it is assigned one of the compute node interfaces. This address is the one used by your domain file.
fr: Spécifie l’adresse à laquelle le service VNC doit s’attacher. Assurez-vous que lui soit assignée une des interfaces de nœud Compute. Cette adresse est celle utilisée par votre fichier de domaine.

source: Frequently asked questions about VNC access to virtual machines
fr: Foire Aux Questions à propos de l’accès VNC aux machines virtuelles

source: Q: What is the difference between <placeholder-1/> and <placeholder-2/>?
fr: Q: Quelle est la différence entre <placeholder-1/> et <placeholder-2/>?

source: A: You need <systemitem class="service">nova-novncproxy</systemitem>, <systemitem class="service">nova-consoleauth</systemitem>, and correctly configured compute hosts.
fr: R : Vous avez besoin de <systemitem class="service">nova-novncproxy</systemitem>, <systemitem class="service">nova-consoleauth</systemitem>, et d’hôtes Compute correctement configurés.

source: A: Make sure you are running <systemitem class="service">nova-consoleauth</systemitem> (in addition to <systemitem class="service">nova-novncproxy</systemitem>). The proxies rely on <systemitem class="service">nova-consoleauth</systemitem> to validate tokens, and waits for a reply from them until a timeout is reached.
fr: R : Assurez-vous d’exécuter <systemitem class="service">nova-consoleauth</systemitem> (en plus de <systemitem class="service">nova-novncproxy</systemitem>). Les proxies s’appuient sur <systemitem class="service">nova-consoleauth</systemitem> pour valider les jetons, et attendent une réponse de leur part jusqu’à ce qu’un timeout soit atteint.

source: Q: My VNC proxy worked fine during my all-in-one test, but now it doesn't work on multi host. Why?
fr: Q: Mon proxy VNC marchait bien lors de mon test tout-en-un, mais maintenant ça ne marche pas en multi-hôtes. Pourquoi ?

source: A: The default options work for an all-in-one install, but changes must be made on your compute hosts once you start to build a cluster. As an example, suppose you have two servers:
fr: R : Les options par défaut marchent pour une installation tout-en-un, mais des changements doivent être faits sur vos hôtes Compute une fois que vous commencez à bâtir un cluster. Par exemple, supposons que vous ayez deux serveurs :

source: Your <systemitem class="service">nova-compute</systemitem> configuration file must set the following values:
fr: Votre fichier de configuration <systemitem class="service">nova-compute</systemitem> doit être réglé avec les valeurs suivantes :

source: <literal>novncproxy_base_url</literal> and <literal>xvpvncproxy_base_url</literal> use a public IP; this is the URL that is ultimately returned to clients, which generally do not have access to your private network. Your PROXYSERVER must be able to reach <literal>vncserver_proxyclient_address</literal>, because that is the address over which the VNC connection is proxied.
fr: <literal>novncproxy_base_url</literal> et <literal>xvpvncproxy_base_url</literal> utilisent une IP publique ; il s’agit de l’URL qui est in fine renvoyée aux clients, qui généralement n’ont pas accès à votre réseau privé. Votre SERVEUR PROXY doit être capable d’atteindre <literal>vncserver_proxyclient_address</literal>, car c’est l’adresse par laquelle la connexion VNC passe.

source: Q: My noVNC does not work with recent versions of web browsers. Why?
fr: Q: Mon noVNC ne marche pas avec les versions récentes des navigateurs web. Pourquoi ?

source: Q: How do I adjust the dimensions of the VNC window image in the OpenStack dashboard?
fr: Q: Comment puis-je ajuster les dimensions de l’image de la fenêtre VNC dans le tableau de bord OpenStack ?

source: Launch an instance from an image
fr: Lancer une instance depuis une image

source: Instances are virtual machines that run inside the cloud.
fr: Les instances sont des machines virtuelles individuelles qui tournent dans le cloud.

source: Alternatively, you can launch an instance from an image that you have copied to a persistent volume.
fr: Autrement, vous pouvez lancer une instance à partird'une image qui a été copiée sur un volume persistent.

source: To launch an instance, specify the following parameters:
fr: Pour lancer une instance, spécifiez les paramètres suivants:

source: A <guilabel>name</guilabel> for your instance.
fr: Un <guilabel>name</guilabel> pour votre instance.

source: Access and security credentials, which include one or both of the following credentials:
fr: Certificats d'accès et de sécurité, qui incluent un ou plusieurs des certificats suivants :

source: To launch an instance:
fr: Pour lancer une instance

source: Log in to the OpenStack dashboard.
fr: Connectez-vous au tableau de bord OpenStack

source: If you are a member of multiple projects, select a project from the drop-down list at the top of the <guilabel>Project</guilabel> tab.
fr: Si vous êtes membre de multiple projets, selectionnez un projet de la liste déroulante en tête de l'onglet <guilabel>Project</guilabel>.

source: Click the <guilabel>Images &amp; Snapshot</guilabel> category.
fr: Cliquez sur la catégorie <guilabel>Images &amp; Snapshot</guilabel>.

source: OpenStack dashboard - Launch Instances window
fr: Tableau de bord OpenStack - Fenêtre du lancement des instances

source: Select an image and click <guibutton>Launch</guibutton>. The <guilabel>Launch Image</guilabel> window appears: <placeholder-1/>
fr: Sélectionnez une image et cliquez sur <guibutton>Launch</guibutton>. La fenêtre <guilabel>Launch Image</guilabel> s'affiche: <placeholder-1/>

source: Specify the following parameters:
fr: Spécifiez les paramètres suivants:

source: Enter an instance name to assign to the virtual machine.
fr: Entrer le nom d'une instance pour l'assigner à la machine virtuel.

source: From the <guilabel>Flavor</guilabel> drop-down list, select the size of the virtual machine to launch.
fr: A partir de la liste déroulante <guilabel>Flavor</guilabel>, sélectionnez la taille de la machine virtuelle à lancer.

source: Optionally, select a keypair.
fr: Facultativement, choisissez une paire de clés.

source: In <guilabel>Instance Count</guilabel>, enter the number of virtual machines to launch from this image.
fr: Dans <guilabel>Instance Count</guilabel>, entrez le nombre de machines virtuelles à lancer depuis cette instance.

source: Assign the instance to the default security group. If you added rules to this group, the instance implements these rules.
fr: Assignez l'instance au groupe de sécurité par défaut. Si vous ajoutez des règles à ce groupe, l'instance met en oeuvre ces règles.

source: Click <guibutton>Launch Instance</guibutton>. The instance is launched on any of the compute nodes in the cloud.
fr: Cliquez sur <guibutton>Launch Instance</guibutton>. L'instance est lancé sur n'importe quel nœud de calcul dans le cloud.

source: OpenStack dashboard - Instances
fr: Tableau de bord OpenStack - Instances

source: If you did not provide a keypair on starting and have not touched security groups or rules so far, by default the instance can only be accessed from inside the cloud through VNC at this point. Even pinging the instance is not possible.
fr: Si vous ne fournissez pas de paire de clés, de groupes de sécurités, ou de règles jusqu'ici, les utilisateurs ne peuvent accéder à l'instance qu'à partir du cloud par VNC. Même pinger l'instance n'est pas possible.

source: Community support
fr: Soutien Communautaire

source: Configuration Reference
fr: Référence de Configuration

source: Operations Guide
fr: Guide d'Opérations

source: Security Guide
fr: Guide de sécurité

source: End User Guide
fr: fin du guide utilisateur

source: OpenStack mailing lists
fr: listes de diffusion OpenStack

source: The OpenStack wiki
fr: Le wiki OpenStack

source: The Launchpad Bugs area
fr: La zone Launchpad Bugs

source: Some tips:
fr: Quelques conseils :

source: Bugs: OpenStack Compute (nova)
fr: Bugs: OpenStack Calcul (nova)

source: Bugs: OpenStack Dashboard (horizon)
fr: Bugs: OpenStack Tableau de Bord (horizon)

source: Bugs: OpenStack Identity (keystone)
fr: Bugs: OpenStack Identité (keystone)

source: Bugs: OpenStack Networking (neutron)
fr: Bugs: OpenStack Réseau (neutron)

source: Bugs: OpenStack Object Storage (swift)
fr: Bugs: OpenStack Stockage d'Objets (swift)

source: Bugs: Orchestration (heat)
fr: Bugs: l'Orchestration (heat)

source: Bugs: Telemetry (ceilometer)
fr: Bugs: Métrologie (ceilometer)

source: The OpenStack IRC channel
fr: Le canal OpenStack IRC

source: Documentation feedback
fr: commentaires sur la documentation

source: CentOS, Fedora, and Red Hat Enterprise Linux:
fr: CentOS, Fedora, et Red Hat Enterprise Linux:

source: Save the builder.
fr: Enregistrer le générateur.

source: Flavors
fr: Types d'instance

source: Element
fr: élément

source: Name
fr: Nom

source: Virtual machine memory in megabytes.
fr: Mémoire de la machine virtuel en mégaoctets.

source: Disk
fr: Disque

source: Ephemeral
fr: Éphémère

source: Number of virtual CPUs presented to the instance.
fr: Nombre de UC virtuelles présentées à l'instance.

source: The tenant who owns the image
fr: Le locataire qui possède l'image

source: Example:
fr: Exemple:

source: Configure the Identity Service with SSL
fr: Configurer le service d'identité avec SSL

source: Certificate types
fr: Types de certificats

source: Certificate Authority chain to validate against.
fr: Certifie la chaîne d'Autorité comme support de validation.

source: Public certificate for Identity Service server.
fr: Certificat public pour le serveur Keystone.

source: Public and private certificate for Identity Service middleware/client.
fr: Certificat public et prive pour le client de middleware de Keystone

source: Private key for the CA.
fr: Clé privée pour le CA

source: Private key for the Identity Service server.
fr: Clé privée pour le serveur Keystone

source: You can choose names for these certificates. You can also combine the public/private keys in the same file, if you wish. These certificates are provided as an example.
fr: Il faut noter qu'il est possible de choisir les noms que vous voulez pour ces certificats, ou de combiner les clés publiques/privées dans le même fichier si vous le souhaitez. Ces certificats sont juste fournis à titre d'exemple.

source: <literal>enable</literal>. True enables SSL. Default is False.
fr: • <literal>enable</literal>: True active le SSL. Par défaut False

source: <literal>certfile</literal>. Path to the Identity Service public certificate file.
fr: <literal>certfile</literal>: Chemin vers les fichiers des certificat Keystone publics.

source: <literal>keyfile</literal>. Path to the Identity Service private certificate file. If you include the private key in the certfile, you can omit the keyfile.
fr: • <literal>keyfile</literal>: Chemin vers les fichiers des certificats Keystone privés. Si la clé privé est incluse dans le certfile, le keyfile peut être omis.

source: <literal>ca_certs</literal>. Path to the CA trust chain.
fr: <literal>ca_certs</literal>: Chemin vers la chaîne de confiance du CA.

source: <literal>cert_required</literal>. Requires client certificate. Default is False.
fr: <literal>cert_required</literal>: Requiert le certificat du client. Par défaut False

source: Use Identity Service API v3 instead of API v2.0
fr: Utilise Service d'Identité API v3 au lieu de API v2.0

source: Manage images
fr: Gérez les images

source: The cloud operator assigns roles to users. Roles determine who can upload and manage images. The operator might restrict image upload and management to only cloud administrators or operators.
fr: L'opérateur du cloud assigne des rôles aux utilisateurs. Les rôles déterminent qui peut télécharger et gérer des images. L'opérateur pourrait restreindre le téléchargement d'images et de gestion uniquement pour les administrateurs du cloud ou les opérateurs.

source: For details about image creation, see the <link href="http://docs.openstack.org/image-guide/content/"><citetitle>Virtual Machine Image Guide</citetitle></link>.
fr: Pour plus de détails sur la création de l'image, voir le <link href="http://docs.openstack.org/image-guide/content/"><citetitle>Virtual Machine Image Guide</citetitle></link>.

source: List or get details for images (glance)
fr: Lister ou trouver les détails pour les images (glance)

source: Create or update an image (glance)
fr: Créer ou mettre à jour une image (glance)

source: The name of the image.
fr: Le nom de l'image.

source: The tenant who should own the image.
fr: Le locataire qui devrait posséder l'image.

source: qemu or kvm
fr: qemu ou kvm

source: OpenStack Object Storage
fr: Stockage d'Objet OpenStack

source: It includes the following components:
fr: Elle comprend les éléments suivants

source: Configure the dashboard for HTTPS
fr: Pour configurer le tableau de bord pour HTTPS

source: Before
fr: Avant

source: After
fr: Après

source: Configure remote console access
fr: Configurer l’accès console à distance

source: To provide a remote console or remote desktop access to guest virtual machines, use VNC or SPICE HTML5 through either the OpenStack dashboard or the command line. Best practice is to select one or the other to run.
fr: OpenStack dispose de deux méthodes principales pour fournir l’accès à une console à distance ou un bureau à distance sur des machines virtuelles hébergées. Ce sont VNC, et SPICE HTML5 et ils peuvent être utilisés soit via le tableau de bord OpenStack, soit en ligne de commande. La meilleure pratique consiste à sélectionner l'un ou l'autre pour fonctionner.

source: Developers interact with the object storage system through a RESTful HTTP API.
fr: Les développeurs interagissent avec le système de stockage d'objets à travers une API HTTP RESTful.

source: Developers can either write directly to the Swift API or use one of the many client libraries that exist for all of the popular programming languages, such as Java, Python, Ruby, and C#. Amazon S3 and RackSpace Cloud Files users should be very familiar with Object Storage. Users new to object storage systems will have to adjust to a different approach and mindset than those required for a traditional filesystem.
fr: Les développeurs peuvent soit écrire directement à l'API Swift ou utiliser l'une des nombreuses bibliothèques clientes qui existent pour tous les langages de programmation, tels que Java, Python, Ruby et C #. Les utilisateurs Amazon S3 et Rackspace Cloud Files devrait être très familier avec l'Object Storage. Les nouveaux utilisateurs du système Object Storage devront s'adapter à une approche et une mentalité différente que ceux requis pour un système de fichiers traditionnel.

source: Insert metadata during launch
fr: <placeholder-2/>

source: When booting a server, you can also add metadata, so that you can more easily identify it amongst your ever-growing elastic cloud. Use the <literal>--meta</literal> option with a key=value pair, where you can make up the string for both the key and the value. For example, you could add a description and also the creator of the server. <placeholder-1/>
fr: Lorsque vous bootez un serveur, vous pouvez aussi ajouter des métadonnées, pour pouvoir l'identifier plus facilement au sein de votre toujours grandissant cloud élastique. Utilisez l'option <literal>--meta</literal> avec une paire key=value, où vous pouvez faire le lien entre la clé et la valeur. Par exemple, vous pouvez ajouter une description et aussi un créateur du serveur.<placeholder-1/>

source: When viewing the server information, you can see the metadata included on the <literal>metadata</literal> line: <placeholder-1/>
fr: Lorsque vous voyez les informations du serveur, vous pouvez voir les métadonnées inclues sur la ligne <literal>metadata</literal>: <placeholder-1/>

source: Overview
fr: Vue d'ensemble

source: OpenStack services and clients
fr: Les services et les clients d'OpenStack

source: Block Storage
fr: Stockage de Bloc

source: Create and manage volumes.
fr: Créer et Gérer les volumes.

source: Create and manage images, instances, and flavors.
fr: Créer et gérer les images, instances et types d'instance.

source: Identity
fr: Identité

source: Create and manage users, tenants, roles, endpoints, and credentials.
fr: Créez et gérez des utilisateurs, des locataires, des rôles, des points de terminaison et des informations d'identification.

source: Create and manage images.
fr: Créer et gérer les images.

source: Networking
fr: Réseaux

source: Telemetry
fr: Métrologie

source: Data Processing
fr: Traitement des données en cours
