Repository: 25hours/openstack-manuals
Catalog: doc/common/source/locale/*/LC_MESSAGES/common.po
Languages: id, tr_tr

source: The Compute component that provides dnsmasq (DHCP, DNS, BOOTP, TFTP) and radvd (routing) services.
id: Komponen Compute yang menyediakan dnsmasq (DHCP, DNS, BOOTP, TFTP) dan radvd (routing) layanan.
tr_tr: Dnsmasq (DHCP, DNS, BOOTP, TFTP) ve radvd (yönlendirme) hizmetleri sağlayan Compute bileşeni.

source: The Compute component that runs on each compute node and manages the VM instance lifecycle, including run, reboot, terminate, attach/detach volumes, and so on. Provided by the nova-compute daemon.
id: Komponen Compute yang berjalan pada setiap node komputasi dan mengelola VM contoh siklus hidup, termasuk run, reboot, menghentikan, melampirkan / melepaskan volume, dan sebagainya. Disediakan oleh daemon nova-menghitung.
tr_tr: Her bir hesaplama düğümünde çalışan ve çalıştırma, yeniden başlatma, sonlandırma, birimleri bağlama/çıkarma vb. gibi VM sunucunun yaşam döngüsünü yöneten Hesaplama bileşeni. nova-compute artalan programı tarafından sağlanır.

source: The Compute direct exchanges, fanout exchanges, and topic exchanges use this key to determine how to process a message; processing varies depending on exchange type.
tr_tr: Hesaplama doğrudan alışverişi, iki hesaba bölünmüş hesaplarla yapılan alışveriş ve konu alışverişleri, bir mesajın nasıl işleneceğini belirlemek için bu anahtarı kullanır; işleme, değişim türüne bağlı olarak değişir.

source: The Compute scheduling method that attempts to fill a host with VMs rather than starting new VMs on a variety of hosts.
id: Hitung metode penjadwalan yang mencoba untuk mengisi host dengan VMS daripada mulai VMs baru di berbagai host.
tr_tr: Bir ana makineyi çeşitli bilgisayarlarda yeni VM'ler başlatmak yerine VM'lerle doldurmaya çalışan Hesaplama zamanlama yöntemi.

source: The Compute service can send alerts through its notification system, which includes a facility to create custom notification drivers. Alerts can be sent to and displayed on the dashboard.
tr_tr: Compute servisi, özel bildirim sürücüleri oluşturmak için bir olanak içeren bildirim sisteminden uyarılar gönderebilir. Uyarılar gösterge paneline gönderilebilir ve gösterilir.

source: The Compute service provides accounting information through the event notification and system usage data facilities.
id: Layanan Compute memberikan informasi akuntansi melalui pemberitahuan acara dan penggunaan sistem fasilitas data.
tr_tr: Hesaplama hizmeti, olay bildirimi ve sistem kullanımı veri olanakları aracılığıyla muhasebe bilgilerini sağlar.

source: The Compute setting that enables or disables RAM overcommitment.
tr_tr: RAM aşırı yüklemesini aktifleştiren veya devre dışı bırakan Hesaplama hizmeti ayarı.

source: The Data processing service for OpenStack (sahara) aims to provide users with a simple means to provision data processing (Hadoop, Spark) clusters by specifying several parameters like Hadoop version, cluster topology, node hardware details and a few more. After a user fills in all the parameters, the Data processing service deploys the cluster in a few minutes. Sahara also provides a means to scale already provisioned clusters by adding or removing worker nodes on demand.
id: Layanan Pengolahan data untuk OpenStack (sahara) bertujuan untuk menyediakan pengguna dengan cara sederhana untuk pengolahan penyediaan data (Hadoop, Spark) cluster dengan menentukan beberapa parameter seperti versi Hadoop, topologi cluster, simpul rincian hardware dan beberapa lagi. Setelah pengguna mengisi semua parameter, layanan Pengolahan data menyebarkan cluster dalam beberapa menit. Sahara juga menyediakan sarana untuk skala cluster yang sudah ditetapkan dengan menambahkan atau menghapus node pekerja pada permintaan.
tr_tr: OpenStack için veri işleme servisi (sahara) kullanıcılara Hadoop sürümü, küme topolojisi, düğüm donanımı ayrıntıları gibi çeşitli parametreleri belirterek veri işleme (Hadoop, Spark) kümeleri hazırlayabilmeleri için basit bir yöntem sağlamayı hedefler. Kullanıcı tüm parametreleri doldurduktan sonra, Veri işleme servisi kümeyi dakikalar içinde kurar. Sahara ayrıca isteğe bağlı olarak mevcut kümeleri ölçeklemek için işçi düğümler ekleme ve çıkarma da yapabilir.

source: The Database service includes the following components:
id: Layanan database meliputi komponen-komponen berikut:
tr_tr: Veritabanı servisi aşağıdaki bileşenleri içerir:

source: The Database service provides resource isolation at high performance levels and automates complex administrative tasks such as deployment, configuration, patching, backups, restores, and monitoring.
id: Layanan Database menyediakan isolasi sumber daya pada tingkat kinerja tinggi dan tugas-tugas administrasi yang rumit otomatis seperti penyebaran, konfigurasi, patch, backup, mengembalikan, dan monitoring.
tr_tr: Veritabanı servisi yüksek başarım seviyelerinde kaynak yalıtımı sağlar ve kurulum, yapılandırma, yamalama, yedekleme, geri yükleme ve izleme gibi karmaşık yönetim görevlerini otomatik hale getirir.

source: The Database service provides scalable and reliable cloud provisioning functionality for both relational and non-relational database engines. Users can quickly and easily use database features without the burden of handling complex administrative tasks. Cloud users and database administrators can provision and manage multiple database instances as needed.
tr_tr: Veritabanı servisi hem ilişkisel hem ilişkisel olmayan veritabanı motorları için güvenilir ve ölçeklenebilir işlevsellik sağlar. Kullanıcılar hızlıca ve kolayca veritabanı özelliklerini karmaşık yönetim işlerini yapmakla uğraşmadan kullanabilirler. Bulut kullanıcıları ve veritabanı yöneticileri gerektiği gibi birden çok veritabanı sunucusunu hazırlayabilir ve yönetebilir.

source: The Identity component that provides high-level authorization services.
id: Komponen Identity yang menyediakan layanan otorisasi tingkat tinggi.
tr_tr: Üst düzey yetkilendirme hizmetleri sağlayan Kimlik bileşeni.

source: The Identity service component that provides authentication services.
id: Komponen layanan Identity yang menyediakan layanan otentikasi.
tr_tr: Kimlik doğrulama hizmetleri sağlayan Kimlik servisi bileşeni.

source: The Identity service contains these components:
id: Layanan Identity mengandung komponen ini:
tr_tr: Kimlik servisi şu bileşenleri içerir:

source: The Identity service endpoint template that contains services available to all projects.
tr_tr: Tüm projelerin kullanabileceği hizmetleri içeren Kimlik hizmeti uç birim şablonu.

source: The Identity service is typically the first service a user interacts with. Once authenticated, an end user can use their identity to access other OpenStack services. Likewise, other OpenStack services leverage the Identity service to ensure users are who they say they are and discover where other services are within the deployment. The Identity service can also integrate with some external user management systems (such as LDAP).
tr_tr: Kimlik servisi genellikle kullanıcının etkileşim kurduğu ilk servistir. Kimlik doğrulama yapıldıktan sonra, bir son kullanıcı kimliğini kullanarak diğer OpenStack servislerine erişebilir. Aynı şekilde, OpenStack servisleri Kimlik servisi vasıtasıyla kullanıcıların söyledikleri kişiler olduklarından emin olur ve kurulum diğer servislerin nerede olduklarını keşfeder. Kimlik servisi ayrıca bazı harici kullanıcı yönetim sistemleriyle de (örneğin LDAP) tümleştirilebilir.

source: The Image service (glance) enables users to discover, register, and retrieve virtual machine images. It offers a :term:`REST <RESTful>` API that enables you to query virtual machine image metadata and retrieve an actual image. You can store virtual machine images made available through the Image service in a variety of locations, from simple file systems to object-storage systems like OpenStack Object Storage.
tr_tr: İmaj servisi (glance) kullanıcıların sanal makine imajlarını keşfetmesini, kaydetmesini ve almasını sağlar. Sanal makine imajı metaverisini sorgulamanızı ve bir imajı almanızı sağlayan bir :term:`REST <RESTful>` API sunar. İmaj servisi tarafından kullanılabilir kılınan sanal makine imajlarını İmaj servisi üzerinden çeşitli yerlerde saklayabilirsiniz, basit dosya sistemlerinden OpenStack Depolama gibi nesne depolama sistemlerine kadar her yerde.

source: The Image service API endpoint for management of VM images. Processes client requests for VMs, updates Image service metadata on the registry server, and communicates with the store adapter to upload VM images from the back-end store.
tr_tr: VM imajlarının yönetimi için İmaj servisi API uç noktası. VM'ler için istemci isteklerini işler, kayıt sunucusunda İmaj hizmeti üst verileri günceller ve VM imajlarını arka uç depodan yüklemek için mağaza bağdaştırıcısı ile iletişim kurar.

source: The Launchpad Bugs area
id: Launchpad Bugs daerah
tr_tr: Launchpad Hataları alanı

source: The Network Controller provides virtual networks to enable compute servers to interact with each other and with the public network. All machines must have a public and private network interface. A VLAN network is a private network interface, which is controlled by the ``vlan_interface`` option with VLAN managers.
tr_tr: Ağ Denetleyicisi, hesaplama sunucularının birbirleriyle ve genel ağ ile etkileşim kurmalarını sağlamak için sanal ağlar sağlar. Tüm makinelerin bir kamu ve özel ağ arabirimine sahip olması gerekir. Bir VLAN ağı, VLAN yöneticileri ile birlikte ``vlan_interface`` seçeneği tarafından kontrol edilen özel bir ağ arabirimidir.

source: The Network Controller provides virtual networks to enable compute servers to interact with each other and with the public network. All machines must have a public and private network interface. A private network interface can be a flat or VLAN network interface. A flat network interface is controlled by the flat_interface with flat managers. A VLAN network interface is controlled by the ``vlan_interface`` option with VLAN managers.
tr_tr: Ağ Denetleyicisi, hesaplama sunucularının birbirleriyle ve genel ağ ile etkileşim kurmalarını sağlamak için sanal ağlar sağlar. Tüm makinelerin bir genele açık ve gizli ağ arabirimine sahip olması gerekir. Gizli ağ arabirimi, düz veya VLAN ağ arabirimi olabilir. Düz bir ağ arabirimi düz yöneticilerle birlikte flat_interface tarafından kontrol edilir. Bir VLAN ağ arayüzü, VLAN yöneticileri ile birlikte ``vlan_interface`` seçeneği ile kontrol edilir.

source: The Network Controller provides virtual networks to enable compute servers to interact with each other and with the public network. All machines must have a public and private network interface. The public network interface is controlled by the ``public_interface`` option.
tr_tr: Ağ Denetleyicisi, hesaplama sunucularının birbirleriyle ve genel ağ ile etkileşim kurmalarını sağlamak için sanal ağlar sağlar. Tüm makinelerin bir kamu ve özel ağ arabirimine sahip olması gerekir. Genel ağ arayüzü ``public_interface`` seçeneği ile kontrol edilir.

source: The Object Storage back-end process that creates and manages object replicas.
tr_tr: Nesne kopyaları oluşturan ve yöneten Nesne Depolama birimi arka uç işlemi.

source: The Object Storage component that provides container services, such as create, delete, list, and so on.
id: Komponen Storage Obyek yang menyediakan layanan kontainer, seperti membuat, menghapus, daftar, dan sebagainya.
tr_tr: Oluşturma, silme, listeleme ve benzeri gibi kapsayıcı hizmetleri sağlayan Nesne Depolama bileşenidir.

source: The Object Storage context of an account. Do not confuse with a user account from an authentication service, such as Active Directory, /etc/passwd, OpenLDAP, OpenStack Identity, and so on.
id: Objek Storage konteks akun. Jangan bingung dengan akun pengguna dari layanan otentikasi, seperti Active Directory, / etc / passwd, OpenLDAP, OpenStack Identitas, dan sebagainya.
tr_tr: Bir hesabın Nesne Depolama kaynağı. Active Directory, /etc/passwd, OpenLDAP, OpenStack Kimlk denetimi vb. gibi bir kimlik doğrulama servisindeki bir kullanıcı hesabıyla karıştırmayın.

source: The OpenStack :term:`Identity service <Identity service (keystone)>` provides a single point of integration for managing authentication, authorization, and a catalog of services.
tr_tr: OpenStack :term:`Kimlik servisi <Kimlik servisi (keystone)>` kimlik doğrulama, yetkilendirme ve servislerin kataloğu yönetimi için tek bir noktada tümleştirme sağlar.

source: The OpenStack Administrator configures the basic infrastructure using the following steps:
id: The OpenStack Administrator mengkonfigurasi infrastruktur dasar menggunakan langkah-langkah berikut:
tr_tr: OpenStack Yöneticisi aşağıdaki adımları kullanarak temel altyapıyı yapılandırır:

source: The OpenStack Block Storage service (cinder) adds persistent storage to a virtual machine. Block Storage provides an infrastructure for managing volumes, and interacts with OpenStack Compute to provide volumes for instances. The service also enables management of volume snapshots, and volume types.
id: Layanan OpenStack Block Storage (abu) menambahkan penyimpanan persisten untuk mesin virtual. Blok Storage menyediakan infrastruktur untuk mengelola volume, dan berinteraksi dengan OpenStack Compute untuk memberikan volume untuk contoh. Layanan ini juga memungkinkan pengelolaan snapshot volume, dan jenis volume.
tr_tr: OpenStack Blok Depolama servisi (cinder) bir sanal makineye kalıcı depolama ekler. Blok Depolama birimleri yönetmek için bir alt yapı sağlar, OpenStack Hesaplama ile iletişime geçerek sunuculara birimler sağlar. Servis ayrıca birim anlık görüntülerini ve birim türlerini yönetmeyi sağlar.

source: The OpenStack Dashboard is a modular `Django web application <https://www.djangoproject.com/>`__ that provides a graphical interface to OpenStack services.
tr_tr: OpenStack Kontrol Panosu OpenStack servislerine grafik arayüz sağlayan modüler bir `Django web uygulamasıdır <https://www.djangoproject.com/>`__.

source: The OpenStack IRC channel
tr_tr: OpenStack IRC kanalı

source: The OpenStack Image service includes the following components:
id: Layanan OpenStack Gambar meliputi komponen-komponen berikut:
tr_tr: OpenStack İmaj servisi şu bileşenleri içerir:

source: The OpenStack Image service is central to Infrastructure-as-a-Service (IaaS) as shown in :ref:`get_started_conceptual_architecture`. It accepts API requests for disk or server images, and metadata definitions from end users or OpenStack Compute components. It also supports the storage of disk or server images on various repository types, including OpenStack Object Storage.
id: The OpenStack layanan Gambar merupakan pusat Infrastruktur-as-a-Service (IaaS) seperti yang ditunjukkan pada: ref: `get_started_conceptual_architecture`. Ini menerima permintaan API untuk disk atau server gambar, dan definisi metadata dari pengguna akhir atau komponen OpenStack Compute. Ini juga mendukung penyimpanan disk atau server gambar pada berbagai jenis repositori, termasuk OpenStack Object Storage.
tr_tr: :ref:`get_started_conceptual_architecture` kısmında gösterildiği gibi OpenStack İmaj servisi Servis olarak Altyapıya (IaaS) merkezidir. Disk veya sunucu imajları için API isteklerini ve son kullanıcılardan veya OpenStack Hesaplama bileşenlerinden metaveri tanımlarını kabul eder. Ayrıca OpenStack Nesne Depolama da dahil, çeşitli depo türleri üzerinde disk veya sunucu imajlarını depolanmasını destekler.

source: The OpenStack Object Storage is a multi-project object storage system. It is highly scalable and can manage large amounts of unstructured data at low cost through a RESTful HTTP API.
tr_tr: OpenStack Nesne Depolama çoklu-proje nesne depolama sistemidir. Yüksek ölçeklenebilirliğe sahiptir büyük miktarda yapısız veriyi RESTful HTTP API aracılığıyla ucuza yönetir.

source: The OpenStack Shared File Systems service (manila) provides file storage to a virtual machine. The Shared File Systems service provides an infrastructure for managing and provisioning of file shares. The service also enables management of share types as well as share snapshots if a driver supports them.
id: The OpenStack Bersama Sistem Berkas layanan (manila) menyediakan penyimpanan file untuk mesin virtual. Layanan Sistem Berkas Shared menyediakan infrastruktur untuk mengelola dan penyediaan saham file. Layanan ini juga memungkinkan manajemen dari jenis saham serta berbagi snapshot jika driver mendukung mereka.
tr_tr: OpenStack Paylaşımlı Dosya Sistemleri servisi (manila) bir sanal makineye dosya depolama sağlar. Paylaşımlı Dosya Sistemleri servisi dosya paylaşımlarının yönetimi ve hazırlanması için bir alt yapı sağlar. Servis ayrıca paylaşım türlerinin ve sürücü destekliyorsa paylaşım anlık görüntülerinin yönetimini etkinleştirir.

source: The OpenStack community lives in the #openstack IRC channel on the Freenode network. You can hang out, ask questions, or get immediate feedback for urgent and pressing issues. To install an IRC client or use a browser-based client, go to `https://webchat.freenode.net/ <https://webchat.freenode.net>`_. You can also use `Colloquy <http://colloquy.info/>`_ (Mac OS X), `mIRC <http://www.mirc.com/>`_ (Windows), or XChat (Linux). When you are in the IRC channel and want to share code or command output, the generally accepted method is to use a Paste Bin. The OpenStack project has one at `Paste <http://paste.openstack.org>`_. Just paste your longer amounts of text or logs in the web form and you get a URL that you can paste into the channel. The OpenStack IRC channel is ``#openstack`` on ``irc.freenode.net``. You can find a list of all OpenStack IRC channels on the `IRC page on the wiki <https://wiki.openstack.org/wiki/IRC>`_.
tr_tr: OpenStack topluluğu Freenode ağındaki #openstack IRC kanalı üzerinde yaşamaktadır. Acele ve acil sorunlar için takılabilirsiniz, sorular sorabilir veya anında geribildirim alabilirsiniz. IRC istemcisi kurmak veya tarayıcı tabanlı istemci kullanmak için `https://webchat.freenode.net/ <https://webchat.freenode.net>`_ bağlantısını ziyaret edin. Ayrıca `Colloquy <http://colloquy.info/>`_ (Mac OS X), `mIRC <http://www.mirc.com/>`_ (Windows), veya XChat (Linux) kullanabilirsiniz. IRC kanalındayken kod paylaşmak istiyorsanız, genel olarak kabul görülen yöntem Paste Bin'i kullanmanızdır. OpenStack projesi için `Paste <http://paste.openstack.org>`_ bağlantısında bir tane var. OpenStack IRC kanalı ``irc.freenode.net`` üzerinde ``#openstack``'dir. Tüm OpenStack IRC kanallarının listesini `vikideki IRC sayfasında <https://wiki.openstack.org/wiki/IRC>`_ bulabilirsiniz.

source: The OpenStack community values your set up and testing efforts and wants your feedback. To log a bug, you must `sign up for a Launchpad account <https://launchpad.net/+login>`_. You can view existing bugs and report bugs in the Launchpad Bugs area. Use the search feature to determine whether the bug has already been reported or already been fixed. If it still seems like your bug is unreported, fill out a bug report.
tr_tr: OpenStack topluluğu kurulum ve test çabalarınızı değerlendirir ve geri bildiriminizi istemektedir. Bir hata raporlamak için `bir Launchpad hesabı açmalısınız <https://launchpad.net/+login>`_. Varolan hataları görüntüleyebilir ve hataları Launchpad Bugs alanında bildirebilirsiniz. Hatanın zaten rapor edildi mi yoksa zaten düzeltilmiş mi olduğunu belirlemek için arama özelliğini kullanın. Hâlâ hata rapor edilmemiş gibi görünüyorsa bir hata raporu doldurun.

source: The OpenStack configuration files use an INI format to describe options and their values. It consists of sections and key value pairs.
id: File-file konfigurasi OpenStack menggunakan format INI untuk menggambarkan pilihan dan nilai-nilai mereka. Ini terdiri dari bagian dan pasangan nilai kunci.
tr_tr: OpenStack yapılandırma dosyaları, seçenekleri ve değerlerini tanımlamak için bir INI biçimi kullanır. Bölümler ve anahtar değer çiftlerinden oluşur.

source: The OpenStack core project that implements services and associated libraries to provide massively-scalable, on-demand, self-service access to compute resources, including bare metal, virtual machines, and containers.
tr_tr: Bare metal, sanal makineler ve kaplar dahil olmak üzere kaynakları hesaplamak için geniş kapsamlı, ölçeklenebilir, isteğe bağlı, self-servis erişim sağlamak için hizmetleri ve ilgili kütüphaneleri uygulayan OpenStack temel projesi.

source: The OpenStack core project that provides eventually consistent and redundant storage and retrieval of fixed digital content.
tr_tr: Sonuç olarak tutarlı ve yedekli depolama ve sabit dijital içeriğin alınmasını sağlayan OpenStack çekirdek projesi.

source: The OpenStack documentation uses several typesetting conventions.
id: Dokumentasi OpenStack menggunakan beberapa konvensi typesetting.
tr_tr: OpenStack belgesi bir takım dizge teamüllü kullanır.

source: The OpenStack end user deploys the Database service using the following steps:
id: Pengguna OpenStack akhir menyebarkan layanan database menggunakan langkah-langkah berikut:
tr_tr: OpenStack son kullanıcısı aşağıdaki adımları takip ederek Veritabanı servisini kurar:

source: The OpenStack project is an open source cloud computing platform for all types of clouds, which aims to be simple to implement, massively scalable, and feature rich. Developers and cloud computing technologists from around the world create the OpenStack project.
id: Proyek OpenStack adalah sumber awan platform komputasi terbuka untuk semua jenis awan, yang bertujuan untuk menjadi sederhana untuk melaksanakan, secara besar-besaran terukur, dan kaya fitur. Pengembang dan teknologi komputasi awan dari seluruh dunia membuat proyek OpenStack.
tr_tr: OpenStack projesi tüm bulut türleri için uyarlaması basit, büyük ölçeğe yayılabilir ve özellik bakımından zengin açık kaynak bulut hesaplama platformudur. Tüm dünyadan geliştiriciler ve bulut hesaplama teknolojistleri OpenStack projesini oluşturur.

source: The OpenStack project which collects measurements of the utilization of the physical and virtual resources comprising deployed clouds, persists this data for subsequent retrieval and analysis, and triggers actions when defined criteria are met.
tr_tr: Dağıtılan bulutları içeren fiziksel ve sanal kaynakların kullanım ölçümlerini toplayan OpenStack projesi, bu verileri daha sonraki geri çağırma ve analiz için devam ettirir ve tanımlanan ölçütler karşılandığında eylemler tetikler.

source: The OpenStack project which implements services and associated libraries to provide on-demand, scalable, and technology-agnostic network abstraction.
tr_tr: İsteğe bağlı, ölçeklenebilir ve yeni teknolojilere geçişten etkilenmeyen ağ soyutlaması sağlamak için hizmetleri ve ilgili kütüphaneleri uygulayan OpenStack projesi.

source: The OpenStack service that implement services and libraries to provide on-demand, self-service access to Block Storage resources via abstraction and automation on top of other block storage devices.
tr_tr: Diğer blok depolama aygıtlarının üstünde soyutlama ve otomasyon yoluyla Blok Depolama kaynaklarına isteğe bağlı, self-servis erişim sağlamak için hizmetleri ve kitaplıkları uygulayan OpenStack hizmeti.

source: The OpenStack service that provide services and associated libraries to store, browse, share, distribute and manage bootable disk images, other data closely associated with initializing compute resources, and metadata definitions.
tr_tr: Önyüklenebilir disk imajlarını, hesaplama kaynakları başlatma işlemiyle yakından ilişkili diğer verileri ve üst veri tanımlarını depolamak, taramak, paylaşmak, dağıtmak ve yönetmek için hizmetler ve ilişkili kitaplıklar sağlayan OpenStack hizmeti.
