Repository: 25hours/openstack-manuals
Catalog: doc/common/source/locale/*/LC_MESSAGES/common.po
Languages: id, tr_tr

source: The following diagram shows the relationships among the OpenStack services:
id: Diagram berikut menunjukkan hubungan antara layanan OpenStack:
tr_tr: Aşağıdaki çizim OpenStack servisleri arasındaki ilişkiyi gösterir:

source: The following documentation provides reference and guidance information for the OpenStack APIs:
id: Dokumentasi berikut memberikan informasi referensi dan pedoman bagi API OpenStack:
tr_tr: Aşağıdaki belgeler, OpenStack API'leri için referans ve kılavuz bilgi sağlar:

source: The following example shows how to update an existing image with a properties that describe the disk bus, the CD-ROM bus, and the VIF model:
id: Contoh berikut menunjukkan cara memperbarui gambar yang ada dengan sifat yang menggambarkan bus disk, bus CD-ROM, dan model VIF:
tr_tr: Aşağıdaki örnek mevcut bir imajı disk yolunu, CD-ROM yolunu ve VIF modelini tanımlayan özelliklerle nasıl güncelleyeceğinizi gösterir:

source: The following example shows the command for installing the OpenStack client with ``pip``, which supports multiple services.
id: Contoh berikut menunjukkan perintah untuk menginstal klien OpenStack dengan `` pip``, yang mendukung beberapa layanan.
tr_tr: Aşağıdaki örnek OpenStack istemcisini ``pip`` ile kurmak için birden fazla servisi destekleyen örnek komutu gösterir.

source: The following example shows the command that you would use to upload a CentOS 6.3 image in qcow2 format and configure it for public access:
id: Contoh berikut menunjukkan perintah yang akan Anda gunakan untuk meng-upload CentOS 6.3 gambar dalam qcow2 Format dan mengkonfigurasinya untuk akses publik:
tr_tr: Aşağıdaki örnek bir CentOS 6.3 imajını qcow2 biçiminde yüklemek ve herkese açık erişimle yapılandırmak için kullanacağınız komutu gösterir:

source: The following example unmanages the ``my-snapshot-id`` image:
id: Contoh berikut unmanages yang `` gambar-snapshot-id`` saya:
tr_tr: Aşağıdaki örnek ``my-snapshot-id`` imajını yönetmeyi bırakır:

source: The following examples show the host usage statistics for a host called ``devstack``.
tr_tr: Aşağıdaki örnekler ``devstack`` ismindeki bir sunucu için kullanım istatistiklerini gösterir.

source: The following guide provides how to contribute to OpenStack documentation:
id: Panduan berikut memberikan cara berkontribusi dokumentasi OpenStack:
tr_tr: Aşağıdaki kılavuz, OpenStack belgelerine nasıl katkıda bulunacağınızı anlatır:

source: The following individual clients are deprecated in favor of a common client. Instead of installing and learning all these clients, we recommend installing and using the OpenStack client. You may need to install an individual project's client because coverage is not yet sufficient in the OpenStack client. If you need to install an individual client's project, replace the ``PROJECT`` name in this ``pip install`` command using the list below.
tr_tr: Aşağıdaki bağımsız istemciler ortak bir istemci sebebiyle artık kullanılmıyor. Tüm bu istemcileri kurup öğrenmek yerine, OpenStack istemcisini kurup kullanmanızı öneriyoruz. OpenStack istemcisinde kapsam henüz tam olmadığından bağımsız bir projenin istemcisini kurmanız gerekebilir. Tek bir istemcinin projesini kurmanız gerekiyorsa, aşağıdaki listeyi kullanarak bu ``pip install`` komutundaki ``PROJE`` ismini değiştirin.

source: The following list explains the optional arguments that you can use with the ``create`` and ``set`` commands to modify image properties. For more information, refer to the `OpenStack Image command reference <https://docs.openstack.org/developer/python-openstackclient/command-objects/image.html>`_.
tr_tr: Aşağıdaki liste imaj özelliklerini değiştirmek için ``create`` ve ``set`` komutlarıyla birlikte kullanabileceğiniz isteğe bağlı bağımsız değişkenleri açıklar. Daha fazla bilgi için `OpenStack İmaj komut başvurusuna <https://docs.openstack.org/developer/python-openstackclient/command-objects/image.html>`_ göz atın.

source: The following resources are available to help you run and use OpenStack. The OpenStack community constantly improves and adds to the main features of OpenStack, but if you have any questions, do not hesitate to ask. Use the following resources to get OpenStack support and troubleshoot your installations.
id: Sumber daya berikut ini tersedia untuk membantu Anda menjalankan dan menggunakan OpenStack. Masyarakat OpenStack terus-menerus meningkatkan dan menambah fitur utama dari OpenStack, tetapi jika Anda memiliki pertanyaan, jangan ragu untuk bertanya. Gunakan sumber daya berikut untuk mendapatkan dukungan OpenStack dan memecahkan masalah instalasi Anda.
tr_tr: OpenStack'ı çalıştırmanıza ve kullanmanıza yardımcı olması için aşağıdaki kaynaklar mevcuttur. OpenStack topluluğu OpenStack'ın temel özelliklerini sürekli geliştirir ve ekler, ancak herhangi bir sorunuz varsa, sormaktan çekinmeyin. OpenStack desteğini almak ve yükleme sırasında oluşan sorunları çözmek için aşağıdaki kaynakları kullanın.

source: The following table describes the OpenStack services that make up the OpenStack architecture:
id: Tabel berikut menjelaskan layanan OpenStack yang membentuk arsitektur OpenStack:
tr_tr: Aşağıdaki tablo OpenStack mimarisini oluşturan OpenStack servislerini tanımlar:

source: The intelligence in the IPMI architecture, which is a specialized micro-controller that is embedded on the motherboard of a computer and acts as a server. Manages the interface between system management software and platform hardware.
tr_tr: IPMI mimarisindeki zeka, bir bilgisayarın anakartına yerleştirilmiş ve bir sunucu görevini gören uzmanlaşmış bir mikro denetleyicidir. Sistem yönetimi yazılımı ve platform donanımı arasındaki arabirimi yönetir.

source: The main virtual communication line used by all AMQP messages for inter-cloud communications within Compute.
tr_tr: Hesaplama içindeki bulutlar arası iletişimler için tüm AMQP mesajları tarafından kullanılan ana sanal iletişim hattı.

source: The method of storage used by horizon to track client sessions, such as local memory, cookies, a database, or memcached.
tr_tr: Yerel bellek, çerezler, veritabanı veya memcached gibi istemci oturumlarını izlemek için horizon tarafından kullanılan depolama yöntemi.

source: The method that a service uses for persistent storage, such as iSCSI, NFS, or local disk.
tr_tr: Bir hizmetin iSCSI, NFS veya yerel disk gibi kalıcı depolama için kullandığı yöntem.

source: The method used by the Compute RabbitMQ for intra-service communications.
tr_tr: Hesaplama RabbitMQ tarafından servis içi iletişim için kullanılan yöntem.

source: The most common web server software currently used on the Internet.
id: Perangkat lunak web server yang paling umum saat ini digunakan di Internet.
tr_tr: Şu anda Internet'te kullanılan en yaygın web sunucusu yazılımı.

source: The nova-api daemon provides access to nova services. Can communicate with other APIs, such as the Amazon EC2 API.
id: The nova-api daemon menyediakan akses ke layanan nova. Dapat berkomunikasi dengan API lainnya, seperti API Amazon EC2.
tr_tr: Nova-api artalan işlemi, yeni servislere erişim sağlar. Amazon EC2 API'sı gibi diğer API'lerle iletişim kurabilir.

source: The number of replicas of the data in an Object Storage ring.
tr_tr: Nesne Depolama Birimi halkasındaki verilerin kopyalarının sayısı.

source: The open standard messaging protocol used by OpenStack components for intra-service communications, provided by RabbitMQ, Qpid, or ZeroMQ.
id: terbuka protokol standar pesan yang digunakan oleh komponen OpenStack untuk komunikasi intra-service, yang disediakan oleh RabbitMQ, Qpid, vs ZeroMQ.
tr_tr: OpenStack bileşenleri tarafından servisler arası iletişim için kullanılan, RabbitMQ, Qpid veya ZeroMQ tarafından sağlanan açık standart ileti protokolü.

source: The output shows that the volume is attached to the server with ID ``84c6e57d-a6b1-44b6-81eb-fcb36afd31b5``, is in the nova availability zone, and is bootable.
id: Output menunjukkan bahwa volume terpasang ke server dengan ID `` 84c6e57d-a6b1-44b6-81eb-fcb36afd31b5``, berada di zona ketersediaan nova, dan bootable.
tr_tr: Çıktı birimin sunucuya ``84c6e57d-a6b1-44b6-81eb-fcb36afd31b5`` kimliğiyle eklendiğini, nova kullanılabilirlik bölgesinde olduğunu ve önyüklenebilir olduğunu gösterir.

source: The output shows the volume transfer ID in the ``id`` row and the authorization key.
id: output menunjukkan volume transfer ID di `` baris id`` dan kunci otorisasi.
tr_tr: Çıktı ``id`` satırında birim aktarım kimliğini ve yetkilendirme anahtarını gösterir.

source: The packaged version might install older clients. If you want to make sure the latest clients are installed, you might need to :ref:`install the clients with pip <installing_with_pip>`.
tr_tr: Paketli sürüm daha eski istemcileri kurabilir. En son istemcilerin kurulu olduğundan emin olmak isterseniz, :ref:`istemcileri pip ile kurmak <installing_with_pip>` isteyebilirsiniz.

source: The persistent data store used to save and retrieve information for a service, such as lists of Object Storage objects, current state of guest VMs, lists of user names, and so on. Also, the method that the Image service uses to get and store VM images. Options include Object Storage, locally mounted file system, RADOS block devices, VMware datastore, and HTTP.
tr_tr: Nesne Depolama nesnelerinin listeleri, konuk VM'lerin mevcut durumu, kullanıcı adlarının listesi vb. Gibi bir hizmet için bilgi kaydetmek ve almak için kullanılan kalıcı veri deposu. Ayrıca, İmaj hizmetinin VM imajlarını alması ve depolaması için kullandığı yöntem. Seçenekler Nesne Depolama, yerel olarak monte edilmiş dosya sistemi, RADOS blok cihazları, VMware veri deposu ve HTTP'dir.

source: The person responsible for installing, configuring, and managing an OpenStack cloud.
id: Orang yang bertanggung jawab untuk menginstal, mengkonfigurasi, dan mengelola awan OpenStack.
tr_tr: Bir OpenStack bulutunu yüklemek, yapılandırmak ve yönetmekten sorumlu olan kişi.

source: The person responsible for planning and maintaining an OpenStack installation.
tr_tr: OpenStack kurulum planlama ve bakımından sorumlu kişi.

source: The point where a user interacts with a service; can be an API endpoint, the dashboard, or a command-line tool.
tr_tr: Bir kullanıcının bir hizmetle etkileşime girdiği nokta; bir API bitiş noktası, kontrol paneli veya bir komut satırı aracı olabilir.

source: The practice of placing one packet type within another for the purposes of abstracting or securing data. Examples include GRE, MPLS, or IPsec.
id: Praktek menempatkan satu jenis paket dalam lain untuk tujuan abstrak atau mengamankan data. Contohnya termasuk GRE, MPLS, atau IPsec.
tr_tr: Verilerin özetlenmesi veya güvence altına alınması amacıyla bir paketin başka bir yere yerleştirilmesi uygulaması. Örnekler arasında GRE, MPLS veya IPsec bulunur.

source: The practice of utilizing a secondary environment to elastically build instances on-demand when the primary environment is resource constrained.
id: Praktek memanfaatkan lingkungan sekunder untuk elastis membangun kasus on-demand ketika lingkungan primer sumber daya terbatas.
tr_tr: Birincil çevre kaynak kısıtlı olduğunda talep üzerine örnekleri elastik bir şekilde oluşturmak için ikincil bir ortam kullanma uygulaması.

source: The procedure for volume transfer is intended for projects (both the volume donor and recipient) within the same cloud.
tr_tr: Birim aktarımı için yordam aynı bulut içindeki projeler içindir (hem birim veren hem alan).

source: The process associating a Compute floating IP address with a fixed IP address.
id: Proses mengaitkan Compute mengambang alamat IP dengan alamat IP tetap.
tr_tr: Bir Hesaplama kayan IP adresini sabit bir IP adresiyle ilişkilendiren süreç.

source: The process of automating IP address allocation, deallocation, and management. Currently provided by Compute, melange, and Networking.
id: Proses mengotomatisasi alokasi alamat IP, dealokasi, dan manajemen. Saat ini disediakan oleh Compute, melange, dan Jaringan.
tr_tr: IP adres tahsisi, tahsis ve yönetimi otomatikleştirme süreci. Şu anda Hesaplama, melange ve Ağ tarafından sağlanmaktadır.

source: The process of connecting a VIF or vNIC to a L2 network in Networking. In the context of Compute, this process connects a storage volume to an instance.
id: Proses menghubungkan VIF atau vNIC ke jaringan L2 di Jaringan. Dalam konteks Compute, proses ini menghubungkan volume penyimpanan ke sebuah contoh.
tr_tr: Bir VIF veya vNIC'yi, Ağda bir L2 ağa bağlama süreci. Hesaplama bağlamında, bu işlem bir depolama birimini bir sunucuya bağlar.

source: The process of copying data to a separate physical device for fault tolerance and performance.
tr_tr: Hata toleransı ve performansı için verileri ayrı bir fiziksel aygıta kopyalama işlemi.

source: The process of distributing Object Storage partitions across all drives in the ring; used during initial ring creation and after ring reconfiguration.
tr_tr: Nesne Depolama bölümlerini halkadaki tüm sürücüler arasında dağıtma süreci; ilk halka oluşturma sırasında ve halka yeniden yapılandırmadan sonra kullanılır.

source: The process of filtering incoming network traffic. Supported by Compute.
id: Proses penyaringan lalu lintas jaringan yang masuk. Didukung oleh Komputer.
tr_tr: Gelen ağ trafiğini filtreleme süreci. Hesaplama tarafından desteklenmektedir.

source: The process of finding duplicate data at the disk block, file, and/or object level to minimize storage use—currently unsupported within OpenStack.
id: Proses menemukan data ganda pada blok disk, berkas, dan / atau tingkat objek untuk meminimalkan penyimpanan penggunaan-saat yang tidak didukung dalam OpenStack.
tr_tr: Depolama kullanımını en aza indirmek için disk bloğu, dosya ve/veya nesne seviyesinde çoklu veriyi bulma işlemi—OpenStack şu an desteklemiyor.

source: The process of migrating one or all virtual machine (VM) instances from one host to another, compatible with both shared storage live migration and block migration.
id: Proses migrasi satu atau semua mesin virtual (VM) contoh dari satu host ke yang lain, kompatibel dengan penyimpanan bersama migrasi hidup dan migrasi blok.
tr_tr: Bir veya birden çok sanal makine (VM) örneğini bir ana makineden diğerine geçirme işlemi, paylaşılan depolama ortamının canlı geçişiyle uyumlu ve geçiş işlemini engelleme işlemi ile uyumludur.

source: The process of moving a VM instance from one host to another.
tr_tr: Bir VM sunucusunu bir ana bilgisayardan diğerine taşıma işlemi.

source: The process of putting a file into a virtual machine image before the instance is started.
id: Proses meletakkan file menjadi gambar mesin virtual sebelum instance dimulai.
tr_tr: Sunucu başlatılmadan önce bir dosyayı bir sanal makine imajına koyma işlemi.

source: The process of removing the association between a floating IP address and a fixed IP address. Once this association is removed, the floating IP returns to the address pool.
id: Proses menghilangkan hubungan antara alamat IP mengambang dan alamat IP tetap. Setelah hubungan ini dihapus, IP mengambang kembali ke kolam renang alamat.
tr_tr: Kayan bir IP adresi ile sabit bir IP adresi arasındaki ilişkiyi kaldırma işlemi. Bu ilişki kaldırıldıktan sonra, kayan IP, adres havuzuna geri döner.

source: The process of removing the association between a floating IP address and fixed IP and thus returning the floating IP address to the address pool.
id: Proses menghilangkan hubungan antara alamat IP mengambang dan tetap IP dan dengan demikian kembali alamat IP mengambang ke kolam alamat.
tr_tr: Bir kayan IP adresi ve sabit IP arasındaki ilişkiyi kaldırma ve böylece kayan IP adresini adres havuzuna döndürme süreci.

source: The process of spreading client requests between two or more nodes to improve performance and availability.
tr_tr: Performansı ve kullanılabilirliği artırmak için istemci isteklerini iki veya daha fazla düğüm arasında yayma işlemi.

source: The process of taking a floating IP address from the address pool so it can be associated with a fixed IP on a guest VM instance.
id: Proses mengambil alamat IP mengambang dari kolam alamat sehingga dapat dikaitkan dengan IP tetap pada tamu VM instance.
tr_tr: Bir konuk VM örneğinde sabit bir IP ile ilişkilendirilebilmesi için adres havuzundan yüzen bir IP adresi alma süreci.

source: The process that confirms that the user, process, or client is really who they say they are through private key, secret token, password, fingerprint, or similar method.
id: Proses yang menegaskan bahwa pengguna, proses, atau klien adalah benar-benar yang mereka katakan melalui private key, tanda rahasia, password, sidik jari, atau metode yang sama.
tr_tr: Kullanıcı, işlem veya istemcinin gerçekten özel anahtar, gizli jeton, parola, parmak izi veya benzeri bir yöntemle söylediklerini doğrulayan işlem.

source: The project that aims to rovide scalable, on demand, self service access to load-balancer services, in technology-agnostic manner.
tr_tr: Yük dengeleyici servislere teknolojiden bağımsmız ölçeklenebilir, istek anında, kendine servis erişim sağlamayı hedefleyen proje.

source: The project that facilitates API client authentication, service discovery, distributed multi-project authorization, and auditing. It provides a central directory of users mapped to the OpenStack services they can access. It also registers endpoints for OpenStack services and acts as a common authentication system.
tr_tr: API istemcisi kimlik doğrulamasını, hizmet keşifini, çoklu proje yetkilendirmesini dağıtmayı ve denetlemeyi kolaylaştıran proje. Erişebildikleri OpenStack hizmetlerine eşlenen merkezi bir kullanıcı dizini sağlar. Ayrıca, OpenStack hizmetleri için uç noktaları kaydeder ve ortak bir kimlik doğrulama sistemi görevi görür.

source: The project that implements clustering services and libraries for the management of groups of homogeneous objects exposed by other OpenStack services.
tr_tr: Diğer OpenStack hizmetlerine maruz kalan homojen nesnelerin gruplarının yönetimi için kümeleme hizmetleri ve kütüphaneleri uygulayan proje.

source: The project that produces a secret storage and generation system capable of providing key management for services wishing to enable encryption features.
tr_tr: Şifreleme özelliklerini etkinleştirmek isteyen hizmetler için anahtar yönetimi sağlayabilen gizli bir depolama ve üretim sistemi üreten proje.

source: The project that produces a set of python libraries containing code shared by OpenStack projects. The APIs provided by these libraries should be high quality, stable, consistent, documented and generally applicable.
tr_tr: OpenStack projeleri tarafından paylaşılan kodu içeren bir dizi python kütüphanesi üreten proje. Bu kütüphaneler tarafından sağlanan API'ler yüksek kaliteli, kararlı, tutarlı, belgelenmiş ve genel olarak uygulanabilir olmalıdır.

source: The project that provides Governance-as-a-Service across any collection of cloud services in order to monitor, enforce, and audit policy over dynamic infrastructure.
tr_tr: Dinamik altyapı üzerinde politikaları izlemek, uygulamak ve denetlemek için bulut hizmetlerinin herhangi bir kümesinde hizmet olarak Yönetişim'i sağlayan proje.

source: The project that provides a messaging service that affords a variety of distributed application patterns in an efficient, scalable and highly available manner, and to create and maintain associated Python libraries and documentation.
tr_tr: Etkili, ölçeklenebilir ve oldukça kullanılabilir bir şekilde çeşitli dağıtık uygulama modelleri tanıyan ve ilişkili Python kitaplıkları ve belgeleri oluşturmak ve sürdürmek için bir mesajlaşma hizmeti sağlayan proje.

source: The project that provides an application catalog service so that users can compose and deploy composite environments on an application abstraction level while managing the application lifecycle.
tr_tr: Kullanıcıların uygulama ömrünü yönetirken bileşik soyutlama düzeyinde bileşik ortamlar oluşturup dağıtabilecekleri bir uygulama katalog hizmeti sağlayan proje.

source: The project that provides integrated tooling for backing up, restoring, and recovering file systems, instances, or database backups.
tr_tr: Dosya sistemleri, sunucuları veya veritabanı yedeklerini yedekleme, geri yükleme ve kurtarma için tümleşik araç sağlayan proje.

source: The project which provides a set of services for provisioning, scaling, and managing container orchestration engines.
tr_tr: Kap orkestrasyon motorlarının hazırlanması, ölçeklendirilmesi ve yönetilmesi için bir dizi hizmet sunan proje.

source: The project who owns an Image service virtual machine image.
tr_tr: İmaj hizmeti sanal makine imajına sahip olan proje.

source: The protocol by which layer-3 IP addresses are resolved into layer-2 link local addresses.
id: protokol dimana alamat lapisan-3 IP diselesaikan ke dalam lapisan-2 Link alamat lokal.
tr_tr: Katman-3 IP adreslerinin katman-2 bağlantı yerel adreslerine dönüştürüldüğü protokol.

source: The queue
tr_tr: Kuyruk

source: The recommended way to install setuptools on Microsoft Windows is to follow the documentation provided on the `Python Setuptools <https://pypi.python.org/pypi/setuptools>`_ website.
tr_tr: Microsoft Windows üzerinde önerilen setuptools kurulum yolu `Python Setuptools <https://pypi.python.org/pypi/setuptools>`_ web sayfasında belgelerle sağlanmıştır.

source: The registry is a private internal service meant for use by OpenStack Image service. Do not expose this service to users.
id: registri adalah layanan internal pribadi dimaksudkan untuk digunakan oleh OpenStack layanan Gambar. Jangan mengekspos layanan ini untuk pengguna.
tr_tr: Kayıt defteri OpenStack İmaj servisi tarafından kullanılmak üzere özel bir dahili servistir. Bu servisi kullanıcılara açmayın.

source: The router advertisement daemon, used by the Compute VLAN manager and FlatDHCP manager to provide routing services for VM instances.
tr_tr: Compute VLAN yöneticisi ve FlatDHCP yöneticisi tarafından VM sunucuları için yönlendirme hizmetleri sağlamak için kullanılan yönlendirici reklam artalan işlemi.

source: The row that has the value ``used_max`` in the ``PROJECT`` column shows the sum of the resources allocated to the instances that run on the host.
tr_tr: ``PROJE`` sütunundaki ``kullanılan_azami`` değerine sahip satır makine üzerinde çalışan sunuculara ayrılan kaynakların toplamını gösterir.

source: The row that has the value ``used_now`` in the ``PROJECT`` column shows the sum of the resources allocated to the instances that run on the host, plus the resources allocated to the virtual machine of the host itself.
tr_tr: ``PROJE`` sütunundaki ``kullanılan_şimdi`` değerine sahip satır makine üzerinde çalışan sunuculara ayrılan kaynakların toplamını sanal makine ve sunucunun kendisine ayrılan kaynaklarla birlikte toplayarak gösterir.

source: The service enables deployers to integrate with the Orchestration service directly or through custom plug-ins.
id: Layanan ini memungkinkan pengembang untuk mengintegrasikan dengan layanan Orkestrasi langsung atau melalui plug-in khusus.
tr_tr: Servis kuranlara doğrudan veya özel eklentiler aracılığıyla Orkestrasyon servisiyle tümleşme sağlar.
