Repository: 25hours/openstack-manuals
Catalog: doc/common/source/locale/*/LC_MESSAGES/common.po
Languages: id, tr_tr

source: An official OpenStack service defined as optional by DefCore Committee. Currently, consists of Dashboard (horizon), Telemetry service (Telemetry), Orchestration service (heat), Database service (trove), Bare Metal service (ironic), and so on.
tr_tr: DefCore Komitesi tarafından seçimli olarak tanımlanan resmi bir OpenStack servisi. Şu anda, Kontrol Paneli (horizon), Telemetri servisi (Telemetry), Orkestrasyon hizmeti (heat), Veritabanı hizmeti (trove), Bare Metal servisi (ironic) vb.

source: An open source LDAP server. Supported by both Compute and Identity.
tr_tr: Açık kaynaklı bir LDAP sunucusu. Hem Hesaplama hem de Kimlik tarafından desteklenir.

source: An open source SQL toolkit for Python, used in OpenStack.
tr_tr: OpenStack'te kullanılan Python için açık kaynaklı SQL araç takımıdır.

source: An open source community project by SUSE that aims to provide all necessary services to quickly deploy and manage clouds.
tr_tr: Bulutları hızla dağıtmak ve yönetmek için gerekli tüm hizmetleri sunmayı amaçlayan SUSE'nin açık kaynak kodlu bir projesi.

source: An operating system configuration management tool supporting OpenStack deployments.
id: Alat operasi manajemen konfigurasi sistem yang mendukung OpenStack penyebaran.
tr_tr: OpenStack yayınlamalarını destekleyen bir işletim sistemi yapılandırma yönetimi aracı.

source: An operating system configuration-management tool supported by OpenStack.
tr_tr: OpenStack tarafından desteklenen bir işletim sistemi yapılandırma yönetimi aracı.

source: An operating system instance running under the control of a hypervisor.
id: Sebuah sistem operasi misalnya berjalan di bawah kendali hypervisor.
tr_tr: Bir hiper yöneticinin kontrolü altında çalışan bir işletim sistemi örneği.

source: An operating system instance that runs on top of a hypervisor. Multiple VMs can run at the same time on the same physical host.
tr_tr: Bir hypervisor'un üstünde çalışan bir işletim sistemi örneği. Aynı fiziksel ana bilgisayarda birden fazla VM aynı anda çalışabilir.

source: An option within Compute that enables administrators to create and manage users through the ``nova-manage`` command as opposed to using the Identity service.
id: Pilihan dalam Computer yang memungkinkan administrator untuk membuat dan mengelola pengguna melalui `` perintah nova-manage`` sebagai lawan menggunakan layanan Identity.
tr_tr: Hesaplama içindeki bir seçenek, yöneticilerin Kimlik servisini kullanmak yerine ``nova-manage`` komutuyla kullanıcıları oluşturmasına ve yönetmesine olanak tanıyan bir seçenektir.

source: An option within Image service so that an image is deleted after a predefined number of seconds instead of immediately.
id: Pilihan dalam layanan Gambar sehingga gambar dihapus setelah sejumlah standar detik bukannya segera.
tr_tr: Resim servisindeki bir seçenek, bir görüntünün hemen yerine önceden tanımlanmış saniye sayısından sonra silinmesini sağlar.

source: Analytics-as-a-Service for ad-hoc or bursty analytic workloads.
id: Analytics-as-a-Service untuk ad-hoc atau beban kerja analitik berdada.
tr_tr: Amaca özel ya da ani yüklü analitik iş yükleri için Servis olarak Tahlili.

source: Another option is to use the `unofficial binary installer maintained by Christoph Gohlke <http://www.lfd.uci.edu/~gohlke/pythonlibs/#setuptools>`_.
tr_tr: Başka bir seçenek `Christoph Gohlke tarafından sürdürülen resmi olmayan ikilik kurucudur <http://www.lfd.uci.edu/~gohlke/pythonlibs/#setuptools>`_.

source: Another option is to use the `unofficial binary installer provided by Christoph Gohlke <http://www.lfd.uci.edu/~gohlke/pythonlibs/#pip>`_.
tr_tr: Başka bir seçenek `Christoph Gohlke tarafından sağlanan resmi olmayan ikilik kurucuyu <http://www.lfd.uci.edu/~gohlke/pythonlibs/#pip>`_ kullanmaktır.

source: Any business that provides Internet access to individuals or businesses.
id: Setiap bisnis yang menyediakan akses Internet untuk individu atau bisnis.
tr_tr: Kişilere veya şirketlere İnternet erişimi sağlayan herhangi bir şirket.

source: Any client software that enables a computer or device to access the Internet.
id: Setiap perangkat lunak klien yang memungkinkan komputer atau perangkat untuk mengakses internet.
tr_tr: Bir bilgisayarın veya aygıtın İnternet'e erişmesini sağlayan herhangi bir istemci yazılımı.

source: Any compute node that runs the network worker daemon.
tr_tr: Ağ işçisi arka plan programını çalıştıran herhangi bir hesaplama düğümü.

source: Any deployment-specific information is helpful, such as whether you are using Ubuntu 14.04 or are performing a multi-node installation.
id: Setiap informasi penyebaran spesifik membantu, seperti apakah Anda menggunakan Ubuntu 14.04 atau melakukan instalasi multi-node.
tr_tr: Herhangi bir geliştirme özelinde bilgi, Ubuntu 14.04 kullanıp kullanmadığınız veya çok-düğümlü kurulum yapıyor olmanız gibi bilgiler yardımcı olur.

source: Any kind of text that contains a link to some other site, commonly found in documents where clicking on a word or words opens up a different website.
id: Setiap jenis teks yang berisi link ke beberapa situs lain, umumnya ditemukan dalam dokumen saat mengklik sebuah kata atau kata-kata membuka situs web yang berbeda.
tr_tr: Bir başka siteye, genellikle bir kelimeyi veya kelimeleri tıklayan belgelerde bulunan başka bir web sitesine bağlantı içeren her tür metin.

source: Any node running a daemon or worker that provides an API endpoint.
id: Setiap node menjalankan daemon atau pekerja yang menyediakan endpoint API.
tr_tr: API uçnoktası sağlanyan .alışan bir arkaplan işleminin veya işçinin herhangi bir düğümü.

source: Any piece of hardware or software that wants to connect to the network services provided by Networking, the network connectivity service. An entity can make use of Networking by implementing a VIF.
id: Setiap bagian dari perangkat keras atau perangkat lunak yang ingin terhubung ke layanan jaringan yang disediakan oleh Jaringan, layanan konektivitas jaringan. Entitas dapat menggunakan Jaringan dengan menerapkan VIF a.
tr_tr: Ağ bağlantısı hizmeti olan Ağ yönetimi tarafından sağlanan ağ hizmetlerine bağlanmak isteyen herhangi bir donanım veya yazılım parçası. Bir eleman, bir VIF uygulayarak Ağ yönetimini kullanabilir.

source: Any user, including the ``root`` user, can run commands that are prefixed with the ``$`` prompt.
id: Setiap pengguna, termasuk `` pengguna root``, dapat menjalankan perintah yang diawali dengan `` `` $ prompt.
tr_tr: Herhangi bir kullanıcı, ``root`` kullanıcısı dahil, ``$`` satırı ile başlayan komutları çalıştırabilir.

source: Apache Hadoop is an open source software framework that supports data-intensive distributed applications.
id: Apache Hadoop adalah kerangka kerja perangkat lunak open source yang mendukung aplikasi data-intensif didistribusikan.
tr_tr: Apache Hadoop, veri yoğunluklu dağıtılmış uygulamaları destekleyen açık kaynaklı bir yazılım çerçevesidir.

source: Apache License 2.0
tr_tr: Apache Lisansı 2.0

source: Apache Web Server
id: Server Web Apache
tr_tr: Apache Web sunucusu

source: Application Catalog service
id: Aplikasi layanan Katalog
tr_tr: Uygulama Kataloğu servisi

source: Application Catalog service (murano)
tr_tr: Uygulama Katalog hizmeti (murano)

source: Application Programming Interface (API)
tr_tr: Uygulama Programlama Arayüzü (API)

source: Application Service Provider (ASP)
tr_tr: Uygulama Hizmeti Sağlayıcı (ASP)

source: As a cloud end user, you can use the OpenStack Dashboard to provision your own resources within the limits set by administrators. You can modify the examples provided in this section to create other types and sizes of server instances.
tr_tr: Bulut son kullanıcısı olarak, OpenStack Kontrol Panosunu kullanarak yöneticiler tarafından ayarlanan sınırlar dahilinde kendi kaynaklarınız hazırlayabilirsiniz. Bu kısımda sağlanan örnekleri değiştirerek değişik türler ve farklı boyutlarda sunucular oluşturabilirsiniz.

source: As an administrator, you can migrate a volume with its data from one location to another in a manner that is transparent to users and workloads. You can migrate only detached volumes with no snapshots.
id: Sebagai administrator, Anda dapat bermigrasi volume dengan data dari satu lokasi ke lokasi lain dengan cara yang transparan kepada pengguna dan beban kerja. Anda dapat bermigrasi volume hanya terpisah tanpa snapshot.
tr_tr: Bir yönetici olarak, kullanıcılara ve iş yüklerine transparan şekilde bir birimi verisiyle birlikte bir konumdan diğerine göç ettirebilirsiniz. Yalnızca anlık görüntüleri olmayan ayrılmış birimleri göç ettirebilirsiniz.

source: As shown in :ref:`get_started_conceptual_architecture`, OpenStack consists of several independent parts, named the OpenStack services. All services authenticate through a common Identity service. Individual services interact with each other through public APIs, except where privileged administrator commands are necessary.
id: Seperti ditunjukkan dalam: ref: `get_started_conceptual_architecture`, OpenStack terdiri dari beberapa bagian independen, bernama layanan OpenStack. Semua layanan otentikasi melalui layanan Identity umum. pelayanan individu berinteraksi satu sama lain melalui API publik, kecuali perintah administrator istimewa yang diperlukan.
tr_tr: :ref:`get_started_conceptual_architecture` kısmında gösterildiği gibi, OpenStack birçok bağımsız parçadan oluşur, bunlara OpenStack servisleri denir. Tüm servisler ortak Kimlik servisiyle kimlik doğrulama yapar. Bağımsız servisler birbirleriyle yetkili yönetici komutlarının gerektiği haller hariç açık API'ler aracılığıyla iletişim kurarlar.

source: As the volume donor, request a volume transfer authorization code for a specific volume:
id: Sebagai donor volume, meminta transfer Volume kode otorisasi untuk volume tertentu:
tr_tr: Birim vericisi olarak, belirli bir birim için bir birim aktarım yetkilendirme kodu isteyin:

source: As the volume recipient, you must first obtain the transfer ID and authorization key from the original owner.
id: Sebagai penerima volume, Anda harus terlebih dahulu mendapatkan transfer ID dan kunci otorisasi dari pemilik asli.
tr_tr: Birim alıcısı olarak, önce asıl sahipten aktarım kimliğini ve yetkilendirme anahtarını almalısınız.

source: Association of an interface ID to a logical port. Plugs an interface into a port.
id: Asosiasi ID antarmuka ke port logis. Colokan antarmuka ke port.
tr_tr: Bir arayüz ID'sinin bir mantıksal bağlantı noktası ile ilişkisi. Bir arayüzü bir bağlantı noktasına takar.

source: Asynchronous JavaScript and XML (AJAX)
tr_tr: Eşzamansız JavaScript ve XML (AJAX)

source: Attach a volume to an instance
id: Melampirkan volume ke sebuah contoh
tr_tr: Bir sunucuya birim ekleyin

source: Attach your volume to a server, specifying the server ID and the volume ID:
id: Melampirkan volume Anda ke server, menentukan ID server dan ID Volume:
tr_tr: Sunucu ve birim kimliğini belirterek biriminizi bir sunucuya ekleyin:

source: Attachment point where a virtual interface connects to a virtual network.
tr_tr: Sanal bir arabirimin sanal bir ağa bağlandığı ek noktası.

source: Authentication and identity service by Microsoft, based on LDAP. Supported in OpenStack.
id: Otentikasi dan identitas layanan oleh Microsoft, berdasarkan LDAP. Didukung dalam OpenStack.
tr_tr: LDAP temelli Microsoft'a dayalı kimlik doğrulama ve kimlik hizmeti. OpenStack'de desteklenir.

source: Authentication method that uses keys rather than passwords.
tr_tr: Parolalar yerine anahtarlar kullanan kimlik doğrulama yöntemi.

source: Authentication method that uses two or more credentials, such as a password and a private key. Currently not supported in Identity.
tr_tr: Bir şifre ve özel bir anahtar gibi iki veya daha fazla kimlik bilgilerini kullanan kimlik doğrulama yöntemi. Şu anda Kimlik hizmetinde desteklenmiyor.

source: Authorizes tokens for users that console proxies provide. See ``nova-novncproxy`` and ``nova-xvpvncproxy``. This service must be running for console proxies to work. You can run proxies of either type against a single nova-consoleauth service in a cluster configuration. For information, see `About nova-consoleauth <https://docs.openstack.org/admin-guide/compute-remote-console-access.html#about-nova-consoleauth>`__.
tr_tr: Konsol vekillerinin sağladığı jetonları kullanıcılar için yetkilendirir. Bkz ``nova-novncproxy`` ve ``nova-xvpnvncproxy``. Konsol vekillerinin çalışması için bu servisin çalışması gerekir. Bir bulut yapılandırmasında tek bir nova-consoleauth servisine karşılık her iki türde vekili de çalıştırabilirsiniz. Bilgi için `nova-consoleauth hakkında <https://docs.openstack.org/admin-guide/compute-remote-console-access.html#about-nova-consoleauth>`__ kısmına göz atın.

source: Auto ACK
tr_tr: Oto ACK

source: Automated software test suite designed to run against the trunk of the OpenStack core project.
tr_tr: OpenStack çekirdek projesinin gövdesine karşı çalışacak şekilde tasarlanmış otomatik yazılım test paketi.

source: Available from anywhere
id: Tersedia dari mana saja
tr_tr: Heryerden kullanılabilir

source: Available instance types
id: jenis contoh yang tersedia
tr_tr: Kullanılabilir sunucu türleri

source: Available networks
id: jaringan yang tersedia
tr_tr: Kullanılabilir ağlar

source: BMC (Baseboard Management Controller)
tr_tr: BMC (Süpürgelik Yönetim Konrolörü)

source: Backup, Restore, and Disaster Recovery service (freezer)
tr_tr: Yedekleme, Geri Yükleme ve Felaket Kurtarma hizmeti (freezer)

source: Bare Metal service
tr_tr: Saf Metal servisi

source: Bare Metal service (ironic)
tr_tr: Bare Metal servisi (ironic)

source: Be sure to include the software and package versions that you are using, especially if you are using a development branch, such as, ``"Kilo release" vs git commit bc79c3ecc55929bac585d04a03475b72e06a3208``.
id: Pastikan untuk menyertakan perangkat lunak dan paket versi yang Anda gunakan, terutama jika Anda menggunakan cabang pengembangan, seperti, `` "Kilo rilis" vs git commit bc79c3ecc55929bac585d04a03475b72e06a3208``.
tr_tr: Özellikle bir geliştirme dalı kullanıyorsanız, kullandığınız yazılım ve paket sürümlerini eklediğinizden emin olun, örneğin, ``"Kilo release" vs git commit bc79c3ecc55929bac585d04a03475b72e06a3208``gibi.

source: Before you can run client commands, you must create and source the ``PROJECT-openrc.sh`` file to set environment variables. See :doc:`../common/cli-set-environment-variables-using-openstack-rc`.
id: Sebelum Anda dapat menjalankan perintah klien, Anda harus membuat dan sumber `` file yang PROJECT-openrc.sh`` untuk mengatur variabel lingkungan. Lihat: doc: `../ umum / cli-set-lingkungan-variabel-menggunakan-OpenStack-rc`.
tr_tr: İstemci komutlarını çalıştrabilmenizden önce, çevre değişikenlerini ayarlamak için ``PROJE-openrc.sh`` dosyasını oluşturmak ve kaynak etmek zorundasınız. Bkz :doc:`../common/cli-set-environment-variables-using-openstack-rc`.

source: Before you proceed, ensure that the controller node has at least several gigabytes of space available in this directory. Keep in mind that since the ``file`` back end is often local to a controller node, it is not typically suitable for a multi-node glance deployment.
tr_tr: Devam etmeden önce, kontrol düğümünün bu dizinde bir kaç gigabayt alanı olduğundan emin olun. ``dosya`` arka ucu genellikle kontrol düğümüne yerel olduğundan, birden çok düğümlü glance kurulumlarına pek uymadığını unutmayın.

source: Bell-LaPadula model
tr_tr: Bell-LaPadula modeli

source: Belongs to a particular domain and is used to specify information about the domain. There are several types of DNS records. Each record type contains particular information used to describe the purpose of that record. Examples include mail exchange (MX) records, which specify the mail server for a particular domain; and name server (NS) records, which specify the authoritative name servers for a domain.
tr_tr: Belirli bir alana ait ve alan adı hakkında bilgi vermek için kullanılır. Birkaç DNS kaydı türü vardır. Her kayıt türü, o kaydın amacını tanımlamak için kullanılan belirli bilgileri içerir. Örnekler arasında belirli bir alan adı için posta sunucusunu belirten posta değişimi (MX) kayıtları; ve etki alanı için yetkili ad sunucularını belirten ad sunucusu (NS) kayıtları.

source: Benchmark service (rally)
tr_tr: Değerlendirme servisi (rally)

source: Block Storage API
tr_tr: Blok Depolama API

source: Block Storage service
id: layanan blok Storage
tr_tr: Blok Depolama servisi

source: Block Storage service (cinder)
tr_tr: Blok Depolama servisi (cinder)

source: Block Storage service overview
id: ikhtisar layanan blok Storage
tr_tr: Blok Depolama servisi genel görünümü

source: Block storage (cinder)
tr_tr: Blok depolama (cinder)

source: Block storage that is simultaneously accessible by multiple clients, for example, NFS.
tr_tr: Aynı anda birden çok istemci tarafından erişilebilen blok depolama alanı, örneğin NFS.

source: Bootstrap Protocol (BOOTP)
tr_tr: Bootstrap Protokolü (BOOTP)

source: Border Gateway Protocol (BGP)
tr_tr: Sınır Geçidi Protokolü (BGP)

source: Both Image service and Compute support encrypted virtual machine (VM) images (but not instances). In-transit data encryption is supported in OpenStack using technologies such as HTTPS, SSL, TLS, and SSH. Object Storage does not support object encryption at the application level but may support storage that uses disk encryption.
id: Kedua layanan Gambar dan dukungan Hitung dienkripsi mesin virtual (VM) gambar (tapi tidak contoh). Di-transit enkripsi data didukung di OpenStack menggunakan teknologi seperti HTTPS, SSL, TLS, dan SSH. Object Storage tidak mendukung enkripsi objek pada tingkat aplikasi tetapi dapat mendukung penyimpanan yang menggunakan enkripsi disk.
tr_tr: İmaj hizmeti ve Hesaplama, şifreli sanal makine (VM) imajlarını destekler (ancak sunucuları değil). Doğrudan veri şifreleme, OpenStack'te HTTPS, SSL, TLS ve SSH gibi teknolojileri kullanarak desteklenir. Nesne Depolama birimi, uygulama düzeyinde nesne şifrelemesini desteklemez, ancak disk şifrelemeyi kullanan belleği destekleyebilir.

source: Both a VM container format and disk format. Supported by Image service.
id: Kedua format kontainer VM dan disk format. Didukung oleh layanan Gambar.
tr_tr: Hem bir VM konteyner biçimi hem de disk biçimi. İmaj servisi tarafından desteklenmektedir.

source: Bring down a physical storage device for maintenance without disrupting workloads.
id: Menurunkan perangkat penyimpanan fisik untuk pemeliharaan tanpa mengganggu beban kerja.
tr_tr: İş yüklerini bozmadan fiziksel bir depolama aygıtını bakım için ayırın.

source: Builds and manages rings within Object Storage, assigns partitions to devices, and pushes the configuration to other storage nodes.
tr_tr: Nesne Depolama alanı içinde halkalar oluşturur ve yönetir, aygıtlara bölümler atar ve yapılandırmayı diğer depolama düğümlerine iter.

source: By default, hardware properties are retrieved from the image properties. However, if this information is not available, the ``libosinfo`` database provides an alternative source for these values.
id: Secara default, sifat hardware yang diambil dari sifat-sifat gambar. Namun, jika informasi ini tidak tersedia, `` basis data libosinfo`` menyediakan sumber alternatif untuk nilai-nilai ini.
tr_tr: Öntanımlı olarak, donanım özellikleri imaj özelliklerinden alınır. Ancak bu bilgi kullanılabilir değilse, ``libosinfo`` veritabanı bu değerler için bir alternatif kaynak sağlar.

source: Can concurrently use multiple layer-2 networking technologies, such as 802.1Q and VXLAN, in Networking.
tr_tr: 802.1Q ve VXLAN gibi çoklu katman-2 ağ teknolojilerini Ağda eşzamanlı olarak kullanabilir.

source: Causes the network interface to pass all traffic it receives to the host rather than passing only the frames addressed to it.
tr_tr: Ağ arabirimine, alıcıya aldığı tüm trafiği yalnızca kendisine gönderilen kareleri iletmek yerine geçirmesine neden olur.

source: Ceph component that enables a Linux block device to be striped over multiple distributed data stores.
tr_tr: Bir Linux blok cihazının çoklu dağıtılmış veri depoları üzerinde çizilmesini sağlayan Ceph bileşeni.

source: Challenge-Handshake Authentication Protocol (CHAP)
tr_tr: Challenge Handshake Kimlik Doğrulama Protokolü (CHAP)

source: Changes to these types of disk volumes are saved.
tr_tr: Bu disk birimlerinin türündeki değişiklikler kaydedilir.

source: Checks for and deletes unused VMs; the component of Image service that implements delayed delete.
tr_tr: Kullanılmayan VM'leri kontrol eder ve siler; Gecikmeli silme uygulayan İmaj servisinin bileşeni.

source: Checks for missing replicas and incorrect or corrupted objects in a specified Object Storage account by running queries against the back-end SQLite database.
id: Cek untuk hilang replika dan benda-benda yang salah atau rusak dalam akun Storage Object ditentukan dengan menjalankan query terhadap back-end database SQLite.
tr_tr: Belirli bir Nesne Deposu hesabındaki eksik kopyaları ve yanlış veya bozuk nesneleri arka planda SQLite veritabanında sorgular çalıştırarak denetler.

source: Checks for missing replicas or incorrect objects in specified Object Storage containers through queries to the SQLite back-end database.
id: Cek untuk hilang replika atau benda yang salah dalam wadah Obyek Storage ditentukan melalui query ke SQLite database back-end.
tr_tr: SQLite arka plan veritabanına yapılan sorgular aracılığıyla belirtilen nesne saklama kaplarındaki eksik kopyaları veya hatalı nesneleri kontrol eder.

source: Choose glance image which has ``cinder_img_volume_type`` property and create a volume from the image.
tr_tr: ``cinder_img_volume_type`` özelliğine sahip glance imajı seçin ve bu imajdan bir birim oluşturun.

source: Choosing a host based on the existence of a GPU is currently unsupported in OpenStack.
id: Memilih host berdasarkan keberadaan GPU saat ini tidak didukung di OpenStack.
tr_tr: GPU'nun varlığına dayalı bir ana makine seçmek şu an OpenStack'da desteklenmiyor.

source: Cinder supports these three ways to specify ``volume type`` during volume creation.
id: Cinder mendukung tiga cara untuk menentukan `` Volume type`` selama pembuatan volume.
tr_tr: Cinder birim oluşturma sırasında ``birim türü`` belirtmek için şu üç yolu destekler.

source: Cisco neutron plug-in
tr_tr: Cisco neutron eklentisi

source: Client
id: Klien
tr_tr: İstemci

source: Cloud Auditing Data Federation (CADF)
tr_tr: Bulut Denetim Veri Federasyonu (CADF)

source: Cloud Auditing Data Federation (CADF) is a specification for audit event data. CADF is supported by OpenStack Identity.
id: Cloud Auditing data Federation (CADF) adalah spesifikasi untuk data peristiwa audit. CARD didukung oleh OpenStack Identity.
tr_tr: Bulut Denetim Veri Federasyonu (CADF), denetim olayı verileri için bir özelliktir. CADF, OpenStack Kimlik tarafından desteklenmektedir.

source: Cloud Data Management Interface (CDMI)
tr_tr: Bulut Veri Yönetimi Arayüzü (CDMI)

source: Cloud Infrastructure Management Interface (CIMI)
tr_tr: Bulut Altyapı Yönetimi Arayüzü (CIMI)

source: Clustering service
id: layanan Clustering
tr_tr: Kümeleme servisi

source: Clustering service (senlin)
tr_tr: Kümeleme servisi (senlin)

source: Code name for :term:`Workflow service <Workflow service (mistral)>`.
tr_tr: :term:`İş akış servisi <Workflow service (mistral)>` için kod ad.

source: Code name for the :term:`Backup, Restore, and Disaster Recovery service <Backup, Restore, and Disaster Recovery service (freezer)>`.
tr_tr: :term:`Yedekleme, Geri Yükleme, and Felaketten Kurtarma hizmeti <Backup, Restore, and Disaster Recovery service (freezer)>` için kod ad.

source: Code name for the :term:`Clustering service <Clustering service (senlin)>`.
tr_tr: :term:`Kümeleme servisi <Clustering service (senlin)>` için kod ad.
