Repository: 25hours/openstack-manuals
Catalog: doc/common/source/locale/*/LC_MESSAGES/common.po
Languages: id, tr_tr

source: delayed delete
tr_tr: geçkalmış silme

source: delivery mode
tr_tr: dağıtım kipi

source: denial of service (DoS)
tr_tr: hizmet reddi (DoS)

source: deprecated auth
tr_tr: kullanımdan kaldırılan kimlik doğrulama

source: developer
tr_tr: geliştirici

source: device ID
tr_tr: aygıt kimliği

source: device weight
tr_tr: cihaz ağırlığı

source: direct consumer
tr_tr: doğrudan tüketici

source: direct exchange
tr_tr: doğrudan değiş tokuş

source: direct publisher
tr_tr: doğrudan yayımcı

source: disassociate
tr_tr: ilişkiyi kes

source: disk encryption
tr_tr: disk şifreleme

source: disk format
tr_tr: disk biçimi

source: dispersion
tr_tr: dağıtım

source: distributed virtual router (DVR)
tr_tr: dağıtık sanal yönlendirici (DVR)

source: domain
tr_tr: alan

source: download
tr_tr: indir

source: durable exchange
tr_tr: dayanıklı değişim

source: durable queue
tr_tr: dayanıklı kuyruk

source: east-west traffic
tr_tr: doğu-batı trafik

source: encapsulation
tr_tr: kapsülleme

source: encryption
tr_tr: şifreleme

source: endpoint
tr_tr: uç nokta

source: endpoint registry
tr_tr: uç nokta kaydı

source: endpoint template
tr_tr: uç nokta şablonu

source: entity
tr_tr: eleman

source: ephemeral image
tr_tr: kısa ömürlü imaj

source: ephemeral volume
tr_tr: kısa ömürlü disk bölümü

source: evacuate
tr_tr: boşaltma

source: exchange
tr_tr: takas

source: exchange type
tr_tr: alışveriş türü

source: exclusive queue
tr_tr: özel kuyruk

source: extended attributes (xattr)
tr_tr: genişletilmiş özellikler (xattr)

source: extension
tr_tr: uzantı

source: external network
tr_tr: harici ağ

source: extra specs
tr_tr: ekstra özellikler

source: fan-out exchange
tr_tr: çıkış yelpazesi takası

source: federated identity
tr_tr: federe kimlik

source: fill-first scheduler
tr_tr: ilk-doldur zamanlayıcı

source: filter
tr_tr: filtre

source: firewall
tr_tr: güvenlik duvarı

source: fixed IP address
tr_tr: sabit IP adres

source: flat mode injection
tr_tr: düz mod enjeksiyonu

source: flat network
tr_tr: düz ağ

source: floating IP address
tr_tr: kayan IP adres

source: front end
tr_tr: ön yüz

source: gateway
tr_tr: geçit

source: generic receive offload (GRO)
tr_tr: genel alma yükü (GRO)

source: generic routing encapsulation (GRE)
tr_tr: genel yönlendirme kapsülleme (GRE)

source: glance API server
tr_tr: glance API sunucusu

source: glance registry
tr_tr: glance kaydı

source: global endpoint template
tr_tr: genel uç birim şablonu

source: golden image
tr_tr: altın imaj

source: guest OS
tr_tr: misafir OS

source: handover
tr_tr: devir teslim

source: hard reboot
tr_tr: zorla yeniden başlatma

source: health monitor
tr_tr: sağlık gözetmeni

source: high availability (HA)
tr_tr: yüksek kullanılabilirlik (HA)

source: horizon plug-in
tr_tr: horizon eklentisi

source: host aggregate
tr_tr: sunucu ekleme

source: hybrid cloud
tr_tr: karma bulut

source: hyperlink
tr_tr: hiper bağ

source: hypervisor
tr_tr: hiper yönetici

source: hypervisor pool
tr_tr: hiper yönetici havuzu

source: iSCSI Qualified Name (IQN)
tr_tr: iSCSI Kalifiye Ad (IQN)

source: identity provider
tr_tr: kimlik sağlayıcı

source: image
tr_tr: İmaj

source: image ID
tr_tr: İmaj ID

source: image UUID
tr_tr: imaj UUID

source: image cache
tr_tr: imaj önbelleği

source: image membership
tr_tr: imaj üyeliği

source: image owner
tr_tr: imaj sahibi

source: image registry
tr_tr: imaj kaydı

source: image status
tr_tr: imaj durumu

source: image store
tr_tr: imaj deposu

source: incubated project
tr_tr: kuluçka proje

source: ingress filtering
tr_tr: giriş filtresi

source: injection
tr_tr: enjeksiyon

source: instance
tr_tr: sunucu

source: instance ID
tr_tr: sunucu kimliği

source: instance UUID
tr_tr: sunucu UUID

source: instance state
tr_tr: sunucu durumu

source: instance tunnels network
tr_tr: sunucu tüneller ağı

source: instance type
tr_tr: sunucu türü

source: instance type ID
tr_tr: sunucu türü kimliği

source: interface
tr_tr: arayüz

source: interface ID
tr_tr: arayüz kimliği

source: jumbo frame
tr_tr: jumbo çerçeve

source: kernel-based VM (KVM)
tr_tr: çekirdek-tabanlı VM (KVM)

source: large object
tr_tr: geniş nesne

source: libvirt for KVM or QEMU
tr_tr: KVM veya QEMU için libvirt

source: libvirt\_type setting
id: pengaturan libvirt_type
tr_tr: libvirt\_type ayarları

source: live migration
tr_tr: canlı göç

source: load balancer
tr_tr: yük dengeleyici

source: load balancing
tr_tr: yük dengeleme

source: management API
tr_tr: yönetim API

source: management network
tr_tr: yönetim ağı

source: manager
tr_tr: yönetici

source: manages and provisions physical machines.
id: mengelola dan ketentuan mesin fisik.
tr_tr: fiziksel makineleri yönetir ve hazırlar.

source: manifest
tr_tr: manifesto

source: manifest object
tr_tr: manifesto nesnesi

source: maximum transmission unit (MTU)
tr_tr: azami aktarım birimi (MTU)

source: mechanism driver
tr_tr: mekanizma sürücüsü

source: membership
tr_tr: üyelik

source: membership list
tr_tr: üyelik listesi

source: memory overcommit
tr_tr: bellek aşırı yükleme

source: message broker
tr_tr: mesaj aracısı

source: message bus
tr_tr: mesaj veri yolu

source: message queue
tr_tr: mesaj kuyruğu

source: migration
tr_tr: göç

source: multi-factor authentication
tr_tr: çok faktörlü kimlik doğrulama

source: multi-host
tr_tr: çoklu-sunucu

source: network
tr_tr: ağ

source: network ID
tr_tr: ağ kimliği

source: network UUID
tr_tr: ağ UUID

source: network controller
tr_tr: ağ denetleyici

source: network manager
tr_tr: ağ yöneticisi

source: network namespace
tr_tr: ağ adalanı

source: network node
tr_tr: ağ düğümü

source: network segment
tr_tr: ağ dilimi

source: network worker
tr_tr: ağ işçisi

source: neutron manager
tr_tr: neutron yöneticisi

source: neutron plug-in
tr_tr: neutron eklentisi

source: node
tr_tr: düğüm

source: non-durable exchange
tr_tr: dayanıklı olmayan değişim

source: non-durable queue
tr_tr: dayanıklı olmayan kuyruk

source: non-persistent volume
tr_tr: kalıcı olmayan disk bölümü

source: north-south traffic
tr_tr: kuzey-güney trafik

source: object
tr_tr: nesne

source: object auditor
tr_tr: nesne denetleyici

source: object expiration
tr_tr: nesne bitişi

source: object hash
tr_tr: nesne karması

source: object path hash
tr_tr: nesne yolu karması

source: object replicator
tr_tr: nesne kopyalama

source: object server
tr_tr: nesne sunucusu

source: object versioning
tr_tr: nesne sürümleme

source: operator
tr_tr: operatör

source: optional service
tr_tr: seçimli servis

source: orphan
tr_tr: kimsesiz

source: parent cell
tr_tr: üst hücre

source: partition
tr_tr: bölüm

source: partition index
tr_tr: bölümleme dizini

source: partition shift value
tr_tr: bölüm değiştirme değeri

source: path MTU discovery (PMTUD)
tr_tr: MTU yolu keşfi (PMTUD)

source: pause
tr_tr: duraklat

source: persistent message
tr_tr: kalıcı mesaj

source: persistent volume
tr_tr: kalıcı disk bölümü

source: personality file
tr_tr: kişilik dosyası

source: pip package
id: paket pip
tr_tr: pip paketi

source: plug-in
tr_tr: eklenti

source: policy service
tr_tr: politika servisi

source: policy-based routing (PBR)
tr_tr: politika-tabanlı yönlendirme (PBR)

source: pool
tr_tr: havuz

source: pool member
tr_tr: havuz üyesi

source: port UUID
tr_tr: bağlantı noktası UUID

source: private IP address
tr_tr: özel IP adresi

source: private image
tr_tr: gizli imaj

source: private network
tr_tr: gizli ağ

source: project
tr_tr: proje

source: project ID
tr_tr: proje kimliği

source: project VPN
tr_tr: proje VPN

source: promiscuous mode
tr_tr: rastgele kipi

source: protected property
tr_tr: korunaklı özellik

source: provider
tr_tr: sağlayan

source: proxy node
tr_tr: vekil düğüm

source: proxy server
tr_tr: vekil sunucu

source: public API
tr_tr: açık API

source: public IP address
tr_tr: görünen IP adresi

source: public image
tr_tr: açık imaj

source: public key authentication
tr_tr: genel anahtar yetkilendirmesi

source: public network
tr_tr: genel ağ

source: qemu or kvm
id: qemu atau kvm
tr_tr: qemu veya kvm

source: quarantine
tr_tr: karantina

source: quota
tr_tr: kota

source: rate limit
tr_tr: oran sınırı

source: raw
tr_tr: ham

source: rebalance
tr_tr: yeniden dengele

source: reboot
tr_tr: yeniden başlat

source: rebuild
tr_tr: yeniden oluştur

source: record
tr_tr: kayıt

source: record ID
tr_tr: kayıt kimliği

source: reference architecture
tr_tr: kaynak mimari

source: region
tr_tr: bölge

source: registry
tr_tr: kayıt defteri

source: registry server
tr_tr: kayıt defteri sunucusu

source: replica
tr_tr: kopya

source: replica count
tr_tr: kopya sayısı

source: replication
tr_tr: çoğaltma

source: replicator
tr_tr: çoğaltıcı

source: request ID
tr_tr: istek ID

source: rescue image
tr_tr: kurtarma imajı

source: resize
tr_tr: yeniden boyutlandır

source: ring
tr_tr: halka

source: ring builder
tr_tr: halka oluşturucu

source: role
tr_tr: rol

source: role ID
tr_tr: rol ID

source: round-robin scheduler
tr_tr: round-robin zamanlayıcı

source: router
tr_tr: yönlendirici

source: routing key
tr_tr: yönlendirme anahtarı

source: scheduler manager
tr_tr: zamanlama yöneticisi

source: scoped token
tr_tr: kapsamlı jeton

source: secret key
tr_tr: gizli anahtar

source: secure boot
tr_tr: güvenli ön yükleme

source: secure shell (SSH)
tr_tr: güvenli kabuk (SSH)

source: security group
tr_tr: güvenlik grubu

source: segmented object
tr_tr: bölümlenmiş nesne

source: self-service
tr_tr: self-servis

source: server
tr_tr: sunucu

source: server UUID
tr_tr: sunucu UUID

source: server image
tr_tr: sunucu imajı

source: service
tr_tr: servis

source: service ID
tr_tr: servis kimliği

source: service catalog
tr_tr: servis kataloğu

source: service project
tr_tr: servis projesi

source: service provider
tr_tr: servis sağlayıcı

source: service registration
tr_tr: servis kaydı

source: service token
tr_tr: servis jetonu

source: session back end
tr_tr: oturum arkaplanı

source: session persistence
tr_tr: oturum kalıcılığı

source: session storage
tr_tr: oturum deposu

source: setuptools package
id: setuptools paket
tr_tr: setuptools paketi

source: share
tr_tr: paylaş

source: share network
tr_tr: paylaşım ağı

source: shared IP address
tr_tr: paylaşımlı IP adresi

source: shared IP group
tr_tr: paylaşımlı IP grubu

source: shared storage
tr_tr: paylaşımlı depo

source: snapshot
tr_tr: anlık görüntü

source: soft reboot
tr_tr: yumuşak yeniden başlatma

source: spread-first scheduler
tr_tr: önce dağıt zamanlayıcı

source: stack
tr_tr: yığın

source: static IP address
tr_tr: sabit IP adres

source: storage back end
tr_tr: depolama art alan uygulaması

source: storage manager
tr_tr: depolama yöneticisi

source: storage manager back end
tr_tr: depolama yönetimi art alan uygulaması

source: storage node
tr_tr: depolama düğümü

source: storage services
tr_tr: depolama hizmetleri

source: strategy
tr_tr: strateji

source: subdomain
tr_tr: alt alan

source: subnet
tr_tr: alt ağ

source: suspend
tr_tr: askıya al

source: swap
tr_tr: takas

source: swift All in One (SAIO)
tr_tr: swift Hepsi bir Arada (SAIO)

source: swift client
tr_tr: swift istemcisi

source: swift middleware
tr_tr: swift arakatmanı

source: swift proxy server
tr_tr: swift vekil sunucu

source: swift storage node
tr_tr: swift depolama düğümü

source: swift-ring-builder
tr_tr: swift-ring inşa edici

source: sync point
tr_tr: sync noktası

source: system usage
tr_tr: sistem kullanımı

source: tenant endpoint
tr_tr: tenant uç noktası

source: token
tr_tr: jeton

source: token services
tr_tr: jeton servisleri

source: topic publisher
tr_tr: konu yayınlayıcı

source: transaction ID
tr_tr: işlem ID

source: transient
tr_tr: geçici

source: transient exchange
tr_tr: geçici alışveriş

source: transient message
tr_tr: geçici mesaj

source: transient queue
tr_tr: geçici kuyruk

source: trusted platform module (TPM)
tr_tr: güvenilir platform modülü (TPM)

source: unscoped token
tr_tr: kapsamdışı jeton

source: updater
tr_tr: güncelleyici

source: user
tr_tr: kullanıcı

source: user data
tr_tr: kullanıcı verisi

source: virtual IP address (VIP)
tr_tr: sanal IP adress (VIP)

source: virtual VLAN
tr_tr: sanal VLAN

source: virtual machine (VM)
tr_tr: sanal makine (VM)

source: virtual network
tr_tr: sanal ağ

source: virtual networking
tr_tr: sanal ağ

source: virtual port
tr_tr: sanal bağlantı noktası

source: virtual private network (VPN)
tr_tr: sanal gizli ağ (VPN)

source: virtual server
tr_tr: sanal sunucu

source: virtual switch (vSwitch)
tr_tr: sanal switch (vSwitch)

source: volume
tr_tr: disk bölümü

source: volume ID
tr_tr: disk bölümü ID'si

source: volume controller
tr_tr: disk bölümü denetleyici

source: volume driver
tr_tr: disk bölümü sürücüsü

source: volume manager
tr_tr: disk bölümü yöneticisi

source: volume node
tr_tr: disk bölümü düğümü

source: volume plug-in
tr_tr: disk bölümü eklentisi

source: volume worker
tr_tr: disk bölümü işçisi

source: weight
tr_tr: ağırlık

source: weighted cost
tr_tr: ağırlıklı maliyet

source: weighting
tr_tr: ağırlıklandırma

source: where filePath points to a JSON file that defines the mount point for OpenStack images on your system and a unique ID. For example:
id: tempat file Jalur poin ke file JSON yang mendefinisikan mount point untuk OpenStack gambar pada sistem anda dan ID unik. Sebagai contoh:
tr_tr: dosyaYolu sisteminizdeki OpenStack imajları için bağlantı noktasını ve benzersiz bir kimliği tanımlayan bir JSON dosyayı gösterir. Örneğin:

source: worker
tr_tr: işçi

source: **Command-line client**
id: ** Command-line klien **

source: **Common client for the OpenStack project.**
id: ** Klien umum untuk proyek OpenStack. **

source: **Red Hat Enterprise Linux, CentOS, or Fedora**
id: ** Red Hat Enterprise Linux, CentOS, atau Fedora **

source: A CLI that communicates with the ``heat-api`` to run :term:`AWS` CloudFormation APIs. End developers can directly use the Orchestration REST API.
id: Sebuah CLI yang berkomunikasi dengan `` panas-api`` untuk menjalankan: istilah: `AWS` CloudFormation API. pengembang akhir dapat langsung menggunakan API orkestrasi REST.

source: A central hub for passing messages between daemons. Usually implemented with `RabbitMQ <http://www.rabbitmq.com/>`__, also can be implemented with another AMQP message queue, such as `ZeroMQ <http://www.zeromq.org/>`__.
id: Sebuah hub pusat untuk lewat pesan antara daemon. Biasanya diimplementasikan dengan `RabbitMQ <http://www.rabbitmq.com/>` __, juga dapat diimplementasikan dengan antrian pesan AMQP lain, seperti `ZeroMQ <http://www.zeromq.org/>` __.

source: A core OpenStack project that provides block storage services for VMs.
id: Sebuah proyek OpenStack inti yang menyediakan layanan penyimpanan blok untuk VMs.

source: A core project that provides the OpenStack Image service.
id: Sebuah proyek inti yang menyediakan layanan Gambar OpenStack.

source: A great way to get answers and insights is to post your question or problematic scenario to the OpenStack mailing list. You can learn from and help others who might have similar issues. To subscribe or view the archives, go to http://lists.openstack.org/cgi-bin/mailman/listinfo/openstack. If you are interested in the other mailing lists for specific projects or development, refer to `Mailing Lists <https://wiki.openstack.org/wiki/Mailing_Lists>`__.
id: Sebuah cara yang bagus untuk mendapatkan jawaban dan wawasan adalah untuk mengirim pertanyaan atau skenario bermasalah ke milis OpenStack. Anda dapat belajar dari dan membantu orang lain yang mungkin memiliki masalah yang sama. Untuk berlangganan atau melihat arsip, pergi ke http://lists.openstack.org/cgi-bin/mailman/listinfo/openstack. Jika Anda tertarik dengan milis lainnya untuk proyek-proyek atau pembangunan spesifik, mengacu pada `Milis <https://wiki.openstack.org/wiki/Mailing_Lists>` __.

source: A list of tenants that can access a given VM image within Image service.
id: Daftar penyewa yang dapat mengakses gambar VM diberikan dalam layanan Gambar.

source: A method to automatically configure networking for a host at boot time. Provided by both Networking and Compute.
id: Sebuah metode untuk secara otomatis mengkonfigurasi jaringan untuk host pada saat boot. Disediakan oleh Jaringan dan Komputer.

source: A plug-in for the OpenStack dashboard (horizon).
id: Sebuah plug-in untuk dashboard OpenStack (horizon).

source: A simple certificate authority provided by Compute for cloudpipe VPNs and VM image decryption.
id: Sebuah sertifikat otoritas sederhana yang disediakan oleh Compute untuk VPN cloudpipe dan VM gambar dekripsi.

source: A volume is a detachable block storage device, similar to a USB hard drive. You can attach a volume to only one instance. To create and manage volumes, you use a combination of ``nova`` and ``cinder`` client commands.
id: Volume adalah perangkat penyimpanan blok dilepas, mirip dengan hard drive USB. Anda dapat melampirkan volume hanya satu contoh. Untuk membuat dan mengelola volume, Anda menggunakan kombinasi `` perintah klien cinder`` nova`` dan ``.

source: AWS CloudFormation allows AWS users to create and manage a collection of related resources. The Orchestration service supports a CloudFormation-compatible format (CFN).
id: AWS CloudFormation memungkinkan pengguna AWS untuk membuat dan mengelola koleksi sumber daya terkait. Layanan Orkestrasi mendukung format CloudFormation-kompatibel (CFN).

source: Accepts metadata requests from instances. The ``nova-api-metadata`` service is generally used when you run in multi-host mode with ``nova-network`` installations. For details, see `Metadata service <http://docs.openstack.org/admin-guide/compute-networking-nova.html#metadata-service>`__ in the OpenStack Administrator Guide.
id: Menerima permintaan metadata dari contoh. The `` layanan nova-api-metadata`` umumnya digunakan ketika Anda berjalan dalam mode multi-host dengan `` instalasi nova-network``. Untuk rincian, lihat `Metadata layanan <http://docs.openstack.org/admin-guide/compute-networking-nova.html#metadata-service>` __ dalam OpenStack Administrator Guide.

source: Add a line to include your newly created style sheet. For example, ``custom.css`` file:
id: Tambahkan baris untuk menyertakan stylesheet Anda yang baru dibuat. Misalnya, `` berkas custom.css``:

source: Alternative name for the glance image API.
id: nama alternatif untuk sekilas gambar API.

source: Alternative term for tenant.
id: istilah alternatif untuk penyewa.

source: Alternative term for the Image service image registry.
id: istilah alternatif untuk registry citra pelayanan Gambar.

source: An Identity service token that is not associated with a specific tenant and is exchanged for a scoped token.
id: Token layanan Identitas yang tidak terkait dengan penyewa tertentu dan dipertukarkan untuk token scoped.

source: An OpenStack core project that provides discovery, registration, and delivery services for disk and server images. The project name of the Image service is glance.
id: Sebuah proyek inti OpenStack yang menyediakan penemuan, pendaftaran, dan jasa pengiriman untuk disk dan server gambar. Nama proyek layanan Gambar adalah pandangan.

source: An integrated project that aims to orchestrate multiple cloud applications for OpenStack.
id: Sebuah proyek terpadu yang bertujuan untuk mengatur beberapa aplikasi cloud untuk OpenStack.

source: An integrated project that provide scalable and reliable Cloud Database-as-a-Service functionality for both relational and non-relational database engines. The project name of Database service is trove.
id: Proyek terintegrasi yang menyediakan scalable dan dapat diandalkan Cloud fungsi database-as-a-Service untuk kedua mesin database relasional dan non-relasional. Nama proyek pelayanan Database karun.

source: An open source community project by Dell that aims to provide all necessary services to quickly deploy clouds.
id: Sebuah komunitas open source proyek oleh Dell yang bertujuan untuk menyediakan semua layanan yang diperlukan dengan cepat menyebarkan awan.

source: Another option is to use the unofficial binary installer maintained by Christoph Gohlke (http://www.lfd.uci.edu/~gohlke/pythonlibs/#setuptools).
id: Pilihan lain adalah dengan menggunakan installer biner resmi dikelola oleh Christoph Gohlke (http://www.lfd.uci.edu/~gohlke/pythonlibs/#setuptools).

source: Another option is to use the unofficial binary installer provided by Christoph Gohlke (http://www.lfd.uci.edu/~gohlke/pythonlibs/#pip).
id: Pilihan lain adalah dengan menggunakan installer biner resmi yang disediakan oleh Christoph Gohlke (http://www.lfd.uci.edu/~gohlke/pythonlibs/#pip).

source: Anvil
id: Landasan

source: Arbitrary property to associate with image. This option can be used multiple times.
id: Properti sewenang-wenang untuk mengasosiasikan dengan gambar. Opsi ini dapat digunakan beberapa kali.

source: As a cloud end user, you can use the OpenStack dashboard to provision your own resources within the limits set by administrators. You can modify the examples provided in this section to create other types and sizes of server instances.
id: Sebagai pengguna cloud akhir, Anda dapat menggunakan dashboard OpenStack untuk penyediaan sumber daya Anda sendiri dalam batas-batas yang ditetapkan oleh administrator. Anda dapat mengubah contoh yang diberikan dalam bagian ini untuk membuat jenis dan ukuran contoh server lainnya.

source: Authorizes tokens for users that console proxies provide. See ``nova-novncproxy`` and ``nova-xvpvncproxy``. This service must be running for console proxies to work. You can run proxies of either type against a single nova-consoleauth service in a cluster configuration. For information, see `About nova-consoleauth <http://docs.openstack.org/admin-guide/compute-remote-console-access.html#about-nova-consoleauth>`__.
id: Kewenangan token untuk pengguna yang konsol proxy menyediakan. Lihat `` nova-novncproxy`` dan `` nova-xvpvncproxy``. Layanan ini harus berjalan untuk konsol proxy untuk bekerja. Anda dapat menjalankan proxy dari kedua jenis terhadap layanan nova-consoleauth tunggal dalam konfigurasi cluster. Untuk informasi, lihat `Tentang nova-consoleauth<http://docs.openstack.org/admin-guide/compute-remote-console-access.html#about-nova-consoleauth>`__.

source: Baseboard Management Controller. The intelligence in the IPMI architecture, which is a specialized micro-controller that is embedded on the motherboard of a computer and acts as a server. Manages the interface between system management software and platform hardware.
id: Alas tiang Manajemen Controller. Kecerdasan dalam arsitektur IPMI, yang merupakan khusus micro-controller yang tertanam pada motherboard komputer dan bertindak sebagai server. Mengelola antarmuka antara perangkat lunak sistem manajemen dan hardware platform yang.

source: By default the help URL points to http://docs.openstack.org. Change this by editing the following attribute to the URL of your choice in ``local_settings.py``:
id: Dengan bawaan bantuan URL poin ke http://docs.openstack.org. Mengubah ini dengan mengedit atribut berikut ke URL pilihan Anda di `` local_settings.py``:
