Repository: 25hours/openstack-manuals
Catalog: doc/common/source/locale/*/LC_MESSAGES/common.po
Languages: id, tr_tr

source: Runs on each compute node and polls for resource utilization statistics. There may be other types of agents in the future, but for now our focus is creating the compute agent.
id: Berjalan pada setiap node komputasi dan jajak pendapat untuk statistik pemanfaatan sumber daya. Mungkin ada jenis lain dari agen di masa depan, tetapi untuk saat ini fokus kami adalah menciptakan agen menghitung.
tr_tr: Her bir hesaplama düğümünde çalışır ve kaynak kullanım istatistikleri çeker. İlerde başka türlerde aracılar olabilir, ama şimdilik dikkatimiz hesaplama aracısını oluşturmak yönünde.

source: Runs on one or more central management servers to allow alarms to be set based on the threshold evaluation for a collection of samples.
id: Berjalan pada satu atau lebih server manajemen pusat untuk memungkinkan alarm harus ditetapkan berdasarkan evaluasi ambang untuk koleksi sampel.
tr_tr: Bir ya da daha fazla merkezi yönetim sunucusunda çalışarak toplanan belirli miktar örnek için tanımlı eşik değerine ayarlı uyarılar sağlar.

source: Runs on one or more central management servers to determine when alarms fire due to the associated statistic trend crossing a threshold over a sliding time window.
id: Berjalan pada satu atau lebih server manajemen pusat untuk menentukan kapan alarm menyala karena tren statistik yang terkait melintasi ambang atas jendela waktu geser.
tr_tr: Bir ya da daha fazla merkezi yönetim sunucusunda çalışarak ilişkili istatistik eğiliminin belirli bir eşiği veya zaman penceresini geçmesi durumunda gönderilecen uyarıları belirler.

source: Runs on one or more central management servers to provide access to the alarm information stored in the data store.
id: Berjalan pada satu atau lebih server manajemen pusat untuk menyediakan akses ke informasi alarm disimpan dalam penyimpanan data.
tr_tr: Bir ya da daha fazla merkezi yönetim sunucusunda çalışarak veri merkezinde tutulan uyarı bilgisine erişim sağlar.

source: Runs on one or more central management servers to provide data access from the data store.
id: Berjalan pada satu atau lebih server manajemen pusat untuk menyediakan akses data dari data store.
tr_tr: Bir ya da daha fazla merkezi yönetim sunucusunda çalışarak veri merkezinden veri erişimi sağlar.

source: Runs on the host, and receives messages from guest instances that want to update information on the host.
id: Berjalan pada host, dan menerima pesan dari contoh tamu yang ingin memperbarui informasi pada host.
tr_tr: Sunucuda çalışır, ve sunucuda bilgi güncellemek isteyen misafir sunuculardan iletiler alır.

source: Runs operating systems and provides scratch space
id: Berjalan sistem operasi dan menyediakan ruang awal
tr_tr: İşletim sistemlerini çalıştırır ve boş alan sağlar

source: Runs within the guest instance. Manages and performs operations on the database itself.
id: Berjalan dalam contoh tamu. Mengelola dan melakukan operasi pada database itu sendiri.
tr_tr: Misafir sunucu içinde çalışır. Veritabanı üzerindeki işlemleri yönetir ve gerçekleştirir.

source: SAML assertion
tr_tr: SAML iddia

source: SINA standard that defines a RESTful API for managing objects in the cloud, currently unsupported in OpenStack.
id: standar SINA yang mendefinisikan API tenang untuk mengelola objek di awan, saat ini tidak didukung di OpenStack.
tr_tr: Şu anda OpenStack'te desteklenmeyen buluttaki nesneleri yönetmek için RESTful bir API tanımlayan SINA standardı.

source: SPICE provides remote desktop access to guest virtual machines. It is an alternative to VNC. SPICE is supported by OpenStack.
tr_tr: SPICE misafir sanal makinelere uzaktan masaüstü erişimi sağlar. VNC'ye alternatiftir. SPICE, OpenStack tarafından desteklenir.

source: SQL database
tr_tr: SQL veritabanı

source: Saving ``OS_PASSWORD`` in plain text may bring a security risk. You should protect the file or not save ``OS_PASSWORD`` into the file in the production environment.
tr_tr: ``OS_PASSWORD`` anahtarını düz metin olarak saklamak güvenlik riski doğurabilir. Üretim ortamında dosyayı korumalı ya da ``OS_PASSWORD`` anahtarını dosyaya kaydetmemelisiniz.

source: Schedules and routes requests to the appropriate share service. The scheduler uses configurable filters and weighers to route requests. The Filter Scheduler is the default and enables filters on things like Capacity, Availability Zone, Share Types, and Capabilities as well as custom filters.
id: Jadwal dan rute permintaan ke layanan berbagi yang tepat. scheduler menggunakan filter dikonfigurasi dan weighers permintaan rute. Filter Scheduler adalah default dan memungkinkan filter pada hal-hal seperti Kapasitas, Ketersediaan Zone, Jenis Share, dan Kemampuan serta filter kustom.
tr_tr: İstekleri uygun paylaşım servisine zamanlar ve yönlendirir. Zamanlayıcı yapılandırılabilir süzgeçler ve ağırlık belirleyiciler kullanarak istekleri yönlendirir. Süzgeç Zamanlayıcı öntanımlıdır ve Kapasite, Kullanılırlık Bölgesi, Paylaşım Türleri ve Yetenekler yanında özel süzgeçler gibi şeyler üzerinde süzgeçler etkinleştirir.

source: Script that initializes the building of the ring file, takes daemon names as parameter and offers commands. Documented in `Managing Services <https://docs.openstack.org/developer/swift/admin_guide.html#managing-services>`_.
tr_tr: Ring dosyasının inşasını başlatan betik, parameter olarak artalan işlerinin isimlerini alır ve komutlar sunar. `Servislerin Yönetiminde <https://docs.openstack.org/developer/swift/admin_guide.html#managing-services>`_ belgelendirilmiştir.

source: See API endpoint.
id: Lihat API endpoint.
tr_tr: API uç noktasına bakınız.

source: Selects the optimal storage provider node on which to create the volume. A similar component to the ``nova-scheduler``.
id: Memilih node penyedia penyimpanan yang optimal yang menciptakan volume. Sebuah komponen mirip dengan `` nova-scheduler``.
tr_tr: Birimin oluşturulacağı en iyi depolamayı sağlayacak düğümü seçer. ``nova-scheduler``'e benzer bir bileşendir.

source: Send the volume transfer ID and authorization key to the new owner (for example, by email).
id: Kirim transfer Volume ID dan kunci otorisasi untuk pemilik baru (misalnya, melalui email).
tr_tr: Birim aktarım kimliğini ve yetkilendirme anahtarını yeni sahibe gönderin (örneğin, eposta ile).

source: Server
tr_tr: Sunucu

source: Service
id: Layanan
tr_tr: Servis

source: Service Function Chain (SFC)
tr_tr: Hizmet İşlev Zinciri (SFC)

source: Service Level Agreement (SLA)
tr_tr: Servis Seviyesinde Anlaşma (SLA)

source: Set environment variables using the OpenStack RC file
id: Set variabel lingkungan menggunakan file OpenStack RC
tr_tr: OpenStack RC dosyasını kullanarak çevre değişkenlerini ayarlayın

source: Set of bits that make up a single character; there are usually 8 bits to a byte.
id: Set bit yang membentuk karakter tunggal; biasanya ada 8 bit untuk byte.
tr_tr: Tek bir karakteri oluşturan bit kümesi; Genellikle bayt başına 8 bit vardır.

source: Setting for the Compute RabbitMQ message delivery mode; can be set to either transient or persistent.
id: Pengaturan untuk mode pengiriman pesan Compute RabbitMQ; dapat diatur untuk baik sementara atau persisten.
tr_tr: Hesaplama RabbitMQ ileti teslimi modunun ayarı; Geçici veya kalıcı olarak ayarlanabilir.

source: Shared File Systems API
tr_tr: Paylaşımlı Dosya Sistemleri API'ı

source: Shared File Systems service
id: Bersama layanan Sistem Berkas
tr_tr: Paylaşımlı Dosya Sistemleri servisi

source: Shared File Systems service (manila)
tr_tr: Paylaşımlı Dosya Sistemleri servisi (manila)

source: Shared File Systems service overview
id: Bersama Berkas Sistem ikhtisar layanan
tr_tr: Paylaşımlı Dosya Sistemleri servisi genel görünümü

source: Show host usage statistics
tr_tr: Sunucu kullanım istatistiklerini göster

source: Show information for your volume:
id: Menampilkan informasi untuk volume Anda:
tr_tr: Biriminiz için bilgi gösterin:

source: Show instance usage statistics
tr_tr: Sunucu kullanım istatistiklerini göster

source: Show usage statistics for hosts and instances
tr_tr: Sunucular ve makineler için kullanım istatistiklerini göster

source: Simple Cloud Identity Management (SCIM)
tr_tr: Basit Bulut Kimlik Yönetimi (SCIM)

source: Simple Protocol for Independent Computing Environments (SPICE)
tr_tr: Bağımsız Hesaplama Ortamları için Basit Protokol (SPICE)

source: Since the installation process compiles source files, this requires the related Python development package for your operating system and distribution.
id: Karena proses instalasi mengkompilasi file sumber, ini memerlukan paket pengembangan Python terkait untuk sistem operasi Anda dan distribusi.
tr_tr: Kurulum süreci kaynak dosyaları derlediğinden, bu işletim sisteminiz ve dağıtımınız için ilişkili Python geliştirme paketini gerektirir.

source: Single-root I/O Virtualization (SR-IOV)
tr_tr: Tekil köklü G/Ç Sanallaştırma (SR-IOV)

source: Sizing based on need
id: Sizing berdasarkan kebutuhan
tr_tr: İhtiyaca göre boyutlandırma

source: Sizings based on need
id: Sizings berdasarkan kebutuhan
tr_tr: İhtiyaca göre boyutlandırmalar

source: Snapshot to modify (name or ID)
tr_tr: Değiştirilecek anlık görüntü (isim veya kimlik)

source: Snapshot to modify (name or ID).
tr_tr: Değiştirilecek anlık görüntü (isim veya kimlik).

source: Soft limit on the amount of network traffic a Compute VM instance can send and receive.
tr_tr: Bir Hesaplama VM sunucusunun gönderip alabileceği ağ trafiğinin miktarına ilişkin yumuşak sınır.

source: Software Development Lifecycle Automation service (solum)
tr_tr: Yazılım Geliştirme Hayat Döngüsü Otomasyon servisi (solum)

source: Software component providing the actual implementation for Networking APIs, or for Compute APIs, depending on the context.
tr_tr: İçeriğine bağlı olarak Ağ API'leri veya Compute API'leri için gerçek uygulamayı sağlayan yazılım bileşenidir.

source: Software programs used to protect sensitive information and prevent it from leaking outside a network boundary through the detection and denying of the data transportation.
id: program perangkat lunak yang digunakan untuk melindungi informasi sensitif dan mencegah dari bocor luar batas jaringan melalui deteksi dan menyangkal dari transportasi data.
tr_tr: Hassas bilgileri korumak ve veri taşımacılığını saptamak ve reddetmek suretiyle bir ağ sınırının dışına sızmasını önlemek için kullanılan yazılım programları.

source: Software that arbitrates and controls VM access to the actual underlying hardware.
id: Software yang mengadili dan mengontrol akses VM ke hardware yang sebenarnya.
tr_tr: VM'nin fiili donanıma aracılık yapan ve denetimini sağlayan yazılım.

source: Software that enables multiple VMs to share a single physical NIC within Compute.
tr_tr: Birden fazla VM'nin Hesaplama içinde tek bir fiziksel NIC paylaşmasını sağlayan yazılım.

source: Software that runs on a host or node and provides the features and functions of a hardware-based network switch.
tr_tr: Bir ana makine veya düğüm üzerinde çalışan ve donanıma dayalı bir ağ anahtarının özelliklerini ve işlevlerini sağlayan yazılım.

source: Software-defined networking (SDN)
tr_tr: Yazılım-tanımlı ağ (SDN)

source: SolidFire Volume Driver
tr_tr: SolidFire Disk Bölümü Sürücüsü

source: Some tips:
id: Beberapa tips:
tr_tr: Bazı ipuçları:

source: Something you must be aware of before proceeding.
id: Sesuatu yang Anda harus menyadari sebelum melanjutkan.
tr_tr: Devam etmeden önce farkında olmanız gereken şeyler.

source: Special project that contains all services that are listed in the catalog.
tr_tr: Katalogda listelenen tüm servisleri içeren özel proje.

source: Specialized microprocessor for incorporating cryptographic keys into devices for authenticating and securing a hardware platform.
tr_tr: Bir donanım platformunun kimliğini doğrulamak ve güvence altına almak için kriptografik anahtarları cihazlara dahil etmek için kullanılan özel mikroişlemci.

source: Specification for managing identity in the cloud, currently unsupported by OpenStack.
tr_tr: Buluttaki kimliği yönetmek için şartlar, şu an OpenStack tarafından desteklenmiyor.

source: Specifies additional requirements when Compute determines where to start a new instance. Examples include a minimum amount of network bandwidth or a GPU.
id: Menentukan persyaratan tambahan ketika Komputer menentukan di mana untuk memulai sebuah contoh baru. Contohnya termasuk jumlah minimum bandwidth jaringan atau GPU.
tr_tr: Compute, yeni bir sunucunun nereden başlatacağını belirlediğinde ek gereksinimleri belirtir. Örnekler, minimum bir ağ bant genişliği veya GPU içerir.

source: Specifies the authentication source used by Image service or Identity. In the Database service, it refers to the extensions implemented for a data store.
tr_tr: İmaj servisi veya Kimlik tarafından kullanılan doğrulama kaynağını belirtir. Veritabanı hizmetinde, bir veri deposu için uygulanan uzantılara karşılık gelir.

source: Standard for packaging VM images. Supported in OpenStack.
tr_tr: VM görüntülerini paketlemek için standart. OpenStack'de desteklenir.

source: Storage concepts
id: konsep penyimpanan
tr_tr: Depolama kavramları

source: Storage protocol similar in concept to TCP/IP; encapsulates SCSI commands and data.
id: protokol penyimpanan mirip dalam konsep TCP / IP; dikemas perintah SCSI dan data.
tr_tr: Depolama protokolü TCP/IP ile benzer; SCSI komutlarını ve verilerini kapsar.

source: Storage protocol that encapsulates SCSI frames for transport over IP networks. Supported by Compute, Object Storage, and Image service.
tr_tr: IP ağları üzerinden nakliye için SCSI çerçevelerini kapsayan depolama protokolü. Hesaplama, Nesne Depolama ve İmaj hizmeti tarafından desteklenir.

source: Storage repository for image files
id: Penyimpanan repositori untuk file gambar
tr_tr: İmaj dosyaları için depolama deposu

source: Storage ring build and rebalance utility. Documented in `Managing the Rings <https://docs.openstack.org/developer/swift/admin_guide.html#managing-the-rings>`_.
tr_tr: Depolama ring inşası ve yeniden dengeleme aracı. `Ring'lerin Yönetiminde <https://docs.openstack.org/developer/swift/admin_guide.html#managing-the-rings>`_ belgelenmiştir.

source: Storage types
id: jenis penyimpanan
tr_tr: Depolama türleri

source: Stores CephFS metadata.
tr_tr: CephFS üst verisi saklar.

source: Stores and retrieves arbitrary unstructured data objects via a RESTful, HTTP based API. It is highly fault tolerant with its data replication and scale-out architecture. Its implementation is not like a file server with mountable directories. In this case, it writes objects and files to multiple drives, ensuring the data is replicated across a server cluster.
id: Toko dan mengambil sewenang-wenang objek data yang tidak terstruktur melalui tenang, berdasarkan HTTP API. Hal ini sangat kesalahan toleran dengan replikasi data dan arsitektur scale-out. pelaksanaannya tidak seperti file server dengan direktori mountable. Dalam hal ini, itu menulis objek dan file ke beberapa drive, memastikan data direplikasi di server cluster.
tr_tr: Gelişigüzel veri nesnelerini RESTful, HTTP tabanlı bir API aracılığıyla deoplar ve getirir. Veri yedekleme ve dışa ölçeklenebilir mimarisiyle yüksek hata payına sahiptir. Uygulaması bağlanabilir dizinlere sahip bir dosya sunucusu gibi değildir. Bu durumda, birden çok sürücüye nesneleri ve dosyaları yazar, verinin sunucu kümesi içinde dağıtıldığından emin olur.

source: Stores and retrieves virtual machine disk images. OpenStack Compute makes use of this during instance provisioning.
id: Toko dan mengambil gambar mesin virtual disk. OpenStack Compute memanfaatkan ini selama misalnya penyediaan.
tr_tr: Sanal makine disk imajlarını depolar ve getirir. OpenStack Hesaplama sunucu hazırlama sırasında bunu kullanır.

source: Stores image metadata and you can choose your database depending on your preference. Most deployments use MySQL or SQLite.
id: Toko metadata gambar dan Anda dapat memilih database Anda tergantung pada preferensi Anda. Kebanyakan penyebaran menggunakan MySQL atau SQLite.
tr_tr: İmaj metaverisini saklar ve isteğinize göre veritabanınızı seçebilirsiniz. Çoğu kurulum MySQL veya SQLite kullanır.

source: Stores most build-time and run-time states for a cloud infrastructure, including:
id: Toko paling membangun-waktu dan runtime negara untuk infrastruktur cloud, termasuk:
tr_tr: Bir bulut altyapası için çoğu inşa-zamanı ve çalışma-zamanı durumlarını tutar, şunlar dahildir:

source: Stores, processes, and retrieves metadata about images. Metadata includes items such as size and type.
id: Toko, proses, dan mengambil metadata tentang gambar. Metadata termasuk barang-barang seperti ukuran dan jenis.
tr_tr: İmajlarla ilgili metaveriyi depolar, işler ve getirir. Metaveri boyut ve tür gibi ögeleri içerir.

source: String of text known only by the user; used along with an access key to make requests to the Compute API.
tr_tr: Yalnızca kullanıcı tarafından bilinen metin dizesi; Hesaplama API'na istek yapmak için bir erişim tuşu ile birlikte kullanılır.

source: Subdivides physical CPUs. Instances can then use those divisions.
tr_tr: Fiziksel CPU'ları alt bölümlere ayırır. Sunucular daha sonra bu bölümleri kullanabilir.

source: Support for different Hadoop distributions:
id: Dukungan untuk distribusi Hadoop yang berbeda:
tr_tr: Farklı Hadoop dağıtımlarına destek:

source: Supported model values
id: nilai model didukung
tr_tr: Desteklenen model değerleri

source: Supports Python 2.7, 3.4, and 3.5.
tr_tr: Python 2.7, 3.4, ve 3.5 destekler.

source: Supports interaction with VMware products in Compute.
tr_tr: Hesaplama'da VMware ürünleri ile etkileşimi destekler.

source: Takes a virtual machine instance request from the queue and determines on which compute server host it runs.
id: Membawa permintaan mesin contoh virtual dari antrian dan menentukan di mana tuan menghitung server yang berjalan.
tr_tr: Kuyruktan bir sanal makine sunucusu isteğini alır ve hangi hesaplama sunucusu üzerinde çalışacağını belirler.

source: Telemetry Alarming service
id: layanan telemetri Alerting
tr_tr: Telemetri Uyarı servisi

source: Telemetry Data Collection service
id: layanan telemetri Pengumpulan Data
tr_tr: Telemetri Veri Toplama servisi

source: Telemetry service
id: layanan telemetri
tr_tr: Telemetri servisi

source: Telemetry service (telemetry)
tr_tr: Telemetri servisi (telemetry)

source: Telemetry service overview
id: ikhtisar layanan telemetri
tr_tr: Telemetri servisi genel görünümü

source: Telemetry v3
tr_tr: Telemetri v3

source: Term for an :term:`Object Storage<Object Storage service (swift)>` process that runs for a long time. Can indicate a hung process.
tr_tr: Uzun süre bayunca çalışan :term:`Nesne Depolama<Object Storage service (swift)>` işlemi için terim. Asılı bir işlemi gösterebilir.

source: Term used in the OSI network architecture for the data link layer. The data link layer is responsible for media access control, flow control and detecting and possibly correcting errors that may occur in the physical layer.
tr_tr: Veri bağlantısı katmanı için OSI ağ mimarisinde kullanılan terim. Veri bağlantısı katmanı, ortam erişim denetiminden, akış denetiminden ve fiziksel katmanda ortaya çıkabilecek hataların algılanıp muhtemelen düzeltilmesinden sorumludur.

source: Term used in the OSI network architecture for the network layer. The network layer is responsible for packet forwarding including routing from one node to another.
tr_tr: Ağ katmanı için OSI ağ mimarisinde kullanılan terim. Ağ katmanı, bir düğümden diğerine yönlendirme de dahil olmak üzere paket yönlendirmeden sorumludur.

source: The API used to access the OpenStack Identity service provided through keystone.
id: API yang digunakan untuk mengakses layanan OpenStack Identity disediakan melalui keystone.
tr_tr: keystone üzerinden sağlanan OpenStack Kimlik servisine erişim için kullanılan API.

source: The Amazon commercial block storage product.
id: Amazon produk penyimpanan blok komersial.
tr_tr: Amazon ticari blok depolama ürünü.

source: The Amazon commercial compute product, similar to Compute.
id: Amazon produk komputasi komersial, mirip dengan Hitunglah.
tr_tr: Amazon ticari hesaplama ürünü, Hesaplama'ya benzer.

source: The Apache Software Foundation supports the Apache community of open-source software projects. These projects provide software products for the public good.
id: Apache Software Foundation mendukung komunitas Apache proyek software open-source. Proyek-proyek ini menyediakan produk perangkat lunak untuk kepentingan publik.
tr_tr: Apache Yazılım Derneği, açık kaynaklı yazılım projelerinin Apache topluluğunu desteklemektedir. Bu projeler halka açık ürünler için yazılım ürünleri sağlar.

source: The Block Storage driver for the SolidFire iSCSI storage appliance.
tr_tr: SolidFire iSCSI depolama cihazı için Blok Depolama sürücüsü.

source: The Block Storage service consists of the following components:
id: Layanan Block Storage terdiri dari komponen-komponen berikut:
tr_tr: Blok Depolama servisi şu bileşenlerden oluşur:

source: The Border Gateway Protocol is a dynamic routing protocol that connects autonomous systems. Considered the backbone of the Internet, this protocol connects disparate networks to form a larger network.
id: Border Gateway Protocol adalah protokol routing dinamis yang menghubungkan sistem otonom. Dianggap sebagai tulang punggung Internet, protokol ini menghubungkan jaringan yang berbeda untuk membentuk jaringan yang lebih besar.
tr_tr: Sınır Geçidi Protokolü özerk sistemleri birbirine bağlayan dinamik bir yönlendirme protokolüdür. İnternetin omurgasına bakıldığında, bu protokol daha geniş bir ağ oluşturmak için birbirinden bağımsız ağları birbirine bağlar.

source: The Ceph storage daemon.
tr_tr: Ceph depolama artalan işlemi.

source: The Compute RabbitMQ message exchange that remains active when the server restarts.
id: Pertukaran pesan Compute RabbitMQ yang tetap aktif saat server restart.
tr_tr: Sunucu yeniden başlatıldığında etkin kalan bir Hesaplama RabbitMQ mesaj alışverişi.

source: The Compute VM scheduling algorithm that attempts to start a new VM on the host with the least amount of load.
tr_tr: En az miktarda yükleme ile sunucu üzerinde yeni bir VM başlatma girişiminde bulunan Hesaplama VM zamanlama algoritması.

source: The Compute component that chooses suitable hosts on which to start VM instances.
id: Komponen Compute yang memilih host yang sesuai di mana untuk memulai VM contoh.
tr_tr: VM sunucularını başlatacak uygun ana makineleri seçen Hesaplama bileşeni.

source: The Compute component that contains a list of the current capabilities of each host within the cell and routes requests as appropriate.
id: Komponen komputer yang berisi daftar kemampuan saat ini masing-masing host dalam sel dan rute permintaan yang sesuai.
tr_tr: Hücredeki her bir ana makinenin mevcut özelliklerinin bir listesini içeren ve istekleri uygun şekilde yönlendiren Hesaplama bileşeni.

source: The Compute component that gives IP addresses to authorized nodes and assumes DHCP, DNS, and routing configuration and services are provided by something else.
id: Komponen Compute yang memberikan alamat IP ke kelenjar resmi dan mengasumsikan DHCP, DNS, dan konfigurasi routing dan layanan yang disediakan oleh sesuatu yang lain.
tr_tr: Yetkili düğümlere IP adresi veren ve DHCP, DNS ve yönlendirme yapılandırmasını ve hizmetlerini varsayan Hesaplama bileşeni başka bir şey tarafından sağlanmaktadır.

source: The Compute component that manages various network components, such as firewall rules, IP address allocation, and so on.
tr_tr: Güvenlik duvarı kuralları, IP adres ayrılması, gibi çeşitli ağ bileşenlerini yöneten Hesaplama hizmeti bileşeni.
