Repository: 25hours/openstack-manuals
Catalog: doc/common/source/locale/*/LC_MESSAGES/common.po
Languages: id, tr_tr

source: Use OpenStack Compute to host and manage cloud computing systems. OpenStack Compute is a major part of an :term:`Infrastructure-as-a-Service (IaaS)` system. The main modules are implemented in Python.
tr_tr: OpenStack Hesaplamayı bulut hesaplama sistemleri sunmak ve yönetmek için kullanın. OpenStack Hesaplama bir :term:`Servis olarak Altyapı (IaaS)` sisteminin büyük bir parçasıdır. Ana modüller Python ile yazılmıştır.

source: Use cases include:
id: Gunakan kasus meliputi:
tr_tr: Kullanım durumları şunları içerir:

source: Use pip to install the OpenStack clients on a Linux, Mac OS X, or Microsoft Windows system. It is easy to use and ensures that you get the latest version of the client from the `Python Package Index <https://pypi.python.org/pypi>`__. Also, pip enables you to update or remove a package.
id: Gunakan pip untuk menginstal klien OpenStack pada Linux, Mac OS X, atau sistem Microsoft Windows. Hal ini mudah digunakan dan memastikan bahwa Anda mendapatkan versi terbaru dari klien dari `Python Package Index <https://pypi.python.org/pypi>` __. Juga, pip memungkinkan Anda untuk memperbarui atau menghapus sebuah paket.
tr_tr: OpenStack istemcilerini Linux, Mac OS X, veya Microsoft Windows sistemler üzerinde kurmak için pip kullanın. `Python Paket İndisinden <https://pypi.python.org/pypi>`__ istemciyi kullanmak ve son sürümü indirdiğinizden emin olmak kolaydır. Ayrıca pip bir paketi güncellemenizi ve kaldırmanızı da sağlar.

source: Use the :command:`trove list` command to get the ID of the instance, followed by the :command:`trove show` command to get the IP address of it.
id: Gunakan: perintah: `harta list` perintah untuk mendapatkan ID dari contoh, diikuti oleh: perintah:` harta show` perintah untuk mendapatkan alamat IP dari itu.
tr_tr: :command:`trove list` komutunu kullanarak sunucu kimliğini alın, ardından :command:`trove show` komutuyla IP adresini alın.

source: Use the :command:`trove-manage` command to import images and offer them to projects.
tr_tr: İmajları içe aktarmak ve projelere sunmak için :command:`trove-manage` komutunu kullanın.

source: Used along with an EC2 access key when communicating with the Compute EC2 API; used to digitally sign each request.
id: Digunakan bersama dengan tombol akses EC2 ketika berkomunikasi dengan API Komputer EC2; digunakan untuk menandatangani secara digital setiap permintaan.
tr_tr: Compute EC2 API ile iletişim kurarken bir EC2 erişim tuşu ile birlikte kullanılır; Her isteği dijital olarak imzalamak için kullanılır.

source: Used along with an EC2 secret key to access the Compute EC2 API.
id: Digunakan bersama dengan EC2 kunci rahasia untuk mengakses API Komputer EC2.
tr_tr: Hesaplama EC2 API'sine erişmek için bir EC2 gizli anahtarı ile birlikte kullanılır.

source: Used along with an EKI to create an EMI.
id: Digunakan bersama dengan EKI untuk menciptakan EMI.
tr_tr: Bir EMI yaratmak için bir EKI ile birlikte kullanılır.

source: Used along with an ERI to create an EMI.
id: Digunakan bersama dengan ERI untuk menciptakan EMI.
tr_tr: Bir EMI oluşturmak için bir ERI ile birlikte kullanılır.

source: Used along with arptables and ebtables, iptables create firewalls in Compute. iptables are the tables provided by the Linux kernel firewall (implemented as different Netfilter modules) and the chains and rules it stores. Different kernel modules and programs are currently used for different protocols: iptables applies to IPv4, ip6tables to IPv6, arptables to ARP, and ebtables to Ethernet frames. Requires root privilege to manipulate.
id: Digunakan bersama dengan arptables dan ebtables, iptables buat firewall di Compute. iptables adalah tabel yang disediakan oleh firewall kernel Linux (diimplementasikan sebagai modul Netfilter yang berbeda) dan rantai dan aturan itu toko. modul kernel yang berbeda dan program yang saat ini digunakan untuk protokol yang berbeda: iptables berlaku untuk IPv4, ip6tables ke IPv6, arptables untuk ARP, dan ebtables untuk frame Ethernet. Membutuhkan hak istimewa root untuk memanipulasi.
tr_tr: Arptables ve ebtables ile birlikte kullanıldığında, iptables Compute'de güvenlik duvarları oluşturur. Iptables, Linux çekirdek güvenlik duvarı (farklı Netfilter modülleri olarak uygulanır) ve depoladığı zincirler ve kurallar tarafından sağlanan tablolardır. Şu anda farklı protokoller için farklı çekirdek modülleri ve programları kullanılmaktadır: iptables, IPv4'e, ip6 tablolarına IPv6'ya, ARP'ye arptables'a ve Ethernet çerçevelerine ebtables'a uygulanır. Yönetmek için root ayrıcalığı gerektirir.

source: Used by Image service to obtain images on the local host rather than re-downloading them from the image server each time one is requested.
id: Digunakan oleh layanan Image untuk mendapatkan gambar pada host lokal daripada-download ulang mereka dari server gambar setiap kali salah satu yang diminta.
tr_tr: İmaj sunucusu tarafından yerel sunucuda imaj elde etmek için her biri istediği zaman imaj sunucusundan yeniden indirmek için kullanılır.

source: Used by Object Storage devices to determine which storage devices are suitable for the job. Devices are weighted by size.
tr_tr: Nesne Depolama aygıtları tarafından hangi depolama aygıtlarının iş için uygun olduğunu belirlemek için kullanılır. Cihazlar boyuta göre ağırlıklandırılır.

source: Used by Object Storage to determine the location of an object in the ring. Maps objects to partitions.
tr_tr: Nesne Depolama tarafından, yüzükteki bir nesnenin konumunu belirlemek için kullanılır. Nesneleri bölümlere eşleştirir.

source: Used by Object Storage to determine which partition data should reside on.
tr_tr: Nesne Depolama tarafından hangi bölüm verisinin bulunması gerektiğini belirlemek için kullanılır.

source: Used by Object Storage to push object replicas.
tr_tr: Nesne Depolama Birimi tarafından nesne kopyalarını itmek için kullanılır.

source: Used by most OpenStack Networking installations to route information between the neutron-server and various agents. Also acts as a database to store networking state for particular plug-ins.
id: Digunakan oleh sebagian besar instalasi OpenStack Networking untuk rute informasi antara neutron-server dan berbagai agen. Juga bertindak sebagai database untuk menyimpan negara jaringan untuk tertentu plug-in.
tr_tr: Neutron-server ve çeşitli aracılar arasında bilgi yönlendirmek için çoğu OpenStack Ağı tarafından kullanılır. Ayrıca belirli ekelntiler tarafından ağ durumunu tutmak için veritabanı olarak kullanılır.

source: Used for adding additional persistent storage to a virtual machine (VM)
id: Digunakan untuk menambahkan penyimpanan persisten tambahan untuk mesin virtual (VM)
tr_tr: Bir sanal makineye (VM) kalıcı ek depolama eklemek için kullanılır

source: Used for providing file shares to a virtual machine
tr_tr: Bir sanal makineye dosya paylaşımları sağlamada kullanılır

source: Used for storing virtual machine images and data
tr_tr: Sanal makine imajları ve veri depolama için kullanılır

source: Used to mark Object Storage objects that have been deleted; ensures that the object is not updated on another node after it has been deleted.
tr_tr: Silinen Nesne Depolama nesnelerini işaretlemek için kullanılır; nesnenin silindikten sonra başka bir düğümde güncellenmesini önler.

source: Used to restrict communications between hosts and/or nodes, implemented in Compute using iptables, arptables, ip6tables, and ebtables.
id: Digunakan untuk membatasi komunikasi antara host dan / atau node, dilaksanakan di Komputer menggunakan iptables, arptables, ip6tables, dan iptables.
tr_tr: Bilgisayarlar arasında iptables, arptables, ip6tables ve ebtables kullanılarak gerçekleştirilen bilgisayarlar ve/veya düğümler arasındaki iletişimi kısıtlamak için kullanılır.

source: Used to track segments of a large object within Object Storage.
tr_tr: Nesne Depolama'da geniş bir nesnenin kesimlerini izlemek için kullanılır.

source: User Mode Linux (UML)
tr_tr: Kullanıcı Kipi Linux (UML)

source: User can specify `volume type` when creating a volume.
id: Pengguna dapat menentukan `type` volume saat menciptakan volume.
tr_tr: Kullanıcı birim oluştururken `birim türü` belirtebilir.

source: User-friendly UI for ad-hoc analytics queries based on Hive or Pig.
id: UI yang user-friendly untuk query analisis ad-hoc berdasarkan Hive atau Pig.
tr_tr: Hive veya Pig tabanlı amaca özel çözüm sorguları için kullanıcı dostu kullanıcı arayüzü.

source: Users and services can locate other services by using the service catalog, which is managed by the Identity service. As the name implies, a service catalog is a collection of available services in an OpenStack deployment. Each service can have one or many endpoints and each endpoint can be one of three types: admin, internal, or public. In a production environment, different endpoint types might reside on separate networks exposed to different types of users for security reasons. For instance, the public API network might be visible from the Internet so customers can manage their clouds. The admin API network might be restricted to operators within the organization that manages cloud infrastructure. The internal API network might be restricted to the hosts that contain OpenStack services. Also, OpenStack supports multiple regions for scalability. For simplicity, this guide uses the management network for all endpoint types and the default ``RegionOne`` region. Together, regions, services, and endpoints created within the Identity service comprise the service catalog for a deployment. Each OpenStack service in your deployment needs a service entry with corresponding endpoints stored in the Identity service. This can all be done after the Identity service has been installed and configured.
tr_tr: Kullanıcılar ve servisler Kimlik servisi tarafından yönetilen servis kataloğunu kullanarak diğer servislerin konumunu bulabilirler. İsminden anlaşıldığı gibi, bir servis kataloğu OpenStack kurulumunda kullanılabilen servisler topluluğudur. Her bir servis bir ya da daha fazla uç noktaya sahip olabilir ve her uç nokta yönetici, dahili veya açık olmak üzere üç tür olabilir. Bir üretim ortamında farklı uç nokta türleri güvenlik sebebiyle farklı kullanıcı türlerine verilmiş farklı ağlar üzerinde bulunabilir. Örneğin herkese açık API ağı kullanıcıların bulutlarını yönetebilmeleri için İnternetten görünür olabilir. Yönetici API ağı kurumdaki bulut alt yapısını yöneten işleticilerle sınırlandırılmış olabilir. Dahili API ağı OpenStack servislerini içeren sunuculara kısıtlanmış olabilir. Ayrıca, OpenStack ölçeklenebilirlik için birden fazla bölgeyi destekler. Basit olması için, bu kılavuz tüm uç nokta türleri ve öntanımlı ``BölgeBir`` bölgesi için yönetim ağını kullanır. Birlikte, bölgeler, servisler ve Kimlik servisinde oluşturulan uç noktalar bir kurulumun servis kataloğunu oluştururlar. Kurulumunuzdaki her OpenStack servisi Kimlik servisinde ilişkili uç noktalarının tutulduğu bir servis girdisine ihtiyaç duyar. Bunları hepsi Kimlik servisi kurulduktan ve yapılandırıldıktan sonra yapılabilir.

source: Users can access OpenStack via the web-based user interface implemented by :doc:`Dashboard <get-started-dashboard>`, via `command-line clients <https://docs.openstack.org/cli-reference/>`__ and by issuing API requests through tools like browser plug-ins or :command:`curl`. For applications, `several SDKs <https://developer.openstack.org/#sdk>`__ are available. Ultimately, all these access methods issue REST API calls to the various OpenStack services.
tr_tr: Kullanıcılar OpenStack'e :doc:`Kontrol Panosu <get-started-dashboard>` tarafından uygulanan web tabanlı kullanıcı arayüzüyle, `komut-satırı istemcileriyle <https://docs.openstack.org/cli-reference/>`__ ve tarayıcı eklentileri veya :command:`curl` gibi araçlar aracılığıyla API istekleri yaparak erişebilirler. Uygulamalar için, kullanılabilir `birçok SDK <https://developer.openstack.org/#sdk>`__ bulunur. Son noktada tüm bu erişim yöntemleri çeşitli OpenStack servislerine REST API çağrıları yaparlar.

source: Users can set the operating system ID or a ``short-id`` in image properties. For example:
id: Pengguna dapat mengatur sistem operasi ID atau `` short-id`` di properti gambar. Sebagai contoh:
tr_tr: Kullanıcılar imaj özelliklerinde işletim sistemi kimliğini veya bir ``short-id`` değerini ayarlayabilirler. Örneğin:

source: Users of Object Storage interact with the service through the proxy server, which in turn looks up the location of the requested data within the ring and returns the results to the user.
tr_tr: Nesne Depolama kullanıcısı vekil sunucusu aracılığıyla hizmetle etkileşim kurar ve vekil sunucusu üzerinden istenilen verilerin bulunduğu yere bakar ve sonuçları kullanıcıya döndürür.

source: Utilization of unused compute power from general purpose OpenStack IaaS cloud.
id: Pemanfaatan kekuatan komputasi yang tidak terpakai dari tujuan umum OpenStack IaaS awan.
tr_tr: Genel amaçlı OpenStack IaaS bulutunun kullanılmayan hesaplama gücünün değerlendirilmesi.

source: VLAN manager
tr_tr: VLAN yöneticisi

source: VLAN network
tr_tr: VLAN ağı

source: VM Remote Control (VMRC)
tr_tr: VM Uzaktan Kontrol (VMRC)

source: VM image
tr_tr: VM imajı

source: VM image container format supported by Image service.
id: VM format kontainer gambar yang didukung oleh layanan Gambar.
tr_tr: İmaj servisi tarafından desteklenen VM imajı kapsayıcı biçimi.

source: VMware NSX Neutron plug-in
tr_tr: VMware NSX Neutron eklentisi

source: VMwareAPI for VMware
tr_tr: VMware için VMwareAPI

source: VNC proxy
tr_tr: VNC vekil

source: Various periodic processes
id: Berbagai proses periodik
tr_tr: Çeşitli dönemsel süreçler

source: Various repository types are supported including normal file systems (or any filesystem mounted on the glance-api controller node), Object Storage, RADOS block devices, VMware datastore, and HTTP. Note that some repositories will only support read-only usage.
tr_tr: Normal dosya sistemleri (veya glance-api kontrol düğümüne bağlı herhangi bir dosya sistemi), Nesne Depolama, RADOS blok aygıtları, VMware verimerkezi ve HTTP dahil çeşitli depo türleri desteklenir. Bazı depoların yalnızca okunur kullanımı destekleyeceğini unutmayın.

source: Verify that transfer list is now empty and that the volume is again available for transfer:
id: Pastikan daftar transfer sekarang kosong dan bahwa volume lagi tersedia untuk transfer:
tr_tr: Aktarım listesinin artık boş olduğunu ve birimin aktarım için tekrar kullanılabilir olduğunu onaylayın:

source: View pending transfers:
id: Lihat transfer tertunda:
tr_tr: Bekleyen aktarımları görüntüleyin:

source: Virtual Central Processing Unit (vCPU)
tr_tr: Sanal Merkezi İşlem Birimi (vCPU)

source: Virtual Disk Image (VDI)
tr_tr: Sanal Disk İmajı (VDI)

source: Virtual Extensible LAN (VXLAN)
tr_tr: Sanal Genişletilebilir LAN (VXLAN)

source: Virtual Hard Disk (VHD)
tr_tr: Sanal Sabit Disk (VHD)

source: Virtual Network Computing (VNC)
tr_tr: Sanal Ağ Hesaplama (VNC)

source: Virtual Network InterFace (VIF)
tr_tr: Sanal Ağ AraYüzü (VIF)

source: Virtual network type that uses neither VLANs nor tunnels to segregate project traffic. Each flat network typically requires a separate underlying physical interface defined by bridge mappings. However, a flat network can contain multiple subnets.
tr_tr: Proje trafiğini ayırmak için VLAN'lar veya tüneller kullanmayan sanal ağ türü. Her düz ağ genellikle köprü eşlemeleri tarafından tanımlanan ayrı bir fiziksel arabirim gerektirir. Bununla birlikte, düz bir ağ birden çok alt ağ içerebilir.

source: Virtualization API library used by OpenStack to interact with many of its supported hypervisors.
tr_tr: OpenStack tarafından desteklenen birçok denetleyicisiyle etkileşim kurmak için kullanılan Sanallaştırma API kitaplığı.

source: Volume API
tr_tr: Disk Bölümü API

source: Volume that does not save the changes made to it and reverts to its original state when the current user relinquishes control.
id: Volume yang tidak menyimpan perubahan yang dilakukan untuk itu dan beralih ke keadaan semula ketika pengguna saat relinquishes kontrol.
tr_tr: Yapılan değişiklikleri kaydetmeyen ve geçerli kullanıcı denetimden vazgeçtiğinde özgün durumuna geri dönen birim.

source: WSGI middleware
tr_tr: WSGI ara yazılımı

source: WSGI middleware component of Object Storage that serves container data as a static web page.
tr_tr: Nesne Depolamanın WSGI ara katman bileşeni, kap verilerine statik bir web sayfası olarak hizmet eder.

source: Watcher
tr_tr: İzleyici

source: What's next
id: Apa berikutnya
tr_tr: Sırada ne var

source: When extending an LVM volume with a snapshot, the volume will be deactivated. The reactivation is automatic unless ``auto_activation_volume_list`` is defined in ``lvm.conf``. See ``lvm.conf`` for more information.
id: Ketika memperluas volume LVM dengan snapshot, volume akan dinonaktifkan. reaktivasi adalah otomatis kecuali `` auto_activation_volume_list`` didefinisikan dalam `` lvm.conf``. Lihat `` lvm.conf`` untuk informasi lebih lanjut.
tr_tr: Bir LVM birimi anlık görüntüyle büyütürken, birim pasifleştirilir. Tekrar etkinleştirme ``lvm.conf``'da ``auto_activation_volume_list`` tanımlı olmadığı sürece otomatiktir. Daha fazla bilgi için ``lvm.conf``'a bakınız.

source: When the volume is fully deleted, it disappears from the list of volumes:
id: Ketika volume sepenuhnya dihapus, menghilang dari daftar volume:
tr_tr: Birim tamamen silindiğinde, birim listesinden kaybolur:

source: When viewing a list of images, you can also use ``grep`` to filter the list, as follows:
id: Saat melihat daftar gambar, Anda juga dapat menggunakan `` grep`` untuk menyaring daftar, sebagai berikut:
tr_tr: Bir imaj listesini görüntülerken, listeden bir şeyler yakalamak için ``grep`` kullanabilirsiniz:

source: When you are prompted for an OpenStack password, enter the password for the user who downloaded the ``PROJECT-openrc.sh`` file.
id: Saat Anda diminta untuk sandi OpenStack, masukkan password untuk user yang download `` berkas PROJECT-openrc.sh``.
tr_tr: OpenStack parolası sorulduğunda, ``PROJE-openrc.sh`` dosyasını indiren kullanıcı için olan parolayı girin.

source: When you run OpenStack client commands, you can override some environment variable settings by using the options that are listed at the end of the ``help`` output of the various client commands. For example, you can override the ``OS_PASSWORD`` setting in the ``PROJECT-openrc.sh`` file by specifying a password on a :command:`openstack` command, as follows:
id: Bila Anda menjalankan perintah klien OpenStack, Anda dapat mengganti beberapa lingkungan pengaturan variabel dengan menggunakan opsi yang didaftar pada akhir `` keluaran help`` dari berbagai perintah klien. Misalnya, Anda dapat mengganti `` pengaturan OS_PASSWORD`` di `` berkas PROJECT-openrc.sh`` dengan menentukan password pada: perintah: `perintah openstack`, sebagai berikut:
tr_tr: OpenStack istemci komutları çalıştırdığınızda, bazı çevre değişkenlerinin üzerine çeşitli istemci komutlarının ``help`` çıktısının sonunda listelenen seçenekleri kullanarak yazabilirsiniz. Örneğin ``OS-PASSWORD`` ayarının üzerine ``PROJE-openrc.sh`` dosyasında :command:`openstack` komutunda bir parola belirterek şu şekilde yazabilirsiniz:

source: When you source the file, environment variables are set for your current shell. The variables enable the OpenStack client commands to communicate with the OpenStack services that run in the cloud.
id: Ketika Anda sumber file, variabel lingkungan ditetapkan untuk shell Anda saat ini. Variabel memungkinkan klien OpenStack perintah untuk berkomunikasi dengan layanan OpenStack yang berjalan di awan.
tr_tr: Dosyayı kaynak ettiğinizde, çevre değişkenleri mevcut kabuğunuz için ayarlanır. Değişkenler bulutta çalışan OpenStack servisleriyle iletişim kurmaları için OpenStack istemci komutlarını etkinleştirir.

source: When you use OpenStack with VMware vCenter Server, you need to specify the ``vmware_disktype`` and ``vmware_adaptertype`` properties with :command:`openstack image create`. Also, we recommend that you set the ``hypervisor_type="vmware"`` property. For more information, see `Images with VMware vSphere <https://docs.openstack.org/ocata/config-reference/compute/hypervisor-vmware.html#images-with-vmware-vsphere>`_ in the OpenStack Configuration Reference.
tr_tr: OpenStack'i VMware vCenter Sunucu ile kullanırken, :command:`openstack image create` komutuyla ``vmware_disktype`` ve ``vmware_adaptertype`` özelliklerini belirtmelisiniz. Ayrıca ``hypervisor_type="vmware"`` özelliğini de ayarlamanızı öneriyoruz. Daha fazla bilgi için OpenStack Yapılandırma Başvurusundaki `VMware vSphere ile İmajlar <https://docs.openstack.org/ocata/config-reference/compute/hypervisor-vmware.html#images-with-vmware-vsphere>`_ bölümüne bakın.

source: Where ``PASSWORD`` is your password.
id: Di mana `` PASSWORD`` adalah password Anda.
tr_tr: ``PASSWORD`` parolanızdır.

source: While logged in as the volume donor, list the available volumes:
id: Sementara login sebagai donor volume, daftar volume yang tersedia:
tr_tr: Birim vericisi olarak giriş yaptıktan sonra, kullanılabilir birimleri listeleyin:

source: While the ``auth_key`` property is visible in the output of ``openstack volume transfer request create VOLUME_ID``, it will not be available in subsequent ``openstack volume transfer request show TRANSFER_ID`` command.
tr_tr: ``auth_key`` özelliği ``openstack volume transfer request create VOLUME_ID`` çıktısında görünür olsa da, ardından gelen ``openstack volume transfer request show TRANSFER_ID`` komutunda kullanılabilir olmayacaktır.

source: Within RabbitMQ and Compute, it is the messaging interface that is used by the scheduler service to receive capability messages from the compute, volume, and network nodes.
id: Dalam RabbitMQ dan Compute, itu adalah antarmuka pesan yang digunakan oleh layanan scheduler untuk menerima pesan kemampuan dari node komputasi, volume, dan jaringan.
tr_tr: RabbitMQ ve Hesaplama içinde, zamanlayıcı hizmeti tarafından hesaplama, hacim ve ağ düğümlerinden yetenek mesajları almak için kullanılan mesajlaşma arayüzüdür.

source: Work in progress - expected for the Mitaka release
id: Bekerja di kemajuan - diharapkan untuk rilis Mitaka
tr_tr: İşlem devam ediyor - Mitaka dağıtımı için bekleniyor

source: Workflow service
id: layanan Workflow
tr_tr: İş akışı servisi

source: Workflow service (mistral)
tr_tr: İş akış servisi (mistral)

source: Workflow service for OpenStack cloud.
id: layanan alur kerja untuk OpenStack awan.
tr_tr: OpenStack bulutu için iş akışı servisi.

source: X.509 is the most widely used standard for defining digital certificates. It is a data structure that contains the subject (entity) identifiable information such as its name along with its public key. The certificate can contain a few other attributes as well depending upon the version. The most recent and standard version of X.509 is v3.
tr_tr: X.509, dijital sertifikaları tanımlamak için en yaygın kullanılan standarttır. Bu, adını örneğin, genel anahtarıyla birlikte özne (öğe) tanımlanabilir bilgisini içeren bir veri yapısıdır. Sertifika, sürümüne bağlı olarak birkaç başka öznitelik içerebilir. X.509'un en son ve standart sürümü v3'tür.

source: Xen Cloud Platform (XCP)
tr_tr: Xen Bulut Platformu (XCP)

source: Xen Storage Manager Volume Driver
tr_tr: Xen Depolama Yönetimi Disk Bölümü Sürücüsü

source: Xen is a hypervisor using a microkernel design, providing services that allow multiple computer operating systems to execute on the same computer hardware concurrently.
tr_tr: Xen, bir mikrokernel tasarımını kullanan, birden fazla bilgisayar işletim sisteminin aynı anda aynı bilgisayar donanımında yürütülmesine izin veren bir hizmet sağlayıcısı olan bir hiper yöneticidir.

source: XenAPI for XenServer/XCP
tr_tr: XenServer/XCP için XenAPI
