Repository: 25hours/openstack-manuals
Catalog: doc/common/source/locale/*/LC_MESSAGES/common.po
Languages: id, tr_tr

source: Code name for the :term:`Containers Infrastructure Management service<Container Infrastructure Management service (magnum)>`.
tr_tr: :term:`Kap Altyapı Yönetimi servisi <Container Infrastructure Management service (magnum)>` için kod adı.

source: Code name for the :term:`DNS service <DNS service (designate)>`.
tr_tr: :term:`DNS servisi <DNS service (designate)>` için kod adı.

source: Code name for the :term:`Governance service <Governance service (congress)>`.
tr_tr: :term:`Yönetim servisi <Governance service (congress)>` için kod ad.

source: Code name for the :term:`Infrastructure Optimization service <Infrastructure Optimization service (watcher)>`.
tr_tr: :term:`Altyapı Eniyileştirme servisi <Infrastructure Optimization service (watcher)>` için kod ad.

source: Code name for the :term:`Load-balancing service <Load-balancing service (octavia)>`.
tr_tr: :term:`Yük dengeleme servisi <Load-balancing service (octavia)>` için kod ad.

source: Code name for the :term:`NFV Orchestration service <NFV Orchestration service (tacker)>`
tr_tr: :term:`NFV Orkestrasyon servisi <NFV Orchestration service (tacker)>` için kod ad

source: Code name for the :term:`Root Cause Analysis service <Root Cause Analysis (RCA) service (Vitrage)>`.
tr_tr: :term:`Kök Sebep Analizi hizmeti <Root Cause Analysis (RCA) service (Vitrage)>` için kod ad.

source: Code name for the :term:`Software Development Lifecycle Automation service <Software Development Lifecycle Automation service (solum)>`.
tr_tr: :term:`Yazılım Geliştirme Hayat Döngüsü Otomasyonu servisi <Software Development Lifecycle Automation service (solum)>` için kod ad.

source: Code name of the :term:`Key Manager service <Key Manager service (barbican)>`.
tr_tr: :term:`Anahtar Yöneticisi hizmeti <Key Manager service (barbican)>`'nin kod adıdır.

source: Codename for :term:`Block Storage service <Block Storage service (cinder)>`.
tr_tr: :term:`Blok Depolama servisi <Block Storage service (cinder)>` için kod ad.

source: Codename for OpenStack :term:`Compute service <Compute service (nova)>`.
tr_tr: :term:`Hesaplama servisi <Compute service (nova)>` için kod ad.

source: Codename for OpenStack :term:`Database service <Database service (trove)>`.
tr_tr: OpenStack :term:`Database service <Database service (trove)>` için kod ad.

source: Codename for OpenStack :term:`Monitoring <Monitoring (monasca)>`.
tr_tr: OpenStack :term:`İzleme <Monitoring (monasca)>` için kod ad.

source: Codename for OpenStack :term:`Networking service <Networking Service (neutron)>`.
tr_tr: OpenStack :term:`Ağ servisi <Networking Service (neutron)>` için kod ad.

source: Codename for OpenStack :term:`Object Storage service<Object Storage service (swift)>`.
tr_tr: :term:`Object Storage service<Object Storage service (swift)>` için kod ad.

source: Codename for OpenStack :term:`Shared File Systems service<Shared File Systems service (manila)>`.
tr_tr: term:`Paylaşımlı Dosya Sistemleri servisi<Shared File Systems service (manila)>` için kod ad.

source: Codename for the :term:`Application Catalog service <Application Catalog service (murano)>`.
tr_tr: :term:`Uygulama Katalog servisi <Application Catalog service (murano)>` için kod adı.

source: Codename for the :term:`Bare Metal service <Bare Metal service (ironic)>`.
tr_tr: :term:`Bare Metal servisi <Bare Metal service (ironic)>` için kod ad.

source: Codename for the :term:`Benchmark service<Benchmark service (rally)>`.
tr_tr: :term:`Değerlendirme servisi<Benchmark service (rally)>` için kod ad.

source: Codename for the :term:`Common Libraries project<Common Libraries (oslo)>`.
tr_tr: :term:`Yaygın Kütüphaneler projesi<Common Libraries (oslo)>` için kod ad.

source: Codename for the :term:`Dashboard <Dashboard (horizon)>`.
tr_tr: :term:`Gösterge Paneli <Dashboard (horizon)>` için kod ad.

source: Codename for the :term:`Data Processing service<Data Processing service (sahara)>`.
tr_tr: :term:`Veri İşleme servisi<Data Processing service (sahara)>` için kod ad.

source: Codename for the :term:`Image service<Image service (glance)>`.
tr_tr: :term:`İmaj servisi<Image service (glance)>` için kod adıdır.

source: Codename for the :term:`Message service <Message service (zaqar)>`.
tr_tr: term:`Mesaj servisi <Message service (zaqar)>` için kod ad.

source: Codename for the :term:`Orchestration service <Orchestration service (heat)>`.
tr_tr: :term:`Orkestrasyon servisi <Orchestration service (heat)>` için kod ad.

source: Codename of the :term:`Identity service <Identity service (keystone)>`.
tr_tr: :term:`Kimlik servisi <Identity service (keystone)>` için kod ad.

source: Collection of Compute components that represent the global state of the cloud; talks to services, such as Identity authentication, Object Storage, and node/storage workers through a queue.
id: Kumpulan komponen komputer yang mewakili negara global awan; pembicaraan untuk layanan, seperti otentikasi identitas, Object Storage, dan pekerja node / storage melalui antrian.
tr_tr: Bulutun genel durumunu temsil eden Compute bileşenlerinin toplanması; Kimlik doğrulama, Nesne Depolama Alanı ve düğüm/depolama işçileri gibi servislerle bir kuyruk aracılığıyla konuşur.

source: Collective name for the Object Storage object services, container services, and account services.
tr_tr: Nesne Depolama Alanı nesneleri hizmetleri, kap hizmetleri ve hesap hizmetleri için toplu ad.

source: Collective term for Object Storage components that provide additional functionality.
tr_tr: Ek işlevsellik sağlayan Nesne Depolama bileşenleri için ortak terim.

source: Collective term for a group of Object Storage components that processes queued and failed updates for containers and objects.
tr_tr: Kaplar ve nesneler için sıraya giren ve başarısız güncelleştirmeleri işleyen bir grup Nesne Depolama bileşenleri için toplu terim.

source: Collects event and metering data by monitoring notifications sent from services.
id: Mengumpulkan acara dan metering data dengan pemantauan pemberitahuan dikirim dari layanan.
tr_tr: Servislerden gönderilen iletileri izleyeren olay ve ölçü verileri toplar.

source: Combination of a URI and UUID used to access Image service VM images through the image API.
id: Kombinasi dari URI dan UUID digunakan untuk mengakses layanan Gambar gambar VM melalui gambar API.
tr_tr: Bir URI ve UUID'nin kombinasyonu, imaj API'si aracılığıyla İmaj hizmeti VM imajlarına erişmek için kullanılır.

source: Command prompts
tr_tr: Komut satırları

source: Command-line client overview
tr_tr: Komut satırı istemcisi genel görünümü

source: Common Internet File System (CIFS)
tr_tr: Yaygın İnternet Dosya Sistemi (CIFS)

source: Common Libraries (oslo)
tr_tr: Genel Kütüphaneler (oslo)

source: Community project that captures Compute AMQP communications; useful for debugging.
tr_tr: Hesaplama AMQP iletişimlerini yakalayan topluluk projesi; hata ayıklama için yararlıdır.

source: Community project that uses shell scripts to quickly build complete OpenStack development environments.
id: proyek komunitas yang menggunakan skrip shell untuk segera membangun lingkungan pengembangan OpenStack lengkap.
tr_tr: Bütün OpenStack geliştirme ortamlarını hızlı bir şekilde oluşturmak için kabuk komut dosyalarını kullanan bir topluluk projesi.

source: Community project used to run automated tests against the OpenStack API.
tr_tr: OpenStack API'sine karşı otomatik testler çalıştıran topluluk projesi.

source: Community support
id: dukungan masyarakat
tr_tr: Topluluk desteği

source: Companies that rent specialized applications that help businesses and organizations provide additional services with lower cost.
id: Perusahaan yang menyewa aplikasi khusus yang membantu bisnis dan organisasi memberikan layanan tambahan dengan biaya yang lebih rendah.
tr_tr: İşletmelere ve kuruluşlara daha düşük maliyetle ek hizmetler sunmak için özelleştirilmiş uygulamaları kiralayan şirketler.

source: Component of Identity that provides a rule-management interface and a rule-based authorization engine.
tr_tr: Kural yönetimi arayüzü ve kural tabanlı bir yetkilendirme motoru sağlayan Kimlik Bileşeni.

source: Compute API (Nova API)
tr_tr: Hesaplama API (Nova API)

source: Compute service
id: layanan komputasi
tr_tr: Hesaplama servisi

source: Compute service (nova)
tr_tr: Hesaplama servisi (nova)

source: Compute service overview
tr_tr: Hesaplama servisi genel görünümü

source: Computer that provides explicit services to the client software running on that system, often managing a variety of computer operations. A server is a VM instance in the Compute system. Flavor and image are requisite elements when creating a server.
tr_tr: Bu sistemde çalışan istemci yazılımına açık hizmetler sağlayan, genellikle çeşitli bilgisayar işlemlerini yöneten bilgisayar. Bir sunucu, Hesaplama sistemindeki bir VM sunucudur. Bir sunucu oluştururken flavor ve imaj gerekli unsurlardır.

source: Conceptual architecture
id: arsitektur konseptual
tr_tr: Kavramsal mimari

source: Configurable option within Object Storage to limit database writes on a per-account and/or per-container basis.
tr_tr: Nesne Depolama Alanı içindeki yapılandırılabilir seçenek, veritabanını hesap başına ve / veya kap bazında sınırlamak için.

source: Configuration setting within RabbitMQ that enables or disables message acknowledgment. Enabled by default.
id: pengaturan konfigurasi dalam RabbitMQ yang mengaktifkan atau menonaktifkan pesan pengakuan. Diaktifkan secara default.
tr_tr: RabbitMQ içindeki ileti onaylamasını etkinleştiren veya devre dışı bırakan yapılandırma ayarı. Varsayılan olarak etkin.

source: Configures networks for guest servers.
id: jaringan yang dikonfigurasi untuk server tamu.
tr_tr: Misafir sunucular için ağları yapılandırır.

source: Connected to by a direct consumer in RabbitMQ—Compute, the message can be consumed only by the current connection.
id: Terhubung oleh konsumen langsung di RabbitMQ-Hitung, pesan dapat dikonsumsi hanya dengan sambungan saat ini.
tr_tr: RabbitMQ—Hesaplama'da doğrudan tüketici tarafından bağlandı, mesaj sadece mevcut bağlantı tarafından alınabilir.

source: Container Infrastructure Management service
id: Layanan Manajemen Infrastruktur wadah
tr_tr: Kapsayıcı Altyapı Yönetim servisi

source: Container Infrastructure Management service (magnum)
tr_tr: Kap Altyapı Yönetimi servisi (magnum)

source: Container servers (swift-container-server)
tr_tr: Kapsayıcı sunucuları (swift-container-server)

source: Contains configuration information that Object Storage uses to reconfigure a ring or to re-create it from scratch after a serious failure.
id: Berisi informasi konfigurasi yang Object Storage digunakan untuk mengkonfigurasi sebuah cincin atau untuk menciptakan kembali dari awal setelah kegagalan serius.
tr_tr: Object Storage'ın bir yüzüğü yeniden yapılandırmak veya ciddi bir arızadan sonra sıfırdan yeniden oluşturmak için kullandığı yapılandırma bilgilerini içerir.

source: Contains information about a user as provided by the identity provider. It is an indication that a user has been authenticated.
tr_tr: Kimlik sağlayıcısı tarafından sağlanan bir kullanıcı hakkında bilgi içerir. Bu, bir kullanıcının kimlik doğrulamasının yapıldığının bir göstergesidir.

source: Contains the locations of all Object Storage partitions within the ring.
tr_tr: Yüzük içindeki tüm Nesne Depolama bölümlerinin konumlarını içerir.

source: Contains the output from a Linux VM console in Compute.
id: Berisi output dari konsol Linux VM di Komputer.
tr_tr: Compute'da bir Linux VM konsolunun çıktısını içerir.

source: Contractual obligations that ensure the availability of a service.
tr_tr: Bir hizmetin sunulmasını sağlayan sözleşme yükümlülükleri.

source: Conventions
id: konvensi
tr_tr: Teamüller

source: Converts an existing server to a different flavor, which scales the server up or down. The original server is saved to enable rollback if a problem occurs. All resizes must be tested and explicitly confirmed, at which time the original server is removed.
tr_tr: Mevcut bir sunucuyu, sunucuyu yukarı veya aşağı ölçeklendiren farklı bir flavor'a dönüştürür. Orijinal sunucu, bir sorun oluşursa geri alma işlemini etkinleştirmek için kaydedilir. Özgün sunucu kaldırıldığında, tüm yeniden boyutlandırmalar sınanmalı ve açıkça onaylanmalıdır.

source: Copy the ``PROJECT-openrc.sh`` file to the computer from which you want to run OpenStack commands.
id: Salin `` berkas PROJECT-openrc.sh`` ke komputer dari mana Anda ingin menjalankan OpenStack perintah.
tr_tr: ``PROJE-openrc.sh`` dosyasını OpenStack komutları çalıştırmak istediğiniz bilgisayara kopyalayın.

source: Create a Database service instance using the :command:`trove create` command.
id: Membuat contoh layanan database menggunakan: perintah: `karun perintah create`.
tr_tr: :command:`trove create` komutunu kullanarak bir Veritabanı servisi sunucusu oluşturun.

source: Create a custom bootable volume or a volume with a large data set and transfer it to a customer.
id: Membuat volume kustom bootable dari volume dengan satu set data yang besar dan transfer ke pelanggan.
tr_tr: Özel önyüklenebilir bir birim veya büyük veri kümesine sahip bir birim oluşuturun ve bir müşteriye aktarın.

source: Create a volume
id: Membuat volume
tr_tr: Bir birim oluşturun

source: Create a volume from specified volume type
id: Membuat volume dari jenis volume spesifik
tr_tr: Belirtilen birim türünden bir birim oluşturun

source: Create a volume transfer request
id: Buat permintaan transfer Volume
tr_tr: Bir birim aktarım isteği oluşturun

source: Create a volume with 8 gibibytes (GiB) of space, and specify the availability zone and image:
tr_tr: 8 gibibayt (GiB) alana sahip bir birim oluşturun ve kullanılabilirlik bölgesini ve imajını belirtin:

source: Create an image for each type of database. For example, one for MySQL and one for MongoDB.
id: Membuat gambar untuk setiap jenis database. Misalnya, satu untuk MySQL dan satu untuk MongoDB.
tr_tr: Her veritabanı türü için bir imaj oluşturun. Örneğin bir tane MySQL için bir tane MongoDB için.

source: Create an image from ISO image
id: Membuat gambar dari ISO image
tr_tr: ISO imajından imaj oluşturun

source: Create and source the OpenStack RC file
id: Membuat dan sumber file OpenStack RC
tr_tr: OpenStack RC dosyasını oluşturun ve kaynak edin

source: Create or update an image (glance)
id: Membuat atau memperbarui gambar (pandangan)
tr_tr: Bir imaj oluşturun veya güncelleyin (glance)

source: Creates a full Object Storage development environment within a single VM.
tr_tr: Tek bir VM içinde tam bir Nesne Depolama Alanı geliştirme ortamı oluşturur.

source: Creates and collects measurements across OpenStack.
id: Menciptakan dan mengumpulkan pengukuran di OpenStack.
tr_tr: OpenStack genelinde ölçüler oluşturur ve toplar.

source: Creates and manages applications.
id: Menciptakan dan mengelola aplikasi.
tr_tr: Uygulamaları oluşturur ve yönetir.

source: Creates and manages clustering services.
id: Menciptakan dan mengelola layanan clustering.
tr_tr: Kümeleme servislerini oluşturur ve yönetir.

source: Creates and manages containers.
id: Menciptakan dan mengelola wadah.
tr_tr: Kapsayıcıları oluşturur ve yönetir.

source: Creates and manages databases.
id: Menciptakan dan mengelola database.
tr_tr: Veritabanlarını oluşturur ve yönetir.

source: Creates and manages images, instances, and flavors.
id: Menciptakan dan mengelola gambar, contoh, dan rasa.
tr_tr: İmajlar, sunucular ve nitelikler oluşturur ve yönetir.

source: Creates and manages images.
id: Menciptakan dan mengelola gambar.
tr_tr: İmajlar oluşturur ve yönetir.

source: Creates and manages keys.
id: pemantauan
tr_tr: Anahtarları oluşturur ve yönetir.

source: Creates and manages self service authoritative DNS.
id: Menciptakan dan mengelola layanan diri DNS otoritatif.
tr_tr: Kendine servis otoriter DNS oluşturur ve yönetir.

source: Creates and manages shared file systems.
id: Menciptakan dan mengelola file sistem bersama.
tr_tr: Paylaşımlı dosya sistemleri oluşturur ve yönetir.

source: Creates and manages volumes.
id: Menciptakan dan mengelola volume.
tr_tr: Birimleri oluşturur ve yöntetir.

source: Critical information about the risk of data loss or security issues.
id: informasi penting tentang risiko kehilangan data atau masalah keamanan.
tr_tr: Veri kaybı veya güvenlik sorunları ile ilgili kritik bilgiler.

source: Cross-Origin Resource Sharing (CORS)
tr_tr: Çapraz-Merkezli Kaynak Paylaşımı (CORS)

source: Currently the libvirt virtualization tool determines the disk, CD-ROM, and VIF device models based on the configured hypervisor type (``libvirt_type`` in ``/etc/nova/nova.conf`` file). For the sake of optimal performance, libvirt defaults to using virtio for both disk and VIF (NIC) models. The disadvantage of this approach is that it is not possible to run operating systems that lack virtio drivers, for example, BSD, Solaris, and older versions of Linux and Windows.
id: Saat ini alat virtualisasi libvirt menentukan model perangkat disk, CD-ROM, dan VIF berdasarkan jenis hypervisor dikonfigurasi (`` libvirt_type`` di `` / etc / nova / nova.conf`` file). Demi kinerja yang optimal, default libvirt untuk menggunakan virtio untuk kedua disk dan VIF (NIC) model. Kerugian dari pendekatan ini adalah bahwa hal itu tidak mungkin untuk menjalankan sistem operasi yang tidak memiliki driver virtio, misalnya, BSD, Solaris, dan versi Linux dan Windows.
tr_tr: Şu anda libvirt sanallaştırma aracı disk, CD-ROM ve VIF aygıt modellerini yapılandırılan hipervizör türüne göre (``/etc/nova/nova.conf`` dosyasındaki ``libvirt_type``) belirler. En iyi başarım için, libvirt hem disk hem VIF (NIC) modelleri için öntanımlı olarak virtio kullanır. Bu yaklaşımın dezavantajı virtio sürücüleri olmayan BSD, Solaris, ve Linux ve Windows'un eski sürümleri gibi işletim sistemlerini çalıştırmanın imkansız oluşudur.

source: Custom modules that extend some OpenStack core APIs.
id: modul kustom yang memperpanjang beberapa API OpenStack inti.
tr_tr: Bazı OpenStack çekirdek API'lerini genişleten özel modüller.

source: DHCP agent
tr_tr: DHCP ajanı

source: DNS record
tr_tr: DNS kaydı

source: DNS service
id: layanan DNS
tr_tr: DNS servisi

source: DNS service (designate)
tr_tr: DNS hizmeti (designate)

source: Daemon that provides DNS, DHCP, BOOTP, and TFTP services for virtual networks.
id: Daemon yang menyediakan DNS, DHCP, BOOTP, dan layanan TFTP untuk jaringan virtual.
tr_tr: Sanal ağlar için DNS, DHCP, BOOTP ve TFTP hizmetleri sağlayan artalan işlemi.

source: Dashboard (horizon)
tr_tr: Gösterge Paneli (horizon)

source: Dashboard overview
id: Sekilas dashboard
tr_tr: Kontrol panosu genel görünümü

source: Data Processing service (sahara)
tr_tr: Veri İşleme servisi (sahara)

source: Data Processing service overview
id: ikhtisar layanan Data Processing
tr_tr: Veri İşleme servisi genel görünümü

source: Data loss prevention (DLP) software
tr_tr: Veri kaybı önleme (DLP) yazılımı

source: Data that is only known to or accessible by a user and used to verify that the user is who he says he is. Credentials are presented to the server during authentication. Examples include a password, secret key, digital certificate, and fingerprint.
id: Data yang hanya diketahui atau diakses oleh pengguna dan digunakan untuk memverifikasi bahwa pengguna yang katanya dia. Kredensial disajikan ke server selama otentikasi. Contohnya termasuk password, kunci rahasia, sertifikat digital, dan sidik jari.
tr_tr: Yalnızca bir kullanıcı tarafından bilinen veya kullanıcı tarafından erişilebilen ve kullanıcının kendisinin söylediğini doğrulamak için kullanılan veriler. Kimlik doğrulama, kimlik doğrulama işlemi sırasında sunucuya sunulur. Örnekler arasında bir şifre, gizli anahtar, dijital sertifika ve parmak izi sayılabilir.

source: Database
tr_tr: Veritabanı

source: Database service
id: layanan database
tr_tr: Veritabanı servisi

source: Database service (trove)
tr_tr: Veritabanı servisi (trove)

source: Database service overview
id: ikhtisar layanan database
tr_tr: Veritabanı servisi genel görünümü

source: Defines resources for a cell, including CPU, storage, and networking. Can apply to the specific services within a cell or a whole cell.
id: Mendefinisikan sumber daya untuk sel, termasuk CPU, penyimpanan, dan jaringan. Dapat berlaku untuk layanan tertentu dalam sel atau sel utuh.
tr_tr: CPU, depolama alanı ve ağ dahil olmak üzere bir hücre için kaynakları tanımlar. Bir hücre veya bir bütün hücre içindeki belirli servislere uygulayabilir.

source: Defining environment variables using an environment file is not a common practice on Microsoft Windows. Environment variables are usually defined in the :menuselection:`Advanced > System Properties` dialog box. One method for using these scripts as-is on Windows is to install `Git for Windows`_ and using Git Bash to source the environment variables and to run all CLI commands.
id: Mendefinisikan variabel lingkungan menggunakan file lingkungan bukan praktek umum pada Microsoft Windows. variabel lingkungan biasanya didefinisikan dalam: menuselection: `Lanjutan> kotak dialog Sistem Properties`. Salah satu metode untuk menggunakan script ini sebagai-adalah pada Windows adalah menginstal `Git untuk Windows`_ dan menggunakan Git Bash untuk sumber variabel lingkungan dan menjalankan perintah semua CLI.
tr_tr: Çevre değişkenlerini bir ortam dosyasıyla tanımlamak Microsoft Windows üzerinde pek yaygın değildir. Çevre değişkenleri genellikle :menuselection:`Gelişmiş > Sistem Özellikleri` iletişim kutusunda tanımlanır. Bu betikleri Windows üzerinde oldukları gibi kullanmanın bir yolu `Windows için Git`_ kurmak ve Git Bash kullanarak çevre değişkenlerini kaynak ederek tüm CLI komutlarını çalıştırmaktır.

source: Delete a volume
id: Hapus volume
tr_tr: Bir birimi silin

source: Delete a volume transfer
id: Hapus transfer Volume
tr_tr: Bir birim aktarımını silin

source: Delete the volume using either the volume name or ID:
id: Hapus volume baik menggunakan nama volume atau ID:
tr_tr: Birimi birim ismi veya kimliğiyle silin:

source: Delete the volume:
id: Menghapus volume:
tr_tr: Birimi silin:

source: Denial of service (DoS) is a short form for denial-of-service attack. This is a malicious attempt to prevent legitimate users from using a service.
id: Penolakan layanan (DoS) adalah bentuk singkat untuk serangan denial-of-service. Ini adalah upaya berbahaya untuk mencegah pengguna yang sah dari penggunaan layanan.
tr_tr: Hizmet reddi (DoS), hizmet reddi saldırısı için kısa biçimidir. Bu meşru kullanıcıların bir hizmet kullanmasını engellemek için yapılan kötü niyetli bir girişimdir.

source: Depending on context, the core API is either the OpenStack API or the main API of a specific core project, such as Compute, Networking, Image service, and so on.
id: Tergantung pada konteks, inti API adalah baik OpenStack API atau API utama dari proyek inti tertentu, seperti Compute, Networking, layanan Gambar, dan sebagainya.
tr_tr: İçeriğe bağlı olarak çekirdek API, OpenStack API'sı veya Hesaplama, Ağ yönetimi, İmaj servisi ve benzeri gibi belirli bir çekirdek projenin ana API'sıdır.

source: Deployment service
id: layanan penyebaran
tr_tr: Kurulum servisi

source: Describes the parameters of the various virtual machine images that are available to users; includes parameters such as CPU, storage, and memory. Alternative term for flavor.
id: Menjelaskan parameter dari berbagai gambar mesin virtual yang tersedia untuk pengguna; termasuk parameter seperti CPU, penyimpanan, dan memori. istilah alternatif untuk rasa.
tr_tr: Kullanıcılar tarafından kullanılabilen çeşitli sanal makine imajlarının parametrelerini açıklar; CPU, depolama alanı ve bellek gibi parametreleri içerir. Flavor için alternatif terim.

source: Description
id: Deskripsi
tr_tr: Açıklama
