Repository: 25hours/openstack-manuals
Catalog: doc/common/source/locale/*/LC_MESSAGES/common.po
Languages: id, tr_tr

source: A system by which Internet domain name-to-address and address-to-name resolutions are determined. DNS helps navigate the Internet by translating the IP address into an address that is easier to remember. For example, translating 111.111.111.1 into www.yahoo.com. All domains and their components, such as mail servers, utilize DNS to resolve to the appropriate locations. DNS servers are usually set up in a master-slave relationship such that failure of the master invokes the slave. DNS servers might also be clustered or replicated such that changes made to one DNS server are automatically propagated to other active servers. In Compute, the support that enables associating DNS entries with floating IP addresses, nodes, or cells so that hostnames are consistent across reboots.
id: Sebuah sistem dimana domain Internet nama-to-address dan resolusi address-to-nama ditentukan. DNS membantu menavigasi Internet dengan menerjemahkan alamat IP ke alamat yang mudah diingat. Misalnya, menerjemahkan 111.111.111.1 ke www.yahoo.com. Semua domain dan komponen mereka, seperti mail server, memanfaatkan DNS untuk menyelesaikan ke lokasi yang tepat. server DNS biasanya ditetapkan dalam hubungan tuan-budak sehingga kegagalan master memanggil budak. server DNS mungkin juga berkerumun atau direplikasi sehingga perubahan yang dibuat untuk satu server DNS secara otomatis disebarkan ke server aktif lainnya. Dalam Compute, dukungan yang memungkinkan menghubungkan entri DNS dengan alamat mengambang IP, node, atau sel-sel sehingga hostname konsisten di reboot.
tr_tr: İnternet alan adından adrese ve adres-ad çözümlemeleri belirleyen bir sistem. DNS, IP adresini daha kolay hatırlanacak bir adrese çevirerek Internet'te gezinmeye yardımcı olur. Örneğin, 111.111.111.1'i www.yahoo.com'a tercüme etmek. Tüm etki alanları ve posta sunucuları gibi bileşenleri, uygun konumlara çözümlemek için DNS'yi kullanır. DNS sunucuları genellikle bir ana-köle ilişkide kurulur, böylece ana sunucunun başarısızlığı köle çağırır. DNS sunucuları, bir DNS sunucusunda yapılan değişiklikler otomatik olarak diğer etkin sunuculara iletilecek şekilde kümelenebilir veya çoğaltılabilir. Hesaplama'da, DNS girdilerinin kayan IP adresleri, düğümler veya hücrelerle ilişkilendirilmesini sağlayan destek, böylece ana makinelerin yeniden başlatıldığında tutarlı olmasını sağlar.

source: A system that provides services to other system entities. In case of federated identity, OpenStack Identity is the service provider.
tr_tr: Diğer sistem varlıklarına hizmet sağlayan bir sistem. Federal kimlik olması durumunda, OpenStack Kimlik hizmet sağlayıcısıdır.

source: A tool to automate system configuration and installation on Debian-based Linux distributions.
tr_tr: Debian tabanlı Linux dağıtımlarında sistem yapılandırmasını ve kurulumunu otomatikleştiren bir araç.

source: A tool to automate system configuration and installation on Red Hat, Fedora, and CentOS-based Linux distributions.
tr_tr: Red Hat, Fedora ve CentOS tabanlı Linux dağıtımlarında sistem yapılandırmasını ve kurulumunu otomatikleştiren bir araç.

source: A type of VM image that exists as a single, bootable file.
id: Sebuah jenis gambar VM yang ada sebagai single, berkas bootable.
tr_tr: Tek, önyüklenebilir bir dosya olarak var olan bir tür VM imajı.

source: A type of image file that is commonly used for animated images on web pages.
id: Sebuah jenis file gambar yang umum digunakan untuk gambar animasi pada halaman web.
tr_tr: Web sayfalarında hareketli görüntüler için yaygın olarak kullanılan bir görüntü dosyası türü.

source: A type of reboot where a physical or virtual power button is pressed as opposed to a graceful, proper shutdown of the operating system.
id: Jenis reboot mana tombol daya fisik atau virtual ditekan sebagai lawan, shutdown yang tepat anggun dari sistem operasi.
tr_tr: İşletim sisteminin zarif ve düzgün bir şekilde kapatılmasına karşı fiziksel ya da sanal bir güç düğmesine basıldığında yeniden başlatma türü.

source: A unique ID given to each replica of an Object Storage database.
id: Sebuah ID unik yang diberikan untuk masing-masing replika database Object Storage.
tr_tr: Nesne Depolama birimi veritabanının her kopyasına verilen benzersiz bir kimlik.

source: A unit of storage within Object Storage used to store objects. It exists on top of devices and is replicated for fault tolerance.
tr_tr: Nesneleri depolamak için kullanılan Nesne Depolama içindeki bir depolama birimi. Cihazların üstünde bulunur ve hata toleransı için çoğaltılır.

source: A user specifies their username and password credentials to interact with OpenStack, using any client command. These credentials can be specified using various mechanisms, namely, the environment variable or command-line argument. It is not safe to specify the password using either of these methods.
id: Seorang pengguna menentukan username dan password identitasnya untuk berinteraksi dengan OpenStack, menggunakan perintah klien. mandat ini dapat ditentukan dengan menggunakan berbagai mekanisme, yaitu, variabel lingkungan atau argumen baris perintah. Hal ini tidak aman untuk menentukan password menggunakan salah satu dari metode ini.
tr_tr: Bir kullanıcı kullanıcı adı ve parola kimlik bilgilerini herhangi bir istemci komutu kullanırken OpenStack ile etkileşim için belirtir. Bu kimlik bilgileri çeşitli mekanizmalarla sağlanabilir, çevre değişkeni veya komut satırı değişkeni olarak da. Parolayı bu yöntemlerle belirtmek güvenli değildir.

source: A user-created Python module that is loaded by horizon to change the look and feel of the dashboard.
id: Sebuah modul Python yang dibuat pengguna yang dimuat oleh cakrawala untuk mengubah tampilan dan nuansa dari dashboard.
tr_tr: Gösterge tablosunun görünümünü ve şeklini değiştirmek için horizon tarafından yüklenen, kullanıcı tarafından oluşturulan bir Python modülü.

source: A virtual network port within Networking; VIFs / vNICs are connected to a port.
tr_tr: Ağ içinde sanal bir ağ portu; VIF'ler / vNIC'ler bir bağlantı noktasına bağlı.

source: A virtual network that provides connectivity between entities. For example, a collection of virtual ports that share network connectivity. In Networking terminology, a network is always a layer-2 network.
tr_tr: Elemanlar arasında bağlantı sağlayan sanal bir ağ. Örneğin, ağ bağlantısını paylaşan bir sanal bağlantı noktaları koleksiyonu. Ağ terminolojisinde, bir ağ her zaman bir katman-2 ağıdır.

source: A volume is a detachable block storage device, similar to a USB hard drive. You can attach a volume to only one instance. Use the ``openstack`` client commands to create and manage volumes.
tr_tr: Birim bir USB sabit diske benzer şekilde, ayrılabilir bir blok depolama aygıtıdır. Bir birimi yalnızca bir sunucuya ekleyebilirsiniz. Birimleri oluşturmak ve yönetmek için ``openstack`` istemci komutlarını kullanın.

source: A web framework used extensively in horizon.
id: Sebuah kerangka web yang digunakan secara luas di cakrawala.
tr_tr: Görünümde geniş olarak kullanılan bir web çatısı.

source: A worker daemon that creates and terminates virtual machine instances through hypervisor APIs. For example:
id: Sebuah daemon pekerja yang menciptakan dan berakhir contoh mesin virtual melalui API hypervisor. Sebagai contoh:
tr_tr: Hipervizör API'leri aracılığıyla sanal makine sunucularını oluşturan ve sonlandıran bir işçi artalan işi. Örneğin:

source: A worker process that verifies the integrity of Object Storage objects, containers, and accounts. Auditors is the collective term for the Object Storage account auditor, container auditor, and object auditor.
id: Sebuah proses pekerja yang memverifikasi integritas objek Object Storage, kontainer, dan rekening. Auditor adalah istilah kolektif untuk akun auditor Object Storage, kontainer auditor, dan objek auditor.
tr_tr: Nesne Depolama nesnelerinin, konteynerların ve hesapların bütünlüğünü doğrulayan bir işçi işlemdir. Denetleyici, Nesne Deposu hesap denetleyicisi, konteyner denetleyicisi ve nesne denetleyicisi için toplu bir terimdir.

source: A wrapper used by the Image service that contains a VM image and its associated metadata, such as machine state, OS disk size, and so on.
id: Sebuah wrapper digunakan oleh layanan Gambar yang berisi gambar VM dan metadata yang terkait, seperti keadaan mesin, ukuran disk OS, dan sebagainya.
tr_tr: İmaj hizmeti tarafından kullanılan ve makine durumu, işletim sistemi diski boyutu ve benzeri gibi bir VM görüntüsü ve ilişkili üst verileri içeren bir asistan.

source: API endpoint
tr_tr: API uç birimi

source: API extension
id: ekstensi API
tr_tr: API uzantısı

source: API extension plug-in
id: API ekstensi plug-in
tr_tr: API uzantısı eklentisi

source: API key
tr_tr: API anahtarı

source: API server
id: Server API
tr_tr: API sunucu

source: API token
tr_tr: API jetonu

source: API used to access OpenStack :term:`Object Storage<Object Storage service (swift)>`.
tr_tr: OpenStack :term:`Nesne Depolama<Object Storage service (swift)>`ya erişmek için kullanılan API.

source: API used to access OpenStack Networking. Provides an extensible architecture to enable custom plug-in creation.
tr_tr: OpenStack Ağına erişmek için kullanılan API. Özel eklenti oluşturulmasını sağlamak için genişletilebilir bir mimari sunar.

source: API version
id: versi API
tr_tr: API sürümü

source: ATA over Ethernet (AoE)
tr_tr: Ethernet üzerinden ATA (AoE)

source: AWS CloudFormation allows Amazon Web Services (AWS) users to create and manage a collection of related resources. The Orchestration service supports a CloudFormation-compatible format (CFN).
tr_tr: AWS CloudFormation, Amazon Web Hizmetleri (AWS) kullanıcılarının ilgili kaynakların bir koleksiyonunu oluşturmasına ve yönetmesine olanak tanır. Orkestrasyon hizmeti CloudFormation uyumlu bir biçimde (CFN) destekler.

source: AWS CloudFormation template
tr_tr: AWS CloudFormation şablonu

source: Absolute limit on the amount of network traffic a Compute VM instance can send and receive.
tr_tr: Bir Hesaplama VM sunucusunun gönderip alabileceği ağ trafiğinin miktarında mutlak sınır.

source: Accept a volume transfer request
id: Menerima permintaan transfer Volume
tr_tr: Bir birim aktarım isteğini kabul edin

source: Accept the request:
id: Terima permintaan:
tr_tr: İsteği kabul edin:

source: Accepts API requests, and routes them to the ``cinder-volume`` for action.
id: Menerima permintaan API, dan rute mereka ke `` cinder-volume`` untuk tindakan.
tr_tr: API isteklerini kabul eder, ve eylem için ``cinder-volume``'ye yönlendirir.

source: Accepts Image API calls for image discovery, retrieval, and storage.
id: Menerima panggilan Gambar API untuk penemuan gambar, pengambilan, dan penyimpanan.
tr_tr: İmaj keşfi, getirilmesi ve depolanması için İmaj API çağrılarını kabul eder.

source: Accepts OpenStack Object Storage API and raw HTTP requests to upload files, modify metadata, and create containers. It also serves file or container listings to web browsers. To improve performance, the proxy server can use an optional cache that is usually deployed with memcache.
id: Menerima OpenStack Obyek API Penyimpanan dan permintaan HTTP baku untuk meng-upload file, memodifikasi metadata, dan menciptakan wadah. Hal ini juga berfungsi file atau wadah listing untuk web browser. Untuk meningkatkan kinerja, proxy server dapat menggunakan cache opsional yang biasanya disebarkan dengan memcache.
tr_tr: OpenStack Nesne Depolama API'si ve ham HTTP isteklerini kabul ederek dosya yükler, metaveri değiştirir ve kapsayıcılar oluşturur. Ayrıca web tarayıcılarına dosya veya kapsayıcı listesi sağlar. Başarımı artırmak için, vekil sunucu genellikle memcache ile kurulan isteğe bağlı bir önbellek kullanabilir.

source: Accepts and responds to end user compute API calls. The service supports the OpenStack Compute API, the Amazon EC2 API, and a special Admin API for privileged users to perform administrative actions. It enforces some policies and initiates most orchestration activities, such as running an instance.
id: Menerima dan merespon end user panggilan menghitung API. Layanan ini mendukung API OpenStack Compute, API Amazon EC2, dan API Admin khusus untuk pengguna hak istimewa untuk melakukan tindakan administratif. Ini memberlakukan beberapa kebijakan dan memulai kegiatan orkestrasi besar, seperti menjalankan sebuah contoh.
tr_tr: Son kullanıcı hesaplama API çağrılarını kabul eder ve yanıtlar. Servis OpenStack Hesaplama API'sini, Amazon EC2 API'sini ve yetkili kullanıcıların yönetim eylemlerini gerçekleştirebilmeleri için özel bir Yönetici API'sini destekler. Bazı ilkeleri zorlar ve çoğu orkestrasyon etkinliğini, örneğin bir sunucu çalıştırmayı başlatır.

source: Accepts and routes API requests to the appropriate OpenStack Networking plug-in for action.
id: Menerima dan permintaan rute API untuk OpenStack Networking plug-in yang tepat untuk bertindak.
tr_tr: API isteklerini eylem için uygun OpenStack Ağ eklentisine kabul eder ve gönderir.

source: Accepts metadata requests from instances. The ``nova-api-metadata`` service is generally used when you run in multi-host mode with ``nova-network`` installations. For details, see `Metadata service <https://docs.openstack.org/admin-guide/compute-networking-nova.html#metadata-service>`__ in the OpenStack Administrator Guide.
tr_tr: Sunuculardan metaveri isteklerini kabul eder. ``nova-api-metadata`` servisi genellikle ``nova-network`` kurulumları olan çoklu sunucu kipinde çalıştırdığınızda kullanılır. Ayrıntılar için OpenStack Yönetici Kılavuzundaki `Metaveri servisine <https://docs.openstack.org/admin-guide/compute-networking-nova.html#metadata-service>`__ göz atın.

source: Access associated with a VM
id: Akses terkait dengan VM
tr_tr: VM ile ilişkili erişim

source: Access can be provided to a VM
id: Akses dapat diberikan kepada VM
tr_tr: Bir sanal makineye erişim sağlanabilir

source: Access the Database service instance using typical database access commands. For example, with MySQL:
id: Mengakses contoh layanan database menggunakan perintah akses database khas. Misalnya, dengan MySQL:
tr_tr: Veritabanı servisi sunucusuna genel veritabanı erişim komutlarıyla erişin. Örneğin MySQL için:

source: Account servers (swift-account-server)
tr_tr: Hesap sunucuları (swift-account-server)

source: Acts as the gatekeeper to Object Storage and is responsible for authenticating the user.
tr_tr: Nesne Depolama Alanı'nın ağ geçidi olarak hareket eder ve kullanıcının kimliğini doğrulamaktan sorumludur.

source: Address Resolution Protocol (ARP)
tr_tr: Adres Çözümleme Protokolü (ARP)

source: Administrator configures size setting, based on flavors
id: Administrator mengkonfigurasi pengaturan ukuran, berdasarkan rasa
tr_tr: Yönetici nitelikleri taban alarak boyut ayarını yapılandırır

source: Advanced Message Queuing Protocol (AMQP)
tr_tr: Gelişmiş Mesaj Kuyruğu Protokolü (AMQP)

source: Advanced RISC Machine (ARM)
tr_tr: Gelişmiş RISC Makinesi (ARM)

source: After the volume recipient, or new owner, accepts the transfer, you can see that the transfer is no longer available:
id: Setelah penerima volume, atau pemilik baru, menerima transfer, Anda dapat melihat bahwa transfer tidak lagi tersedia:
tr_tr: Birim alıcısı, ya da yeni sahip aktarımı kabul ettikten sonra aktarımın artık kullanılabilir olmadığını göreceksiniz:

source: After you restart the Image service, you can use the following syntax to view the image's location information:
id: Setelah Anda me-restart layanan Image, Anda dapat menggunakan sintaks berikut untuk melihat informasi gambar lokasi:
tr_tr: İmaj servisini yeniden başlattıktan sonra, imajın konum bilgisini görüntülemek için şu sözdizimini kullanabilirsiniz:

source: After you upload an image, you cannot change it.
id: Setelah Anda meng-upload gambar, Anda tidak dapat mengubahnya.
tr_tr: Bir imaj yükledikten sonra değiştiremezsiniz.

source: All OpenStack core projects are provided under the terms of the Apache License 2.0 license.
id: Semua proyek inti OpenStack disediakan di bawah persyaratan Apache License 2.0 lisensi.
tr_tr: Tüm OpenStack çekirdek projeleri, Apache Lisans 2.0 lisansı şartları altında sağlanmaktadır.

source: Allows a user to set a flag on an :term:`Object Storage<Object Storage service (swift)>` container so that all objects within the container are versioned.
tr_tr: Kullanıcının :term:`Nesne Depolama<Object Storage service (swift)>` kabı üzerinde bir bayrak ayarlamaya böylece kap içindeki bütün nesnelerin sürümlendirilmesine olanak sağlar.

source: Alphanumeric ID assigned to each Identity service role.
tr_tr: Her Kimlik servisi rolüne atanan alfanumerik ID.

source: Alternative name for the :term:`Image API`.
tr_tr: :term:`İmaj API`için alternatif isim.

source: Alternative name for the Block Storage API.
tr_tr: Blok Depolama Alanı API'sı için alternatif ad.

source: Alternative term for a Networking plug-in or Networking API extension.
id: istilah alternatif untuk Jaringan plug-in atau Jaringan ekstensi API.
tr_tr: Bir Ağ Eklentisi veya Ağ API uzantısı için alternatif terim.

source: Alternative term for a RabbitMQ message exchange.
id: istilah alternatif untuk pertukaran pesan RabbitMQ.
tr_tr: RabbitMQ mesaj alışverişi için alternatif terim.

source: Alternative term for a VM image.
tr_tr: VM imajı için alternatif terim.

source: Alternative term for a VM instance type.
id: istilah alternatif untuk VM jenis contoh.
tr_tr: Bir VM sunucu türünün alternatif terimi.

source: Alternative term for a VM or guest.
tr_tr: VM veya misafir için alternatif terim.

source: Alternative term for a cloud controller node.
id: Istilah alternatif untuk controller awan simpul.
tr_tr: Bulut denetleyicisi düğümünün alternatif terimi.

source: Alternative term for a cloudpipe.
tr_tr: cloudpipe için alternatif terim.

source: Alternative term for a fixed IP address.
tr_tr: Değişmeyen IP adres için alternatif terim.

source: Alternative term for a flavor ID.
id: istilah alternatif untuk ID rasa.
tr_tr: Flavor kimliğine alternatif terim.

source: Alternative term for a non-durable exchange.
tr_tr: Kalıcı olmayan alışveriş için alternatif terim.

source: Alternative term for a non-durable queue.
tr_tr: Kalıcı olmayan kuyruk için alternatif terim.

source: Alternative term for a paused VM instance.
tr_tr: Duraklatılmış VM sunucuları içi alternatif terim.

source: Alternative term for a virtual network.
tr_tr: Sanal bir ağ için alternatif terim.

source: Alternative term for a volume plug-in.
tr_tr: Bir toplu eklentinin alternatif terimi.

source: Alternative term for an API extension or plug-in. In the context of Identity service, this is a call that is specific to the implementation, such as adding support for OpenID.
id: Istilah alternatif untuk perpanjangan API atau plug-in. Dalam konteks layanan Identity, ini adalah panggilan yang khusus untuk pelaksanaan, seperti menambahkan dukungan untuk OpenID.
tr_tr: Bir API uzantısı veya eklentisi için alternatif terim. Kimlik hizmeti bağlamında, bu, OpenID için destek eklenmesi gibi, uygulamaya özgü bir çağrıdır.

source: Alternative term for an API token.
id: Istilah alternatif untuk token API.
tr_tr: API jetonuna alternatif terim.

source: Alternative term for an Amazon EC2 access key. See EC2 access key.
id: Istilah alternatif untuk kunci akses Amazon EC2. Lihat tombol akses EC2.
tr_tr: Amazon EC2 erişim anahtarı için alternatif terim. Bkz. EC2 erişim anahtarı.

source: Alternative term for an Identity service catalog.
id: istilah alternatif untuk katalog layanan Identity.
tr_tr: Kimlik servisi kataloğuna alternatif terim.

source: Alternative term for an Identity service default token.
tr_tr: Kimlik servisi varsayılan jetonu için alternatif bir terim.

source: Alternative term for an Object Storage authorization node.
id: istilah alternatif untuk kewenangan simpul Object Storage.
tr_tr: Nesne Depolama yetkilendirme düğümü için alternatif terim.

source: Alternative term for an admin API.
tr_tr: Bir yönetici API'sının alternatif terimi.

source: Alternative term for an ephemeral volume.
tr_tr: Bir geçici disk bölümü için alternatif terim.

source: Alternative term for an image.
tr_tr: Bir imaj için alternatif terim.

source: Alternative term for instance UUID.
id: istilah alternatif misalnya UUID.
tr_tr: Sunucu UUID için alternatif terim.

source: Alternative term for non-durable.
tr_tr: Kalıcı olmayanlar için alternatif bir terim.

source: Alternative term for project.
tr_tr: Proje için alternatif terim.

source: Alternative term for the :term:`Compute API <Compute API (nova API)>`.
tr_tr: :term:`Hesaplama API <Compute API (nova API)>` için alternatif terim.

source: Alternative term for the Identity service API.
id: istilah alternatif untuk layanan Identity API.
tr_tr: Kimlik hizmet API'si için alternatif terim.

source: Alternative term for the Identity service catalog.
tr_tr: Kimlik hizmeti katalogu için alternatif bir terim.

source: Alternative term for the Image service :term:`image registry`.
tr_tr: :term:`imaj kaydı` İmaj servisi için alternatif isim.

source: Alternative term for the Image service registry.
tr_tr: İmaj servisi kayıt defteri için alternatif terim.

source: Alternatively, users can set ``id`` to a URL:
id: Atau, pengguna dapat mengatur `` id`` ke URL:
tr_tr: Alternatif olarak, kullanıclar bir URL'ye ``id`` ayarlayabilirler:

source: Alternatively, you can create the ``PROJECT-openrc.sh`` file from scratch, if you cannot download the file from the dashboard.
id: Atau, Anda dapat membuat `` berkas PROJECT-openrc.sh`` dari awal, jika Anda tidak dapat men-download file dari dashboard.
tr_tr: Alternatif olarak, kontrol panosundan indiremiyorsanız ``PROJE-openrc.sh`` dosyasını sıfırdan oluşturabilirsiniz.

source: Amazon Kernel Image (AKI)
id: Amazon Kernel Gambar (AKI)
tr_tr: Amazon Çekirdek İmajı (AKI)

source: Amazon Machine Image (AMI)
tr_tr: Amazon Makine İmajı (AMI)

source: Amazon Ramdisk Image (ARI)
id: Amazon Ramdisk Gambar (ARI)
tr_tr: Amazon Ramdisk İmajı (ARI)

source: An API endpoint used for both service-to-service communication and end-user interactions.
tr_tr: Hem servis-hizmet iletişimi hem de son kullanıcı etkileşimleri için kullanılan bir API uç birimi.

source: An API on a separate endpoint for attaching, detaching, and creating block storage for compute VMs.
id: API pada titik akhir terpisah untuk melampirkan, memisahkan, dan menciptakan penyimpanan blok untuk menghitung VMS.
tr_tr: Hesap VM'lerine blok depolama birimi eklemek, ayırmak ve oluşturmak için ayrı bir uç nokta üzerinde bulunan bir API.

source: An API server (``aodh-api``)
id: API Server (`` oauth-api``)
tr_tr: Bir API sunucu (``aodh-api``)

source: An API server (``ceilometer-api``)
id: API Server (`` ceilometer-api``)
tr_tr: Bir API sunucusu (``ceilometer-api``)

source: An API that is accessible to projects.
tr_tr: Projelere erişilebilen bir API.

source: An AWS Query API that is compatible with AWS CloudFormation. It processes API requests by sending them to the ``heat-engine`` over RPC.
id: API AWS Query yang kompatibel dengan AWS CloudFormation. Memproses permintaan API dengan mengirimkan mereka ke `` panas-engine`` lebih RPC.
tr_tr: AWS CloudFormation ile uyumlu bir AWS Sorgu API'si. API isteklerini RPC üzerinden ``heat-engine``'ye göndererek işler.

source: An Amazon EBS storage volume that contains a bootable VM image, currently unsupported in OpenStack.
id: Volume penyimpanan Amazon EBS yang berisi gambar VM bootable, saat ini tidak didukung di OpenStack.
tr_tr: Halihazırda OpenStack'de desteklenmeyen, önyüklenebilir bir VM imajı içeren bir Amazon EBS depolama birimi.
