Repository: 25hours/openstack-manuals
Catalog: doc/common/source/locale/*/LC_MESSAGES/common.po
Languages: id, tr_tr

source: Designed as an OpenStack component.
id: Dirancang sebagai komponen OpenStack.
tr_tr: Bir OpenStack bileşeni olarak tasarlandı.

source: Desktop-as-a-Service
tr_tr: Hizmet olarak Masaüstü

source: Determines whether back-end members of a VIP pool can process a request. A pool can have several health monitors associated with it. When a pool has several monitors associated with it, all monitors check each member of the pool. All monitors must declare a member to be healthy for it to stay active.
id: Menentukan apakah anggota back-end dari kolam VIP dapat memproses permintaan. Sebuah kolam dapat memiliki beberapa monitor kesehatan yang berhubungan dengan itu. Ketika kolam renang memiliki beberapa monitor yang terkait dengan itu, semua monitor memeriksa setiap anggota dari kolam renang. Semua monitor harus menyatakan anggota untuk menjadi sehat untuk itu untuk tetap aktif.
tr_tr: Bir VIP havuzunun arka uç üyelerinin bir isteği işleyip işlememeyeceğini belirler. Bir havuz, bununla ilişkili birkaç sağlık monitörüne sahip olabilir. Bir havuzda ona bağlı birkaç monitör varsa, tüm monitörler havuzun her üyesini kontrol eder. Tüm monitörler aktif olması için sağlıklı bir üye olduğunu beyan etmelidir.

source: Device plugged into a PCI slot, such as a fibre channel or network card.
id: Perangkat terhubung ke slot PCI, seperti saluran serat atau kartu jaringan.
tr_tr: Fiber kanalı veya ağ kartı gibi bir PCI yuvasına takılan aygıt.

source: Disables server-side message acknowledgment in the Compute RabbitMQ. Increases performance but decreases reliability.
tr_tr: Hesaplama RabbitMQ'da sunucu tarafında ileti bildirimini devre dışı bırakır. Performansı artırır, ancak güvenilirliği azaltır.

source: Discover the version number for a client
id: Temukan nomor versi untuk klien
tr_tr: Bir istemci için sürüm numarasını keşfedin

source: Discretionary Access Control (DAC)
tr_tr: Isteğe Bağlı Erişim Kontrolü (DAC)

source: Disk-based data storage generally represented as an iSCSI target with a file system that supports extended attributes; can be persistent or ephemeral.
tr_tr: Disk tabanlı veri depolama genellikle genişletilmiş öznitelikleri destekleyen bir dosya sistemi ile bir iSCSI hedefi olarak temsil edilir; Kalıcı veya kısa ömürlü olabilir.

source: Disk-based virtual memory used by operating systems to provide more memory than is actually available on the system.
tr_tr: Sistem üzerinde gerçekte olduğundan daha fazla bellek sağlamak için işletim sistemleri tarafından kullanılan disk tabanlı sanal bellek.

source: Distributed block storage system for QEMU, supported by OpenStack.
tr_tr: OpenStack tarafından desteklenen, QEMU için dağıtık blok depolama sistemi.

source: Distributes partitions proportionately across Object Storage devices based on the storage capacity of each device.
id: Mendistribusikan partisi secara proporsional di seluruh perangkat Object Storage berdasarkan kapasitas penyimpanan masing-masing perangkat.
tr_tr: Her bir aygıtın depolama kapasitesine dayalı olarak Nesne Depolama aygıtları arasında bölümleri orantılı olarak dağıtır.

source: Documentation
id: Dokumentasi
tr_tr: Belgelendirme

source: Documentation feedback
id: umpan balik dokumentasi
tr_tr: Belgelendirme geribildirimi

source: Domain Name System (DNS)
tr_tr: Alan Adı Sistemi (DNS)

source: Download and source the OpenStack RC file
id: Download dan sumber file OpenStack RC
tr_tr: OpenStack RC dosyasını indirin ve kaynak edin

source: Drivers
tr_tr: Sürücüler

source: Drivers or a service back end are integrated to the centralized server. They are used for accessing identity information in repositories external to OpenStack, and may already exist in the infrastructure where OpenStack is deployed (for example, SQL databases or LDAP servers).
id: Driver atau back end layanan terintegrasi ke server terpusat. Mereka digunakan untuk mengakses informasi identitas dalam repositori eksternal untuk OpenStack, dan mungkin sudah ada dalam infrastruktur di mana OpenStack dikerahkan (misalnya, database SQL atau server LDAP).
tr_tr: Sürücüler veya bir servis arka ucu merkezi sunucuya tümleştirilmiştir. OpenStack'e harici olan depolardaki kimlik bilgisine erişim için kullanılırlar, ve OpenStack'in kurulu olduğu altyapıda zaten mevcut olabilirler (örneğin, SQL veritabanları veya LDAP sunucuları).

source: During the set up or testing of OpenStack, you might have questions about how a specific task is completed or be in a situation where a feature does not work correctly. Use the `ask.openstack.org <https://ask.openstack.org>`_ site to ask questions and get answers. When you visit the `Ask OpenStack <https://ask.openstack.org>`_ site, scan the recently asked questions to see whether your question has already been answered. If not, ask a new question. Be sure to give a clear, concise summary in the title and provide as much detail as possible in the description. Paste in your command output or stack traces, links to screen shots, and any other information which might be useful.
tr_tr: OpenStack'i kurarken veya test ederken, belirli bir görevi nasıl tamamladığınız veya bir özelliğin düzgün çalışmadığı bir durumda olmanız hakkında sorularınız olabilir. `ask.openstack.org <https://ask.openstack.org>`_ sitesini soru sormak ve cevap almak için kullanın. `OpenStack Sor <https://ask.openstack.org>`_ sitesine eriştiğinizde, sorunuza zaten cevap verip vermediğini görmek için son sorulan soruları tarayın. Değilse, yeni bir soru sorma. Başlıkta açık ve özlü bir özet verdiğinizden ve açıklamada olabildiğince çok ayrıntı sağladığınızdan emin olun. Komut çıktısına veya yığın izlerine, ekran görüntülerine bağlantılar ve yararlı olabilecek diğer tüm bilgileri yapıştırın.

source: Dynamic Host Configuration Protocol (DHCP)
tr_tr: Değişen Makine Yapılandırma Protokolü (DHCP)

source: Dynamic HyperText Markup Language (DHTML)
tr_tr: Dinamik Bağlantılı Metin Biçimlendirme Dili (DHTML)

source: EBS boot volume
tr_tr: EBS ön yükleme disk bölümü

source: EC2 Compatibility API
tr_tr: EC2 Uyumluluk API'si

source: EC2 access key
tr_tr: EC2 erişim anahtarı

source: EC2 secret key
tr_tr: EC2 gizli anahtarı

source: Each OpenStack release has a code name. Code names ascend in alphabetical order: Austin, Bexar, Cactus, Diablo, Essex, Folsom, Grizzly, Havana, Icehouse, Juno, Kilo, Liberty, Mitaka, Newton, Ocata, Pike, and Queens. Code names are cities or counties near where the corresponding OpenStack design summit took place. An exception, called the Waldon exception, is granted to elements of the state flag that sound especially cool. Code names are chosen by popular vote.
tr_tr: Her OpenStack dağıtımını bir kod adı vardır. Kod adları alfabede artan sıradadır: Austin, Bexar, Cactus, Diablo, Essex, Folsom, Grizzly, Havana, Icehouse, Juno, Kilo, Liberty, Mitaka, Newton, Ocata, Pike, ve Queens. Kod adları ilişkili OpenStack tasarım toplantısının yapıldığı şehirler veya ülkelerdir. Waldon bir istisnadır, havalı göründüğü için devlet bayrağının elemanlarından verilmiştir. Kod adları popüler oyla seçilir.

source: Easily scalable for future growth
id: Mudah terukur untuk pertumbuhan di masa depan
tr_tr: İlerideki büyüme için kolaylıkla ölçeklenebilir

source: Efficiently polls metering data related to OpenStack services.
id: Efisien Data jajak pendapat metering terkait dengan OpenStack layanan.
tr_tr: Etkin şekilde OpenStack servisleriyle ilişkili ölçü verilerini çeker.

source: Either a soft or hard reboot of a server. With a soft reboot, the operating system is signaled to restart, which enables a graceful shutdown of all processes. A hard reboot is the equivalent of power cycling the server. The virtualization platform should ensure that the reboot action has completed successfully, even in cases in which the underlying domain/VM is paused or halted/stopped.
tr_tr: Bir sunucunun hem yumuşak hem de sert yeniden başlatılmasıdır. Yumuşak yeniden başlatma ile işletim sistemine bütün işlemlerin sırayla kapatılmasına olanak sağlayan yeniden başlatma sinyali gönderilir. Sert yeniden başlatma sunucunun güç çevrimi ile eşdeğerdir. Sanallaştırma platformu, ilgili alan/VM duraklatıldığında veya durdurulduğunda bile yeniden başlatma eyleminin başarılı bir şekilde tamamlandığından emin olmalıdır.

source: Elastic Block Storage (EBS)
tr_tr: Elastic Blok Depolama (EBS)

source: Element of RabbitMQ that provides a response to an incoming MQ message.
id: Unsur RabbitMQ yang menyediakan respon terhadap pesan MQ masuk.
tr_tr: Gelen MQ mesajına yanıt veren RabbitMQ öğesi.

source: Enables Compute and Networking integration, which enables Networking to perform network management for guest VMs.
tr_tr: Ağın konuk VM'ler için ağ yönetimini gerçekleştirmesini sağlayan Hesaplama ve Ağ entegrasyonunu etkinleştirir.

source: Enables Compute to communicate with NetApp storage devices through the NetApp OnCommand Provisioning Manager.
tr_tr: Hesaplama'nın NetApp OnCommand Sağlama Yöneticisi aracılığıyla NetApp depolama aygıtıyla iletişim kurmasını sağlar.

source: Enables Network-Connectivity-as-a-Service for other OpenStack services, such as OpenStack Compute. Provides an API for users to define networks and the attachments into them. Has a pluggable architecture that supports many popular networking vendors and technologies.
id: Memungkinkan jaringan-Konektivitas-as-a-Service untuk layanan OpenStack lainnya, seperti OpenStack Compute. Menyediakan API bagi pengguna untuk menentukan jaringan dan lampiran ke mereka. Memiliki arsitektur pluggable yang mendukung banyak vendor jaringan populer dan teknologi.
tr_tr: OpenStack Hesaplama gibi diğer OpenStack servisleri için Servis olarak Ağ Bağlantısını etkinleştirir. Kullanıcılara ağları ve onlara olan ekleri tanımlama için bir API sağlar. Bir çok ünlü ağ üreticisi ve teknolojisi için tak çıkar mimarisine sahiptir.

source: Enables Networking to distribute incoming requests evenly between designated instances.
tr_tr: Ağın, gelen istekleri belirlenmiş sunucular arasında eşit olarak dağıtmasını sağlar.

source: Enables a Linux bridge to understand a Networking port, interface attachment, and other abstractions.
tr_tr: Bir Linux köprüsünün Ağ Bağlantı Noktasını, arabirim ekini ve diğer soyutlamaları anlamasını sağlar.

source: Enables users to submit commands to the REST API through a command-line client authorized as either a admin user, reseller user, or swift user.
id: Memungkinkan pengguna untuk mengirimkan perintah ke REST API melalui klien baris perintah resmi baik sebagai user admin, user reseller, atau pengguna cepat.
tr_tr: Kullanıcıların bir yönetici kullanıcı, yeniden satıcı kullanıcı veya swift kullanıcı olarak yetkilendirilmiş komut satırı istemcisi aracılığıyla REST API'ye komutlar göndermesini sağlar.

source: Encryption is available
id: Enkripsi sudah tersedia
tr_tr: Şifreleme kullanılabilir

source: Encryption is not available yet
id: Enkripsi belum tersedia
tr_tr: Şifreleme henüz kullanılabilir değil

source: Ensure that the ``C:\Python27\Scripts`` directory is defined in the ``PATH`` environment variable, and use the ``easy_install`` command from the setuptools package:
id: Pastikan bahwa `` C: direktori \ Python27 \ Scripts`` didefinisikan dalam `` variabel lingkungan PATH``, dan menggunakan `` perintah easy_install`` dari paket setuptools:
tr_tr: ``C:\Python27\Scripts`` dizininin ``PATH`` çevre değişkeninde tanımlandığından emin olun ve setuptools paketinden ``easy_install`` komutunu kullanın:

source: Ensure that the version of qemu you are using is version 0.14 or later. Earlier versions of qemu result in an ``unknown option -s`` error message in the ``/var/log/nova/nova-compute.log`` file.
id: Pastikan bahwa versi qemu Anda gunakan adalah versi 0.14 atau yang lebih baru. Versi sebelumnya dari hasil qemu dalam `` opsi diketahui pesan -s`` kesalahan dalam `` / var / log file / nova / nova-compute.log``.
tr_tr: Kullandığınız aqemu sürümünün 0.14 ya da daha sonrası olduğundan emin olun. Qemu'nun eski sürümleri ``/var/log/nova/nova-compute.log`` dosyasında ``unknown option -s`` hatası verirler.

source: Eucalyptus Kernel Image (EKI)
tr_tr: Okaliptür Çekirdek İmajı (EKI)

source: Eucalyptus Machine Image (EMI)
tr_tr: Okaliptüs Makine İmajı (EMI)

source: Eucalyptus Ramdisk Image (ERI)
tr_tr: Okaliptüs Ramdisk İmajı (ERI)

source: Examine the ``/var/log/nova/nova-api.log`` and ``/var/log/nova/nova-compute.log`` log files for error messages.
id: Periksa `` / var / log / nova / nova-api.log`` dan `` / var / log / nova / nova-compute.log`` file log untuk pesan error.
tr_tr: ``/var/log/nova/nova-api.log`` ve ``/var/log/nova/nova-compute.log`` dosyalarını hata iletileri için inceleyin.

source: Example cinder.conf file configuration.
id: Misalnya cinder.conf file konfigurasi.
tr_tr: Örnek cinder.conf dosya yapılandırması.

source: Example: 1 TB "extra hard drive"
tr_tr: Örnek: 1 TB "ek sabit sürücü"

source: Example: 1 TB of file share
tr_tr: Örnek: 1 TB dosya paylaşımı

source: Example: 10 GB first disk, 30 GB/core second disk
tr_tr: Örnek: 10 GB ilk disk, 30 GB/çekirdek ikinci disk

source: Example: 10s of TBs of data set storage
tr_tr: Örnek: 10'larca TB veri kümesi depolama

source: Extension to iptables that allows creation of firewall rules that match entire "sets" of IP addresses simultaneously. These sets reside in indexed data structures to increase efficiency, particularly on systems with a large quantity of rules.
id: Ekstensi untuk iptables yang memungkinkan penciptaan aturan firewall yang cocok seluruh "set" alamat IP secara bersamaan. set ini berada dalam struktur data diindeks untuk meningkatkan efisiensi, terutama pada sistem dengan jumlah besar aturan.
tr_tr: IP adreslerinin tüm "kümeleri" ni eş zamanlı olarak eşleştiren güvenlik duvarı kurallarının oluşturulmasına izin veren iptables'e uzantı. Bu setler, özellikle çok miktarda kuralları olan sistemlerde, verimliliği artırmak için dizinlenmiş veri yapılarında bulunur.

source: Facility in Compute that allows each virtual machine instance to have more than one VIF connected to it.
tr_tr: Her bir sanal makine örneğinin ona bağlı birden fazla VIF'e sahip olmasını sağlayan Hesaplama servisi özelliği.

source: Fast provisioning of Hadoop clusters on OpenStack for development and QA.
id: penyediaan cepat cluster Hadoop pada OpenStack untuk pengembangan dan QA.
tr_tr: Geliştirme ve QA için Hadoop kümelerinin OpenStack üzerinde hızlı hazırlanması.

source: Feature in modern Ethernet networks that supports frames up to approximately 9000 bytes.
tr_tr: Yaklaşık 9000 bayt'a kadar çerçeveleri destekleyen modern Ethernet ağlarındaki özellikler.

source: Feature of certain network interface drivers that combines many smaller received packets into a large packet before delivery to the kernel IP stack.
id: Fitur driver jaringan tertentu antarmuka yang menggabungkan banyak paket yang diterima lebih kecil ke dalam paket besar sebelum pengiriman ke stack kernel IP.
tr_tr: Çekirdek IP yığınına teslim edilmeden önce çok sayıda daha küçük alınan paketleri büyük bir paketle birleştiren bazı ağ arabirimi sürücülerinin özelliği.

source: Fibre Channel
tr_tr: Fiber Kanal

source: Fibre Channel over Ethernet (FCoE)
tr_tr: Ethernet üzerinden Fiber Kanal (FCoE)

source: File Storage (manila)
tr_tr: Dosya Depolama (manila)

source: File system option that enables storage of additional information beyond owner, group, permissions, modification time, and so on. The underlying Object Storage file system must support extended attributes.
id: pilihan sistem file yang memungkinkan penyimpanan informasi tambahan di luar pemilik, grup, perizinan, waktu modifikasi, dan sebagainya. Sistem file Object Storage mendasari harus mendukung atribut diperpanjang.
tr_tr: Sahip, grup, izinler, değiştirme süresi ve ötesinde ek bilgilerin depolanmasını sağlayan dosya sistemi seçeneği. Temel Nesne Depolama dosya sistemi, genişletilmiş öznitelikleri desteklemelidir.

source: Filtering tool for a Linux bridging firewall, enabling filtering of network traffic passing through a Linux bridge. Used in Compute along with arptables, iptables, and ip6tables to ensure isolation of network communications.
id: alat penyaringan untuk Linux menjembatani firewall, memungkinkan penyaringan lalu lintas jaringan melewati jembatan Linux. Digunakan dalam Hitung bersama dengan arptables, iptables, dan ip6tables untuk memastikan isolasi komunikasi jaringan.
tr_tr: Linux köprüsü güvenlik duvarı için filtreleme aracı, Linux köprüsünden geçen ağ trafiğinin filtrelenmesini sağlar. Ağ iletişimi izolasyonunu sağlamak için Hesaplama'da arptables, iptables ve ip6tables ile birlikte kullanılır.

source: Find the matching transfer ID:
id: Menemukan ID Transfer cocok:
tr_tr: Eşleşen aktarım kimliğini bulun:

source: FireWall-as-a-Service (FWaaS)
tr_tr: Hizmet-olarak-Güvenlik-Duvarı (FWaaS)

source: First, add the Open Build Service repository as described in the `Installation Tutorial <https://docs.openstack.org/ocata/install-guide-obs/environment-packages.html>`_.
tr_tr: Öncelikle, `Kurulum Öğreticisinde <https://docs.openstack.org/ocata/install-guide-obs/environment-packages.html>`_ tanımlandığı şekilde Açık İnşa Servisi deposunu ekleyin.

source: Flat Manager
tr_tr: Düz Yönetici

source: FlatDHCP Manager
tr_tr: FlatDHCP Yöneticisi

source: For IaaS, ability for a regular (non-privileged) account to manage a virtual infrastructure component such as networks without involving an administrator.
tr_tr: IaaS için, düzenli olmayan (ayrıcalıksız) bir hesabın, bir yönetici içermeyen ağlar gibi sanal bir altyapı bileşenini yönetme yeteneği.

source: For Mac OS X or Linux:
id: Untuk Mac OS X atau Linux:
tr_tr: Mac OS X veya Linux için:

source: For Microsoft Windows:
id: Untuk Microsoft Windows:
tr_tr: Microsoft Windows için:

source: For SUSE Linux Enterprise Server, use ``zypper`` to install the clients from the packaged versions:
tr_tr: SUSE Linux Kurumsal Sunucu için, istemcileri paketli sürümlerinden kurmak için ``zypper`` kullanın:

source: For Ubuntu or Debian, use ``apt-get`` to install the clients from the packaged versions:
id: Untuk Ubuntu atau Debian, menggunakan `` apt-get`` untuk menginstal klien dari versi paket:
tr_tr: Ubuntu veya Debian için, istemcileri paketli sürümlerden kurmak için ``apt-get`` kullanın:

source: For a given service, SFC is the abstracted view of the required service functions and the order in which they are to be applied.
tr_tr: Belirli bir hizmet için, SFC gerekli servis işlevlerinin soyutlanmış görünümü ve uygulanma sırası.

source: For bulk import of data to the cloud, the data ingress system creates a new Block Storage volume, copies data from the physical device, and transfers device ownership to the end user.
id: Untuk sebagian besar impor data ke awan, sistem data yang menelan menciptakan volume Block Storage baru, salinan data dari perangkat fisik, dan perangkat transfer kepemilikan kepada pengguna akhir.
tr_tr: Verinin buluta toplu aktarımında, veri giriş sistemi yeni bir Blok Depolama birimi oluşturur, fiziksel aygıttan veriyi kopyalar ve aygıt sahipliğini son kullanıcıya aktarır.

source: For communication between the processes of one service, an AMQP message broker is used. The service's state is stored in a database. When deploying and configuring your OpenStack cloud, you can choose among several message broker and database solutions, such as RabbitMQ, MySQL, MariaDB, and SQLite.
id: Untuk komunikasi antara proses satu layanan, broker pesan AMQP digunakan. Layanan ini negara disimpan dalam database. Ketika penggelaran dan mengkonfigurasi awan OpenStack Anda, Anda dapat memilih di antara beberapa broker pesan dan basis data solusi, seperti RabbitMQ, MySQL, MariaDB, dan SQLite.
tr_tr: Bir servisin süreçleri arasındaki iletişim için bir AMQP ileti aracısı kullanılır. Servisin durumu veritabanında tutulur. OpenStack bulutunuzu kurarken ya da yapılandırırken, RabbitMQ, MySQL, MariaDB ve SQLite gibi çeşitli ileti aracısı ve veritabanı çözümlerinden seçim yapabilirsiniz.

source: For details about image creation, see the `Virtual Machine Image Guide <https://docs.openstack.org/image-guide/>`__.
tr_tr: İmaj oluşturmayla ilgili ayrıntılar için, `Sanal Makine İmaj Kılavuzuna <https://docs.openstack.org/image-guide/>`__ göz atın.

source: For example, copy the file to the computer from which you want to upload an image with a ``glance`` client command.
id: Misalnya, menyalin file ke komputer dari mana Anda ingin meng-upload gambar dengan `` perintah klien glance``.
tr_tr: Örneğin, dosyayı ``glance`` istemci komutuyla bir imaj yüklemek istediğiniz bilgisayara kopyalayın.

source: For example, to see the version number for the ``openstack`` client, run the following command:
id: Misalnya, untuk melihat nomor versi untuk `` klien openstack``, jalankan perintah berikut:
tr_tr: Örneğin, ``openstack`` istemcisi için sürüm numarasını görmek için şu komutu çalıştırın:

source: For example, using the image ID shown above, you would issue the command as follows:
id: Misalnya, menggunakan gambar IS yang ditunjukkan di atas, Anda bisa mengeluarkan perintah sebagai berikut:
tr_tr: Örneğin, yukarıda gösterilen imaj kimliğiyle, komutu şu şekilde çalıştırırdınız:

source: For example, when you specify your password using the command-line client with the ``--os-password`` argument, anyone with access to your computer can view it in plain text with the ``ps`` field.
tr_tr: Örneğin parolayı komut satırı istemcinizde ``--os-password`` bağımsız değişkenini kullanarak belirttiğinizde, bilgisayarınıza erişebilen herhangi biri düz metin olarak ``ps`` alanıyla görebilir.

source: For example:
id: Sebagai contoh:
tr_tr: Örneğin

source: For information on requirements for other back ends, see `Configuration Reference <https://docs.openstack.org/ocata/config-reference/image.html>`__.
tr_tr: Diğer arka uçların gereksinimleriyle ilgili bilgi için `Yapılandırma Başvurusuna <https://docs.openstack.org/ocata/config-reference/image.html>`__ göz atın.

source: For more information, see `OpenStack Configuration Reference <https://docs.openstack.org/ocata/config-reference/shared-file-systems/overview.html>`__.
tr_tr: Daha fazla bilgi için, `OpenStack Yapılandırma Başvurusuna <https://docs.openstack.org/ocata/config-reference/shared-file-systems/overview.html>`__ göz atın.

source: For more sophisticated monitoring, see the `ceilometer <https://launchpad.net/ceilometer>`__ project. You can also use tools, such as `Ganglia <http://ganglia.info/>`__ or `Graphite <http://graphite.wikidot.com/>`__, to gather more detailed data.
tr_tr: Daha karmaşık izleme için, `ceilometer <https://launchpad.net/ceilometer>`__ projesine göz atın. Daha fazla ayrıntılı veri toplamak için ayrıca `Ganglia <http://ganglia.info/>`__ veya `Graphite <http://graphite.wikidot.com/>`__ gibi araçlar kullanabilirsiniz.

source: For openSUSE, use ``zypper`` to install the clients from the distribution packages service:
id: Untuk openSUSE, menggunakan `` zypper`` untuk menginstal klien dari layanan paket distribusi:
tr_tr: openSUSE için, istemcileri dağıtım paket servisinden kurmak için ``zypper`` kullanın:

source: For simplicity, this guide describes configuring the Image service to use the ``file`` back end, which uploads and stores in a directory on the controller node hosting the Image service. By default, this directory is ``/var/lib/glance/images/``.
tr_tr: Basitlik için, bu kılavuz İmaj servisini ``dosya`` arka ucunu kullanacak şekilde yapılandırmayı anlatır, bu da İmaj servisini sunan kontrol düğümünde bir dizine yükleme ve kaydetme demektir. Öntanımlı olarak bu dizin ``/var/lib/glance/images/`` dizinidir.
