Repository: 25hours/openstack-manuals
Catalog: doc/common/source/locale/*/LC_MESSAGES/common.po
Languages: id, tr_tr

source: For the available OpenStack documentation, see `docs.openstack.org <https://docs.openstack.org>`_.
tr_tr: Kullanılabilir OpenStack Belgelendirmesi için, bakınız `docs.openstack.org <https://docs.openstack.org>`_.

source: Free up space in a thinly-provisioned back end.
id: Membebaskan ruang di akhir tipis-ditetapkan kembali.
tr_tr: İnce hazırlanmış bir arka uçta alan boşaltın.

source: From a network architecture point of view, this service must be accessible to customers and the public API for each OpenStack service. To use the administrator functionality for other services, it must also connect to Admin API endpoints, which should not be accessible by customers.
id: Dari titik arsitektur jaringan pandang, layanan ini harus dapat diakses oleh pelanggan dan API publik untuk setiap layanan OpenStack. Untuk menggunakan fungsi administrator untuk layanan lainnya, juga harus terhubung ke Admin API endpoint, yang tidak boleh diakses oleh pelanggan.
tr_tr: Ağ mimarisi bakış açısından, bu servis müşterilerce ve her OpenStack servisi için açık API ile erişilebilir olmalıdır. Diğer servisler için yönetici işlevselliğini kullanabilmek için, müşteriler tarafından erişilemez olması gereken Yönetici API'si uç noktalarına bağlanmalıdır.

source: Gathers statistics, lists items, updates metadata, and uploads, downloads, and deletes files stored by the Object Storage service. Gains access to an Object Storage installation for ad hoc processing.
id: Mengumpulkan statistik, daftar item, update metadata, dan upload, download, dan menghapus file yang disimpan oleh layanan Object Storage. Keuntungan akses ke instalasi Storage Object untuk pengolahan ad hoc.
tr_tr: İstatistikleri toplar, ögeleri listeler, metaveriyi günceller ve Nesne Depolama servisi tarafından depolanan dosyaları yükler, indirir ve siler. Nesne Depolama kurulumu ve plansız işleme için erişim elde eder.

source: Generally, extra properties on an Image service image to which only cloud administrators have access. Limits which user roles can perform CRUD operations on that property. The cloud administrator can configure any image property as protected.
tr_tr: Genel olarak, yalnızca bulut yöneticilerinin erişebileceği bir İmaj hizmeti imajındaji ek özellikler. Hangi kullanıcı rollerinin o özellikte CRUD işlemlerini gerçekleştirebileceğini sınırlar. Bulut yöneticisi, herhangi bir imaj özelliğini korumalı olarak yapılandırabilir.

source: Get CPU, memory, I/O, and network statistics for an instance.
tr_tr: Bir sunucu için CPU, hafıza, I/O ve ağ istatistiklerini getir.

source: Get a summary of resource usage of all of the instances running on the host:
tr_tr: Makine üzerinde çalışan tüm sunucuların kaynak kullanım özetlerini getir:

source: Get diagnostic statistics:
tr_tr: Teşhis istatistiklerini getir:

source: Get started with OpenStack
id: Memulai OpenStack
tr_tr: OpenStack ile başlangıç

source: Get summary statistics for each project:
tr_tr: Her bir proje için özet istatistikleri getir:

source: Give a clear, concise summary.
id: Memberikan yang jelas, ringkasan singkat.
tr_tr: Temiz, özlü bir özet verin.

source: Gives guest VMs exclusive access to a PCI device. Currently supported in OpenStack Havana and later releases.
tr_tr: Konuk VM'lere bir PCI aygıtına özel erişim hakkı tanır. Halen OpenStack Havana'da ve daha sonraki sürümlerde desteklenmektedir.

source: Glossary
id: Glosarium
tr_tr: Sözlük

source: Governance service (congress)
tr_tr: Yönetişim hizmeti (congress)

source: Governs the ability of subjects to access objects, while enabling users to make policy decisions and assign security attributes. The traditional UNIX system of users, groups, and read-write-execute permissions is an example of DAC.
tr_tr: Kullanıcıların politik kararlar almalarını ve güvenlik özniteliklerini atamalarını sağlarken, nesnelerin nesnelere erişme yeteneğini yönetir. Geleneksel UNIX kullanıcı sistemi, gruplar ve okuma yazma yürütme izinleri DAC örneğidir.

source: Graphic Interchange Format (GIF)
tr_tr: Grafik Değişim Biçemi (GIF)

source: Graphics Processing Unit (GPU)
tr_tr: Grafik İşleme Birimi (GPU)

source: Green Threads
tr_tr: Yeşil İş parçacıkları

source: Group
tr_tr: Grup

source: Hadoop Distributed File System (HDFS)
tr_tr: Hadoop Dağıtık Dosya Sistemi (HDFS)

source: Handles authentication and is usually OpenStack Identity.
id: Menangani otentikasi dan biasanya OpenStack Identity.
tr_tr: Kimlik doğrulamayı ele alır genellikle OpenStack Kimlik'dir.

source: Heat Orchestration Template (HOT)
tr_tr: Heat Orkestrasyon Şablonu (HOT)

source: Heat input in the format native to OpenStack.
id: masukan panas dalam format asli untuk OpenStack.
tr_tr: OpenStack'e özgü biçimde hear girdisi.

source: Helpful information that prevents the user from making mistakes.
id: informasi bermanfaat yang mencegah pengguna dari membuat kesalahan.
tr_tr: Kullanıcının hatalar yapmasını önleyen faydalı bilgiler.

source: High-availability mode for legacy (nova) networking. Each compute node handles NAT and DHCP and acts as a gateway for all of the VMs on it. A networking failure on one compute node doesn't affect VMs on other compute nodes.
tr_tr: Miras (nova) ağ için yüksek kullanılabilirlik modu. Her hesaplama düğümü, NAT ve DHCP'yi işler ve üzerinde bulunan tüm VM'ler için bir ağ geçidi görevi görür. Bir hesaplama düğümünde bir ağ hatası, diğer hesaplama düğümlerinde bulunan VM'leri etkilemez.

source: High-performance 64-bit file system created by Silicon Graphics. Excels in parallel I/O operations and data consistency.
tr_tr: Silicon Graphics tarafından üretilen yüksek performanslı 64 bit dosya sistemi. Paralel G/Ç işlemleri ve veri tutarlılığı konusunda üstünlük sağlar.

source: Host Bus Adapter (HBA)
tr_tr: Sunucu Veri Yolu Bağdaştırıcısı (HBA)

source: Hypertext Transfer Protocol (HTTP)
tr_tr: Bağlantılı Metin Aktarım Protokolü (HTTP)

source: Hypertext Transfer Protocol Secure (HTTPS)
tr_tr: Güvenli Bağlantılı Metin Aktarım Protokolü (HTTPS)

source: ID number
tr_tr: Kimlik numarası

source: INI format
tr_tr: INI biçimi

source: IOPS are a common performance measurement used to benchmark computer storage devices like hard disk drives, solid state drives, and storage area networks.
tr_tr: IOPS, sabit disk sürücüleri, katı hal diski ve depolama alanı ağları gibi bilgisayar depolama aygıtlarını karşılaştırmak için kullanılan ortak bir performans ölçümüdür.

source: IP Address Management (IPAM)
tr_tr: IP Adresi Yönetimi (IPAM)

source: IP address
tr_tr: IP adresi

source: IPMI is a standardized computer system interface used by system administrators for out-of-band management of computer systems and monitoring of their operation. In layman's terms, it is a way to manage a computer using a direct network connection, whether it is turned on or not; connecting to the hardware rather than an operating system or login shell.
tr_tr: IPMI, bilgisayar sistemlerinin bant dışı yönetimi ve işlemlerinin izlenmesi için sistem yöneticileri tarafından kullanılan standartlaştırılmış bir bilgisayar sistemi arabirimidir. layman koşullarına göre, bir bilgisayarın açık olup olmadığı; doğrudan ağ bağlantısı kullanarak yönetmek; bir işletim sistemi veya giriş kabuğundan ziyade donanıma bağlanmak için bir yöntemdir.

source: IQN is the format most commonly used for iSCSI names, which uniquely identify nodes in an iSCSI network. All IQNs follow the pattern iqn.yyyy-mm.domain:identifier, where 'yyyy-mm' is the year and month in which the domain was registered, 'domain' is the reversed domain name of the issuing organization, and 'identifier' is an optional string which makes each IQN under the same domain unique. For example, 'iqn.2015-10.org.openstack.408ae959bce1'.
tr_tr: IQN, bir iSCSI ağındaki düğümleri benzersiz bir şekilde tanımlayan iSCSI isimleri için yaygın olarak kullanılan bir biçemdir. Bütün IQN'ler qn.yyyy-mm.domain:identifier şablonunu takip eder, 'yyyy-mm' alan adının kaydedildiği yılı ve ayı, 'domain' yayınlanan organizasyonun ters alan adını, ve 'identifier' IQN'i aynı alan adı altında benzersiz yapan seçimli bir karakter dizisidir. Örneğin, 'iqn.2015-10.org.openstack.408ae959bce1'.

source: IaaS is a provisioning model in which an organization outsources physical components of a data center, such as storage, hardware, servers, and networking components. A service provider owns the equipment and is responsible for housing, operating and maintaining it. The client typically pays on a per-use basis. IaaS is a model for providing cloud services.
tr_tr: IaaS, bir kuruluşun depolama, donanım, sunucular ve ağ bileşenleri gibi bir veri merkezinin fiziksel bileşenlerini dışa aktardığı bir tedarik modeli. Bir servis sağlayıcı ekipmana sahiptir ve konut, işletme ve bakımı için sorumludur. Müşteri genellikle bir kullanım esasına göre ödeme yapar. IaaS, bulut hizmetleri sağlayan bir modeldir.

source: Identity API
tr_tr: Kimlik API

source: Identity back end
tr_tr: Kimlik art alan uygulaması

source: Identity service (keystone)
tr_tr: Kimlik servisi (keystone)

source: Identity service API
tr_tr: Kimlik servisi API

source: Identity service overview
id: ikhtisar layanan Identity
tr_tr: Kimlik servisi genel görünümü

source: If Object Storage finds objects, containers, or accounts that are corrupt, they are placed in this state, are not replicated, cannot be read by clients, and a correct copy is re-replicated.
tr_tr: Nesne Depolama, bozuk nesneleri, kapları veya hesapları bulursa, bunlar bu duruma getirilir, çoğaltılamaz, istemciler tarafından okunamaz ve doğru bir kopya yeniden çoğaltılır.

source: If a requested resource such as CPU time, disk storage, or memory is not available in the parent cell, the request is forwarded to its associated child cells. If the child cell can fulfill the request, it does. Otherwise, it attempts to pass the request to any of its children.
id: Jika sumber daya yang diminta seperti waktu CPU, penyimpanan disk, atau memori tidak tersedia dalam sel induk, permintaan tersebut diteruskan ke sel anak yang terkait. Jika sel anak dapat memenuhi permintaan, itu tidak. Jika tidak, ia mencoba untuk lulus permintaan ke salah satu dari anak-anaknya.
tr_tr: CPU süresi, disk depolama alanı veya bellek gibi istenen bir kaynak üst hücrede mevcut değilse, istek ilgili alt hücrelerine iletilir. Alt hücre isteği yerine getirebilirse geçerlidir. Aksi takdirde, talebini çocuklarından herhangi birisine iletmeye çalışır.

source: If a requested resource, such as CPU time, disk storage, or memory, is not available in the parent cell, the request is forwarded to associated child cells.
tr_tr: CPU süresi, disk depolama alanı veya bellek gibi istenen bir kaynak üst hücrede yoksa, istek ilişkili alt hücrelere iletilir.

source: If above parameters are not set, Cinder uses default_volume_type which is defined in cinder.conf during volume creation.
id: Jika parameter di atas tidak diatur, cinder menggunakan jenis volume default yang didefinisikan di cinder.conf selama pembuatan volume.
tr_tr: Yukarıdaki parametreler ayarlanmamışsa, Cinder birim oluşturma sırasında cinder.conf dosyasında tanımlı öntanımlı default_volume_type değerini kullanır.

source: If glance image has ``cinder_img_volume_type`` property, Cinder uses this parameter to specify ``volume type`` when creating a volume.
id: Jika gambar sekilas memiliki `` properti cinder_img_volume_type``, cinder menggunakan parameter ini untuk menentukan `` type`` volume saat menciptakan volume.
tr_tr: Glance imajının ``cinder_img_volume_type`` özelliği varsa, Cinder bu parametreyi kullanarak birim oluştururken ``birim türü`` belirtir.

source: If the guest operating system is not in the database, or if the use of ``libosinfo`` is disabled, the default system values are used.
id: Jika sistem operasi tamu tidak dalam database, atau jika penggunaan `` libosinfo`` dinonaktifkan, nilai-nilai default sistem yang digunakan.
tr_tr: Misafir işletim sistemi veritabanında değilse, veya ``libosinfo`` kullanıma kapatılmışsa, öntanımlı sistem değerleri kullanılır.

source: If the volume has snapshots, the specified host destination cannot accept the volume. If the user is not an administrator, the migration fails.
id: Jika volume memiliki snapshot, host tujuan yang ditentukan tidak dapat menerima volume. Jika pengguna bukan administrator, migrasi gagal.
tr_tr: Birimin anlık görüntüleri varsa, belirtilen sunucu hedefi birimi kabul edemez. Kullanıcı bir yönetici değilse, göç başarısız olur.

source: If you do not have a sufficient quota for the transfer, the transfer is refused.
id: Jika Anda tidak memiliki kuota yang cukup untuk transfer, transfer ditolak.
tr_tr: Aktarım için yeterli kotanız yoksa aktarım reddedilir.

source: If you encounter problems in creating an image in the Image service or Compute, the following information may help you troubleshoot the creation process.
id: Jika Anda mengalami masalah dalam menciptakan sebuah gambar dalam pelayanan Gambar atau Compute, informasi berikut dapat membantu Anda memecahkan masalah proses pembuatan.
tr_tr: İmaj servisinde veya Hesaplamada imaj oluşturmayla ilgili sorunlarla karşılaşırsanız, aşağıdaki bilgi oluşturma sürecinde sorun gidermeyle ilgili yardımcı olacaktır.

source: If you need to install the source package for the command-line package, the following table lists the software needed to run the command-line clients, and provides installation instructions as needed.
id: Jika Anda perlu menginstal paket source untuk paket baris perintah, tabel berikut berisi daftar perangkat lunak yang diperlukan untuk menjalankan klien baris perintah, dan menyediakan petunjuk instalasi yang diperlukan.
tr_tr: Komut satırı paketi için kaynak paketi kurmanız gerekiyorsa, aşağıdaki tablo komut satırı istemcilerini kurmak için gerekli yazılımları listeler, ve gerektiği şekilde kurulum yönergelerini sağlar.

source: If you specify a disk or CD-ROM bus model that is not supported, see the Disk_and_CD-ROM_bus_model_values_table_. If you specify a VIF model that is not supported, the instance fails to launch. See the VIF_model_values_table_.
id: Nilai model valid tergantung pada `` pengaturan libvirt_type``, seperti yang ditunjukkan pada tabel berikut.
tr_tr: Desteklenmeyen bir disk veya CD-ROM veriyolu belirtirseniz, bkz Disk_ve_CD-ROM_veriyolu_model_değerleri_tablosu_. Desteklenmeyen bir VIF modeli belirtirseniz, sunucu başlamada başarısız olur. Bkz VIF_model_değerleri_tablosu_.

source: If your volume was created successfully, its status is ``available``. If its status is ``error``, you might have exceeded your quota.
id: Jika volume Anda telah berhasil dibuat, statusnya adalah `` available``. Jika statusnya adalah `` error``, Anda mungkin telah melebihi kuota.
tr_tr: Biriminiz başarıyla oluşturulduysa, durumu ``kullanılabilir`` olur. Durumu ``hata`` ise kotanızı aşmış olabilirsiniz.

source: Image API
tr_tr: İmaj API

source: Image service
id: layanan gambar
tr_tr: İmaj servisi

source: Image service (glance)
tr_tr: İmaj servisi (glance)

source: Image service overview
id: ikhtisar layanan gambar
tr_tr: İmaj servisi genel görünümü

source: Impassable limits for guest VMs. Settings include total RAM size, maximum number of vCPUs, and maximum disk size.
id: batas dilalui untuk tamu VMS. Pengaturan mencakup ukuran total RAM, jumlah maksimum vCPUs, dan ukuran disk maksimum.
tr_tr: Konuk VM'ler için geçilmez sınırlar. Ayarlar, toplam RAM boyutu, maksimum vCPU sayısı ve maksimum disk boyutu içerir.

source: Implemented as a filesystem underlying OpenStack Compute
id: Diimplementasikan sebagai filesystem yang mendasari OpenStack Compute
tr_tr: OpenStack Hesaplama altında yatan bir dosya sistemi olarak uygulanmıştır

source: In Compute and Block Storage, the ability to set resource limits on a per-project basis.
tr_tr: Hesaplama ve Blok Depolama alanında kaynak sınırlarını proje bazında ayarlama olanağı.

source: In Compute, conductor is the process that proxies database requests from the compute process. Using conductor improves security because compute nodes do not need direct access to the database.
id: Dalam Compute, konduktor adalah proses yang proxy permintaan database dari proses menghitung. Menggunakan konduktor meningkatkan keamanan karena menghitung node tidak memerlukan akses langsung ke database.
tr_tr: Hesaplama'da kondüktör, hesaplama işleminden veritabanı isteklerini yönlendiren işlemdir. Kondüktörü kullanmak, hesaplama düğümlerinin veritabanına doğrudan erişimi gerektirmediği için güvenliği artırır.

source: In Object Storage, tools to test and ensure dispersion of objects and containers to ensure fault tolerance.
id: Dalam Object Storage, alat untuk menguji dan memastikan dispersi dari objek dan kontainer untuk memastikan toleransi kesalahan.
tr_tr: Nesne Depolama'da, hata toleransını sağlamak için nesneleri ve kapları test etmek ve dağıtmak için kullanılan araçlar.

source: In OpenStack Identity, entities represent individual API consumers and are owned by a specific domain. In OpenStack Compute, a user can be associated with roles, projects, or both.
tr_tr: OpenStack Kimlik'de varlıklar, tek tek API tüketicilerini temsil eder ve belirli bir alana aittir. OpenStack Compute'de bir kullanıcı roller, projeler veya her ikisi ile ilişkilendirilebilir.

source: In OpenStack, the API version for a project is part of the URL. For example, ``example.com/nova/v1/foobar``.
id: Dalam OpenStack, versi API untuk sebuah proyek adalah bagian dari URL. Misalnya, `` example.com / nova / v1 / foobar``.
tr_tr: OpenStack'te bir proje için API sürümü URL'in bir parçasıdır. Örneğin, `example.com/nova/v1/foobar``.

source: In a high-availability setup with an active/active configuration, several systems share the load together and if one fails, the load is distributed to the remaining systems.
id: Dalam setup ketersediaan tinggi dengan aktif / konfigurasi aktif, beberapa sistem berbagi beban bersama-sama dan jika salah satu gagal, beban didistribusikan ke sistem yang tersisa.
tr_tr: Etkin/etkin yapılandırmayla birlikte yüksek kullanılabilirlikli bir kurulumda, birkaç sistem yükü birlikte paylaşır ve biri başarısız olursa yük kalan sistemlere dağıtılır.

source: In a high-availability setup with an active/passive configuration, systems are set up to bring additional resources online to replace those that have failed.
id: Dalam setup ketersediaan tinggi dengan / konfigurasi pasif aktif, sistem yang dibentuk untuk membawa sumber daya online tambahan untuk menggantikan mereka yang telah gagal.
tr_tr: Aktif/pasif bir yapılandırmaya sahip yüksek kullanılabilirlikli bir kurulumda, sistemler başarısız olanları değiştirmek için çevrimiçi ek kaynaklar getirmek üzere ayarlanır.

source: In a text editor, create a file named ``PROJECT-openrc.sh`` and add the following authentication information:
id: Dalam editor teks, membuat file bernama `` PROJECT-openrc.sh`` dan menambahkan informasi otentikasi berikut:
tr_tr: Bir metin düzenleyicide, ``PROJE-openrc.sh`` isimli bir dosya oluşturun ve şu kimlik doğrulama bilgisini ekleyin:

source: In cryptography, an entity that issues digital certificates. The digital certificate certifies the ownership of a public key by the named subject of the certificate. This enables others (relying parties) to rely upon signatures or assertions made by the private key that corresponds to the certified public key. In this model of trust relationships, a CA is a trusted third party for both the subject (owner) of the certificate and the party relying upon the certificate. CAs are characteristic of many public key infrastructure (PKI) schemes. In OpenStack, a simple certificate authority is provided by Compute for cloudpipe VPNs and VM image decryption.
tr_tr: Kriptografide, dijital sertifikalar veren bir varlık. Dijital sertifika, bir açık anahtarın sahipliğini sertifikanın adlandırılmış konusuyla belgelemektedir. Bu, başkalarının (taraflara güvenerek) sertifikalı açık anahtara karşılık gelen özel anahtar tarafından yapılan imzalara veya iddialara güvenmesini sağlar. Bu güven ilişkileri modelinde bir CA, sertifikanın hem konusunun (sahibi) hem de sertifikaya güvenen tarafın güvenilen bir üçüncü tarafıdır. CA'lar birçok açık anahtar altyapısı (PKI) şemasının karakteristik özelliklerini taşır. OpenStack'te, Compute tarafından basit bir sertifika yetkilendirmesi sağlanıyor, bulut VPNleri ve VM imaj şifre çözme için.

source: In the Image service, run the following command:
id: Dalam layanan Image, jalankan perintah berikut:
tr_tr: İmaj servisinde, aşağıdaki komutu çalıştırın:

source: In the context of Object Storage, this is a process that is not terminated after an upgrade, restart, or reload of the service.
tr_tr: Nesne Depolama Alanı bağlamında, bu, yükseltme, yeniden başlatma veya hizmetin yeniden yüklenmesinden sonra sonlandırılmayan bir işlemdir.

source: In the context of the Identity service, the worker process that provides access to the admin API.
id: Dalam konteks pelayanan Identity, proses pekerja yang menyediakan akses ke admin API.
tr_tr: Kimlik hizmeti bağlamında, yönetici API'sına erişim sağlayan işçi işlemi.

source: In the following example, the ``demo-openrc.sh`` file is sourced for the demo project:
id: Pada contoh berikut ini, `` berkas demo-openrc.sh`` bersumber untuk proyek demo:
tr_tr: Aşağıdaki örnekte, ``demo-openrc.sh`` dosyası demo projesi için kaynak ediliyor:

source: In this example, ``--force-host-copy`` forces the generic host-based migration mechanism and bypasses any driver optimizations. ``--lock-volume | --unlock-volume`` applies to the available volume. To determine whether the termination of volume migration caused by other commands. ``--lock-volume`` locks the volume state and does not allow the migration to be aborted.
tr_tr: Bu örnekte, ``--force-host-copy`` genel sunucu tabanlı göç mekanizmasına zorlar ve sürücü iyileştirmelerini göz ardı eder. ``--lock-volume | --unlock-volume`` kullanılabilir birime uygulanır. Birim göçünün sonlandırılmasının diğer komutlar sebebiyle olup olmadığını anlamak için. ``--lock-volume`` birim durumunu kitler ve göçten çıkılmasına izin vermez.

source: Individual command-line clients
tr_tr: Bağımsız komut satırı istemcileri

source: Information that consists solely of ones and zeroes, which is the language of computers.
id: Informasi yang hanya terdiri dari satu dan nol, yang merupakan bahasa komputer.
tr_tr: Bilgisayar dili olan sadece sıfır ve birlerden oluşan bilgi.

source: Infrastructure Optimization service (watcher)
tr_tr: Altyapı Eniyileştirme hizmeti (watcher)

source: Infrastructure-as-a-Service (IaaS)
tr_tr: Hizmet-olarak-Altyapı (IaaS)

source: Input/Output Operations Per Second (IOPS)
tr_tr: Saniye gerçekleşen Girdi/çıktı İşlemleri (IOPS)

source: Install each client separately by using the following command:
id: Menginstal setiap klien secara terpisah dengan menggunakan perintah berikut:
tr_tr: Aşağıdaki komutu kullanarak her istemciyi ayrı ayrı kurun:

source: Install pip through the package manager for your system:
id: Menginstal pip melalui manajer paket untuk sistem Anda:
tr_tr: Pip'i sisteminiz için paket yöneticisi aracılığıyla kurun:

source: Install the Database service.
id: Menginstal layanan database.
tr_tr: Veritabanı servisini kurun.

source: Install the OpenStack client
id: Menginstal klien OpenStack
tr_tr: OpenStack istemcisini kurun

source: Install the OpenStack command-line clients
id: Menginstal klien baris perintah OpenStack
tr_tr: OpenStack komut satırı istemcilerini kurun

source: Install the prerequisite software
id: Menginstal perangkat lunak prasyarat
tr_tr: Ön koşul yazılımını kurun
