Repository: 25hours/openstack-manuals
Catalog: doc/common/source/locale/*/LC_MESSAGES/common.po
Languages: id, tr_tr

source: **CentOS, Fedora, and Red Hat Enterprise Linux:** https://www.rdoproject.org/
id: ** CentOS, Fedora, dan Red Hat Enterprise Linux: ** https://www.rdoproject.org/
tr_tr: **CentOS, Fedora, ve Red Hat Enterprise Linux:** https://www.rdoproject.org/

source: **Components**
tr_tr: **Bileşenler**

source: **Disk and CD-ROM bus model values**
id: ** Nilai model Disk dan CD-ROM bus **
tr_tr: **Disk ve CD-ROM veriyolu modeli değerleri**

source: **Process flow example**
id: ** Proses aliran contoh **
tr_tr: **Süreç akışı örneği**

source: **Red Hat Enterprise Linux or CentOS**
tr_tr: **Red Hat Kurumsal Linux veya CentOS**

source: **SUSE Linux Enterprise Server**
tr_tr: **SUSE Linux Kurumsal Sunucu**

source: **Ubuntu or Debian**
id: ** Ubuntu atau Debian **
tr_tr: **Ubuntu veya Debian**

source: **VIF model values**
id: ** VIF nilai model **
tr_tr: **VIF model değerleri**

source: **openSUSE and SUSE Linux Enterprise Server:** https://en.opensuse.org/Portal:OpenStack
id: ** OpenSUSE dan SUSE Linux Enterprise Server: ** https://en.opensuse.org/Portal:OpenStack
tr_tr: **openSUSE ve SUSE Linux Enterprise Server:** https://en.opensuse.org/Portal:OpenStack

source: *The OpenStack Image service is used to manage the virtual machine images in an OpenStack cluster, not store them.* It provides an abstraction to different methods for storage - a bridge to the storage, not the storage itself.
id: * The OpenStack layanan Gambar digunakan untuk mengelola gambar mesin virtual di cluster OpenStack, tidak menyimpannya * Ini menyediakan abstraksi untuk metode yang berbeda untuk penyimpanan -. Jembatan untuk penyimpanan, tidak penyimpanan itu sendiri.
tr_tr: *OpenStack İmaj servisi bir OpenStack kümesindeki sanal makine imajlarını yönetmede kullanılır, depolamada değil.* Depolama için farklı yöntemler için bir soyutlama sağlar - depolamaya bir köprü, depolamanın kendisi değil.

source: *The OpenStack Object Storage can function on its own.* The Object Storage (swift) product can be used independently of the Compute (nova) product.
id: * The OpenStack Object Storage dapat berfungsi sendiri. * The Object Storage (cepat) produk dapat digunakan secara independen dari Compute (nova) produk.
tr_tr: *OpenStack Nesne Depolama kendi başına çalışabilir.* Nesne Depolama (swift) ürünü Hesaplama (nova) ürününden bağımsız olarak kullanılabilir.

source: *You cannot use OpenStack Object Storage like a traditional hard drive.* The Object Storage relaxes some of the constraints of a POSIX-style file system to get other gains. You can access the objects through an API which uses HTTP. Subsequently you don't have to provide atomic operations (that is, relying on eventual consistency), you can scale a storage system easily and avoid a central point of failure.
id: * Anda tidak dapat menggunakan OpenStack Object Storage seperti hard drive tradisional. * The Object Storage melemaskan beberapa kendala dari sistem file POSIX-gaya untuk mendapatkan keuntungan lainnya. Anda dapat mengakses obyek melalui API yang menggunakan HTTP. Selanjutnya Anda tidak harus menyediakan operasi atom (yaitu, mengandalkan konsistensi akhirnya), Anda dapat skala sistem penyimpanan mudah dan menghindari titik pusat kegagalan.
tr_tr: *OpenStack Nesne Depolamayı geleneksel sabit disk gibi kullanamazsınız.* Nesne Depolama başka yerlerden kazanmak için POSIX-biçemli dosya sistemlerinin bazı kısıtlamalarını kaldırır. Nesnelere HTTP kullanan bir API üzerinden erişebilirsiniz. Atomik işlemler sağlamak zorunda değilsiniz (bu nihai tutuarlılığa dayanır), bir depolama sistemini kolaylıkla ölçekleyebilir ve tek noktada başarısızlıktan kaçınabilirsiniz.

source: 6to4
tr_tr: 6dan4e

source: <transfer>
tr_tr: <aktarım>

source: A BLOB of data held by Object Storage; can be in any format.
tr_tr: Nesne Depolama Birimi tarafından tutulan BLOB bir veri; Herhangi bir biçimde olabilir.

source: A Block Storage component that creates, attaches, and detaches persistent storage volumes.
tr_tr: Kalıcı depolama disk bölümlerini oluşturan, ekleyen ve çıkaran Blok Depolama bileşeni.

source: A Block Storage component that oversees and coordinates storage volume actions.
tr_tr: Depolama hacmi eylemlerini denetleyen ve koordine eden bir Blok Depolama bileşeni.

source: A Block Storage node that runs the cinder-volume daemon.
tr_tr: cinder-volume artalan işlemini çalıştıran Blok Depolama düğümü.

source: A Block Storage volume plug-in that enables communication with the Xen Storage Manager API.
tr_tr: Xen Depolama Yönetimi API ile iletişimi sağlayan bir Blok Depolama disk bölümü eklentisi.

source: A CLI that communicates with the ``heat-api`` to run AWS CloudFormation APIs. End developers can directly use the Orchestration REST API.
tr_tr: AWS CloudFormation API'leri çalıştırmak için ``heat-api`` ile iletişim kuran bir CLI. Son geliştiricler doğrudan Orkestrasyon REST API'sini kullanabilirler.

source: A CLI that communicates with the ``trove-api`` component.
id: Sebuah CLIP yang berkomunikasi dengan `` komponen harta-api``.
tr_tr: ``trove-api`` bileşeniyle iletişim kuran bir CLI.

source: A Ceph component that communicates with external clients, checks data state and consistency, and performs quorum functions.
tr_tr: Harici istemcilerle iletişim kuran, veri durumunu ve tutarlılığını kontrol eden ve çekirdek işlevleri gerçekleştiren bir Ceph bileşeni.

source: A Certificate Revocation List (CRL) in a PKI model is a list of certificates that have been revoked. End entities presenting these certificates should not be trusted.
tr_tr: PKI modelindeki bir Sertifika İptal Listesi (CRL), kaldırılan sertifikaların bir listesidir. Bu sertifikaları sunan son kuruluşlara güvenilmemelidir.

source: A Compute API parameter that downloads changes to the requested item since your last request, instead of downloading a new, fresh set of data and comparing it against the old data.
id: Sebuah API parameter Compute yang mendownload perubahan pada item yang diminta sejak permintaan terakhir Anda, bukan men-download yang baru, segar set data dan membandingkannya terhadap data lama.
tr_tr: Yeni, sıfırdan veri kümesini indirip eski veri ile karşılaştırmak yerine, son istekten beri istenen öğedeki değişiklikleri indiren Hesaplama API parametresidir.

source: A Compute RabbitMQ message queue that remains active when the server restarts.
id: Sebuah antrian pesan Compute RabbitMQ yang tetap aktif saat server restart.
tr_tr: Sunucu yeniden başlatıldığında aktif kalan bir Hesaplama RabbitMQ mesaj kuyruğu.

source: A Compute RabbitMQ setting that determines whether a message exchange is automatically created when the program starts.
id: Pengaturan Hitung RabbitMQ yang menentukan apakah suatu pertukaran pesan secara otomatis dibuat ketika program dijalankan.
tr_tr: Program başladığında bir ileti alışverişinin otomatik olarak oluşturulup oluşturulmayacağını belirleyen bir Hesaplama RabbitMQ ayarı.

source: A Compute back-end database table that contains the current workload, amount of free RAM, and number of VMs running on each host. Used to determine on which host a VM starts.
id: Sebuah Hitung back-end tabel database yang berisi beban kerja saat ini, jumlah RAM bebas, dan jumlah VMs berjalan pada setiap host. Digunakan untuk menentukan di mana host VM dimulai.
tr_tr: Geçerli iş yükünü, boş RAM miktarını ve her ana bilgisayarda çalışan VM'lerin sayısını içeren bir Hesaplama arka uç veritabanı tablosu. Bir VM'nin hangi ana bilgisayarda başlatıldığını belirlemek için kullanılır.

source: A Compute component that determines where VM instances should start. Uses modular design to support a variety of scheduler types.
tr_tr: VM sunucularının nerede başlayacağını belirleyen bir Hesaplama bileşeni. Çeşitli zamanlama türlerini desteklemek için modüler tasarım kullanır.

source: A Compute component that enables OpenStack to communicate with Amazon EC2.
id: Sebuah komponen Compute yang memungkinkan OpenStack untuk berkomunikasi dengan Amazon EC2.
tr_tr: OpenStack'ın Amazon EC2 ile iletişim kurmasını sağlayan bir Hesaplama bileşeni.

source: A Compute component that manages IP address allocation, firewalls, and other network-related tasks. This is the legacy networking option and an alternative to Networking.
tr_tr: IP adresi tahsisi, güvenlik duvarları ve diğer ağ ile ilgili görevleri yöneten bir Hesaplama bileşeni. Bu, eski ağ seçeneği ve Ağ servisine alternatiftir.

source: A Compute component that provides dnsmasq and radvd and sets up forwarding to and from cloudpipe instances.
tr_tr: Dnsmasq ve radvd sağlayan ve cloudpipe sunucularına yönlendirme yapan bir Hesaplama bileşeni.

source: A Compute component that provides users access to the consoles of their VM instances through VNC or VMRC.
tr_tr: Kullanıcıların VM örneklerinin konsollarına VNC veya VMRC aracılığıyla erişmelerini sağlayan bir Hesaplama bileşeni.

source: A Compute component that, along with the notification system, collects meters and usage information. This information can be used for billing.
tr_tr: Bildirim sistemi ile birlikte, sayaçları ve kullanım bilgilerini toplayan bir Hesaplama bileşeni. Bu bilgiler faturalandırma için kullanılabilir.

source: A Compute daemon that orchestrates the network configuration of nodes, including IP addresses, VLANs, and bridging. Also manages routing for both public and private networks.
tr_tr: IP adresleri, VLAN'lar ve köprüleme de dahil olmak üzere düğümlerin ağ yapılandırmasını düzenleyen bir Hesap sunucusu. Hem kamu hem de özel ağlar için yönlendirme yönetir.

source: A Compute networking method where the OS network configuration information is injected into the VM image before the instance starts.
id: Sebuah metode jaringan Hitung mana informasi konfigurasi jaringan OS disuntikkan ke dalam gambar VM sebelum instance dimulai.
tr_tr: Sunucu başlatılmadan önce OS ağ yapılandırma bilgisinin VM imajına enjekte edildiği bir Hesaplama ağ yöntemi.

source: A Compute option that enables parent cells to pass resource requests to child cells if the parent cannot provide the requested resource.
id: Sebuah pilihan Compute yang memungkinkan sel-sel induk untuk lulus permintaan sumber daya untuk sel anak jika orang tua tidak dapat memberikan sumber daya yang diminta.
tr_tr: Ebeveynden istenen kaynağı sağlayamıyorsa üst hücrelerin alt isteklere kaynak istekleri göndermesini sağlayan bir Hesap seçeneği.

source: A Compute process that determines the suitability of the VM instances for a job for a particular host. For example, not enough RAM on the host, too many CPUs on the host, and so on.
tr_tr: Belirli bir ana makine için bir iş için VM sunucularının uygunluğunu belirleyen bir Hesaplama işlemi. Örneğin, ana bilgisayarda yeterli RAM yok, ana bilgisayarda çok fazla CPU vb.

source: A Debian-based Linux distribution.
tr_tr: Debian tabanlı Linux dağıtımı.

source: A Java program that can be embedded into a web page.
id: Sebuah program Java yang dapat tertanam ke dalam halaman web.
tr_tr: Bir web sayfasına yerleştirilebilen bir Java programı.

source: A Linux distribution compatible with OpenStack.
id: Sebuah distribusi Linux yang kompatibel dengan OpenStack.
tr_tr: OpenStack ile uyumlu Linux dağıtımı.

source: A Linux distribution that is compatible with OpenStack.
id: Sebuah distribusi Linux yang kompatibel dengan OpenStack.
tr_tr: OpenStack ile uyumlu bir Linux dağıtımı.

source: A Networking extension that provides perimeter firewall functionality.
id: Sebuah ekstensi Networking yang menyediakan perimeter fungsi firewall.
tr_tr: Çevre güvenlik duvarı işlevselliğini sağlayan bir Ağ uzantısı.

source: A Networking plug-in for Cisco devices and technologies, including UCS and Nexus.
id: Sebuah plug-in Networking untuk perangkat Cisco dan teknologi, termasuk UCS dan Nexus.
tr_tr: UCS ve Nexus'un da dahil olduğu Cisco aygıtları ve teknolojileri için Ağ yönetimi eklentisi.

source: A SQLite database that contains Object Storage accounts and related metadata and that the accounts server accesses.
id: Sebuah database SQLite yang berisi rekening Storage Object dan metadata terkait dan bahwa akun server yang mengakses.
tr_tr: Nesne Depolama hesapları ve ilgili meta verileri içeren ve hesap sunucusunun eriştiği bir SQLite veritabanı.

source: A SQLite database that stores Object Storage containers and container metadata. The container server accesses this database.
id: Sebuah database SQLite yang menyimpan Object Wadah penyimpanan dan metadata kontainer. Server kontainer mengakses database ini.
tr_tr: Nesne Depolama kaplarını ve kap üst verilerini depolayan bir SQLite veritabanı. Kap sunucusu bu veritabanına erişir.

source: A Shared File Systems service that provides a stable RESTful API. The service authenticates and routes requests throughout the Shared File Systems service. There is python-manilaclient to interact with the API.
tr_tr: Stabil bir RESTful API sağlayan Paylaşımlı Dosya Sistemleri hizmeti. Hizmet, istekleri Paylaşımlı Dosya Sistemleri hizmetinde doğrulamakta ve yönlendirmektedir. API ile etkileşim kurmak için python-manilaclient var.

source: A VM image that does not save changes made to its volumes and reverts them to their original state after the instance is terminated.
id: Sebuah gambar VM yang tidak menyimpan perubahan yang dibuat untuk volume dan mengkonversi mereka ke negara asal mereka setelah contoh diakhiri.
tr_tr: Birimlere yapılan değişiklikleri kaydetmeyen ve sunucu kapatıldıktan sonra orijinal durumuna geri döndüren bir VM imajı.

source: A VM instance that runs on a host.
tr_tr: Bir ana bilgisayarda çalışan bir VM sunucu.

source: A VM state where no changes occur (no changes in memory, network communications stop, etc); the VM is frozen but not shut down.
tr_tr: Hiçbir değişiklik meydana gelmeyen bir VM durumu (bellekte herhangi bir değişiklik, ağ iletişimi durdurma, vb.); VM donmuş ancak kapanmıyor.

source: A WSGI app that authenticates and routes requests throughout the Shared File Systems service. It supports the OpenStack APIs.
id: Sebuah aplikasi WSGI yang mengotentikasi dan rute permintaan seluruh layanan Sistem Berkas Bersama. Ini mendukung OpenStack API.
tr_tr: İstekleri Paylaşımlı Dosya Sistemleri servisi üzerinden yönlendiren ve kimlik doğrulama yapan bir WSGI uygulaması. OpenStack API'lerini destekler.

source: A Windows project providing guest initialization features, similar to cloud-init.
id: Sebuah proyek Windows menyediakan fitur inisialisasi tamu, mirip dengan awan-init.
tr_tr: Cloud-init'e benzer şekilde konuk başlatma özellikleri sağlayan bir Windows projesi.

source: A XenAPI component that provides a pluggable interface to support a wide variety of persistent storage back ends.
tr_tr: Çok çeşitli kalıcı depolama arka uçlarını desteklemek için takılabilir bir arabirim sağlayan bir XenAPI bileşeni.

source: A bit is a single digit number that is in base of 2 (either a zero or one). Bandwidth usage is measured in bits per second.
id: Sedikit adalah angka digit tunggal yang ada di dasar 2 (baik nol atau satu). penggunaan bandwidth diukur dalam bit per detik.
tr_tr: Bir bir, 2lik tabanda tek bir sayıdır (ya sıfır, ya bir olabilir). Bant genişliği saniyedeki bit sayısı ile ölçülür.

source: A blob of data that the user can specify when they launch an instance. The instance can access this data through the metadata service or config drive. Commonly used to pass a shell script that the instance runs on boot.
tr_tr: Bir sunucu başlattıklarında kullanıcının belirtebileceği bir miktar veri. Sunucu, bu verilere üst veri hizmeti veya yapılandırma sürücüsü aracılığıyla erişebilir. Genellikle, sunucunun önyükleme işleminde çalıştırdığı bir kabuk komut dosyasını geçirmek için kullanılır.

source: A central agent (``ceilometer-agent-central``)
id: Seorang agen pusat (`` ceilometer-agen-central``)
tr_tr: Merkezi bir aracı (``ceilometer-agent-central``)

source: A central hub for passing messages between daemons. Usually implemented with `RabbitMQ <https://www.rabbitmq.com/>`__, also can be implemented with another AMQP message queue, such as `ZeroMQ <http://www.zeromq.org/>`__.
tr_tr: Artalan işleri arasında iletileri geçirmek için merkezi bir göbek. Genellikle `RabbitMQ <https://www.rabbitmq.com/>`__ ile uygulanır, fakat `ZeroMQ <http://www.zeromq.org/>`__ gibi başkar bir AMQP ileti kuyruğu da kullanılabilir.

source: A centralized server provides authentication and authorization services using a RESTful interface.
id: Sebuah server terpusat menyediakan layanan otentikasi dan otorisasi menggunakan antarmuka tenang.
tr_tr: Merkezi bir sunucu RESTful bir arayüz kullanarak kimlik doğrulama ve yetkilendirme servisleri sağlar.

source: A cinder component that interacts with back-end storage to manage the creation and deletion of volumes and the creation of compute volumes, provided by the cinder-volume daemon.
tr_tr: Cinder-volum arka plan programı tarafından sağlanan disk bölümlerinin oluşturulmasını ve silinmesini ve hesaplama disk bölümlerinin oluşturulmasını yönetmek için arka uç depolama alanıyla etkileşime giren bir cinder bileşeni.

source: A cli tool used to retrieve various metrics and telemetry information about a cluster that has been collected by the swift-recon middleware.
id: Sebuah alat cli digunakan untuk mengambil berbagai metrik dan informasi telemetri tentang cluster yang telah dikumpulkan oleh middleware cepat-pengintaian.
tr_tr: swift-recon ara yazılımı tarafından toplanan küme hakkındaki telemetri bilgisini ve çeşitli ölçümleri almada kullanılan bir cli aracı.

source: A collection of command-line tools for administering VMs; most are compatible with OpenStack.
id: Sebuah kumpulan alat baris perintah untuk mengelola VMs; yang paling kompatibel dengan OpenStack.
tr_tr: VM'leri yönetmek için bir komut satırı araçları topluluğu; çoğu OpenStack ile uyumludur.

source: A collection of components that provides object storage within Ceph. Similar to OpenStack Object Storage.
tr_tr: Ceph içinde nesne saklama alanı sağlayan bileşenlerden oluşan bir koleksiyon. OpenStack Nesne Depolamaya benzer.

source: A collection of files for a specific operating system (OS) that you use to create or rebuild a server. OpenStack provides pre-built images. You can also create custom images, or snapshots, from servers that you have launched. Custom images can be used for data backups or as "gold" images for additional servers.
id: Sebuah kumpulan file untuk sistem operasi tertentu (OS) yang Anda gunakan untuk membuat atau membangun kembali server. OpenStack memberikan gambar pre-built. Anda juga dapat membuat gambar kustom, atau snapshot, dari server yang telah Anda diluncurkan. gambar kustom dapat digunakan untuk backup data atau sebagai "emas" gambar untuk server tambahan.
tr_tr: Sunucuyu oluşturmak veya yeniden oluşturmak için kullandığınız belirli bir işletim sistemi (OS) için bir dosya koleksiyonu. OpenStack, önceden oluşturulmuş imajlar sağlar. Başlattığınız sunuculardan özel imajlar veya anlık görüntüler de oluşturabilirsiniz. Özel imajlar veri yedeklemeleri için veya ek sunucular için "altın" imajlar olarak kullanılabilir.

source: A collection of hypervisors grouped together through host aggregates.
id: Koleksi hypervisors dikelompokkan bersama-sama melalui agregat tuan rumah.
tr_tr: Sunucu toplama aracılığıyla gruplandırılmış bir dizi hiper yönetici.

source: A collection of servers that can share IPs with other members of the group. Any server in a group can share one or more public IPs with any other server in the group. With the exception of the first server in a shared IP group, servers must be launched into shared IP groups. A server may be a member of only one shared IP group.
tr_tr: IP'leri grubun diğer üyeleriyle paylaşabilen sunucular topluluğu. Bir gruptaki herhangi bir sunucu, bir veya daha fazla genel IP'yi gruptaki diğer sunucularla paylaşabilir. Paylaşılan bir IP grubundaki ilk sunucu hariç olmak üzere, sunucuların paylaşılan IP gruplarına başlatılması gerekir. Sunucu, yalnızca bir paylaşılan IP grubunun üyesi olabilir.

source: A collection of specifications used to access a service, application, or program. Includes service calls, required parameters for each call, and the expected return values.
id: Koleksi spesifikasi yang digunakan untuk mengakses layanan, aplikasi, atau program. Termasuk layanan panggilan, parameter yang diperlukan untuk setiap panggilan, dan kembali nilai-nilai yang diharapkan.
tr_tr: Bir hizmete, uygulamaya veya programa erişmek için kullanılan özellikler topluluğu. Hizmet çağrıları, her çağrı için gerekli parametreler ve beklenen dönüş değerleri içerir.

source: A collector (``ceilometer-collector``)
id: Seorang kolektor (`` ceilometer-collector``)
tr_tr: Bir toplayıcı (``ceilometer-collector``)

source: A comment with additional information that explains a part of the text.
id: Sebuah komentar dengan informasi tambahan yang menjelaskan bagian dari teks.
tr_tr: Metnin bir bölümünü açıklayan ek bilgili bir yorum.

source: A common API for vendors, admins, services, and users to meaningfully define their own custom metadata. This metadata can be used on different types of resources like images, artifacts, volumes, flavors, and aggregates. A definition includes the new property's key, description, constraints, and the resource types which it can be associated with.
id: Sebuah API umum untuk vendor, admin, layanan, dan pengguna untuk bermakna menentukan metadata kustom mereka sendiri. metadata ini dapat digunakan pada berbagai jenis sumber daya seperti gambar, artefak, volume, rasa, dan agregat. Definisi termasuk kunci properti baru, deskripsi, kendala, dan jenis sumber daya yang dapat dikaitkan dengan.
tr_tr: Üreticiler, yöneticiler, servisler ve kullanıcılar için kendi özel metaverilerini anlamlı şekilde tanımlayabilmeleri için ortak bir API. Bu metaveri imajlar, yapılar, birimler, nitelikler ve takımlar gibi farklı kaynak türlerinde kullanılabilir. Tanım yeni özelliğin anahtarını, tanımını, kısıtlamalarını ve ilişkili kaynak türlerini içerir.

source: A community project may be elevated to this status and is then promoted to a core project.
id: Sebuah proyek komunitas dapat diangkat ke status ini dan kemudian dipromosikan untuk sebuah proyek inti.
tr_tr: Topluluk projesi bu statüye yükseltilebilir ve daha sonra çekirdek bir projeye terfi edilebilir.

source: A compute agent (``ceilometer-agent-compute``)
id: Seorang agen menghitung (`` ceilometer-agen-compute``)
tr_tr: Bir hesaplama aracısı (``ceilometer-agent-compute``)

source: A compute service that creates VPNs on a per-project basis.
id: Sebuah layanan komputasi yang menciptakan VPN pada basis per-proyek.
tr_tr: VPN'leri proje bazında oluşturan bir hesaplama hizmeti.

source: A configurable option within Object Storage to automatically delete objects after a specified amount of time has passed or a certain date is reached.
tr_tr: Nesne Depolama Alanı içinde, belirli bir süre dolduktan sonra veya belirli bir tarihe ulaştıktan sonra nesneleri otomatik olarak silmek için yapılandırılabilir bir seçenek.

source: A content delivery network is a specialized network that is used to distribute content to clients, typically located close to the client for increased performance.
id: Sebuah jaringan pengiriman konten adalah jaringan khusus yang digunakan untuk mendistribusikan konten ke klien, biasanya terletak dekat dengan klien untuk meningkatkan kinerja.
tr_tr: Bir içerik dağıtım ağı, içeriği müşterilere dağıtmak için kullanılan, genellikle artan performans için istemcinin yakınında bulunan özel bir ağdır.

source: A controlled reboot where a VM instance is properly restarted through operating system commands.
tr_tr: Bir VM kopyasının işletim sistemi komutlarıyla düzgün şekilde yeniden başlatıldığı kontrollü bir yeniden başlatma.
