Repository: 25hours/openstack-manuals
Catalog: doc/common/source/locale/*/LC_MESSAGES/common.po
Languages: id, tr_tr

source: New snapshot state. (“available”, “error”, “creating”, “deleting”, or “error_deleting”) (admin only) (This option simply changes the state of the snapshot in the database with no regard to actual status, exercise caution when using)
tr_tr: Yeni anlık görüntü durumu. (“kullanılabilir”, “hata”, “oluşturuluyor”, “siliniyor” veya “silmede_hata”) (yalnızca yönetici) (Bu seçenek basitçe anlık görüntünün veritabanındaki durumunu güncel durumundan bağımsız olarak değiştirir, dikkatli kullanın)

source: New users are assigned to this project if no project is specified when a user is created.
tr_tr: Bir kullanıcı oluşturulduğunda herhangi bir proje belirtilmezse, yeni kullanıcılar bu projeye atanır.

source: Newton
tr_tr: kuruluşların QoS, ACL'ler veya IDS gibi gelişmiş özellikler için özel eklentiler oluşturmalarını sağlayan Ağ içindeki arabirim.

source: Nexenta volume driver
tr_tr: Nexenta disk bölümü sürücüsü

source: No ACK
tr_tr: ACK yok

source: Note that extra dependencies may be required, per operating system, depending on the package being installed, such as is the case with Tempest.
id: Perhatikan bahwa dependensi ekstra mungkin diperlukan, per sistem operasi, tergantung pada paket yang diinstal, seperti halnya dengan Tempest.
tr_tr: Tempest durumunda olduğu gibi, kurulan pakete bağlı olarak işletim sistemine göre ek bağımlılıkların gerekli olabileceğini unutmayın.

source: Note that the volume is now available.
id: Perhatikan bahwa volume sekarang tersedia.
tr_tr: Birimin artık kullanılabilir olduğuna dikkat edin.

source: Notices
id: pemberitahuan
tr_tr: Uyarılar

source: Notices take these forms:
id: Pemberitahuan mengambil bentuk-bentuk:
tr_tr: Uyarılar bu biçemleri alır:

source: Number that is unique to every computer system on the Internet. Two versions of the Internet Protocol (IP) are in use for addresses: IPv4 and IPv6.
id: Jumlah yang unik untuk setiap sistem komputer di Internet. Dua versi dari Internet Protocol (IP) yang digunakan untuk alamat: IPv4 dan IPv6.
tr_tr: İnternetteki her bilgisayar sistemine özgü numara. Internet Protokolünün (IP) iki sürümü, adresler için kullanılmaktadır: IPv4 ve IPv6.

source: Object Storage (swift)
tr_tr: Nesne Depolama (swift)

source: Object Storage API
tr_tr: Nesne Depolama API

source: Object Storage Device (OSD)
tr_tr: Nesne Depolama Aygıtı (OSD)

source: Object Storage middleware that uploads (posts) an image through a form on a web page.
id: Object Storage middleware yang di upload (posting) gambar melalui formulir di halaman web.
tr_tr: Nesne Depolama ara katmanı, bir imajı bir web sayfasındaki bir form üzerinden yükler (gönderir).

source: Object Storage service
id: Layanan Penyimpanan objek
tr_tr: Nesne Depolama servisi

source: Object Storage service (swift)
tr_tr: Nesne Depolama servisi (swift)

source: Object Storage service overview
id: ikhtisar layanan penyimpanan objek
tr_tr: Nesne Depolama servisi genel görünümü

source: Object servers (swift-object-server)
tr_tr: Nesne sunucuları (swift-object-server)

source: Oldie
tr_tr: Eski

source: On Red Hat Enterprise Linux or CentOS, use ``yum`` to install the clients from the packaged versions:
tr_tr: Red Hat Kurumsal Linux veya CentOS üzerinde istemcileri paketli sürümlerinden kurmak için ``yum`` kullanın:

source: On Red Hat Enterprise Linux, this command assumes that you have enabled the OpenStack repository. For more information, see the `Installation Tutorial for Red Hat Enterprise Linux and CentOS <https://docs.openstack.org/ocata/install-guide-rdo/environment-packages.html>`_.
tr_tr: Red Hat Kurumsal Linux üzerinde, bu komut OpenStack deposunu etkinleştirdiğinizi varsayar. Daha fazla bilgi için, `Red Hat Kurumsal Linux ve CentOS için Kurulum Öğreticisine <https://docs.openstack.org/ocata/install-guide-rdo/environment-packages.html>`_ göz atın.

source: On any shell from which you want to run OpenStack commands, source the ``PROJECT-openrc.sh`` file for the respective project.
id: Pada shell apapun dari yang Anda ingin menjalankan OpenStack perintah, sumber yang `` berkas PROJECT-openrc.sh`` untuk proyek masing-masing.
tr_tr: OpenStack komutları çalıştırmak istediğiniz herhangi bir kabuk üzerinde, ``PROJE-openrc.sh`` dosyasını ilgili proje için kaynak edin.

source: On any shell from which you want to run OpenStack commands, source the ``PROJECT-openrc.sh`` file for the respective project. In this example, you source the ``admin-openrc.sh`` file for the admin project:
id: Pada shell apapun dari yang Anda ingin menjalankan OpenStack perintah, sumber yang `` berkas PROJECT-openrc.sh`` untuk proyek masing-masing. Dalam contoh ini, Anda sumber `` file yang admin-openrc.sh`` untuk proyek admin:
tr_tr: OpenStack komutları çalıştırmak istediğiniz herhangi bir kabuk üzerinde, ``PROJE-openrc.sh`` dosyasını ilgili proje için kaynak edin. Bu örnekte, admin projesi için ``admin-openrc.sh`` dosyasını kaynak edersiniz:

source: On the :guilabel:`API Access` tab, click :guilabel:`Download OpenStack RC File` and save the file. The filename will be of the form ``PROJECT-openrc.sh`` where ``PROJECT`` is the name of the project for which you downloaded the file.
id: Pada: guilabel: `API Access` tab, klik: guilabel:` Ambil OpenStack RC file` dan menyimpan file. nama file akan menjadi bentuk `` PROJECT-openrc.sh`` mana `` PROJECT`` adalah nama proyek yang Anda download file.
tr_tr: :guilabel:`API Erişimi` sekmesinde, :guilabel:`OpenStack RC Dosyasını İndir`'e tıklayın ve dosyayı kaydedin. Dosya ismi ``PROJE`` dosyasını indirdiğiniz projenin ismi olmak üzere ``PROJE-openrc.sh`` biçiminde olacaktır.

source: On the :guilabel:`Project` tab, open the :guilabel:`Compute` tab and click :guilabel:`Access & Security`.
id: Pada: label gui: `tab project`, buka: gui label:` tab Compute` dan klik: guilabel: `Access & Security`.
tr_tr: :guilabel:`Proje` sekmesinde, :guilabel:`Hesaplama` sekmesini açın ve :guilabel:`Erişim & Güvenlik`'e tıklayın.

source: On-instance / ephemeral
tr_tr: Sunucu üzerinde / geçici

source: One of the RPC primitives used by the OpenStack message queue software. Sends a message and does not wait for a response.
id: Salah satu primitif RPC digunakan oleh perangkat lunak pesan antrian OpenStack. Mengirim pesan dan tidak menunggu jawaban.
tr_tr: OpenStack ileti kuyruğu yazılımı tarafından kullanılan RPC ilkel öğelerinden biri. Bir ileti gönderir ve yanıt beklemez.

source: One of the RPC primitives used by the OpenStack message queue software. Sends a message and waits for a response.
id: Salah satu primitif RPC digunakan oleh perangkat lunak pesan antrian OpenStack. Mengirim pesan dan menunggu respons.
tr_tr: OpenStack ileti kuyruğu yazılımı tarafından kullanılan RPC ilkel öğelerinden biri. Bir ileti gönderir ve bir yanıt bekler.

source: One of the VM image disk formats supported by Image service.
tr_tr: İmaj hizmeti tarafından desteklenen VM imaj disk formatlarından biri.

source: One of the VM image disk formats supported by Image service; an unstructured disk image.
tr_tr: İmaj hizmeti tarafından desteklenen VM imajı disk formatlarından biri; yapılandırılmamış bir disk imajı.

source: One of the default roles in the Compute RBAC system and the default role assigned to a new user.
id: Salah satu peran default di sistem Hitung RBAC dan peran default ditugaskan untuk pengguna baru.
tr_tr: Hesaplama RBAC sistemindeki varsayılan rollerden biri ve yeni bir kullanıcıya atanan varsayılan rota.

source: One of the default roles in the Compute RBAC system. Enables a user to add other users to a project, interact with VM images that are associated with the project, and start and stop VM instances.
tr_tr: Compute RBAC sistemindeki varsayılan rollerden biri. Bir kullanıcının bir projeye diğer kullanıcıları eklemesine, projeyle ilişkili VM imajlarıyla etkileşime girmesine ve VM sunucularını başlatmasına ve durdurmasına olanak tanır.

source: One of the default roles in the Compute RBAC system. Enables the user to allocate publicly accessible IP addresses to instances and change firewall rules.
tr_tr: Hesaplama RBAC sistemindeki varsayılan rollerden biri. Kullanıcının, herkese açık IP adreslerini sunuculara tahsis etmesini ve güvenlik duvarı kurallarını değiştirmesini sağlar.

source: One of the default roles in the Compute RBAC system. Grants complete system access.
id: Salah satu peran default di sistem Hitung RBAC. Hibah akses sistem yang lengkap.
tr_tr: Compute RBAC sistemindeki varsayılan rollerden biri. Sisteme tam erişim sağlar.

source: One of the hypervisors supported by OpenStack.
id: Salah satu hypervisors didukung oleh OpenStack.
tr_tr: OpenStack tarafından desteklenen hipervizörlerden biri.

source: One of the supported response formats in OpenStack.
tr_tr: OpenStack'te desteklenen cevap biçemlerinden biri.

source: Open Cloud Computing Interface (OCCI)
tr_tr: Açık Bulut Hesaplama Arayüzü (OCCI)

source: Open Virtualization Format (OVF)
tr_tr: Açık Sanallaştırma Formatı (OVF)

source: Open source GUI and CLI tools used for remote console access to VMs. Supported by Compute.
tr_tr: VM'lere uzak konsol erişimi için kullanılan açık kaynak GUI ve CLI araçları. Hesaplama tarafından desteklenmektedir.

source: Open source tool used to access remote hosts through an encrypted communications channel, SSH key injection is supported by Compute.
tr_tr: Şifrelenmiş bir iletişim kanalı vasıtasıyla uzaktaki ana makinelere erişmek için kullanılan açık kaynaklı araç, Hesaplama tarafından SSH anahtar enjeksiyonu desteklenmektedir.

source: Open vSwitch (OVS) agent
tr_tr: Open vSwitch (OVS) ajanı

source: Open vSwitch is a production quality, multilayer virtual switch licensed under the open source Apache 2.0 license. It is designed to enable massive network automation through programmatic extension, while still supporting standard management interfaces and protocols (for example NetFlow, sFlow, SPAN, RSPAN, CLI, LACP, 802.1ag).
tr_tr: Open vSwitch, açık kaynak kodlu Apache 2.0 lisansı altında lisanslanan, çok katmanlı bir sanal anahtar, üretim kalitesidir. Standart yönetim arabirimlerini ve protokollerini (örneğin NetFlow, sFlow, SPAN, RSPAN, CLI, LACP, 802.1ag) desteklemeye devam ederken, programlı genişletme yoluyla devasa ağ otomasyonunu etkinleştirmek üzere tasarlanmıştır.

source: Open vSwitch neutron plug-in
tr_tr: Open vSwitch neutron eklentisi

source: OpenStack APIs are open-source Python clients, and can run on Linux or Mac OS X systems. On some client commands, you can specify a debug parameter to show the underlying API request for the command. This is a good way to become familiar with the OpenStack API calls.
id: OpenStack API adalah open-source Python klien, dan dapat berjalan di Linux atau Mac OS X sistem. Pada beberapa perintah klien, Anda dapat menentukan parameter debug untuk menunjukkan permintaan API yang mendasari perintah. Ini adalah cara yang baik untuk menjadi akrab dengan OpenStack API panggilan.
tr_tr: OpenStack API'leri açık kaynaklı Python istemcileridir, ve Linux veya Mac OS X sistemler üzerinde çalışabilirler. Bazı istemci komutlarında, altta yatan API isteklerini göstermesi için komut için hata ayıklama parametreleri belirtebilirsiniz. Bu OpenStack API çağrılarına aşina olmak için iyi bir yoldur.

source: OpenStack Compute consists of the following areas and their components:
id: OpenStack Compute terdiri dari bidang-bidang berikut dan komponen mereka:
tr_tr: OpenStack Hesaplama şu alanlardan ve bileşenlerden oluşur:

source: OpenStack Compute interacts with OpenStack Identity for authentication; OpenStack Image service for disk and server images; and OpenStack Dashboard for the user and administrative interface. Image access is limited by projects, and by users; quotas are limited per project (the number of instances, for example). OpenStack Compute can scale horizontally on standard hardware, and download images to launch instances.
tr_tr: OpenStack Hesaplama kimlik doğrulama için OpenStack Kimlik ile; Disk ve sunucu imajları için OpenStack İmaj; ve kullanıcı ve yönetim arayüzü için OpenStack Kontrol Panosuyla etkileşir. İmaj erişimi projelerce ve kullanıcılarca sınırlandırılmıştır; kotalar proje başına sınırlıdır (sunucu sayısı mesela). OpenStack Hesaplama standart donanım üzerinde yatay olarak ölçeklenebilir, ve sunucu başlatmak için imajlar indirebilir.

source: OpenStack Networking (neutron) allows you to create and attach interface devices managed by other OpenStack services to networks. Plug-ins can be implemented to accommodate different networking equipment and software, providing flexibility to OpenStack architecture and deployment.
id: OpenStack Jaringan (neutron) memungkinkan Anda untuk membuat dan memasang perangkat antarmuka dikelola oleh layanan OpenStack lainnya ke jaringan. Plug-in dapat diimplementasikan untuk mengakomodasi peralatan jaringan yang berbeda dan perangkat lunak, memberikan fleksibilitas untuk arsitektur OpenStack dan penyebaran.
tr_tr: OpenStack Ağı (neutron) diğer OpenStack servisleri tarafından yönetilen arayüz aygıtlarını oluşturmanızı ve ağlara eklemenizi sağlar. Farklı ağ ekipmanı ve yazılımı için eklentiler uygulanarak OpenStack mimarisi ve kurulumuna esneklik sağlanabilir.

source: OpenStack Networking agent that provides DHCP services for virtual networks.
id: agen OpenStack Networking yang menyediakan layanan DHCP untuk jaringan virtual.
tr_tr: Sanal ağlar için DHCP hizmetleri sağlayan OpenStack Ağ ajanı.

source: OpenStack Networking agent that provides layer-2 connectivity for virtual networks.
tr_tr: Sanal ağlar için katman-2 bağlantısı sağlayan OpenStack Ağ ajanı.

source: OpenStack Networking agent that provides layer-3 (routing) services for virtual networks.
tr_tr: Sanal ağlar için katman-3 (yönlendirme) hizmetleri sağlayan OpenStack Ağ ajan.

source: OpenStack Networking agent that provides metadata services for instances.
tr_tr: Sunucular için üst veri hizmetleri sağlayan OpenStack Ağ ajan.

source: OpenStack Networking mainly interacts with OpenStack Compute to provide networks and connectivity for its instances.
id: OpenStack Networking terutama berinteraksi dengan OpenStack Compute untuk menyediakan jaringan dan konektivitas untuk kasus tersebut.
tr_tr: OpenStack Ağı temelde OpenStack Hesaplama ile etkileşim kurarak sunucuları için ağ ve bağlantı sağlar.

source: OpenStack Networking plug-ins and agents
id: plugin dan agen OpenStack Jaringan
tr_tr: OpenStack Ağ eklentileri ve aracıları

source: OpenStack Services
id: Layanan OpenStack
tr_tr: OpenStack Servisleri

source: OpenStack code name
tr_tr: OpenStack kod adı

source: OpenStack command-line clients prerequisites
id: OpenStack baris perintah klien prasyarat
tr_tr: OpenStack komut satırı istemcileri ön koşulları

source: OpenStack distribution packages
id: paket distribusi OpenStack
tr_tr: OpenStack dağıtım paketleri

source: OpenStack is a cloud operating system that controls large pools of compute, storage, and networking resources throughout a data center, all managed through a dashboard that gives administrators control while empowering their users to provision resources through a web interface. OpenStack is an open source project licensed under the Apache License 2.0.
tr_tr: OpenStack, bir veri merkezi boyunca hesaplama, depolama ve ağ kaynaklarının büyük havuzlarını kontrol eden ve tüm kullanıcıların bir web arabirimi aracılığıyla kaynak sağlama yetkisi vererek yöneticileri kontrol etmesini sağlayan bir kontrol paneliyle yönetilen bir bulut işletim sistemidir. OpenStack, Apache License 2.0 kapsamında lisanslı açık kaynaklı bir projedir.

source: OpenStack mailing lists
id: OpenStack milis
tr_tr: OpenStack e-posta listeleri

source: OpenStack project that aims to make cloud services easier to consume and integrate with application development process by automating the source-to-image process, and simplifying app-centric deployment.
tr_tr: OpenStack projesi, bulut servislerini kaynaktan görüntü sürecini otomatikleştirerek ve uygulama merkezli dağıtımı basitleştirerek uygulama geliştirme süreciyle tüketimini ve entegrasyonunu kolaylaştırmayı amaçlıyor.

source: OpenStack project that aims to organize, analyze and visualize OpenStack alarms and events, yield insights regarding the root cause of problems and deduce their existence before they are directly detected.
tr_tr: OpenStack alarmlarını ve olaylarını organize etmeyi, analiz etmeyi ve görselleştirmeyi amaçlayan OpenStack projesi, sorunların ana sebebine ilişkin anlayışlar üretir ve var olduklarını doğrudan algılamadan önce çıkarır.

source: OpenStack project that aims to provide a flexible and scalable resource optimization service for multi-project OpenStack-based clouds.
tr_tr: OpenStack projesi, çoklu proje OpenStack tabanlı bulutlar için esnek ve ölçeklenebilir bir kaynak eniyileştirme hizmeti sunmayı amaçlıyor.

source: OpenStack project that provides a framework for performance analysis and benchmarking of individual OpenStack components as well as full production OpenStack cloud deployments.
tr_tr: Her bir OpenStack bileşenleri ve tam üretim OpenStack bulut dağıtımlarının performans analizi ve karşılaştırması için bir çerçeve sağlayan OpenStack projesi.

source: OpenStack project that provides a scalable data-processing stack and associated management interfaces.
tr_tr: Ölçeklenebilir veri işleme yığını ve ilişkili yönetim arabirimleri sağlayan OpenStack projesi.

source: OpenStack project that provides scalable, on demand, self service access to authoritative DNS services, in a technology-agnostic manner.
tr_tr: Yetkili DNS hizmetlerine ölçeklenebilir, isteğe bağlı, self servis erişim sağlayan, teknoloji bakımından bağımsız bir şekilde OpenStack projesi.

source: OpenStack project which provides an extensible, unified, web-based user interface for all OpenStack services.
tr_tr: OpenStack projesi, tüm OpenStack hizmetleri için genişletilebilir, birleştirilmiş, web tabanlı kullanıcı arabirimi sağlar.

source: OpenStack provides an :term:`Infrastructure-as-a-Service (IaaS)` solution through a set of interrelated services. Each service offers an :term:`application programming interface (API)` that facilitates this integration. Depending on your needs, you can install some or all services.
tr_tr: OpenStack bağımsız bir servis kümesi ile bir :term:`Servis olarak Altyapı (IaaS)` çözümü sağlar. Her servis bu tümleştirmeye bağlı bir :term:`uygulama programlama arayüzü (API)` sunar. İhtiyacınıza bağlı olarak bazı servisleri veya tüm servisleri kurabilirsiniz.

source: OpenStack service that aims to implement Network Function Virtualization (NFV) orchestration services and libraries for end-to-end life-cycle management of network services and Virtual Network Functions (VNFs).
tr_tr: Ağ hizmetlerinin ve Sanal Ağ İşlevleri'nin (VNF'ler) uçtan uca yaşam döngüsü yönetimi için Ağ İşlevleri Sanallaştırma (NFV) orkestrasyon hizmetlerini ve kütüphanelerini uygulamayı amaçlayan OpenStack hizmeti.

source: OpenStack services
id: layanan OpenStack
tr_tr: OpenStack servisleri

source: OpenStack services and clients
id: layanan OpenStack dan klien
tr_tr: OpenStack servisleri ve istemcileri

source: OpenStack supports accessing the Amazon EC2 API through Compute.
id: OpenStack mendukung mengakses API Amazon EC2 melalui Compute.
tr_tr: OpenStack, Amazon EC2 API'sine Hesaplama üzerinden erişilmesini destekler.

source: OpenStack supports encryption technologies such as HTTPS, SSH, SSL, TLS, digital certificates, and data encryption.
tr_tr: OpenStack, HTTPS, SSH, SSL, TLS, dijital sertifikalar ve veri şifreleme gibi şifreleme teknolojilerini destekler.

source: OpenStack-on-OpenStack program. The code name for the OpenStack Deployment program.
tr_tr: OpenStack-on-OpenStack programı. OpenStack Yayınlama programı için kod ad.

source: OpenStackClient project provides a unified command-line client, which enables you to access the project API through easy-to-use commands. Also, most OpenStack project provides a command-line client for each service. For example, the Compute service provides a ``nova`` command-line client.
tr_tr: OpenStackClient projesi proje API'sine kullanımı kolay komutlar aracılığıyla erişebilmeniz için birleştirilmiş bir komut satırı istemcisi sağlar. Ayrıca, çoğu OpenStack projesi her bir servis için bir komut satırı istemcisi sağlar. Örneğin, Hesaplama servisi bir ``nova`` komut satırı istemcisi sağlar.

source: Opens all objects for an object server and verifies the MD5 hash, size, and metadata for each object.
tr_tr: Bir nesne sunucusu için tüm nesneleri açar ve her nesne için MD5 karması, boyut ve meta verileri doğrular.

source: Optionally, to confirm the upload in Image service, run:
id: Opsional, untuk mengkonfirmasi upload dalam layanan Gambar, jalankan:
tr_tr: İsteğe bağlı olarak, imaj servisinde yüklemeyi onaylamak için şunu çalıştırın:

source: Optionally, you can specify a name for the transfer by using the ``--name transferName`` parameter.
tr_tr: İsteğe bağlı olarak, ``--name transferName`` parametresini kullanarak aktarım için bir isim belirtebilirsiniz.

source: Orchestrates multiple composite cloud applications by using either the native HOT template format or the AWS CloudFormation template format, through both an OpenStack-native REST API and a CloudFormation-compatible Query API.
id: Orchestrates beberapa aplikasi cloud komposit dengan menggunakan salah satu template format HOT asli atau format template yang AWS CloudFormation, baik melalui sebuah SISA API OpenStack-pribumi dan CloudFormation-kompatibel Query API.
tr_tr: Birden çok bileşik bulut uygulamasını yerel HOT şablon biçimiyle veya AWS CloudFormation şablonu biçimiyle, hem OpenStack'e özel REST API'si ile hem CloudFormation uyumlu Sorgu API'si aracılığıyla yönetir.

source: Orchestrates the launching of templates and provides events back to the API consumer.
id: Orchestrates peluncuran template dan menyediakan acara kembali ke API konsumen.
tr_tr: Şablonların başlatılmasını düzenler ve API tüketicisine olaylar olarak geri dönüş yapar.

source: Orchestration service
id: orkestrasi layanan
tr_tr: Orkestrasyon servisi

source: Orchestration service (heat)
tr_tr: Orkestrasyon servisi (heat)

source: Orchestration service overview
id: ikhtisar layanan orkestrasi
tr_tr: Orkestrasyion servisi genel görünümü

source: Organizes and stores objects in Object Storage. Similar to the concept of a Linux directory but cannot be nested. Alternative term for an Image service container format.
id: Mengatur dan menyimpan objek dalam Object Storage. Mirip dengan konsep sebuah direktori Linux tetapi tidak dapat bersarang. istilah alternatif untuk format kontainer layanan Image.
tr_tr: Organize eder ve nesneleri Nesne Depolama Birimi'nde saklar. Bir Linux dizini kavramına benzer ancak iç içe yerleştirilemez. Bir Resim servis kabı biçimi için alternatif terim.

source: Override environment variable values
id: Mengesampingkan nilai-nilai variabel lingkungan
tr_tr: Çevre değişkeni değerlerinin üzerine yazın

source: PCI passthrough
tr_tr: PCI düz geçiş

source: Package
id: Paket
tr_tr: Paket

source: Pages that use HTML, JavaScript, and Cascading Style Sheets to enable users to interact with a web page or show simple animation.
id: Halaman yang menggunakan HTML, JavaScript, dan Cascading Style Sheets untuk memungkinkan pengguna untuk berinteraksi dengan halaman web atau menunjukkan animasi sederhana.
tr_tr: Kullanıcıların bir web sayfası ile ilertişim kurmasını sağlayan veya basit bir canlandırma gösteren, HTML, JavaScript ve Basamaklı Stil Şablonları kullanan sayfalar.

source: Part of the OpenStack :term:`Telemetry service <Telemetry service (telemetry)>`; gathers and stores metrics from other OpenStack services.
tr_tr: OpenStack :term:`Telemetry servisi <Telemetry service (telemetry)>`nin bir parçası; diğer OpenStack servislerinden ölçümleri toplar ve saklar.
