Repository: 25hours/openstack-manuals
Catalog: doc/common/source/locale/*/LC_MESSAGES/common.po
Languages: id, tr_tr

source: Certificate Authority or Certification Authority. In cryptography, an entity that issues digital certificates. The digital certificate certifies the ownership of a public key by the named subject of the certificate. This enables others (relying parties) to rely upon signatures or assertions made by the private key that corresponds to the certified public key. In this model of trust relationships, a CA is a trusted third party for both the subject (owner) of the certificate and the party relying upon the certificate. CAs are characteristic of many public key infrastructure (PKI) schemes.
id: Otoritas sertifikat atau Otoritas Sertifikasi. Dalam kriptografi, sebuah entitas yang mengeluarkan sertifikat digital. Sertifikat digital mengesahkan kepemilikan kunci publik oleh subjek bernama sertifikat. Hal ini memungkinkan orang lain (mengandalkan pihak) bergantung pada tanda tangan atau pernyataan yang dibuat oleh kunci pribadi yang sesuai dengan kunci publik bersertifikat. Dalam model ini hubungan kepercayaan, CA adalah pihak ketiga yang dipercaya untuk kedua subjek (pemilik) sertifikat dan pihak mengandalkan sertifikat. CA merupakan ciri khas dari banyak kunci infrastruktur (PKI) skema public.

source: Change the colors and image file names as appropriate, though the relative directory paths should be the same. The following example file shows you how to customize your CSS file:
id: Mengubah warna dan nama file gambar yang sesuai, meskipun jalur direktori relatif harus sama. Contoh berikut file menunjukkan Anda bagaimana untuk menyesuaikan file CSS Anda:

source: Choose glance image which has "cinder_img_volume_type" property and create a volume from the image.
id: Pilih gambar sekilas yang memiliki "cinder_img_volume_type" properti dan membuat volume dari gambar.

source: Code name for the DNS service project for OpenStack.
id: Nama kode untuk proyek layanan DNS untuk OpenStack.

source: Code name of the key management service for OpenStack.
id: kode nama layanan manajemen kunci untuk OpenStack.

source: Create a volume with 8 gibibytes (GiB) of space, and specify the availability zone and image:
id: Membuat volume dengan 8 gigabyte (GB) ruang, dan menentukan zona ketersediaan dan gambar:

source: Create two PNG logo files with transparent backgrounds using the following sizes:
id: Membuat dua file logo PNG dengan latar belakang transparan menggunakan ukuran berikut:

source: Creates and manages Hadoop clusters on OpenStack.
id: Menciptakan dan mengelola cluster Hadoop pada OpenStack.

source: Creates and manages users, tenants, roles, endpoints, and credentials.
id: Menciptakan dan mengelola pengguna, penyewa, peran, endpoint, dan kredensial.

source: Currently, the clients do not support Python 3.
id: Saat ini, klien tidak mendukung Python 3.

source: Customize the dashboard
id: Menyesuaikan dashboard

source: Data Processing service
id: Layanan Data Processing

source: Deletes all image properties that are not explicitly set in the update request. Otherwise, those properties not referenced are preserved.
id: Menghapus semua sifat gambar yang tidak secara eksplisit diatur dalam permintaan update. Jika tidak, properti-properti tidak dirujuk yang diawetkan.

source: Description of the snapshot. Defaults to ``None``.
id: Deskripsi snapshot. Standarnya `` None``.

source: Discretionary access control. Governs the ability of subjects to access objects, while enabling users to make policy decisions and assign security attributes. The traditional UNIX system of users, groups, and read-write-execute permissions is an example of DAC.
id: kontrol akses discretionary. Mengatur kemampuan subyek untuk mengakses objek, sementara memungkinkan pengguna untuk membuat keputusan kebijakan dan menetapkan atribut keamanan. Sistem UNIX tradisional pengguna, kelompok, dan membaca-menulis-izin eksekusi adalah contoh dari DAC.

source: Domain Name System. A hierarchical and distributed naming system for computers, services, and resources connected to the Internet or a private network. Associates human-friendly, domain names to IP addresses.
id: Domain Name System. Sebuah sistem penamaan hirarkis dan didistribusikan untuk komputer, jasa, dan sumber daya yang terhubung ke Internet atau jaringan pribadi. Associates manusia-ramah, nama domain ke alamat IP.

source: During the set up or testing of OpenStack, you might have questions about how a specific task is completed or be in a situation where a feature does not work correctly. Use the `ask.openstack.org <https://ask.openstack.org>`__ site to ask questions and get answers. When you visit the https://ask.openstack.org site, scan the recently asked questions to see whether your question has already been answered. If not, ask a new question. Be sure to give a clear, concise summary in the title and provide as much detail as possible in the description. Paste in your command output or stack traces, links to screen shots, and any other information which might be useful.
id: Selama mengatur atau pengujian OpenStack, Anda mungkin memiliki pertanyaan tentang bagaimana tugas tertentu selesai atau berada dalam situasi di mana fitur tidak bekerja dengan benar. Gunakan `ask.openstack.org <https://ask.openstack.org>` __ situs untuk mengajukan pertanyaan dan mendapatkan jawaban. Ketika Anda mengunjungi situs https://ask.openstack.org, memindai baru-baru diajukan untuk melihat apakah pertanyaan Anda telah dijawab. Jika tidak, mengajukan pertanyaan baru. Pastikan untuk memberikan yang jelas, ringkasan singkat dalam judul dan memberikan detail sebanyak mungkin dalam deskripsi. Tempel di output perintah atau tumpukan jejak, link Anda ke layar tembakan, dan informasi lainnya yang mungkin berguna.

source: Dynamic Host Configuration Protocol. A network protocol that configures devices that are connected to a network so that they can communicate on that network by using the Internet Protocol (IP). The protocol is implemented in a client-server model where DHCP clients request configuration data, such as an IP address, a default route, and one or more DNS server addresses from a DHCP server.
id: Dynamic Host Configuration Protocol. Sebuah protokol jaringan yang mengkonfigurasi perangkat yang terhubung ke jaringan sehingga mereka dapat berkomunikasi pada jaringan yang menggunakan Internet Protocol (IP). protokol diimplementasikan dalam model client-server di mana klien DHCP meminta data konfigurasi, seperti alamat IP, rute default, dan satu atau alamat server DNS lebih dari server DHCP.

source: Dynamic root of trust measurement.
id: akar dinamis pengukuran kepercayaan.

source: Each OpenStack project provides a command-line client, which enables you to access the project API through easy-to-use commands. For example, the Compute service provides a ``nova`` command-line client.
id: Setiap proyek OpenStack memberikan klien baris perintah, yang memungkinkan Anda untuk mengakses API proyek melalui perintah mudah digunakan. Misalnya, layanan Compute menyediakan `` nova`` klien baris perintah.

source: Enables users to submit commands as a tenant administrator or end user.
id: Memungkinkan pengguna untuk mengirimkan perintah sebagai administrator penyewa atau pengguna akhir.

source: First, add the Open Build Service repository:
id: Pertama, tambahkan Terbuka repositori Build Service:

source: For SUSE Linux Enterprise Server, use ``zypper`` to install the clients from the distribution packages in the Open Build Service. First, add the Open Build Service repository:
id: Untuk SUSE Linux Enterprise Server, menggunakan `` zypper`` untuk menginstal klien dari paket distribusi di Build Service Terbuka. Pertama, tambahkan Terbuka repositori Build Service:

source: For details about image creation, see the `Virtual Machine Image Guide <http://docs.openstack.org/image-guide/>`__.
id: Untuk rincian tentang penciptaan gambar, lihat `Machine Gambar Virtual Gratis <http://docs.openstack.org/image-guide/>` __.

source: For example, when you specify your password using the command-line client with the :option:`--os-password` argument, anyone with access to your computer can view it in plain text with the ``ps`` field.
id: Misalnya, ketika Anda menentukan kata sandi Anda menggunakan klien baris perintah dengan: opsi: `--os-password` argumen, siapa pun dengan akses ke komputer Anda dapat melihatnya dalam teks biasa dengan` `bidang ps``.

source: For more information, see `Configuration Reference Guide <http://docs.openstack.org/mitaka/config-reference/content/section_shared-file-systems-overview.html>`__.
id: Untuk informasi lebih lanjut, lihat `Konfigurasi Panduan Referensi<http://docs.openstack.org/mitaka/config-reference/content/section_shared-file-systems-overview.html>`__.

source: For the available OpenStack documentation, see `docs.openstack.org <http://docs.openstack.org>`__.
id: Untuk dokumentasi OpenStack yang tersedia, lihat `docs.openstack.org <http://docs.openstack.org>` __.

source: HTML title
id: title HTML

source: Hash of image data to use for verification.
id: Hash data gambar untuk digunakan untuk verifikasi.

source: Help URL
id: URL bantuan

source: IOPS (Input/Output Operations Per Second) are a common performance measurement used to benchmark computer storage devices like hard disk drives, solid state drives, and storage area networks.
id: IOPS (Input / Output Operations Per Second) adalah pengukuran kinerja yang umum digunakan untuk perangkat penyimpanan komputer patokan seperti hard disk drive, solid state drive, dan jaringan area penyimpanan.

source: Identity service
id: layanan Identity

source: If you do not want to use this theme you can remove it and its dependencies using the following command:
id: Jika Anda tidak ingin menggunakan tema ini Anda dapat menghapus dan dependensinya menggunakan perintah berikut:

source: In order to benefit from the Identity service, other OpenStack services need to collaborate with it. When an OpenStack service receives a request from a user, it checks with the Identity service whether the user is authorized to make the request.
id: Dalam rangka memperoleh manfaat dari layanan Identity, layanan OpenStack lainnya harus berkolaborasi dengan itu. Bila layanan OpenStack menerima permintaan dari pengguna, itu memeriksa dengan layanan Identity apakah pengguna berwenang untuk membuat permintaan.

source: In this example, :option:`--force-host-copy True` forces the generic host-based migration mechanism and bypasses any driver optimizations.
id: Dalam contoh ini,: Opsi: `force-host-copy TRUE` memaksa mekanisme migrasi berbasis host generik dan melewati optimasi driver.

source: Infrastructure-as-a-Service. IaaS is a provisioning model in which an organization outsources physical components of a data center, such as storage, hardware, servers, and networking components. A service provider owns the equipment and is responsible for housing, operating and maintaining it. The client typically pays on a per-use basis. IaaS is a model for providing cloud services.
id: Infrastruktur-as-a-Service. IaaS adalah model penyediaan dimana organisasi jasa kontraktor komponen fisik dari pusat data, seperti penyimpanan, hardware, server, dan komponen jaringan. Sebuah penyedia layanan memiliki peralatan dan bertanggung jawab untuk perumahan, mengoperasikan dan memelihara itu. Klien biasanya membayar pada basis per-digunakan. IaaS adalah model untuk menyediakan layanan cloud.

source: Initial Program Loader.
id: Awal Loader Program.

source: Intelligent Platform Management Interface. IPMI is a standardized computer system interface used by system administrators for out-of-band management of computer systems and monitoring of their operation. In layman's terms, it is a way to manage a computer using a direct network connection, whether it is turned on or not; connecting to the hardware rather than an operating system or login shell.
id: Cerdas Management Interface Platform. IPMI adalah antarmuka sistem komputer standar yang digunakan oleh administrator sistem untuk out-of-band manajemen sistem komputer dan pemantauan operasi mereka. Dalam istilah awam, itu adalah cara untuk mengelola komputer menggunakan koneksi jaringan langsung, apakah itu diaktifkan atau tidak; menghubungkan ke perangkat keras daripada sistem operasi atau login shell.

source: Internet Control Message Protocol, used by network devices for control messages. For example, :command:`ping` uses ICMP to test connectivity.
id: Internet Control Message Protocol, digunakan oleh perangkat jaringan untuk pesan kontrol. Sebagai contoh,: perintah: `ping` menggunakan ICMP untuk menguji konektivitas.

source: Intrusion Detection System.
id: Sistem pendeteksi intrusi.

source: Local file that contains the disk image to be uploaded during the update. Alternatively, you can pass images to the client through stdin.
id: file lokal yang berisi disk image yang akan di upload selama update. Atau, Anda dapat melewati gambar ke klien melalui stdin.

source: Logo link
id: Link logo

source: Makes an image accessible for all the tenants (admin-only by default).
id: Membuat gambar dapat diakses untuk semua penyewa (admin-satunya secara default).

source: Manage a snapshot with the :command:`cinder snapshot-manage` command:
id: Mengelola snapshot dengan: perintah: `cinder perintah snapshot-manage`:

source: Managed through REST API with UI available as part of OpenStack dashboard.
id: Dikelola melalui API REST dengan UI tersedia sebagai bagian dari OpenStack dashboard.

source: Many Linux distributions provide packages to make setuptools easy to install. Search your package manager for setuptools to find an installation package. If you cannot find one, download the setuptools package directly from https://pypi.python.org/pypi/setuptools.
id: Banyak distribusi Linux menyediakan paket untuk membuat setuptools mudah untuk menginstal. Cari manajer paket untuk setuptools untuk menemukan paket instalasi. Jika Anda tidak dapat menemukan satu, download paket setuptools langsung dari https://pypi.python.org/pypi/setuptools.

source: Mechanism for highly-available multi-host routing when using OpenStack Networking (neutron).
id: Mekanisme yang sangat-tersedia routing yang multi-host ketika menggunakan OpenStack Jaringan (neutron).

source: Mediates interactions between the ``nova-compute`` service and the database. It eliminates direct accesses to the cloud database made by the ``nova-compute`` service. The ``nova-conductor`` module scales horizontally. However, do not deploy it on nodes where the ``nova-compute`` service runs. For more information, see `Configuration Reference Guide <http://docs.openstack.org/mitaka/config-reference/compute/conductor.html>`__.
id: Menengahi interaksi antara `` layanan nova-compute`` dan database. Menghilangkan akses langsung ke database awan yang dibuat oleh `` layanan nova-compute``. The `` modul nova-conductor`` skala horizontal. Namun, jangan sebarkan di node mana `` nova-compute`` layanan berjalan. Untuk informasi lebih lanjut, lihat `Konfigurasi Panduan Referensi <http://docs.openstack.org/mitaka/config-reference/compute/conductor.html>` __.

source: Metadata key-value pairs. Defaults to ``None``.
id: Metadata pasangan kunci-nilai. Standarnya `` None``.

source: Migrate a volume with the :command:`cinder migrate` command, as shown in the following example:
id: Bermigrasi volume dengan: perintah: `bara perintah migrate`, seperti yang ditunjukkan dalam contoh berikut:

source: Most Linux distributions include packaged versions of the command-line clients that you can install directly, see Installing_from_packages_.
id: Kebanyakan distribusi Linux menyertakan versi paket dari klien baris perintah yang dapat Anda menginstal langsung, lihat Instalasi Dari Paket.

source: Name for the Compute component that manages VMs.
id: Nama untuk komponen Compute yang mengelola VMs.

source: Name of the snapshot. Defaults to ``None``.
id: Nama snapshot. Standarnya `` None``.

source: Name or ID of the snapshot to unmanage.
id: Nama atau ID dari snapshot untuk unmanaged.

source: Name, ID, or other identifier for an existing snapshot.
id: Nama, ID, atau pengenal lainnya untuk snapshot yang ada.

source: New users are assigned to this tenant if no tenant is specified when a user is created.
id: pengguna baru ditugaskan untuk penyewa ini jika tidak ada penyewa ditentukan ketika pengguna dibuat.

source: Note the ID of your volume.
id: Perhatikan ID volume Anda.

source: On Red Hat Enterprise Linux, CentOS, or Fedora, use ``yum`` to install the clients from the packaged versions available in `RDO <https://www.rdoproject.org/>`__:
id: Pada Red Hat Enterprise Linux, CentOS, atau Fedora, penggunaan `` yum`` untuk menginstal klien dari versi dikemas tersedia di `RDO <https://www.rdoproject.org/>` __:

source: Once you have the dashboard installed you can customize the way it looks and feels to suit your own needs.
id: Setelah Anda dasbor terpasang Anda dapat menyesuaikan cara itu terlihat dan terasa sesuai dengan kebutuhan Anda sendiri.

source: Open the following HTML template in an editor of your choice:
id: Buka template HTML berikut di editor pilihan Anda:

source: OpenStack Compute interacts with OpenStack Identity for authentication; OpenStack Image service for disk and server images; and OpenStack dashboard for the user and administrative interface. Image access is limited by projects, and by users; quotas are limited per project (the number of instances, for example). OpenStack Compute can scale horizontally on standard hardware, and download images to launch instances.
id: OpenStack Compute berinteraksi dengan OpenStack Identity untuk otentikasi; layanan Gambar OpenStack untuk disk dan server gambar; dan dashboard OpenStack bagi pengguna dan antarmuka administratif. Akses gambar dibatasi oleh proyek-proyek, dan oleh pengguna; kuota terbatas per proyek (jumlah kasus, misalnya). OpenStack Compute dapat skala horizontal pada hardware standar, dan men-download gambar untuk memulai kasus.

source: OpenStack project that provides a dashboard, which is a web interface.
id: proyek OpenStack yang menyediakan dashboard, yang merupakan antarmuka web.

source: OpenStack project that provides a framework for performance analysis and benchmarking of individual OpenStack components as well as full production OpenStack cloud deployments. The code name of the project is rally.
id: proyek OpenStack yang menyediakan kerangka kerja untuk analisis kinerja dan benchmarking komponen OpenStack individual maupun produksi penuh penyebaran OpenStack awan. Kode nama dari proyek ini adalah reli.

source: OpenStack project that provides a scalable data-processing stack and associated management interfaces. The code name for the project is sahara.
id: proyek OpenStack yang menyediakan setumpuk pengolahan data terukur dan antarmuka manajemen terkait. Nama kode untuk proyek ini adalah sahara.

source: OpenStack project that provides an application catalog service so that users can compose and deploy composite environments on an application abstraction level while managing the application lifecycle. The code name of the project is murano.
id: proyek OpenStack yang menyediakan layanan katalog aplikasi sehingga pengguna dapat menulis dan menyebarkan lingkungan komposit pada tingkat abstraksi aplikasi sementara mengelola siklus hidup aplikasi. Kode nama dari proyek ini adalah murano.

source: OpenStack project that provides backup restore and disaster recovery as a service.
id: proyek OpenStack yang menyediakan backup memulihkan dan pemulihan bencana sebagai layanan.

source: OpenStack project that provides scalable, on demand, self service access to authoritative DNS services, in a technology-agnostic manner. The code name for the project is designate.
id: proyek OpenStack yang menyediakan scalable, on demand, akses layanan diri ke layanan DNS otoritatif, secara teknologi-agnostik. Nama kode untuk proyek ini adalah menunjuk.

source: OpenStack project that provides the Governance service.
id: proyek OpenStack yang menyediakan layanan Governance.

source: OpenStack project that provisions bare metal, as opposed to virtual machines.
id: proyek OpenStack bahwa ketentuan telanjang logam, yang bertentangan dengan mesin virtual.

source: OpenStack project that provisions bare metal, as opposed to virtual machines. The code name for the project is ironic.
id: proyek OpenStack bahwa ketentuan telanjang logam, yang bertentangan dengan mesin virtual. Nama kode untuk proyek ini adalah ironis.

source: OpenStack project to provide Governance-as-a-Service across any collection of cloud services in order to monitor, enforce, and audit policy over dynamic infrastructure. The code name for the project is congress.
id: proyek OpenStack untuk menyediakan Governance-as-a-Service di setiap koleksi layanan cloud untuk memantau, menegakkan, dan kebijakan audit atas infrastruktur yang dinamis. Nama kode untuk proyek ini adalah kongres.

source: OpenStack provides an Infrastructure-as-a-Service (:term:`IaaS`) solution through a set of interrelated services. Each service offers an :term:`application programming interface (API)` that facilitates this integration. Depending on your needs, you can install some or all services.
id: OpenStack menyediakan a-Service Infrastructure-as-(: istilah: `IaaS`) solusi melalui satu set layanan yang saling terkait. Setiap layanan menawarkan: istilah: `antarmuka pemrograman aplikasi (API)` yang memfasilitasi integrasi ini. Tergantung pada kebutuhan Anda, Anda dapat menginstal beberapa atau semua layanan.

source: Optionally, you can specify a name for the transfer by using the ``--display-name displayName`` parameter.
id: Opsional, Anda dapat menentukan nama untuk transfer dengan menggunakan `` --display-nama displayName`` parameter.

source: Overview
id: Iktisar

source: Plugs and unplugs ports, creates networks or subnets, and provides IP addressing. These plug-ins and agents differ depending on the vendor and technologies used in the particular cloud. OpenStack Networking ships with plug-ins and agents for Cisco virtual and physical switches, NEC OpenFlow products, Open vSwitch, Linux bridging, and the VMware NSX product.
id: Busi dan unplugs port, menciptakan jaringan atau subnet, dan menyediakan alamat IP. plug-in dan agen-agen ini berbeda tergantung pada vendor dan teknologi yang digunakan di awan tertentu. kapal OpenStack Networking dengan plug-in dan agen untuk Cisco switch virtual dan fisik, NEC produk OpenFlow, Open vSwitch, bridging Linux, dan produk VMware NSX.

source: Prevents an image from being deleted.
id: Mencegah sebuah gambar tidak dihapus.

source: Prints the image size in a human-friendly format.
id: Mencetak ukuran foto dalam format ramah manusia.

source: Processes client requests for VMs, updates Image service metadata on the registry server, and communicates with the store adapter to upload VM images from the back-end store.
id: Memproses permintaan klien untuk VMS, update Gambar layanan metadata pada server registry, dan berkomunikasi dengan adaptor toko untuk meng-upload VM gambar dari toko back-end.

source: RDO, openSUSE, SUSE Linux Enterprise, Debian, and Ubuntu have client packages that can be installed without ``pip``.
id: RDO, openSUSE, SUSE Linux Enterprise, Debian, dan Ubuntu memiliki paket client yang dapat diinstal tanpa `` pip``.

source: Restart Apache for this change to take effect.
id: Restart Apache untuk perubahan ini berlaku.

source: Restart the Apache service.
id: Restart layanan Apache.

source: SNAPSHOT
id: FOTO
