Repository: 25hours/openstack-manuals
Catalog: doc/common/source/locale/*/LC_MESSAGES/common.po
Languages: id, tr_tr

source: The OpenStack service that provides a multi-project, highly scalable, performant, fault-tolerant monitoring-as-a-service solution for metrics, complex event processing and logging. To build an extensible platform for advanced monitoring services that can be used by both operators and projects to gain operational insight and visibility, ensuring availability and stability.
tr_tr: Metrikler, karmaşık olay işleme ve günlükleme için çok projeli, yüksek ölçeklenebilir, hata töleranslı hizmet olarak gözlem çözümü sunan OpenStack servisi. Hem işletmeciler hem de projeler tarafından operasyonel içgörü ve görünürlük kazanmak için kullanılabilirlik ve istikrar sağlayan gelişmiş izleme hizmetleri için genişletilebilir bir platform oluşturmak.

source: The OpenStack service that provides a service and associated libraries capable of managing and provisioning physical machines in a security-aware and fault-tolerant manner.
tr_tr: Güvenlik farkındalığı ve hata töleransı açısından fiziksel makinaları yöneten ve sağlayan bir servis ve ilişkili kütüphaneleri sağlayan OpenStack servisi.

source: The OpenStack service that provides a simple YAML-based language to write workflows (tasks and transition rules) and a service that allows to upload them, modify, run them at scale and in a highly available manner, manage and monitor workflow execution state and state of individual tasks.
tr_tr: İş akışları (görevler ve akış kuralları) ve bunları yüklemeye, düzenlemeye, ölçek ve yüksek kullanılabilirlik açısından çalıştırmaya olanak sağlayan servisleri yazmak, iş akışlarının çalışma durumunu ve görevlerin durumunu yönetmek ve izlemek için bir YAML tabanlı dil sağlayan OpenStack servisi.

source: The OpenStack service which orchestrates composite cloud applications using a declarative template format through an OpenStack-native REST API.
tr_tr: Bir OpenStack yerli REST API'si aracılığıyla bildirimsel bir şablon biçimi kullanarak bileşik bulut uygulamalarını düzenleyen OpenStack hizmeti.

source: The OpenStack stack uses the following storage types:
id: The OpenStack tumpukan menggunakan jenis penyimpanan berikut:
tr_tr: OpenStack yığını aşağıdaki depolama türlerini kullanır:

source: The OpenStack wiki
tr_tr: OpenStack viki

source: The Orchestration service consists of the following components:
id: Layanan Orkestrasi terdiri dari komponen-komponen berikut:
tr_tr: Orkestrasyon servisi aşağıdaki bileşenlerden oluşur:

source: The Orchestration service provides a template-based orchestration for describing a cloud application by running OpenStack API calls to generate running cloud applications. The software integrates other core components of OpenStack into a one-file template system. The templates allow you to create most OpenStack resource types such as instances, floating IPs, volumes, security groups, and users. It also provides advanced functionality such as instance high availability, instance auto-scaling, and nested stacks. This enables OpenStack core projects to receive a larger user base.
id: Layanan Orkestrasi menyediakan orkestrasi berbasis template untuk menggambarkan aplikasi cloud dengan menjalankan OpenStack API panggilan untuk menghasilkan menjalankan aplikasi cloud. Perangkat lunak ini mengintegrasikan komponen inti lainnya dari OpenStack menjadi sistem template satu-berkas. Template memungkinkan Anda untuk membuat sebagian besar jenis sumber daya OpenStack seperti contoh, mengambang IP, volume, kelompok keamanan, dan pengguna. Hal ini juga menyediakan fungsi canggih seperti misalnya ketersediaan tinggi, misalnya auto-scaling, dan tumpukan bersarang. Hal ini memungkinkan proyek inti OpenStack untuk menerima basis pengguna yang lebih besar.
tr_tr: Orkestrasyon servisi çalışan bulut uygulamaları üretmek için OpenStack API çağrıları çalıştırarak bir bulut uygulamasını tanımlamak için şablon tabanlı orkestrasyon sağlar. Yazılım OpenStack'in diğer temel bileşenlerini tek dosyalı bir şablon sisteminde birleştirir. Ayrıca sunucu yüksek kullanılabilirliği, sunuc otomatik ölçekleme, ve iç içe yığınlar gibi gelişmiş işlevsellik de sağlar. Bu da OpenStack'in çekirdek projelerinin daha büyük kullanıcı tabanına sahip olmasını sağlar.

source: The POSIX-compliant file system provided by Ceph.
id: Sistem file POSIX-compliant disediakan oleh Ceph.
tr_tr: Ceph tarafından sağlanan POSIX uyumlu dosya sistemi.

source: The Shared File Systems service consists of the following components:
id: Layanan Sistem Berkas Shared terdiri dari komponen-komponen berikut:
tr_tr: Paylaşımlı Dosya Sistemleri servisi şu bileşenlerden oluşur:

source: The Telemetry Alarming service consists of the following components:
id: Layanan telemetri mengkhawatirkan terdiri dari komponen-komponen berikut:
tr_tr: Telemetri Uyarı servisi şu bileşenlerden oluşur:

source: The Telemetry Alarming services trigger alarms when the collected metering or event data break the defined rules.
id: Layanan mengkhawatirkan Telemetry memicu alarm ketika metering atau peristiwa data yang dikumpulkan melanggar aturan yang ditetapkan.
tr_tr: Telemetri Uyarı servisleri toplanan ölçütler veya olaylar belirli kuralları kırdığında uyarılar tetikler.

source: The Telemetry Data Collection services provide the following functions:
id: Layanan Koleksi Data telemetri menyediakan fungsi-fungsi berikut:
tr_tr: Telemetri Veri Toplama servisleri şu işlevselliği sağlar:

source: The Telemetry service consists of the following components:
id: Layanan telemetri terdiri dari komponen-komponen berikut:
tr_tr: Telemetri servisi şu bileşenlerden oluşur:

source: The Xen administrative API, which is supported by Compute.
tr_tr: Hesaplama tarafından desteklenen, Xen yönetim API.

source: The `OpenStack wiki <https://wiki.openstack.org/>`_ contains a broad range of topics but some of the information can be difficult to find or is a few pages deep. Fortunately, the wiki search feature enables you to search by title or content. If you search for specific information, such as about networking or OpenStack Compute, you can find a large amount of relevant material. More is being added all the time, so be sure to check back often. You can find the search box in the upper-right corner of any OpenStack wiki page.
tr_tr: `OpenStack viki <https://wiki.openstack.org/>`_'si geniş bir konu yelpazesine sahiptir ancak bazı bilgilerin bulunması zor olabilir ya da birkaç sayfa derinliklidir. Neyse ki, viki arama özelliği başlık veya içerik bazında arama yapmanızı sağlar. Ağ veya OpenStack Hesaplama gibi belirli bilgiler ararsanız, büyük miktarda ilgili malzeme bulabilirsiniz. Her zaman daha fazla bilgi ekleniyor, bu yüzden sık sık kontrol etmeyi unutmayın. Arama kutusunu herhangi bir OpenStack viki sayfasının sağ üst köşesinde bulabilirsiniz.

source: The ``CPU`` column shows the sum of the virtual CPUs for instances running on the host.
tr_tr: ``CPU`` sütunu makine üzerinde çalışan sunucuların sanal işlemcilerinin toplamını gösterir.

source: The ``DISK GB`` column shows the sum of the root and ephemeral disk sizes (in GB) of the instances that run on the host.
tr_tr: ``DISK_GB`` sütunu makine üzerinde çalışan sunucuların kök ve geçici disk boyutlarının toplamını (GB olarak ) gösterir.

source: The ``MEMORY MB`` column shows the sum of the memory (in MB) allocated to the instances that run on the host.
tr_tr: ``MEMORY MB`` sütunu makine üzerinde çalışan sunucular için ayrılan toplam hafızayı (MB olarak) gösterir.

source: The ``cinder-backup`` service provides backing up volumes of any type to a backup storage provider. Like the ``cinder-volume`` service, it can interact with a variety of storage providers through a driver architecture.
id: The `` layanan cinder-backup`` memberikan back up volume dari jenis apa pun ke penyedia penyimpanan cadangan. Seperti `` layanan bara-volume``, dapat berinteraksi dengan berbagai penyedia penyimpanan melalui arsitektur driver.
tr_tr: ``cinder-backup`` servisi her tür birimin bir yedek depolama sağlayıcısına yedeklenmesini sağlar. ``cinder-volume`` servisi gibi bir sürücü mimarisi aracılığıyla çeşitli depolama sağlayıcılarıyla iletişime geçebilir.

source: The ``nova-network`` worker daemon; provides services such as giving an IP address to a booting nova instance.
tr_tr: ``nova-network`` işçi artalan işlemi; önyüklemeli nova sunucusuna bir IP adresi vermek gibi servisler sağlar.

source: The ``root`` user must run commands that are prefixed with the ``#`` prompt. You can also prefix these commands with the :command:`sudo` command, if available, to run them.
id: The `` pengguna root`` harus menjalankan perintah yang diawali dengan `` # `` prompt. Anda juga dapat awalan perintah ini dengan: perintah: `perintah sudo`, jika tersedia, untuk menjalankannya.
tr_tr: ``root`` kullanıcısı ``#`` ile başlayan komutları çalıştırmalıdır. Ayrıca bu komutları çalıştırmak için, eğer kullanılabilir durumda ise :command:`sudo` komutu ile başlatabilirsiniz.

source: The ability to encrypt data at the file system, disk partition, or whole-disk level. Supported within Compute VMs.
id: Kemampuan untuk mengenkripsi data pada sistem file, partisi disk, atau tingkat keseluruhan disk. Didukung dalam Hitung VMS.
tr_tr: Dosya sisteminde, disk bölümünde veya tüm disk düzeyinde verileri şifreleme özelliği. Hesaplama VM'leri içinde desteklenir.

source: The ability to guarantee certain network or storage requirements to satisfy a Service Level Agreement (SLA) between an application provider and end users. Typically includes performance requirements like networking bandwidth, latency, jitter correction, and reliability as well as storage performance in Input/Output Operations Per Second (IOPS), throttling agreements, and performance expectations at peak load.
tr_tr: Bir uygulama sağlayıcısı ve son kullanıcılar arasındaki Hizmet Düzeyi Sözleşmesini (SLA) karşılamak için belirli ağ veya depolama gereksinimlerini garanti etme yeteneği. Genellikle ağa bağlı bant genişliği, gecikme süresi, titreşim düzeltme ve güvenilirlik gibi performans gereksinimlerini ve ayrıca Saniyede Giriş/Çıkış İşlemleri (IOPS), onaylama sözleşmeleri ve tepe yükte performans beklentileri gibi performans gereksinimleri bulunur.

source: The ability to start new VM instances based on the actual memory usage of a host, as opposed to basing the decision on the amount of RAM each running instance thinks it has available. Also known as RAM overcommit.
tr_tr: Her çalışan sunucunun mevcut olduğunu düşünen RAM miktarına karar vermenin aksine, bir ana bilgisayarın gerçek bellek kullanımına dayalı olarak yeni VM sunucuları başlatma yeteneği. RAM aşırı yüklemesi olarak da bilinir.

source: The ability to start new VM instances based on the actual memory usage of a host, as opposed to basing the decision on the amount of RAM each running instance thinks it has available. Also known as memory overcommit.
tr_tr: Bir ana bilgisayarın gerçek bellek kullanımına dayalı olarak yeni VM örneklerini başlatma yeteneği, her çalıştıran örneğin mevcut olduğunu düşünen RAM miktarına karar verme aksine. Bellek aşırı yükleme olarak da bilinir.

source: The ability within Compute to move running virtual machine instances from one host to another with only a small service interruption during switchover.
tr_tr: Hesaplama içinde çalışan sanal makine sunucuları bir ana bilgisayardan diğerine taşımak için geçiş sırasında yalnızca küçük bir hizmet kesintisi yapma yeteneği.

source: The act of verifying that a user, process, or client is authorized to perform an action.
id: Tindakan memverifikasi bahwa pengguna, proses, atau klien berwenang untuk melakukan tindakan.
tr_tr: Bir kullanıcının, işlemin veya müşterinin bir eylem gerçekleştirmeye yetkili olduğunu doğrulama eylemi.

source: The amount of available data used by communication resources, such as the Internet. Represents the amount of data that is used to download things or the amount of data available to download.
id: Jumlah data yang tersedia digunakan oleh sumber daya komunikasi, seperti internet. Merupakan jumlah data yang digunakan untuk men-download hal-hal atau jumlah data yang tersedia untuk men-download.
tr_tr: İnternet gibi iletişim kaynakları tarafından kullanılan mevcut veri miktarı. Karşıdan yüklemek için kullanılan veri miktarını veya karşıdan yüklenebilecek veri miktarını temsil eder.

source: The amount of time it takes for a new Object Storage object to become accessible to all clients.
id: Jumlah waktu yang dibutuhkan untuk objek Object Storage baru agar bisa diakses oleh semua klien.
tr_tr: Yeni bir Nesne Depolama nesnesinin tüm istemcilerin erişebilmesi için geçen süre.

source: The arguments to be passed are:
id: Argumen untuk dilewati adalah:
tr_tr: Geçirilecek bağımsız değişkenler:

source: The association between an Image service VM image and a project. Enables images to be shared with specified projects.
tr_tr: Bir İmaj servisi VM imajı ile bir proje arasındaki ilişki. Belirli projelerle resimlerin paylaşılmasını sağlar.

source: The back-end store used by Image service to store VM images, options include Object Storage, locally mounted file system, RADOS block devices, VMware datastore, or HTTP.
tr_tr: İmaj servisinin VM imajlarını depolamak için kullandığı arka uç deposu, Nesne Depolama Alanı, yerel olarak monte edilmiş dosya sistemi, RADOS blok aygıtları, VMware veri deposu veya HTTP'yi içerir.

source: The cloud operator assigns roles to users. Roles determine who can upload and manage images. The operator might restrict image upload and management to only cloud administrators or operators.
id: Operator cloud memberikan peran kepada pengguna. Peran menentukan siapa yang dapat meng-upload dan mengelola gambar. operator mungkin membatasi upload image dan manajemen hanya administrator awan atau operator.
tr_tr: Bulut işleticisi kullanıcılara rol atar. Roller kimlerin imaj yükleyebileceğini ve yönetebileceğini belirler. İşletici imaj yüklemeyi ve yönetimini yalnızca bulut yöneticilerine veya işleticilere kısıtlayabilir.

source: The code name for the eighth release of OpenStack. The design summit took place in Portland, Oregon, US and Havana is an unincorporated community in Oregon.
id: Nama kode untuk rilis kedelapan OpenStack. KTT desain berlangsung di Portland, Oregon, Amerika Serikat dan Havana adalah komunitas tak berhubungan di Oregon.
tr_tr: OpenStack'in sekizinci sürümünün kod adı. Tasarım zirvesi Portland, Oregon, ABD'de gerçekleşti ve Havana, Oregon'da kurulu olmayan bir topluluktu.

source: The code name for the eleventh release of OpenStack. The design summit took place in Paris, France. Due to delays in the name selection, the release was known only as K. Because ``k`` is the unit symbol for kilo and the kilogram reference artifact is stored near Paris in the Pavillon de Breteuil in Sèvres, the community chose Kilo as the release name.
tr_tr: OpenStack'ın onbirinci sürümünün kod adı. Tasarım zirvesi Paris, Fransa'da gerçekleşti. Ad seçiminde gecikmeler nedeniyle sürüm yalnızca K olarak biliniyordu. ``k``, kilo için birim simgesi ve kilogram referans eseri Sevres'teki Pavillon de Breteuil'de Paris yakınlarında depolandığı için topluluk olarak sürüm adı olarak Kilo seçildi.

source: The code name for the fifteenth release of OpenStack. The design summit will take place in Barcelona, Spain. Ocata is a beach north of Barcelona.
tr_tr: OpenStack'ın on beşinci sürümünün kod adı. Tasarım zirvesi Barselona, İspanya'da gerçekleşecek. Ocata Barselona'nın kuzeyinde bir plajdır.

source: The code name for the fourteenth release of OpenStack. The design summit took place in Austin, Texas, US. The release is named after "Newton House" which is located at 1013 E. Ninth St., Austin, TX. which is listed on the National Register of Historic Places.
tr_tr: OpenStack'ın ondördüncü sürümünün kod adı. Tasarım zirvesi Austin, Texas, ABD'de gerçekleşti. Sürüm adı "Newton House", Ulusal Tarihi Yerler Kayıtları'nda listelenen 1013 E. Ninth St, Austin, TX'de yer alıyor.

source: The code name for the initial release of OpenStack. The first design summit took place in Austin, Texas, US.
id: Nama kode untuk rilis awal OpenStack. KTT desain pertama berlangsung di Austin, Texas, AS.
tr_tr: OpenStack'in ilk sürümünün kod adı. İlk tasarım zirvesi Austin, Texas, ABD'de gerçekleşti.

source: The code name for the ninth release of OpenStack. The design summit took place in Hong Kong and Ice House is a street in that city.
id: Nama kode untuk rilis kesembilan OpenStack. KTT desain berlangsung di Hong Kong dan Ice House adalah sebuah jalan di kota itu.
tr_tr: OpenStack dokuzuncu sürümünün kod adı. Tasarım zirvesi Hong Kong'da gerçekleşti ve Ice House bu şehirde bir cadde.

source: The code name for the seventeenth release of OpenStack. The design summit will take place in Sydney, Australia. The release is named after the Queens Pound river in the South Coast region of New South Wales.
tr_tr: OpenStack'in on yedinci sürümünün kod adı. Tasarım zirvesi Sydney, Avustralya'da gerçekleşecek. Sürüm adını, New South Wales'in South Coast bölgesinde Queens Pound nehrinden alıyor.

source: The code name for the seventh release of OpenStack. The design summit took place in San Diego, California, US and Grizzly is an element of the state flag of California.
id: Nama kode untuk rilis ketujuh OpenStack. KTT desain berlangsung di San Diego, California, Amerika Serikat dan Grizzly merupakan elemen dari bendera negara bagian California.
tr_tr: OpenStack'in yedinci sürümünün kod adı. Tasarım zirvesi San Diego, Kaliforniya, ABD'de gerçekleşti ve Grizzly, Kaliforniya eyaleti bayrağının bir unsurudur.

source: The code name for the sixteenth release of OpenStack. The design summit will take place in Boston, Massachusetts, US. The release is named after the Massachusetts Turnpike, abbreviated commonly as the Mass Pike, which is the easternmost stretch of Interstate 90.
tr_tr: OpenStack'in altıncı sürümünün kod adı. Tasarım zirvesi Boston, Massachusetts, ABD'de gerçekleşecek. Bu sürüm ismini, Interstate 90'nın en doğusundaki, genellikle Mass Pike olarak kısaltılan, Massachusetts Turnpike'dan alır.

source: The code name for the tenth release of OpenStack. The design summit took place in Atlanta, Georgia, US and Juno is an unincorporated community in Georgia.
tr_tr: OpenStack'in onuncu sürümünün kod adı. Tasarım zirvesi Atlanta, Georgia, ABD'de gerçekleşti ve Juno, Georgia'da kurulu olmayan bir topluluktu.

source: The code name for the thirteenth release of OpenStack. The design summit took place in Tokyo, Japan. Mitaka is a city in Tokyo.
tr_tr: OpenStack'in onüçüncü sürümünün kod adı. Tasarım zirvesi Tokyo, Japonya'da gerçekleşti. Mitaka, Tokyo'da bir şehirdir.

source: The code name for the twelfth release of OpenStack. The design summit took place in Vancouver, Canada and Liberty is the name of a village in the Canadian province of Saskatchewan.
tr_tr: OpenStack'in onikinci sürümünün kod adı. Tasarım zirvesi Vancouver, Kanada'da gerçekleşti ve Liberty, Kanada'nın Saskatchewan eyaletinde bir köyün adı.

source: The collaboration site for OpenStack.
tr_tr: OpenStack için işbirliği sitesi.

source: The common agents are L3 (layer 3), DHCP (dynamic host IP addressing), and a plug-in agent.
id: Para agen umum adalah L3 (lapisan 3), DHCP (IP dynamic host pengalamatan), dan plug-in agen.
tr_tr: Yaygın aracılar L3 (katman 3), DHCP (dinamik sunucu IP adresleme), ve eklenti aracısıdır.

source: The cooperative threading model used by Python; reduces race conditions and only context switches when specific library calls are made. Each OpenStack service is its own thread.
id: Model threading koperasi digunakan oleh Python; mengurangi kondisi ras dan hanya switch konteks saat panggilan perpustakaan khusus yang dibuat. Setiap layanan OpenStack adalah thread sendiri.
tr_tr: Python tarafından kullanılan ortak çalışma modeli; Belirli kütüphane çağrıları yapıldığında yarış durumunu ve yalnızca içerik anahtarlarını azaltır. Her OpenStack hizmeti kendi iş parçacıklarından biridir.

source: The current state of a guest VM image.
id: Keadaan saat tamu VM gambar.
tr_tr: Konuk VM görüntüsünün geçerli durumu.

source: The current status of a VM image in Image service, not to be confused with the status of a running instance.
id: Status gambar VM dalam pelayanan Gambar, tidak menjadi bingung dengan status contoh menjalankan.
tr_tr: İmaj hizmetindeki bir VM imajının geçerli durumu, çalışan bir sunucunun durumu ile karıştırılmamalıdır.

source: The daemon, worker, or service that a client communicates with to access an API. API endpoints can provide any number of services, such as authentication, sales data, performance meters, Compute VM commands, census data, and so on.
id: Daemon, pekerja, atau layanan yang klien berkomunikasi dengan untuk mengakses API. endpoints API dapat memberikan sejumlah layanan, seperti otentikasi, data penjualan, kinerja meter, perintah Compute VM, data sensus, dan sebagainya.
tr_tr: Bir istemcinin bir API'ye erişmek için iletişim kurduğu arkaplan işlemi, işçi veya hizmet. API uç birimi kimlik doğrulama, satış verileri, performans ölçerleri, Hesaplama VM komutları, sayım verileri vb. gibi herhangi bir sayıdaki hizmeti sağlayabilir.

source: The dashboard is usually deployed through `mod_wsgi <http://code.google.com/p/modwsgi/>`__ in Apache. You can modify the dashboard code to make it suitable for different sites.
id: dashboard biasanya dikerahkan melalui `mod_wsgi <http://code.google.com/p/modwsgi/>` __ di Apache. Anda dapat memodifikasi kode dashboard untuk membuatnya cocok untuk situs yang berbeda.
tr_tr: Kontrol panosu genellikle Apache'de `mod_wsgi <http://code.google.com/p/modwsgi/>`__ üzerinden kurulur. Kontrol panosu kodunu farklı siteler için uygun olacak şekilde değiştirebilirsiniz.

source: The default message queue software used by OpenStack.
tr_tr: OpenStack tarafından kullanılan varsayılan mesaj sırası yazılımı.

source: The default panel that is displayed when a user accesses the dashboard.
tr_tr: Bir kullanıcı gösterge paneline eriştiğinde gösterilecek varsayılan panel.

source: The fibre channel protocol tunneled within Ethernet.
id: Protokol saluran serat terowongan dalam Ethernet.
tr_tr: Ethernet içinde tünellenen fiber kanalı protokolü.

source: The following Launchpad Bugs areas are available:
id: Launchpad Bugs daerah berikut tersedia:
tr_tr: Aşağıdaki Lauchpad Hataları alanları kullanılabilir:

source: The following Linux distributions provide community-supported packages for OpenStack:
id: Distribusi Linux berikut ini memberikan paket yang didukung komunitas untuk OpenStack:
tr_tr: Aşağıdaki Linux dağıtımları OpenStack için topluluk-destekli paketler sunar:

source: The following books explain how to configure and run an OpenStack cloud:
id: Buku-buku berikut ini menjelaskan cara mengkonfigurasi dan menjalankan awan OpenStack:
tr_tr: Aşağıdaki kitaplar OpenStack bulutunu nasıl yapılandırıp çalıştıracağınızı açıklar:

source: The following books explain how to install an OpenStack cloud and its associated components:
id: Buku-buku berikut ini menjelaskan cara menginstal awan OpenStack dan komponen terkait:
tr_tr: Aşağıdaki kitap OpenStack bulutunu ve ilgili bileşenleri nasıl kuracağınızı anlatmaktadır:

source: The following books explain how to use the OpenStack Dashboard and command-line clients:
tr_tr: Aşağıdaki kitaplar OpenStack Kontrol panosu ve komut satırı istemcisinin nasıl kullanılacağını açıklar:

source: The following diagram shows the most common, but not the only possible, architecture for an OpenStack cloud:
id: Diagram berikut menunjukkan yang paling umum, tetapi bukan satu-satunya yang mungkin, arsitektur untuk awan OpenStack:
tr_tr: Aşağıdaki çizim tek yöntem olmasa da en yaygın OpenStack bulut mimarisini gösterir:
