Repository: 25hours/openstack-manuals
Catalog: doc/common/source/locale/*/LC_MESSAGES/common.po
Languages: id, tr_tr

source: Install the prerequisite software and the Python package for each OpenStack client.
id: Menginstal perangkat lunak prasyarat dan paket Python untuk setiap klien OpenStack.
tr_tr: OpenStack istemcisi için ön koşul yazılımını ve Python paketini kurun.

source: Installed by default on Mac OS X.
id: Terinstal secara default pada Mac OS X.
tr_tr: Mac OS X üzerinde öntanımlı olarak kurulu.

source: Installing from packages
id: Instalasi dari paket
tr_tr: Paketlerden kurulum

source: Installing with pip
id: Instalasi dengan pip
tr_tr: Pip ile kurulum

source: Instances in use
tr_tr: Kullanımdaki sunucular

source: Instruments the complex system flows that support provisioning instances, managing the lifecycle of instances, and performing operations on instances.
id: Instrumen arus sistem yang kompleks yang mendukung penyediaan contoh, mengelola siklus hidup contoh, dan melakukan operasi pada kasus.
tr_tr: Sunucuları hazırlamayı destekleyen, sunucuların yaşam döngülerini yöneten ve sunucular üzerinde işlemler gerçekleştiren karmaşık sistem akışını ayarlar.

source: Integration with vendor specific management tools, such as Apache Ambari or Cloudera Management Console.
id: Integrasi dengan alat manajemen vendor tertentu, seperti Apache Ambari vs Cloudera Management Console.
tr_tr: Apache Ambari veya Cloudera Yönetim Konsolu gibi üreticiye özel yönetim araçlarıyla tümleştirme.

source: Intelligent Platform Management Interface (IPMI)
tr_tr: Akıllı Platform Yönetim Arayüzü (IPMI)

source: Interactions and processes that are obfuscated from the user, such as Compute volume mount, data transmission to an iSCSI target by a daemon, or Object Storage object integrity checks.
id: Interaksi dan proses yang dikaburkan dari pengguna, seperti volume Compute gunung, transmisi data ke target iSCSI oleh daemon, atau Object Storage pemeriksaan integritas objek.
tr_tr: Hesaplama disk bölümü bağlama, arkaplan işlemi tarafından iSCSI hedefine veri iletimi veya Nesne Depolama nesnesi bütünlüğü denetimi gibi kullanıcı tarafından anlaşılmaz olan etkileşimler ve süreçler.

source: Interacts directly with the Block Storage service, and processes such as the ``cinder-scheduler``. It also interacts with these processes through a message queue. The ``cinder-volume`` service responds to read and write requests sent to the Block Storage service to maintain state. It can interact with a variety of storage providers through a driver architecture.
id: Berinteraksi langsung dengan layanan Block Storage, dan proses seperti `` cinder-scheduler``. Hal ini juga berinteraksi dengan proses-proses ini melalui antrian pesan. The `` layanan cinder-volume`` merespon untuk membaca dan menulis permintaan dikirim ke layanan Block Storage untuk mempertahankan negara. Hal ini dapat berinteraksi dengan berbagai penyedia penyimpanan melalui arsitektur driver.
tr_tr: Doğrudan Blok Depolama servisiyle ve ``cinder-scheduler`` gibi süreçlerle iletişime geçer. Ayrca bu süreçlerle bir ileti kuyruğu aracılığıyla etkileşime girer. ``cinder-volume`` servisi durum korumak için Blok Depolama servisine gönderilen okuma ve yazma isteklerine yanıt verir. Sürücü mimarisiyle çeşitli depolama sağlayıcılarıyla iletişim kurabilir.

source: Interface within Networking that enables organizations to create custom plug-ins for advanced features, such as QoS, ACLs, or IDS.
tr_tr: QoS, ACLs, veya IDS gibi gelişmiş özellikler için özel eklentiler oluşturmak için organizasyonları etkinleştiren Ağ hizmetinde bir arayüz.

source: Internally, OpenStack services are composed of several processes. All services have at least one API process, which listens for API requests, preprocesses them and passes them on to other parts of the service. With the exception of the Identity service, the actual work is done by distinct processes.
id: Internal, layanan OpenStack terdiri dari beberapa proses. Semua layanan memiliki setidaknya satu proses API, yang mendengarkan permintaan API, proses ulang dan melewati mereka ke bagian lain dari layanan. Dengan pengecualian dari layanan Identitas, pekerjaan yang sebenarnya dilakukan oleh proses yang berbeda.
tr_tr: Dahili olarak, OpenStack servisleri çeşitli süreçlerden oluşur. Tüm servisler API isteklerini dinleyen, ön işleme yapan ve servisin diğer bölümlerine gönderen en az bir API sürecine sahiptir. Kimlik servisi hariç, asıl iş belirli süreçlerce yapılır.

source: Internally, each command uses cURL command-line tools, which embed API requests. OpenStack APIs are RESTful APIs, and use the HTTP protocol. They include methods, URIs, media types, and response codes.
id: Secara internal, setiap perintah menggunakan alat baris perintah Curl, yang menanamkan permintaan API. OpenStack API adalah API tenang, dan menggunakan protokol HTTP. Mereka termasuk metode, URI, jenis media, dan kode respon.
tr_tr: Dahili olarak, her komut API isteklerini gömen cURL komut satırı araçlarını kullanır. OpenStack API'leri RESTful API'lerdir ve HTTP iletişim kuralını kullanırlar. Yöntemler, URI'ler, ortam türleri ve yanıt kodları içerirler.

source: Internet Control Message Protocol (ICMP)
tr_tr: İnternet Kontrol Mesaj Protokolü (ICMP)

source: Internet Engineering Task Force (IETF) is an open standards organization that develops Internet standards, particularly the standards pertaining to TCP/IP.
tr_tr: İnternet Mühendisliği Görev Gücü (IETF), TCP/IP ile ilgili standartlar olmak üzere, İnternet standartlarını geliştiren açık bir standart organizasyonudur.

source: Internet Service Provider (ISP)
tr_tr: Internet Servis Sağlayıcı (ISP)

source: Internet Small Computer System Interface (iSCSI)
tr_tr: İnternet Küçük Bilgisayar Sistemi Arayüzü (iSCSI)

source: Internet protocol (IP)
tr_tr: İnternet Protokolü (IP)

source: It includes the following components:
id: Ini mencakup komponen-komponen berikut:
tr_tr: Aşağıdaki bileşenleri içerir:

source: JavaScript Object Notation (JSON)
tr_tr: JavaScript Nesne Gösterimi (JSON)

source: Key Manager service
tr_tr: Anahtar Yönetim servisi

source: Key Manager service (barbican)
tr_tr: Anahtar Yönetim servisi (barbican)

source: Key features are:
id: Fitur utama adalah:
tr_tr: Anahtar özellikler şöyledir:

source: LBaaS feature that provides availability monitoring using the ``ping`` command, TCP, and HTTP/HTTPS GET.
tr_tr: ``ping`` komutu, TCP ve HTTP/HTTPS GET kullanarak kullanılabilirlik izlemesi sağlayan LBaaS özelliği.

source: Launches stacks from templates, views details of running stacks including events and resources, and updates and deletes stacks.
id: Meluncurkan tumpukan dari template, tampilan detail dari menjalankan tumpukan termasuk peristiwa dan sumber daya, dan update dan menghapus tumpukan.
tr_tr: Şablonlardan yığınlar başlatır, çalışan yığınların ayrıntılarını kaynaklar ve olaylarla birlikte görüntüler ve yığınları günceller ve siler.

source: Layer-2 (L2) agent
tr_tr: Katman-2 (L2) ajanı

source: Layer-2 network
tr_tr: Katman-2 ağ

source: Layer-3 (L3) agent
tr_tr: Katman-3 (L3) ajanı

source: Layer-3 network
tr_tr: Katman-3 ağ

source: Lightweight Directory Access Protocol (LDAP)
tr_tr: Hafif Dizin Erişim Protokolü (LDAP)

source: Linux Bridge neutron plug-in
tr_tr: Linux Bridge neutron eklentisi

source: Linux bridge
tr_tr: Linux köprü

source: Linux containers (LXC)
tr_tr: Linux kapları (LXC)

source: Linux kernel feature that provides independent virtual networking instances on a single host with separate routing tables and interfaces. Similar to virtual routing and forwarding (VRF) services on physical network equipment.
tr_tr: Ayrı yönlendirme tabloları ve arayüzleri olan tek bir ana bilgisayarda bağımsız sanal ağ örnekleri sağlayan Linux çekirdeği özelliği. Fiziksel ağ donanımlarındaki sanal yönlendirme ve yönlendirme (VRF) hizmetlerine benzer.

source: Linux kernel security module that provides the mechanism for supporting access control policies.
tr_tr: Erişim kontrol politikalarını destekleme mekanizmasını sağlayan Linux çekirdeği güvenlik modülü.

source: List available volumes and their statuses:
id: Daftar volume yang tersedia dan status mereka:
tr_tr: Kullanılabilir birimleri ve durumlarını listeleyin:

source: List images, and note the ID of the image that you want to use for your volume:
id: gambar daftar, dan perhatikan ID dari gambar yang ingin Anda gunakan untuk volume Anda:
tr_tr: İmajları listeleyin ve birim için kullanmak istediğiniz imajın kimliğini not edin:

source: List instances:
tr_tr: Sunucuları listele:

source: List or get details for images (glance)
id: Daftar atau mendapatkan rincian untuk gambar (pandangan)
tr_tr: İmajları listeleyin ya da ayrıntılarını alın (glance)

source: List the availability zones, and note the ID of the availability zone in which you want to create your volume:
tr_tr: Kullanılabilirlik bölgelerini listeleyin ve birimi oluşturmak istediğiniz kullanılabilirlik bölgesinin kimliğini not edin:

source: List the hosts and the nova-related services that run on them:
tr_tr: Üzerlerinde çalışan sunucları ve nova ile ilişkili servisleri listeleyin:

source: List the volumes again, and note that the status of your volume is ``deleting``:
id: Daftar volume lagi, dan perhatikan bahwa status volume Anda adalah `` deleting``:
tr_tr: Birimleri tekrar listeleyin, ve biriminizin durumunun artık ``siliniyor`` olduğuna dikkat edin:

source: List volumes:
id: volume daftar:
tr_tr: Birimleri listeleyin:

source: Lists allowed commands within the Compute rootwrap facility.
id: Daftar diperbolehkan perintah dalam fasilitas rootwrap Komputer.
tr_tr: Hesaplama rootwrap servisinde izin verilen komutları listeler.

source: Lists containers in Object Storage and stores container information in the account database.
id: Daftar kontainer di Object Storage dan menyimpan informasi kontainer dalam database akun.
tr_tr: Nesne Depolama Alanındaki kapları listeler ve kap bilgilerini hesap veritabanında saklar.

source: Load-Balancer-as-a-Service (LBaaS)
tr_tr: Hizmet-olarak-Yük-Dengeleyici (LBaaS)

source: Load-balancing service (octavia)
tr_tr: Yük-dengeleme hizmeti (octavia)

source: Log in to the dashboard and from the drop-down list select the project for which you want to download the OpenStack RC file.
id: Login ke dashboard dan dari daftar drop-down pilih proyek yang Anda ingin men-download file OpenStack RC.
tr_tr: Kontrol panosuna giriş yapın ve aşağı açılır listeden OpenStack RC dosyasını indirmek istediğiniz projeyi seçin.

source: Logical Volume Manager (LVM)
tr_tr: Mantıksal Hacim Yönetimi (LVM)

source: Logical architecture
id: arsitektur logis
tr_tr: Mantıksal mimari

source: Logical groupings of related code, such as the Block Storage volume manager or network manager.
tr_tr: Blok Depolama hacmi yöneticisi veya ağ yöneticisi gibi ilgili kodun mantıksal grupları.

source: Logical subdivision of an IP network.
tr_tr: Bir IP ağının mantıksal altbölümü.

source: Lower power consumption CPU often found in mobile and embedded devices. Supported by OpenStack.
id: daya CPU konsumsi rendah sering ditemukan pada perangkat mobile dan embedded. Didukung oleh OpenStack.
tr_tr: Daha düşük güç tüketimi CPU çoğunlukla mobil ve gömülü aygıtlarda bulunur. OpenStack tarafından desteklenmektedir.

source: MD5 hash of an object within Object Storage, used to ensure data integrity.
id: MD5 hash dari sebuah objek dalam Object Storage, digunakan untuk memastikan integritas data.
tr_tr: Nesne Depolama Alanı içinde, veri bütünlüğünü sağlamak için kullanılan bir nesnenin MD5 karması.

source: Manage a snapshot
id: Mengelola snapshot
tr_tr: Bir anlık görüntüyü yönetin

source: Manage a snapshot with the :command:`openstack volume snapshot set` command:
tr_tr: :command:`openstack volume snapshot set` komutuyla bir anlık görüntüyü yönetin:

source: Manage and unmanage a snapshot
id: Mengelola dan unmanage snapshot
tr_tr: Bir anlık görüntüyü yönetim ve yönetmeyi bırakın

source: Manage images
id: mengelola gambar
tr_tr: İmajları yönetin

source: Manage volumes
id: mengelola volume
tr_tr: Birimleri yönetin

source: Managed through REST API with UI available as part of OpenStack Dashboard.
tr_tr: OpenStack Kontrol Panosunun parçası olarak kullanılabilen UI'ye sahip REST API üzerinden yönetilen.

source: Manages accounts defined with Object Storage.
id: account yang dikelola didefinisikan dengan Object Storage.
tr_tr: Nesne Depolamayla tanımlanan hesapları yönetir.

source: Manages actual objects, such as files, on the storage nodes.
id: Mengelola objek yang sebenarnya, seperti file, pada node penyimpanan.
tr_tr: Asıl nesneleri, örneğin dosyaları, depolama düğümlerinde yönetir.

source: Manages back-end devices that provide shared file systems. A manila-share process can run in one of two modes, with or without handling of share servers. Share servers export file shares via share networks. When share servers are not used, the networking requirements are handled outside of Manila.
id: Mengelola perangkat back-end yang menyediakan berbagi file sistem. Sebuah proses manila-share dapat berjalan di salah satu dari dua mode, dengan atau tanpa penanganan server saham. Berbagi file server ekspor saham melalui jaringan berbagi. Ketika server saham tidak digunakan, persyaratan jaringan ditangani di luar Manila.
tr_tr: Paylaşımlı dosya sistemleri sağlayan arka uç aygıtlarını yönetir. Bir manila-paylaşım süreci iki kipten birinde çalışabilir, paylaşım sunucularının ele alınması ile veya değil. Paylaşım sunucuları paylaşım ağları aracılığıyla dosya paylaşımlarını açığa çıkarır. Paylaşım sunucuları kullanılmadığında, ağ gereksinimleri Manila dışında ele alınır.

source: Manages the lifecycle of compute instances in an OpenStack environment. Responsibilities include spawning, scheduling and decommissioning of virtual machines on demand.
id: Mengelola siklus hidup dari contoh komputasi di lingkungan OpenStack. Tanggung jawabnya meliputi pemijahan, penjadwalan dan dekomisioning mesin virtual pada permintaan.
tr_tr: OpenStack ortamındaki hesaplama sunucularının yaşam döngülerini yönetir. Sorumlulukları isteğe bağlı olarak sanal makineleri başlatma, zamanlama ve kapatmaktır.

source: Manages the mapping of containers or folders, within Object Storage.
id: Mengelola pemetaan wadah atau folder, dalam Object Storage.
tr_tr: Kapsayıcılar veya dizinlerin, Nesne Depolama içinde eşleşmesini yönetir.

source: Many Linux distributions provide packages to make setuptools easy to install. Search your package manager for setuptools to find an installation package. If you cannot find one, download the setuptools package directly from `Python Setuptools <https://pypi.python.org/pypi/setuptools>`_.
tr_tr: Çoğu Linux dağıtımı setuptools'un kurulumunu kolaylaştırmak için paketler sağlar. Paket yöneticinizde setuptools'u aratarak bir kurulum paketi bulabilirsiniz. Bulamazsanız, setuptools paketini doğrudan `Python Setuptools <https://pypi.python.org/pypi/setuptools>`_ adresinden indirin.

source: Maps Object Storage partitions to physical storage devices.
id: Peta Object partisi Penyimpanan ke perangkat penyimpanan fisik.
tr_tr: Nesne Depolama bölümlerini fiziksel depolama aygıtlarına eşleştirir.

source: Massively scalable distributed storage system that consists of an object store, block store, and POSIX-compatible distributed file system. Compatible with OpenStack.
id: sistem penyimpanan besar-besaran scalable terdistribusi yang terdiri dari sebuah toko objek, blok toko, dan POSIX-kompatibel sistem file terdistribusi. Kompatibel dengan OpenStack.
tr_tr: Nesne deposu, blok deposu ve POSIX uyumlu dağıtılmış dosya sisteminden oluşan yoğun ölçeklenebilir dağıtılmış depolama sistemi. OpenStack ile uyumludur.

source: Maximum frame or packet size for a particular network medium. Typically 1500 bytes for Ethernet networks.
tr_tr: Belli bir ağ ortamı için maksimum çerçeve veya paket boyutu. Ethernet ağları için tipik olarak 1500 bayt.

source: Mechanism for highly available multi-host routing when using OpenStack Networking (neutron).
tr_tr: OpenStack Ağ kullanıldığında yüksek kullanılabilirliğe sahip çoklu ana bilgisayar yönlendirme mekanizması (neutron).

source: Mechanism in IP networks to detect end-to-end MTU and adjust packet size accordingly.
tr_tr: Uçtan uca MTU'yu tespit etmek ve buna göre paket boyutunu ayarlamak için IP ağlarındaki mekanizma.

source: Mediates interactions between the ``nova-compute`` service and the database. It eliminates direct accesses to the cloud database made by the ``nova-compute`` service. The ``nova-conductor`` module scales horizontally. However, do not deploy it on nodes where the ``nova-compute`` service runs. For more information, see `Configuration Reference Guide <https://docs.openstack.org/ocata/config-reference/compute/config-options.html#nova-conductor>`__.
tr_tr: ``nova-compute`` servisi ve veritabanı arasındaki etkileşime aracı olur. ``nova-compute`` servisi tarafından yapılan bulut veritabanına doğrudan erişimi ortadan kaldırır. ``nova-conductor`` modülü yatay ölçeklenir. Ancak ``nova-compute`` servisinin çalıştığı düğümlere kurmayın. Daha fazla bilgi için `Yapılandırma Başvuru Kılavuzuna <https://docs.openstack.org/ocata/config-reference/compute/config-options.html#nova-conductor>`__ göz atın.

source: Message exchange that is cleared when the service restarts. Its data is not written to persistent storage.
tr_tr: Hizmet yeniden başlatıldığında silinen ileti değişimi. Verileri kalıcı depolamaya yazılmaz.

source: Message queue software supported by OpenStack. An alternative to RabbitMQ. Also spelled 0MQ.
tr_tr: OpenStack tarafından desteklenen mesaj kuyruğu yazılımı. RabbitMQ'ya bir alternatif. Ayrıca 0MQ olarak da yazılır.

source: Message queue software supported by OpenStack; an alternative to RabbitMQ.
tr_tr: RabbiyMQ'ya alternatif; OpenStack tarafından desteklene mesaj kuyruğu yazılımı.

source: Message queue that is cleared when the service restarts. Its data is not written to persistent storage.
tr_tr: Hizmet yeniden başlatıldığında silinen ileti sırası. Verileri kalıcı depolamaya yazılmaz.

source: Message service (zaqar)
tr_tr: Mesaj servisi (zaqar)

source: Messaging queue
tr_tr: İleti kuyruğu

source: Meta-Data Server (MDS)
tr_tr: Üst-Veri Sunucusu (MDS)

source: Metadata agent
tr_tr: Üstveri ajanı

source: Metadata definition service
id: Layanan definisi metadata
tr_tr: Metaveri tanım servisi

source: Method of keeping a clock for a host or node correct via communication with a trusted, accurate time source.
tr_tr: Güvenilir, doğru bir zaman kaynağı ile iletişim yoluyla bir sunucu veya düğüm için doğru saat tutma yöntemi.

source: Method to access VM instance consoles using a web browser. Supported by Compute.
tr_tr: Bir web tarayıcısı kullanarak VM örnek konsollarına erişmek için kullanılan yöntem. Hesaplama tarafından desteklenmektedir.

source: Middleware modules run in the address space of the OpenStack component that is using the Identity service. These modules intercept service requests, extract user credentials, and send them to the centralized server for authorization. The integration between the middleware modules and OpenStack components uses the Python Web Server Gateway Interface.
id: modul middleware berjalan di ruang alamat dari komponen OpenStack yang menggunakan layanan Identity. Modul ini mencegat permintaan layanan, kepercayaan ekstrak pengguna, dan mengirimkannya ke server terpusat untuk otorisasi. Integrasi antara modul middleware dan komponen OpenStack menggunakan Python Web Server Gateway Interface.
tr_tr: Ara yazılım modülleri Kimlik servisini kullanan OpenStack bileşenin adres uzayında çalışır. Bu modüller servis isteklerini keser, kullanıcı kimlik bilgilerini çıkartır ve yetkilendirme için bunları merkezi sunucuya gönderirler. Ara yazılım modülleriyle OpenStack bileşenleri arasındaki yazılım Python Web Sunucu Geçit Arayüzünü kullanır.

source: Migrate a volume
id: Bermigrasi volume
tr_tr: Bir birimi göç ettirin

source: Migrate a volume with the :command:`openstack volume migrate` command, as shown in the following example:
tr_tr: Aşağıdaki örnekte olduğu gibi bir birimi :command:`openstack volume migrate` komutuyla göç ettirin:

source: Modify the properties of a volume.
id: Memodifikasi sifat dari volume.
tr_tr: Bir birimin özelliklerini değiştirin.

source: Modular Layer 2 (ML2) neutron plug-in
tr_tr: Modüler Katman 2 (ML2) neutron eklentisi

source: Modular system that allows the underlying message queue software of Compute to be changed. For example, from RabbitMQ to ZeroMQ or Qpid.
tr_tr: Hesaplama'nin altında yatan mesaj kuyruğu yazılımının değiştirilmesini sağlayan modüler sistem. Örneğin, RabbitMQ'dan ZeroMQ veya Qpid'e.

source: Modules
tr_tr: Modüller

source: Monitor (LBaaS)
tr_tr: İzleme (LBaaS)

source: Monitor (Mon)
tr_tr: İzleme (Mon)

source: Monitoring
id: pemantauan
tr_tr: İzleme

source: Monitoring (monasca)
tr_tr: Gözlem (monasca)

source: Monitoring solution.
id: Pemantauan solusi.
tr_tr: İzleme çözümü.

source: Monitors and meters the OpenStack cloud for billing, benchmarking, scalability, and statistical purposes.
id: Monitor dan meter awan OpenStack untuk penagihan, benchmarking, skalabilitas, dan keperluan statistik.
tr_tr: OpenStack bulutunu ödeme, başarım deneme, ölçeklenebilirlik ve istatistiksel amaçlarla izler ve ölçer.

source: Most Linux distributions include packaged versions of the command-line clients. You can directly install the clients from the packages with prerequisites. For more information, see Installing_from_packages_.
tr_tr: Çoğu Linux dağıtımları komut satırı istemcilerinin paketli sürümlerini içerir. İstemcileri ön koşullarıyla doğrudan paketlerden kurabilirsiniz. Daha fazla bilgi için, Paketten kuruluma bakınız_.

source: Mounted via OpenStack Block Storage controlled protocol (for example, iSCSI)
id: Dipasang melalui protokol kontrol OpenStack Block Storage (misalnya, iSCSI)
tr_tr: OpenStack Blok Depolama kontrollü iletişim kuralı aracılığıyla bağlıdır (örneğin, iSCSI)

source: NFV Orchestration Service (tacker)
tr_tr: NFV Orkestrasyon Servisi (tacker)

source: Name or ID of transfer to delete.
tr_tr: Silinecek aktarımın ismi veya kimliği.

source: NetApp volume driver
tr_tr: NetApp disk bölümü sürücüsü

source: Network Address Translation (NAT)
tr_tr: Ağ Adres Çevirisi (NAT)

source: Network File System (NFS)
tr_tr: Ağ Dosya Sistemi (NFS)

source: Network Service Header (NSH)
tr_tr: Ağ Servis Başlığı (NSH)

source: Network Time Protocol (NTP)
tr_tr: Ağ Zaman Protokolü (NTP)

source: Network traffic between a user or client (north) and a server (south), or traffic into the cloud (south) and out of the cloud (north). See also east-west traffic.
tr_tr: Bir kullanıcı veya istemci (kuzey) ve bir sunucu (güney) arasındaki ağ trafiği veya buluta (güney) ve buluttan (kuzey) trafik. Ayrıca bkz. doğu-batı trafiği.

source: Network traffic between servers in the same cloud or data center. See also north-south traffic.
id: lalu lintas jaringan antara server di awan yang sama atau datacenter. Lihat juga lalu lintas utara-selatan.
tr_tr: Aynı bulut veya veri merkezi içinde sunucular arasındaki ağ akışı. Ayrıca bakınız: kuzey-güney trafik.

source: Networking API (Neutron API)
tr_tr: Ağ API (Neutron API)

source: Networking service
tr_tr: Ağ servisi

source: Networking service (neutron)
tr_tr: Ağ servisi (neutron)

source: Networking service overview
id: ikhtisar layanan jaringan
tr_tr: Ağ servisi genel görünümü

source: New snapshot description
tr_tr: Yeni anlık görüntü tanımı

source: New snapshot name
tr_tr: Yeni anlık görüntü ismi
