Repository: 25hours/openstack-manuals
Catalog: doc/common/source/locale/*/LC_MESSAGES/common.po
Languages: id, tr_tr

source: Script that initializes the building of the ring file, takes daemon names as parameter and offers commands. Documented in http://docs.openstack.org/developer/swift/admin_guide.html#managing-services.
id: Script yang menginisialisasi pembangunan file cincin, mengambil nama daemon sebagai parameter dan menawarkan perintah. Didokumentasikan dalam http://docs.openstack.org/developer/swift/admin_guide.html#managing-services.

source: See access control list.
id: Lihat daftar kontrol akses.

source: Set the HTML title, which appears at the top of the browser window, by adding the following line to ``local_settings.py``:
id: Mengatur judul HTML, yang muncul di bagian atas jendela browser, dengan menambahkan baris berikut ke `` local_settings.py``:

source: Similar to :option:`--location` in usage, but indicates that the image server should immediately copy the data and store it in its configured image store.
id: Mirip dengan: Opsi: `--location` dalam penggunaan, tetapi menunjukkan bahwa server image harus segera menyalin data dan menyimpannya di toko citra dikonfigurasi.

source: Similar to the ``nova-compute`` service, accepts networking tasks from the queue and manipulates the network. Performs tasks such as setting up bridging interfaces or changing IPtables rules.
id: Serupa dengan `` layanan nova-compute``, menerima tugas jaringan dari antrian dan memanipulasi jaringan. Melakukan tugas-tugas seperti menyiapkan menjembatani interface atau mengubah Iptables aturan.

source: Site colors
id: warna situs

source: Storage protocol that encapsulates SCSI frames for transport over IP networks.
id: protokol penyimpanan yang merangkum SCSI frame untuk transportasi melalui jaringan IP.

source: Storage ring build and rebalance utility. Documented in http://docs.openstack.org/developer/swift/admin_guide.html#managing-the-rings.
id: cincin penyimpanan membangun dan menyeimbangkan utilitas. Didokumentasikan dalam http://docs.openstack.org/developer/swift/admin_guide.html#managing-the-rings.

source: The :command:`cinder delete` command does not return any output.
id: The: perintah: `perintah cinder delete` tidak kembali output apapun.

source: The :command:`cinder extend` command does not return any output.
id: The: perintah: `perintah cinder extend` tidak kembali output apapun.

source: The :command:`nova volume-detach` command does not return any output.
id: The: perintah: `nova perintah volume detach` tidak kembali output apapun.

source: The Compute service can send alerts through its notification system, which includes a facility to create custom notification drivers. Alerts can be sent to and displayed on the horizon dashboard.
id: Layanan Hitung dapat mengirim peringatan melalui sistem pemberitahuan, yang mencakup fasilitas untuk membuat driver pemberitahuan khusus. Alarm dapat dikirim ke dan ditampilkan pada dashboard cakrawala.

source: The ID of a volume that is the parent of the snapshot, and managed by the Block Storage service.
id: ID volume yang merupakan induk dari snapshot, dan dikelola oleh layanan Block Storage.

source: The Identity service endpoint template that contains services available to all tenants.
id: Layanan Identity Template endpoint yang berisi layanan yang tersedia untuk semua penyewa.

source: The Image service API endpoint for management of VM images.
id: Layanan Gambar API endpoint untuk manajemen gambar VM.

source: The OpenStack :term:`Identity service` provides a single point of integration for managing authentication, authorization, and service catalog services. Other OpenStack services use the Identity service as a common unified API. Additionally, services that provide information about users but that are not included in OpenStack (such as LDAP services) can be integrated into a pre-existing infrastructure.
id: The OpenStack: Istilah: `service` Identity memberikan satu titik integrasi untuk mengelola layanan otentikasi, otorisasi, dan katalog layanan. layanan OpenStack lainnya menggunakan layanan Identity sebagai API bersatu umum. Selain itu, layanan yang memberikan informasi tentang pengguna tapi itu tidak termasuk dalam OpenStack (seperti jasa LDAP) dapat diintegrasikan ke dalam infrastruktur yang sudah ada.

source: The OpenStack Object Storage is a multi-tenant object storage system. It is highly scalable and can manage large amounts of unstructured data at low cost through a RESTful HTTP API.
id: The OpenStack Object Storage adalah sistem penyimpanan objek multi-tenant. Hal ini sangat scalable dan dapat mengelola sejumlah besar data yang tidak terstruktur dengan biaya rendah melalui HTTP API tenang.

source: The OpenStack community lives in the #openstack IRC channel on the Freenode network. You can hang out, ask questions, or get immediate feedback for urgent and pressing issues. To install an IRC client or use a browser-based client, go to `https://webchat.freenode.net/ <https://webchat.freenode.net>`__. You can also use Colloquy (Mac OS X, http://colloquy.info/), mIRC (Windows, http://www.mirc.com/), or XChat (Linux). When you are in the IRC channel and want to share code or command output, the generally accepted method is to use a Paste Bin. The OpenStack project has one at http://paste.openstack.org. Just paste your longer amounts of text or logs in the web form and you get a URL that you can paste into the channel. The OpenStack IRC channel is ``#openstack`` on ``irc.freenode.net``. You can find a list of all OpenStack IRC channels at https://wiki.openstack.org/wiki/IRC.
id: Masyarakat OpenStack hidup dalam saluran IRC #openstack di jaringan Freenode. Anda dapat bergaul, mengajukan pertanyaan, atau mendapatkan umpan balik langsung untuk masalah yang mendesak dan mendesak. Untuk menginstal klien IRC atau menggunakan klien berbasis browser, pergi ke `https://webchat.freenode.net/ <https://webchat.freenode.net>` __. Anda juga dapat menggunakan Musyawarah (Mac OS X, http://colloquy.info/), mIRC (Windows, http://www.mirc.com/), atau XChat (Linux). Ketika Anda berada di channel IRC dan ingin berbagi kode atau perintah output, metode yang berlaku umum adalah dengan menggunakan Paste Bin. Proyek OpenStack memiliki satu di http://paste.openstack.org. Cukup tempelkan jumlah Anda lagi teks atau log dalam bentuk web dan Anda mendapatkan URL yang dapat Anda paste ke saluran. Saluran OpenStack IRC adalah `` # openstack`` pada `` irc.freenode.net``. Anda dapat menemukan daftar semua saluran OpenStack IRC di https://wiki.openstack.org/wiki/IRC.

source: The OpenStack community values your set up and testing efforts and wants your feedback. To log a bug, you must sign up for a Launchpad account at https://launchpad.net/+login. You can view existing bugs and report bugs in the Launchpad Bugs area. Use the search feature to determine whether the bug has already been reported or already been fixed. If it still seems like your bug is unreported, fill out a bug report.
id: Masyarakat OpenStack nilai mengatur dan usaha Anda menguji dan ingin umpan balik Anda. Untuk log bug, Anda harus mendaftar untuk account Launchpad di https://launchpad.net/+login. Anda dapat melihat bug yang ada dan melaporkan bug di daerah Launchpad Bugs. Gunakan fitur pencarian untuk menentukan apakah bug tersebut telah dilaporkan atau sudah diperbaiki. Jika masih tampak seperti bug Anda tidak dilaporkan, mengisi laporan bug.

source: The OpenStack core project that enables management of volumes, volume snapshots, and volume types. The project name of Block Storage is cinder.
id: Proyek-proyek inti OpenStack yang memungkinkan manajemen volume, snapshot volume, dan jenis volume. Nama proyek Blok Storage adalah bara.

source: The OpenStack core project that provides a central directory of users mapped to the OpenStack services they can access. It also registers endpoints for OpenStack services. It acts as a common authentication system. The project name of Identity is keystone.
id: Proyek inti OpenStack yang menyediakan direktori pusat pengguna dipetakan ke layanan OpenStack mereka dapat mengakses. Hal ini juga register endpoint untuk layanan OpenStack. Karena berfungsi sebagai sistem otentikasi umum. Nama proyek Identitas adalah batu kunci.

source: The OpenStack core project that provides compute services. The project name of Compute service is nova.
id: Proyek inti OpenStack yang menyediakan layanan komputasi. Nama proyek pelayanan Compute adalah nova.

source: The OpenStack dashboard by default on Ubuntu installs the ``openstack-dashboard-ubuntu-theme`` package.
id: The OpenStack dashboard secara default pada Ubuntu menginstal `` paket OpenStack-dashboard-ubuntu-theme``.

source: The OpenStack dashboard is a modular `Django web application <https://www.djangoproject.com/>`__ that provides a graphical interface to OpenStack services.
id: The OpenStack dashboard adalah aplikasi web modular `Django <https://www.djangoproject.com/>` __ yang menyediakan antarmuka grafis untuk OpenStack layanan.

source: The OpenStack project that implements clustering services and libraries for the management of groups of homogeneous objects exposed by other OpenStack services. The project name of Clustering service is senlin.
id: Proyek OpenStack yang mengimplementasikan layanan clustering dan perpustakaan untuk pengelolaan kelompok objek homogen terkena oleh layanan OpenStack lainnya. Nama proyek pelayanan Clustering adalah senlin.

source: The OpenStack project that provides integrated tooling for backing up, restoring, and recovering file systems, instances, or database backups. The project name is freezer.
id: Proyek OpenStack yang menyediakan perkakas terintegrasi untuk membuat cadangan, memulihkan, dan memulihkan file sistem, contoh, atau backup basis data. Nama proyek freezer.

source: The URL where the data for this image resides. This option is only available in V1 API. When using it, you also need to set ``--os-image-api-version``. For example, if the image data is stored in swift, you could specify ``--os-image-api-version 1 --location swift://account:key@example.com/container/obj``.
id: URL mana data untuk gambar ini berada. Opsi ini hanya tersedia di V1 API. Ketika menggunakannya, Anda juga perlu mengatur `` --os-gambar-api-version``. Sebagai contoh, jika data gambar disimpan dalam cepat, Anda bisa menentukan `` --os-gambar-api-versi 1 --location cepat: // akun: key @ example.com / container / obj``.

source: The `OpenStack wiki <https://wiki.openstack.org/>`__ contains a broad range of topics but some of the information can be difficult to find or is a few pages deep. Fortunately, the wiki search feature enables you to search by title or content. If you search for specific information, such as about networking or OpenStack Compute, you can find a large amount of relevant material. More is being added all the time, so be sure to check back often. You can find the search box in the upper-right corner of any OpenStack wiki page.
id: The `OpenStack wiki <https://wiki.openstack.org/>` __ berisi berbagai topik tetapi beberapa informasi yang bisa sulit untuk menemukan atau beberapa halaman dalam. Untungnya, fitur pencarian wiki memungkinkan Anda untuk mencari berdasarkan judul atau konten. Jika Anda mencari informasi tertentu, seperti tentang jaringan atau OpenStack Compute, Anda dapat menemukan sejumlah besar materi yang relevan. Lebih sedang ditambahkan sepanjang waktu, jadi pastikan untuk memeriksa kembali sering. Anda dapat menemukan kotak pencarian di pojok kanan atas setiap halaman wiki OpenStack.

source: The back-end store used by Image service to store VM images, options include Object Storage, local file system, S3, or HTTP.
id: Toko back-end yang digunakan oleh layanan Image untuk menyimpan VM gambar, pilihan termasuk Object Storage, sistem file lokal, S3, atau HTTP.

source: The container format of the image. Acceptable formats are ami, ari, aki, bare, docker, and ovf.
id: Format kontainer gambar. Format yang diterima adalah ami, ari, aki, telanjang, docker, dan OVF.

source: The following books explain how to use the OpenStack dashboard and command-line clients:
id: Buku-buku berikut ini menjelaskan bagaimana menggunakan OpenStack dashboard dan baris perintah klien:

source: The following can easily be customized:
id: berikut ini dapat dengan mudah disesuaikan:

source: The following example manages the ``my-snapshot-id`` snapshot with the ``my-volume-id`` parent volume:
id: Contoh berikut mengelola `` snapshot saya-snapshot-id`` dengan `` Volume orangtua-volume-id`` saya:

source: The following individual clients are deprecated in favor of a common client. Instead of installing and learning all these clients, we recommend installing and using the OpenStack client. You may need to install an individual project's client because coverage is not yet sufficient in the OpenStack client. If you need to install an individual client's project, replace the ``<project>`` name in this ``pip install`` command using the list below.
id: Masing-masing klien berikut usang dalam mendukung klien umum. Alih-alih memasang dan belajar semua klien ini, kami sarankan menginstal dan menggunakan klien OpenStack. Anda mungkin perlu menginstal klien proyek individu karena cakupan belum memadai dalam klien OpenStack. Jika Anda perlu menginstal proyek klien individu, menggantikan `` <project> `` nama dalam `` pip perintah install`` menggunakan daftar di bawah ini.

source: The following list explains the optional arguments that you can use with the ``create`` and ``set`` commands to modify image properties. For more information, refer to Image service chapter in the `OpenStack Command-Line Interface Reference <http://docs.openstack.org/cli-reference/index.html>`__.
id: Daftar berikut menjelaskan argumen opsional yang dapat Anda gunakan dengan `` create`` dan `` set`` perintah untuk memodifikasi properti gambar. Untuk informasi lebih lanjut, lihat bab layanan Gambar di `OpenStack Command-Line Interface Referensi <http://docs.openstack.org/cli-reference/index.html>` __.

source: The following table lists the command-line client for each OpenStack service with its package name and description.
id: Tabel berikut mencantumkan klien baris perintah untuk setiap layanan OpenStack dengan nama paket dan keterangan.

source: The logo also acts as a hyperlink. The default behavior is to redirect to ``horizon:user_home``. To change this, add the following attribute to ``local_settings.py``:
id: logo juga bertindak sebagai hyperlink. Perilaku default adalah untuk mengarahkan ke `` cakrawala: user_home``. Untuk mengubah ini, menambahkan atribut berikut untuk `` local_settings.py``:

source: The minimum amount of RAM needed to boot the image, in megabytes.
id: Jumlah minimum RAM yang dibutuhkan untuk boot gambar, dalam megabyte.

source: The minimum size of the disk needed to boot the image, in gigabytes.
id: Ukuran minimum dari disk yang diperlukan untuk boot gambar, dalam gigabyte.

source: The name of the image.
id: Nama gambar.

source: The persistent data store used to save and retrieve information for a service, such as lists of Object Storage objects, current state of guest VMs, lists of user names, and so on. Also, the method that the Image service uses to get and store VM images. Options include Object Storage, local file system, S3, and HTTP.
id: Menyimpan data persisten digunakan untuk menyimpan dan mengambil informasi untuk layanan, seperti daftar objek Storage Object, keadaan saat tamu VMS, daftar nama pengguna, dan sebagainya. Juga, metode yang menggunakan layanan Gambar untuk mendapatkan dan menyimpan gambar VM. Pilihan termasuk Object Storage, sistem file lokal, S3, dan HTTP.

source: The point where a user interacts with a service; can be an API endpoint, the horizon dashboard, or a command-line tool.
id: Titik di mana pengguna berinteraksi dengan layanan; bisa menjadi titik akhir API, dashboard cakrawala, atau alat baris perintah.

source: The procedure for volume transfer is intended for tenants (both the volume donor and recipient) within the same cloud.
id: Prosedur untuk transfer volume yang ditujukan untuk penyewa (baik volume donor dan penerima) dalam awan yang sama.

source: The recommended way to install setuptools on Microsoft Windows is to follow the documentation provided on the setuptools website (https://pypi.python.org/pypi/setuptools).
id: Cara yang disarankan untuk menginstal setuptools pada Microsoft Windows adalah mengikuti dokumentasi yang disediakan di situs setuptools (https://pypi.python.org/pypi/setuptools).

source: The tenant who owns an Image service virtual machine image.
id: Penyewa yang memiliki layanan Gambar mesin virtual gambar.

source: The tenant who should own the image. The size of image data, in bytes.
id: Penyewa yang harus memiliki gambar. Ukuran data gambar, dalam byte.

source: The web-based management interface for OpenStack. An alternative name for horizon.
id: Antarmuka manajemen berbasis web untuk OpenStack. Sebuah nama alternatif untuk horizon.

source: Then you can install the packages:
id: Kemudian Anda dapat menginstal paket:

source: Theoretically, OpenStack Compute can support any database that SQL-Alchemy supports. Common databases are SQLite3 for test and development work, MySQL, MariaDB, and PostgreSQL.
id: Secara teoritis, OpenStack Compute dapat mendukung database SQL-Alchemy mendukung. database umum adalah SQLite3 untuk uji dan pengembangan, MySQL, MariaDB, dan PostgreSQL.

source: There are also packaged versions of the clients available in `RDO <https://www.rdoproject.org/>`__ that enable yum to install the clients as described in Installing_from_packages_.
id: Ada juga versi dikemas dari klien tersedia dalam `RDO <https://www.rdoproject.org/>` __ yang memungkinkan yum untuk menginstal klien seperti yang dijelaskan dalam Installing_from_packages_.

source: This guide focuses on the ``local_settings.py`` file.
id: Panduan ini berfokus pada `` berkas local_settings.py``.

source: To provide a set of services for provisioning, scaling, and managing container orchestration engines.
id: Untuk memberikan satu set layanan untuk mesin provisioning, scaling, dan mengelola wadah orkestrasi.

source: To provide feedback on documentation, join and use the openstack-docs@lists.openstack.org mailing list at `OpenStack Documentation Mailing List <http://lists.openstack.org/cgi-bin/mailman/listinfo/openstack-docs>`__, or `report a bug <https://bugs.launchpad.net/openstack-manuals/+filebug>`__.
id: Untuk memberikan umpan balik pada dokumentasi, bergabung dan menggunakan milis openstack-docs@lists.openstack.org di `OpenStack Daftar Dokumentasi Mailing <http://lists.openstack.org/cgi-bin/mailman/listinfo/openstack-docs> `__, atau` melaporkan bug <https://bugs.launchpad.net/openstack-manuals/+filebug> `__.

source: To remove the client, run the :command:`pip uninstall` command:
id: Untuk menghapus klien, jalankan: perintah: `pip perintah uninstall`:

source: To set the required environment variables for the OpenStack command-line clients, you must create an environment file called an OpenStack rc file, or ``openrc.sh`` file. If your OpenStack installation provides it, you can download the file from the OpenStack dashboard as an administrative user or any other user. This project-specific environment file contains the credentials that all OpenStack services use.
id: Untuk mengatur variabel lingkungan yang diperlukan untuk klien baris perintah OpenStack, Anda harus membuat file lingkungan yang disebut file rc OpenStack, atau `` berkas openrc.sh``. Jika instalasi OpenStack Anda menyediakan itu, Anda dapat men-download file dari dashboard OpenStack sebagai pengguna administratif atau pengguna lain. File lingkungan khusus-proyek ini berisi kredensial yang menggunakan semua layanan OpenStack.

source: To upgrade a client, add the :option:`--upgrade` option to the :command:`pip install` command:
id: Untuk meng-upgrade klien, menambahkan: opsi: opsi `--upgrade` ke: perintah:` pip perintah install`:

source: To view your changes reload your dashboard. If necessary go back and modify your CSS file as appropriate.
id: Untuk melihat perubahan ulang dashboard Anda. Jika perlu kembali dan memodifikasi file CSS Anda yang sesuai.

source: Type of back-end device the identifier provided. Is typically ``source-name`` or ``source-id``. Defaults to ``source-name``.
id: Jenis perangkat back-end identifier yang disediakan. Biasanya `` sumber-name`` atau `` sumber-id``. Standarnya `` sumber-name``.

source: Unmanage a snapshot with the :command:`cinder snapshot-unmanage` command:
id: Unmanaged snapshot dengan: perintah: `cinder snapshot-unmanaged` perintah:

source: Use OpenStack Compute to host and manage cloud computing systems. OpenStack Compute is a major part of an Infrastructure-as-a-Service (:term:`IaaS`) system. The main modules are implemented in Python.
id: Gunakan OpenStack Compute untuk menjadi tuan rumah dan mengelola sistem komputasi awan. OpenStack Compute adalah bagian utama dari a-Service Infrastructure-as-(: istilah: `IaaS`) sistem. Modul utama diimplementasikan dalam Python.

source: Use the :command:`trove-manage` command to import images and offer them to tenants.
id: Gunakan: perintah: `perintah harta-manage` untuk mengimpor gambar dan menawarkan mereka untuk penyewa.

source: Users can access OpenStack via the web-based user interface implemented by :doc:`Dashboard <get-started-dashboard>`, via `command-line clients <http://docs.openstack.org/cli-reference/>`__ and by issuing API requests through tools like browser plug-ins or :command:`curl`. For applications, `several SDKs <http://developer.openstack.org/#sdk>`__ are available. Ultimately, all these access methods issue REST API calls to the various OpenStack services.
id: Pengguna dapat mengakses OpenStack melalui antarmuka pengguna berbasis web dilaksanakan oleh: doc: `Dashboard <get-mulai-dashboard>`, melalui `klien baris perintah <http://docs.openstack.org/cli-reference/>` __ dan dengan mengeluarkan permintaan API melalui alat seperti plug-in browser, atau: perintah: `curl`. Untuk aplikasi, `beberapa SDK <http://developer.openstack.org/#sdk>` __ tersedia. Pada akhirnya, semua ini metode akses masalah SISA API panggilan ke berbagai layanan OpenStack.

source: Various repository types are supported including normal file systems, Object Storage, RADOS block devices, HTTP, and Amazon S3. Note that some repositories will only support read-only usage.
id: Berbagai jenis repositori yang didukung termasuk sistem file normal, Object Storage, RADOS block device, HTTP, dan Amazon S3. Perhatikan bahwa beberapa repositori hanya akan mendukung read-only penggunaan.

source: Virtual network type that uses neither VLANs nor tunnels to segregate tenant traffic. Each flat network typically requires a separate underlying physical interface defined by bridge mappings. However, a flat network can contain multiple subnets.
id: Virtual jenis jaringan yang menggunakan tidak VLAN atau terowongan untuk memisahkan lalu lintas penyewa. Setiap jaringan datar biasanya memerlukan antarmuka fisik yang mendasari terpisah didefinisikan oleh pemetaan jembatan. Namun, jaringan datar dapat berisi beberapa subnet.

source: When installing OpenStack Identity service, you must register each service in your OpenStack installation. Identity service can then track which OpenStack services are installed, and where they are located on the network.
id: Saat memasang layanan OpenStack Identity, Anda harus mendaftar setiap layanan di instalasi OpenStack Anda. Layanan Identity kemudian dapat melacak layanan OpenStack yang diinstal, dan di mana mereka berada pada jaringan.
