Repository: 25hours/openstack-manuals
Catalog: doc/common/source/locale/*/LC_MESSAGES/common.po
Languages: id, tr_tr

source: A daemon that listens to a queue and carries out tasks in response to messages. For example, the cinder-volume worker manages volume creation and deletion on storage arrays.
tr_tr: Bir sırayı dinleyen ve mesajları yanıtlayan görevleri yerine getiren bir arka plan programı. Örneğin, cinder-volume işçisi, depolama dizileri üzerinde disk bölümü oluşturma ve silme işlemlerini yönetir.

source: A database engine supported by the Database service.
id: Sebuah mesin database yang didukung oleh layanan database.
tr_tr: Veritabanı hizmeti tarafından desteklenen bir veritabanı motorudur.

source: A default role in the Compute RBAC system that can quarantine an instance in any project.
tr_tr: Hesaplama RBAC sisteminde, herhangi bir projedeki bir sunucuyu karantinaya alabilecek varsayılan bir rol.

source: A device that moves data in the form of blocks. These device nodes interface the devices, such as hard disks, CD-ROM drives, flash drives, and other addressable regions of memory.
id: Sebuah perangkat yang memindahkan data dalam bentuk blok. node perangkat ini antarmuka perangkat, seperti hard disk, CD-ROM drive, flash drive, dan daerah beralamat lainnya dari memori.
tr_tr: Veriyi bloklar halinde taşıyan aygıt. Bu aygıt düğümleri, sabit disk, CD-ROM aygıtları, bellek aygıtı ve belleğin diğer adreslenebilir bölümleri gibi aygıtlara arayüz sağlar.

source: A directory service, which allows users to login with a user name and password. It is a typical source of authentication tokens.
id: Sebuah layanan direktori, yang memungkinkan pengguna untuk login dengan user name dan password. Ini adalah sumber khas token otentikasi.
tr_tr: Kullanıcıların bir kullanıcı adı ve parola ile oturum açmasına izin veren bir dizin hizmeti. Kimlik doğrulama jetonlarının tipik bir kaynağıdır.

source: A discrete OpenStack environment with dedicated API endpoints that typically shares only the Identity (keystone) with other regions.
tr_tr: Genellikle sadece Kimlik'i (keystone) diğer bölgelerle paylaşan ayrılmış API uç noktalarına sahip ayrı bir OpenStack ortamı.

source: A disk storage protocol tunneled within Ethernet.
id: Sebuah protokol penyimpanan disk terowongan dalam Ethernet.
tr_tr: Ethernet içinde tünellenen bir disk depolama protokolü.

source: A distributed memory object caching system that is used by Object Storage for caching.
tr_tr: Nesne Depolama Birimi tarafından önbellekleme için kullanılan dağıtılmış bir bellek nesnesi önbelleğe alma sistemi.

source: A distributed, highly fault-tolerant file system designed to run on low-cost commodity hardware.
id: Sebuah didistribusikan, sistem file yang sangat toleran dirancang untuk berjalan pada perangkat keras komoditas murah.
tr_tr: Düşük maliyetli ticari donanımda çalışmak üzere tasarlanmış, dağıtık, yüksek düzeyde hataya dayanıklı dosya sistemi.

source: A domain within a parent domain. Subdomains cannot be registered. Subdomains enable you to delegate domains. Subdomains can themselves have subdomains, so third-level, fourth-level, fifth-level, and deeper levels of nesting are possible.
tr_tr: Üst alandaki bir alan. Alt alanlar kaydedilemez. Alt alanlar, alanları delege etmemizi sağlar. Alt alanlar kendi başlarına alt alanlara sahip olabilirler, böylece üçüncü seviye, dördüncü seviye, beşinci seviye ve daha derin seviyelerde iç içe geçme mümkündür.

source: A driver for the Modular Layer 2 (ML2) neutron plug-in that provides layer-2 connectivity for virtual instances. A single OpenStack installation can use multiple mechanism drivers.
tr_tr: Modüler Katman 2 (ML2) nötron eklentisi için sanal örnekler için katman-2 bağlantısı sağlayan bir sürücü. Tek bir OpenStack kurulumu, birden fazla mekanizma sürücüsünü kullanabilir.

source: A feature of Compute that allows the unprivileged "nova" user to run a specified list of commands as the Linux root user.
tr_tr: Ayrıcalıksız "nova" kullanıcısının Linux kök kullanıcısı olarak belirli bir komut listesi çalıştırmasına izin veren Hesaplama özelliğidir.

source: A feature of the load-balancing service. It attempts to force subsequent connections to a service to be redirected to the same node as long as it is online.
tr_tr: Yük dengeleme hizmetinin bir özelliği. Bir hizmete olan sonraki bağlantıları, çevrimiçi olduğu sürece aynı düğüme yeniden yönlendirilmek üzere zorlar.

source: A file sharing protocol. It is a public or open variation of the original Server Message Block (SMB) protocol developed and used by Microsoft. Like the SMB protocol, CIFS runs at a higher level and uses the TCP/IP protocol.
id: Sebuah protokol file sharing. Ini adalah variasi umum atau terbuka Server Message Block (SMB) protokol asli yang dikembangkan dan digunakan oleh Microsoft. Seperti protokol SMB, CIFS berjalan pada tingkat yang lebih tinggi dan menggunakan protokol TCP / IP.
tr_tr: Dosya paylaşım protokolü. Microsoft tarafından geliştirilen ve kullanılan orijinal Sunucu İleti Bloğu (SMB) protokolünün genel veya açık bir varyasyonudur. SMB protokolü gibi, CIFS daha yüksek bir seviyede çalışır ve TCP/IP protokolünü kullanır.

source: A file system designed to aggregate NAS hosts, compatible with OpenStack.
id: Sebuah sistem file dirancang untuk agregat NAS host, kompatibel dengan OpenStack.
tr_tr: OpenStack ile uyumlu, NAS sunucularını toplamak için tasarlanmış bir dosya sistemi.

source: A file used to customize a Compute instance. It can be used to inject SSH keys or a specific network configuration.
tr_tr: Bir Hesaplama sunucusunu özelleştirmek için kullanılan bir dosya. SSH anahtarlarını veya belirli bir ağ yapılandırması enjekte etmek için kullanılabilir.

source: A generic term for virtualization of network functions such as switching, routing, load balancing, and security using a combination of VMs and overlays on physical network infrastructure.
tr_tr: Anahtarlama, yönlendirme, yük dengeleme ve güvenlik gibi fiziksel ağ altyapısı üzerine VM'lerin ve bindirmelerin birleşimini kullanarak ağ işlevlerinin sanallaştırılması için genel bir terim.

source: A great way to get answers and insights is to post your question or problematic scenario to the OpenStack mailing list. You can learn from and help others who might have similar issues. To subscribe or view the archives, go to the `general OpenStack mailing list <http://lists.openstack.org/cgi-bin/mailman/listinfo/openstack>`_. If you are interested in the other mailing lists for specific projects or development, refer to `Mailing Lists <https://wiki.openstack.org/wiki/Mailing_Lists>`_.
tr_tr: Yanıtları ve fikirleri almak için mükemmel bir yol, soru ya da sorunlu senaryonuzu OpenStack posta listesine göndermektir. Benzer sorunları olabilecek diğer insanlardan bilgi edinebilir ve bunlara yardımcı olabilirsiniz. Kayıt olmak veya arşivi görmek için `genel OpenStack e-posta listesine <http://lists.openstack.org/cgi-bin/mailman/listinfo/openstack>`_ gidin. Eğer belirli projeler ve geliştirme için başka e-posta listelerine ilginiz varsa `E-posta Listeleri <https://wiki.openstack.org/wiki/Mailing_Lists>`_'ne bakın.

source: A group of fixed and/or floating IP addresses that are assigned to a project and can be used by or assigned to the VM instances in a project.
id: Sekelompok alamat IP tetap dan / atau mengambang yang ditugaskan untuk sebuah proyek dan dapat digunakan oleh atau ditugaskan ke contoh VM dalam proyek.
tr_tr: Bir projeye atanan ve bir projedeki VM örnekleri tarafından kullanılacak veya atanabilen sabit ve/veya kayan IP adresleri grubu.

source: A group of interrelated web development techniques used on the client-side to create asynchronous web applications. Used extensively in horizon.
id: Sekelompok teknik pengembangan web saling terkait yang digunakan pada sisi klien untuk membuat aplikasi web asynchronous. Digunakan secara luas di cakrawala.
tr_tr: Asenkron web uygulamaları oluşturmak için istemci tarafında kullanılan birbiriyle ilişkili web geliştirme teknikleri grubu. Ufukta yoğun bir şekilde kullanılır.

source: A group of related button types within horizon. Buttons to start, stop, and suspend VMs are in one class. Buttons to associate and disassociate floating IP addresses are in another class, and so on.
id: Sekelompok jenis tombol terkait dalam cakrawala. Tombol untuk memulai, menghentikan, dan menangguhkan VMs berada dalam satu kelas. Tombol untuk mengasosiasikan dan memisahkan mengambang alamat IP berada di kelas lain, dan sebagainya.
tr_tr: Görüşteki ilgili düğme türlerinden oluşan bir grup. VM'leri başlatmak, durdurmak ve askıya almak için kullanılan düğmeler tek bir sınıfta. Yüzen IP adreslerini ilişkilendirmek ve ayırmak için kullanılan düğmeler başka bir sınıfta.

source: A group of users; used to isolate access to Compute resources. An alternative term for a project.
tr_tr: Bir kullanıcı grubu; Hesaplama kaynaklarına erişimi izole etmek için kullanılır. Bir proje için alternatif bir terim.

source: A grouped release of projects related to OpenStack that came out in April 2012, the fifth release of OpenStack. It included Compute (nova 2012.1), Object Storage (swift 1.4.8), Image (glance), Identity (keystone), and Dashboard (horizon). Essex is the code name for the fifth release of OpenStack. The design summit took place in Boston, Massachusetts, US and Essex is a nearby city.
id: Sebuah rilis dikelompokkan proyek yang terkait dengan OpenStack yang keluar pada bulan April 2012, rilis kelima OpenStack. Ini termasuk Hitung (nova 2012.1), Object Storage (swift 1.4.8), Gambar (pandangan), Identity (keystone), dan Dashboard (horizon). Essex adalah nama kode untuk rilis kelima OpenStack. KTT desain berlangsung di Boston, Massachusetts, Amerika Serikat dan Essex adalah sebuah kota di dekatnya.
tr_tr: OpenStack'ın beşinci sürümünde Nisan 2012'de yayınlanan OpenStack ile ilgili projelerin grup halinde yayınlanması. Compute (nova 2012.1), Nesne Depolama Alanı (swift 1.4.8), Görüntü (glance), Kimlik (keystone) ve Gösterge Tablosu (horizon) dahil edildi. Essex, OpenStack'in beşinci sürümünün kod adıdır. Tasarım zirvesi Boston, Massachusetts, ABD'de gerçekleşti ve Essex yakındaki bir şehirdi.

source: A grouped release of projects related to OpenStack that came out in February of 2011. It included only Compute (nova) and Object Storage (swift). Bexar is the code name for the second release of OpenStack. The design summit took place in San Antonio, Texas, US, which is the county seat for Bexar county.
id: Sebuah rilis dikelompokkan proyek yang terkait dengan OpenStack yang keluar pada bulan Februari 2011. Ini termasuk hanya Compute (nova) dan Object Storage (cepat). Bexar adalah nama kode untuk rilis kedua dari OpenStack. KTT desain berlangsung di San Antonio, Texas, AS, yang merupakan pusat pemerintahan kabupaten untuk Bexar county.
tr_tr: 2011'in Şubat ayında OpenStack ile alakalı bir grup proje sürümü çıktı. Sadece Hesaplama (nova) ve Nesne Depolama (swift)'i içeriyordu. Bexar, OpenStack'in ikinci sürümünün kod adıdır. Tasarım zirvesi, Bexar ilçesinin ilçe merkezi olan San Antonio, Texas'ta gerçekleşti.

source: A grouped release of projects related to OpenStack that came out in the fall of 2011, the fourth release of OpenStack. It included Compute (nova 2011.3), Object Storage (swift 1.4.3), and the Image service (glance). Diablo is the code name for the fourth release of OpenStack. The design summit took place in the Bay Area near Santa Clara, California, US and Diablo is a nearby city.
id: Sebuah rilis dikelompokkan proyek yang terkait dengan OpenStack yang keluar pada musim gugur 2011, rilis keempat OpenStack. Ini termasuk Hitung (nova 2.011,3), Object Storage (swift 1.4.3), dan layanan Image (pandangan). Diablo adalah nama kode untuk rilis keempat OpenStack. KTT desain berlangsung di Bay Area dekat Santa Clara, California, Amerika Serikat dan Diablo adalah sebuah kota di dekatnya.
tr_tr: OpenStack'ın dördüncü sürümü olan 2011'in sonbaharında çıkan OpenStack ile ilgili projelerin grup halinde yayınlanması. Hesaplama (nova 2011.3), Nesne Depolama Alanı (swift 1.4.3) ve Görüntü hizmetini (glance) içeriyordu. Diablo, OpenStack'in dördüncü sürümü için kod adıdır. Tasarım zirvesi ABD Kaliforniya, Santa Clara yakınlarındaki Bay Area'da gerçekleşti ve Diablo yakındaki bir şehirdir.

source: A grouped release of projects related to OpenStack that came out in the fall of 2012, the sixth release of OpenStack. It includes Compute (nova), Object Storage (swift), Identity (keystone), Networking (neutron), Image service (glance), and Volumes or Block Storage (cinder). Folsom is the code name for the sixth release of OpenStack. The design summit took place in San Francisco, California, US and Folsom is a nearby city.
id: Sebuah rilis dikelompokkan proyek yang terkait dengan OpenStack yang keluar pada musim gugur 2012, rilis keenam OpenStack. Ini termasuk Compute (nova), Object Storage (cepat), Identity (keystone), Jaringan (neutron), layanan Image (pandangan), dan Volume atau Block Storage (abu). Folsom adalah nama kode untuk rilis keenam OpenStack. KTT desain berlangsung di San Francisco, California, Amerika Serikat dan Folsom adalah kota terdekat.
tr_tr: OpenStack'ın altıncı sürümünde olan 2012 yılının sonbaharında çıkan OpenStack ile ilgili projelerin grup halinde yayınlanması. Hesaplama (nova), Nesne Depolama Alanı (swift), Kimlik (keystone), Ağ Oluşturma (neutron), İmaj servisi (glance) ve Disk Bölümleri veya Blok Depolama (cinder) içerir. Folsom, OpenStack'in altıncı sürümünün kod adıdır. Tasarım zirvesi, ABD'nin Kaliforniya eyaletindeki San Francisco kentinde gerçekleşti ve Folsom yakınlardaki bir kenttir.

source: A high availability system design approach and associated service implementation ensures that a prearranged level of operational performance will be met during a contractual measurement period. High availability systems seek to minimize system downtime and data loss.
id: Sebuah ketersediaan tinggi pendekatan desain sistem dan implementasi layanan yang terkait memastikan bahwa tingkat diatur sebelumnya kinerja operasional akan bertemu selama periode pengukuran kontrak. sistem ketersediaan tinggi berusaha untuk meminimalkan downtime sistem dan kehilangan data.
tr_tr: Yüksek kullanılabilirlikli sistem tasarımı yaklaşımı ve bunlarla ilgili hizmet uygulaması, sözleşmeye dayalı bir ölçüm periyodu sırasında önceden belirlenmiş bir operasyonel performans düzeyinin sağlanmasını sağlar. Yüksek kullanılabilirlik sistemleri, sistemin kapalı kalma süresini ve veri kaybını en aza indirger.

source: A horizon component that stores and tracks client session information. Implemented through the Django sessions framework.
tr_tr: İstemci oturum bilgilerini saklayan ve izleyen horizon bileşeni. Django oturum çerçevesi ile gerçekleştirilmiştir.

source: A hybrid cloud is a composition of two or more clouds (private, community or public) that remain distinct entities but are bound together, offering the benefits of multiple deployment models. Hybrid cloud can also mean the ability to connect colocation, managed and/or dedicated services with cloud resources.
id: Awan hibrida adalah komposisi dari dua atau lebih awan (swasta, masyarakat atau publik) yang tetap entitas yang berbeda namun terikat bersama-sama, menawarkan manfaat dari beberapa model penyebaran. Hybrid cloud juga dapat berarti kemampuan untuk menghubungkan colocation, managed services dan / atau berdedikasi dengan sumber daya cloud.
tr_tr: Melez bir bulut, birden çok dağıtım modelinin faydalarını sunan, ayrı varlıklar olarak kalan, ancak birbirine bağlı olan iki veya daha fazla bulutun (özel, topluluk veya kamuya açık) bir bileşimidir. Karma bulut, aynı zamanda ortak yerleşim, yönetilen ve/veya ayrılmış hizmetleri bulut kaynaklarıyla bağlama olanağı anlamına da gelebilir.

source: A kind of web service API that uses REST, or Representational State Transfer. REST is the style of architecture for hypermedia systems that is used for the World Wide Web.
tr_tr: REST veya Temsili Durum Aktarımı kullanan bir tür web servis API'sıdir. REST, World Wide Web için kullanılan hiper ortam sistemleri mimarisi türüdür.

source: A lightweight SQL database, used as the default persistent storage method in many OpenStack services.
tr_tr: Bir çok OpenStack servisinde varsayılan kalıcı depolama olarak kullanılan hafif bir SQL veritabanıdır.

source: A list of API endpoints that are available to a user after authentication with the Identity service.
id: Daftar endpoint API yang tersedia untuk pengguna setelah otentikasi dengan layanan Identity.
tr_tr: Kimlik servisi ile kullanıcı doğrulama yapıldıktan sonra bir kullanıcı için kullanılabilir olan API uç noktalarının bir listesi.

source: A list of URL and port number endpoints that indicate where a service, such as Object Storage, Compute, Identity, and so on, can be accessed.
id: Daftar URL dan nomor port endpoint yang menunjukkan di mana layanan, seperti Object Storage, Compute, Identitas, dan sebagainya, dapat diakses.
tr_tr: Nesne Depolama Alanı, Hesaplama, Kimlik ve benzeri bir hizmetin nerede erişileceğini gösteren URL ve port numarası uç noktalarının bir listesi.

source: A list of VM images that are available through Image service.
id: Sebuah daftar gambar VM yang tersedia melalui layanan Gambar.
tr_tr: İmaj hizmeti aracılığıyla kullanılabilen VM imajlarının bir listesi.

source: A list of permissions attached to an object. An ACL specifies which users or system processes have access to objects. It also defines which operations can be performed on specified objects. Each entry in a typical ACL specifies a subject and an operation. For instance, the ACL entry ``(Alice, delete)`` for a file gives Alice permission to delete the file.
id: Daftar izin dilampirkan ke objek. ACL menentukan mana pengguna atau proses sistem memiliki akses ke objek. Hal ini juga mendefinisikan yang operasi dapat dilakukan pada objek tertentu. Setiap entri dalam ACL khas menentukan subjek dan operasi. Misalnya, masuknya ACL `` (Alice, menghapus) `` untuk file memberikan izin Alice untuk menghapus file.
tr_tr: Bir nesneye eklenen izinlerin bir listesi. Bir ACL, hangi kullanıcıların veya sistem işlemlerinin nesnelere erişimi olduğunu belirtir. Ayrıca, belirtilen nesneler üzerinde hangi işlemlerin gerçekleştirilebileceğini tanımlar. Tipik bir ACL'deki her girdi, bir özne ve bir işlemi belirtir. Örneğin, bir dosya için ``(Alice, delete)`` ACL girişi Alice'e dosyayı silmek için izin verir.

source: A list of projects that can access a given VM image within Image service.
tr_tr: İmaj hizmetinde belirli bir VM imaj erişebilen projelerin listesi.

source: A load balancer is a logical device that belongs to a cloud account. It is used to distribute workloads between multiple back-end systems or services, based on the criteria defined as part of its configuration.
tr_tr: Yük dengeleyici, bir bulut hesabına ait mantıksal bir aygıttır. Yapılandırmanun bir parçası olarak tanımlanan kriterlere dayanarak, iş yüklerini birden fazla arka uç sistem veya hizmet arasında dağıtmak için kullanılır.

source: A logical set of devices, such as web servers, that you group together to receive and process traffic. The load balancing function chooses which member of the pool handles the new requests or connections received on the VIP address. Each VIP has one pool.
tr_tr: Trafiği almak ve işlemek üzere bir araya getirdiğiniz web sunucuları gibi mantıksal bir dizi cihaz. Yük dengeleme işlevi, havuzun hangi üyesinin VIP adresinde alınan yeni istekleri veya bağlantıları seçtiğini seçer. Her VIP'nin bir havuzu vardır.

source: A mechanism that allows IPv6 packets to be transmitted over an IPv4 network, providing a strategy for migrating to IPv6.
id: Sebuah mekanisme yang memungkinkan paket IPv6 untuk ditransmisikan melalui jaringan IPv4, menyediakan strategi untuk migrasi ke IPv6.
tr_tr: IPv6 paketlerinin bir IPv4 ağı üzerinden iletilmesini sağlayan ve IPv6'ya geçiş stratejisi sağlayan bir mekanizma.

source: A mechanism that allows many resources (for example, fonts, JavaScript) on a web page to be requested from another domain outside the domain from which the resource originated. In particular, JavaScript's AJAX calls can use the XMLHttpRequest mechanism.
id: Sebuah mekanisme yang memungkinkan banyak sumber daya (misalnya, font, JavaScript) pada halaman web yang akan diminta dari domain lain di luar domain yang sumber daya berasal. Secara khusus, AJAX panggilan JavaScript dapat menggunakan mekanisme XMLHttpRequest.
tr_tr: Bir web sayfasındaki kaynakların (örneğin, yazı tipleri, JavaScript) birçoğunun kaynaktan kaynaklanan etki alanının dışındaki başka bir alan adından talep edilebilmesini sağlayan bir mekanizma. Özellikle JavaScript'in AJAX çağrıları, XMLHttpRequest mekanizmasını kullanabilir.

source: A message that is stored both in memory and on disk. The message is not lost after a failure or restart.
tr_tr: Hem bellekte hem de diskte saklanan bir ileti. Bir arıza veya yeniden başlatma sonrasında mesaj kaybolmaz.

source: A message that is stored in memory and is lost after the server is restarted.
tr_tr: Hafızada saklanan ve sunucu yeniden başlatıldıktan sonra kaybolan bir mesaj.

source: A method for making file systems available over the network. Supported by OpenStack.
tr_tr: Dosya sistemleri ağ üzerinden kullanılabilir kılmak için bir yöntem. OpenStack tarafından desteklenmektedir.

source: A method of VM live migration used by KVM to evacuate instances from one host to another with very little downtime during a user-initiated switchover. Does not require shared storage. Supported by Compute.
id: Sebuah metode migrasi hidup VM digunakan oleh KVM untuk mengevakuasi contoh dari satu host ke yang lain dengan sangat sedikit downtime selama peralihan dimulai oleh pengguna. Tidak memerlukan penyimpanan bersama. Didukung oleh Compute.
tr_tr: Kullanıcı tarafından başlatılan bir geçiş sırasında çok az kesinti ile örnekleri bir ana bilgisayardan diğerine tahliye etmek için KVM tarafından kullanılan VM canlı geçiş yöntemi. Paylaşılan depolama alanı gerektirmez. Hesaplama tarafından desteklenmektedir.

source: A method of operating system installation where a finalized disk image is created and then used by all nodes without modification.
id: Sebuah metode instalasi sistem operasi mana disk image selesai dibuat dan kemudian digunakan oleh semua node tanpa modifikasi.
tr_tr: Sonlandırılmış bir disk imajının oluşturulduğu ve daha sonra herhangi bir değişiklik yapılmadan tüm düğümler tarafından sistem kurulumunda kullanılan bir yöntem.

source: A method to establish trusts between identity providers and the OpenStack cloud.
id: Sebuah metode untuk membangun trust antara penyedia identitas dan awan OpenStack.
tr_tr: Kimlik sağlayıcıları ve OpenStack bulutu arasında güven oluşturmak için kullanılan bir yöntem.

source: A method to further subdivide availability zones into hypervisor pools, a collection of common hosts.
id: Sebuah metode untuk membagi zona ketersediaan ke kolam hypervisor, koleksi host umum.
tr_tr: Kullanılabilirlik bölgelerini, ortak ana bilgisayarlardan oluşan bir koleksiyon olan hipervizör havuzlarına daha da alt bölümlere ayırmak için kullanılan bir yöntem.

source: A minimal Linux distribution designed for use as a test image on clouds such as OpenStack.
id: Sebuah distribusi Linux yang minimal dirancang untuk digunakan sebagai gambar tes di awan seperti OpenStack.
tr_tr: OpenStack gibi bulutlar üzerinde bir test imajı olarak kullanılmak üzere tasarlanmış minimal bir Linux dağıtımı.
