Repository: 25hours/openstack-manuals
Catalog: doc/common/source/locale/*/LC_MESSAGES/common.po
Languages: id, tr_tr

source: The service that provides a set of services for management of shared file systems in a multi-project cloud environment, similar to how OpenStack provides block-based storage management through the OpenStack :term:`Block Storage service<Block Storage service (cinder)>` project. With the Shared File Systems service, you can create a remote file system and mount the file system on your instances. You can also read and write data from your instances to and from your file system.
tr_tr: OpenStack :term:`Blok Depolama servisi <Block Storage service (cinder)>` aracılığıyla OpenStack'in blok tabanlı depolama yönetimi sağlamasına benzer şekilde, bir çoklu proje bulut ortamında paylaşımlı dosya sistemlerinin yönetimi için bir servis kümesi sağlayan servis. Paylaşılan Dosya Sistemleri servisiyle uzak bir dosya sistemi oluşturabilir ve dosya sistemini sunucunuza bağlayabilirsiniz. Ayrıca, örneklerinizden dosya sisteminize ve dosyanızdan veri okuyabilir ve yazabilirsiniz.

source: The software package used to provide AMQP messaging capabilities within Compute. Default package is RabbitMQ.
tr_tr: Hesaplama içinde AMQP mesajlaşma yetenekleri sağlamak için kullanılan yazılım paketi. Varsayılan paket RabbitMQ'dur.

source: The solution addresses the following use cases:
id: Solusinya membahas kasus penggunaan berikut:
tr_tr: Çözüm şu kullanım durumlarını hedefler:

source: The source used by Identity service to retrieve user information; an OpenLDAP server, for example.
id: Sumber yang digunakan oleh layanan Identity untuk mengambil informasi pengguna; server openldap, misalnya.
tr_tr: Kimlik hizmeti tarafından kullanıcı bilgilerini almak için kullanılan kaynak; Örneğin bir OpenLDAP sunucusu.

source: The step in the Compute scheduling process when hosts that cannot run VMs are eliminated and not chosen.
id: Langkah dalam proses penjadwalan Compute ketika host yang tidak dapat menjalankan VMS dieliminasi dan tidak dipilih.
tr_tr: VM'leri çalıştıramayan ana makineler elendiğinde Hesaplama zamanlama sürecindeki adım ortadan kaldırılır ve seçilmez.

source: The storage method used by the Identity service catalog service to store and retrieve information about API endpoints that are available to the client. Examples include an SQL database, LDAP database, or KVS back end.
id: Cara penyimpanan yang digunakan oleh Identity layanan katalog layanan untuk menyimpan dan mengambil informasi tentang endpoint API yang tersedia untuk klien. Contohnya termasuk database SQL, Database LDAP, atau KVS back end.
tr_tr: Kimlik hizmeti katalog hizmeti tarafından istemcinin kullanabileceği API uç noktaları hakkında bilgi depolamak ve almak için kullanılan depolama yöntemi. Örnekler arasında bir SQL veritabanı, LDAP veritabanı veya KVS arka uç bulunur.

source: The sum of each cost used when deciding where to start a new VM instance in Compute.
tr_tr: Hesaplama'da yeni bir VM sunucusuna nereden başlatacağınıza karar verirken kullanılan her maliyetin toplamı.

source: The transfer of data, usually in the form of files, from one computer to another.
id: Transfer data, biasanya dalam bentuk file, dari satu komputer ke komputer lain.
tr_tr: Genellikle dosya biçiminde verilerin bir bilgisayardan diğerine aktarılması.

source: The underlying format that a disk image for a VM is stored as within the Image service back-end store. For example, AMI, ISO, QCOW2, VMDK, and so on.
id: Yang mendasari format yang disk image untuk VM disimpan sebagai dalam layanan Gambar toko back-end. Misalnya, AMI, ISO, QCOW2, VMDK, dan sebagainya.
tr_tr: Bir VM için bir disk görüntüsünün temel resim hizmeti arka uç deposunda olduğu gibi depolandığı biçimi. Örneğin, AMI, ISO, QCOW2, VMDK vb.

source: The universal measurement of how quickly data is transferred from place to place.
id: Pengukuran universal seberapa cepat data ditransfer dari satu tempat ke tempat.
tr_tr: Verinin bir yerden bir yere ne kadar hızlı aktarıldığını gösteren evrensel ölçü birimi.

source: The valid model values depend on the ``libvirt_type`` setting, as shown in the following tables.
tr_tr: Geçerli model değerleri aşağıdaki tabloda gösterildiği şekilde ``libvirt_type`` ayarına bağlıdır.

source: The volume must be in an ``available`` state or the request will be denied. If the transfer request is valid in the database (that is, it has not expired or been deleted), the volume is placed in an ``awaiting-transfer`` state. For example:
id: Volume harus dalam `` negara available`` atau permintaan akan ditolak. Jika permintaan transfer berlaku dalam database (yaitu, belum kedaluwarsa atau sudah dihapus), volume ditempatkan dalam `` negara menunggu-transfer``. Sebagai contoh:
tr_tr: Birim ``kullanılabilir`` durumda olmalıdır yoksa istek reddedilir. Aktarım isteği veritabanında geçerliyse (yani zaman aşımına uğramamış ya da silinmemişse), birim ``aktarım-bekliyor`` durumuna geçirilir. Örneğin:

source: Then install pip and use it to manage client installation:
id: Kemudian instal pip dan menggunakannya untuk mengelola instalasi klien:
tr_tr: Adından pip kurun ve istemci kurulumlarını yönetmek için kullanın:

source: Theoretically, OpenStack Compute can support any database that SQLAlchemy supports. Common databases are SQLite3 for test and development work, MySQL, MariaDB, and PostgreSQL.
tr_tr: Teorik olarak, OpenStack Hesaplama SQLAlchemy'nin desteklediği tüm veritabanlarını destekleyebilir. Genellikle test ve geliştirme işleri için SQLite3, MySQL, MariaDB ve PostgreSQL.

source: There are also packaged versions of the clients available that enable :command:`yum` to install the clients as described in Installing_from_packages_.
tr_tr: İstemcilerin ayrıca paketlerden yüklemede gösterildiği gibi :command:`yum` tarafından kurulmasını sağlayan paketli sürümleri de bulunur.

source: There are also packaged versions of the clients available that enable zypper to install the clients as described in Installing_from_packages_.
id: Ada juga versi dikemas dari klien yang tersedia yang memungkinkan zypper untuk menginstal klien seperti yang dijelaskan di Instalasi Dari Paket.
tr_tr: Ayrıca paketlerden kurulum kısmında anlatıldığı gibi zypper ile istemcileri kurabilmeniz için paketli sürümleri de bulunur.

source: These services communicate by using the OpenStack messaging bus. Only the collector and API server have access to the data store.
id: Layanan ini berkomunikasi dengan menggunakan OpenStack pesan bus. Hanya kolektor dan server API memiliki akses ke data store.
tr_tr: Bu servisler OpenStack ileti veri yolunu kullanarak iletişim kurarlar. Yalnızca toplayıcı ve API sunucusu veri merkezine doğrudan erişebilir.

source: These values are computed by using information about the flavors of the instances that run on the hosts. This command does not query the CPU usage, memory usage, or hard disk usage of the physical host.
tr_tr: Bu değerler makineler üzerinde çalışan sunucuların nitelikleri hakkında bilgi kullanılarak hesaplanır. Bu komut fiziksel sunucunun CPU kullanımını, hafıza kullanımını veya sabit disk kullanımını sorgulamaz.

source: This command assumes that you have enabled the OpenStack repository for your distribution. For more information, see the `Installation Tutorial for Red Hat Enterprise Linux and CentOS <https://docs.openstack.org/ocata/install-guide-rdo/environment-packages.html>`_.
tr_tr: Bu komut dağıtımınız için OpenStack deposunu etkinleştirdiğinizi varsayar. Daha fazla bilgi için, `Red Hat Kurumsal Linux ve CentOS için Kurulum Öğreticisine <https://docs.openstack.org/ocata/install-guide-rdo/environment-packages.html>`_ göz atın.

source: This command assumes that you have enabled the OpenStack repository for your distribution. For more information, see the `Installation Tutorial for openSUSE and SUSE Linux Enterprise <https://docs.openstack.org/ocata/install-guide-obs/environment-packages.html>`_.
tr_tr: Bu komut dağıtımınız için OpenStack deposunu etkinleştirdiğinizi varsayar. Daha fazla bilgi için `openSUSE ve SUSE Linux Kurumsal için Kurulum Öğreticisine <https://docs.openstack.org/ocata/install-guide-obs/environment-packages.html>`_ göz atın.

source: This command does not provide any output.
tr_tr: Bu komut herhangi bir çıktı sağlamaz.

source: This example creates a ``my-new-volume`` volume based on an image.
id: Contoh ini menciptakan `` my-baru-volume`` volume based pada gambar.
tr_tr: Bu örnek bir imaj tabanlı ``my-new-volume`` birimini oluşturur.

source: This example is a high-level process flow for using Database services:
id: Contoh ini adalah aliran proses tingkat tinggi untuk menggunakan layanan database:
tr_tr: Bu örnek Veritabanı servislerini kullanmak için yüksek seviye süreç akışıdır:

source: This glossary offers a list of terms and definitions to define a vocabulary for OpenStack-related concepts.
id: glossary ini menawarkan daftar istilah dan definisi untuk mendefinisikan kosakata untuk konsep OpenStack terkait.
tr_tr: Bu sözlük, OpenStack ile ilgili kavramlar için bir sözcük tanımlamak için terimlerin ve tanımların bir listesini sunar.

source: This section describes OpenStack services in detail.
id: Bagian ini menjelaskan OpenStack layanan secara rinci.
tr_tr: Bu kısım OpenStack servislerini ayrıntılı olarak tanımlar.

source: To add to OpenStack glossary, clone the `openstack/openstack-manuals repository <https://git.openstack.org/cgit/openstack/openstack-manuals>`__ and update the source file ``doc/common/glossary.rst`` through the OpenStack contribution process.
id: Untuk menambah OpenStack glossary, mengkloning `OpenStack / OpenStack-manual repositori <https://git.openstack.org/cgit/openstack/openstack-manuals>` __ dan memperbarui file sumber `` doc / umum / glossary.rst `` melalui proses kontribusi OpenStack.
tr_tr: OpenStack sözlüğüne ekleme yapmak için, `openstack/openstack-manuals deposunu <https://git.openstack.org/cgit/openstack/openstack-manuals>`__ klonlayın ve OpenStack katkısı süresinde ``doc/common/glossary.rst`` kaynak dosyasını güncelleyin.

source: To avoid storing the password in plain text, you can prompt for the OpenStack password interactively.
id: Untuk menghindari menyimpan password dalam teks biasa, Anda dapat meminta password OpenStack interaktif.
tr_tr: Parolayı düz metin olarak kaydetmekten kaçınmak için, OpenStack parolasını etkileşimli şekilde sordurabilirsiniz.

source: To create an image, use :command:`openstack image create`:
id: Untuk membuat gambar, gunakan: perintah: `OpenStack image create`:
tr_tr: Bir imaj oluşturmak için, :command:`openstack image create` kullanın:

source: To delete your volume, you must first detach it from the server. To detach the volume from your server and check for the list of existing volumes, see steps 1 and 2 in Resize_a_volume_.
id: Untuk menghapus volume Anda, Anda harus mencopotnya dahulu dari server. Untuk melepaskan volume dari server Anda dan memeriksa daftar volume yang ada, lihat langkah 1 dan 2 di Resize_a_volume_.
tr_tr: Bir birimi silmek için, önce sunucudan ayırmanız gerekir. Bir birimi sunucunuzdan ayırmak ve mevcut birimlerin listesini kontrol etmek için, birimi yeniden boyutlandırm aşamasındaki 1. ve 2. adımlara göz atın.

source: To design, deploy, and configure OpenStack, administrators must understand the logical architecture.
id: Merancang, menyebarkan, dan mengkonfigurasi OpenStack, administrator harus memahami arsitektur logis.
tr_tr: OpenStack'i tasarlamak, kurmak ve yapılandırmak için yöneticiler mantıksal mimariyi anlamalıdır.

source: To get a list of images and to get further details about a single image, use :command:`openstack image list` and :command:`openstack image show` commands.
id: Untuk mendapatkan daftar gambar dan untuk mendapatkan rincian lebih lanjut tentang satu gambar, gunakan: perintah: `OpenStack image list` dan: perintah:` perintah gambar show` OpenStack.
tr_tr: İmajların listesini almak ve tek bir imajla ilgili ayrıntıları getirmek için :command:`openstack image list` ve :command:`openstack image show` komutlarını kullanın.

source: To install the clients on a Linux, Mac OS X, or Microsoft Windows system, use pip. It is easy to use, ensures that you get the latest version of the clients from the `Python Package Index <https://pypi.python.org/>`__, and lets you update or remove the packages later on.
id: Untuk menginstal klien pada Linux, Mac OS X, atau sistem Microsoft Windows, gunakan pip. Hal ini mudah digunakan, memastikan bahwa Anda mendapatkan versi terbaru dari klien dari `Python Package Index <https://pypi.python.org/>` __, dan memungkinkan Anda memperbarui atau menghapus paket nanti.
tr_tr: İstemcileri Linux, Mac OS X veya Microsoft Windows sisteminde kurmak için, pip kullanın. Kullanımı kolaydır, `Python Paket İndisinden <https://pypi.python.org/>`__ istemcilerin son sürümlerini almanızı sağlar, ve ilerde paketleri güncellemenize ve kaldırmanıza izin verir.

source: To provide feedback on documentation, join and use the openstack-docs@lists.openstack.org mailing list at `OpenStack Documentation Mailing List <http://lists.openstack.org/cgi-bin/mailman/listinfo/openstack-docs>`_, join our IRC channel ``#openstack-doc`` on the freenode IRC network, or `report a bug <https://bugs.launchpad.net/openstack-manuals/+filebug>`_.
tr_tr: Belgelendirme hakkında geri bildirim yapmak için `OpenStack Belgelendirme Mail Listesindeki <http://lists.openstack.org/cgi-bin/mailman/listinfo/openstack-docs>`_ openstack-docs@lists.openstack.org mail listesine katılın ve kullanın, freenode IRC ağındaki ``#openstack-doc`` IRC kanalımıza katılın veya `bir hata raporlayın <https://bugs.launchpad.net/openstack-manuals/+filebug>`_.

source: To provide feedback on documentation, join and use the openstack-docs@lists.openstack.org mailing list at `OpenStack Documentation Mailing List <http://lists.openstack.org/cgi-bin/mailman/listinfo/openstack-docs>`_, or `report a bug <https://bugs.launchpad.net/openstack-manuals/+filebug>`_.
tr_tr: Belgelendime üzerine geribildirimde bulunma için `OpenStack Belgelendirme E-posta Listesi <http://lists.openstack.org/cgi-bin/mailman/listinfo/openstack-docs>`_'ndeki openstack-docs@lists.openstack.org e-posta listesine katılabilir ve kullanabilirsiniz veya `bir hata raporlayın <https://bugs.launchpad.net/openstack-manuals/+filebug>`_.

source: To remove the client with pip, run the :command:`pip uninstall` command:
tr_tr: İstemciyi pip ile kaldırmak için, :command:`pip uninstall` komutunu çalıştırın:

source: To resize your volume, you must first detach it from the server. To detach the volume from your server, pass the server ID and volume ID to the following command:
id: Untuk mengubah ukuran volume Anda, Anda harus mencopotnya dahulu dari server. Untuk melepaskan volume dari server Anda, lulus ID server dan ID volume untuk perintah berikut:
tr_tr: Biriminizi yeniden boyutlandırmak için önce sunucudan ayırmanız gerekir. Birimi sunucudan ayırmak için aşağıdaki komuta sunucu ve birim kimliklerini verin:

source: To set the required environment variables for the OpenStack command-line clients, you must create an environment file called an OpenStack rc file, or ``openrc.sh`` file. If your OpenStack installation provides it, you can download the file from the OpenStack Dashboard as an administrative user or any other user. This project-specific environment file contains the credentials that all OpenStack services use.
tr_tr: OpenStack komut satırı istemcileri için gerekli çevre değişkenlerini ayarlamak için, OpenStack rc dosyası, ya da ``openrc.sh`` dosyası olarak adlandırılan bir çevre dosyası oluşturmalısınız. OpenStack kurulumunuz bunu sağlıyorsa, dosyayı doğrudan OpenStack Kontrol Panosundan yönetici kullanıcı veya başka bir kullanıcı olarak indirebilirsiniz. Bu projeye özel ortam dosyası tüm OpenStack servislerinin kullandığı kimlik bilgilerini içerir.

source: To store location metadata for images, which enables direct file access for a client, update the ``/etc/glance/glance-api.conf`` file with the following statements:
id: Untuk menyimpan metadata lokasi untuk gambar, yang memungkinkan akses file langsung untuk klien, memperbarui file `` / etc / pandangan / pandangan-api.conf`` dengan pernyataan berikut:
tr_tr: İmajlar için konum metaverisi kaydetmek için, ki bu istemci için doğrudan dosya erişimini etkinleştirir, ``/etc/glance/glance-api.conf`` dosyasını aşağıdaki ifadelerle güncelleyin:

source: To update an image by name or ID, use :command:`openstack image set`:
id: Untuk memperbarui gambar berdasarkan nama atau ID, gunakan: perintah: `OpenStack image set`:
tr_tr: Bir imajı isimle veya kimlikle güncellemek için, :command:`openstack image set` kullanın:

source: To upgrade a client with :command:`pip`, add the ``--upgrade`` option to the :command:`pip install` command:
tr_tr: Bir istemciyi :command:`pip` ile güncellemek için, :command:`pip install` komutuna ``--upgrade`` seçeneğini ekleyin:

source: To verify that your volume was created successfully, list the available volumes:
id: Untuk memverifikasi bahwa volume Anda telah berhasil dibuat, daftar volume yang tersedia:
tr_tr: Biriminizin başarıyla oluşturulduğunu onaylamak için kullanılabilir birimleri listeleyin:

source: Tool used for maintaining Address Resolution Protocol packet filter rules in the Linux kernel firewall modules. Used along with iptables, ebtables, and ip6tables in Compute to provide firewall services for VMs.
id: Alat yang digunakan untuk menjaga Address Resolution Protocol aturan packet filter di Linux modul firewall kernel. Digunakan bersama dengan iptables, ebtables, dan ip6tables di Hitung untuk menyediakan layanan firewall untuk VMs.
tr_tr: Linux çekirdeği güvenlik duvarı modüllerinde Adres Çözümleme Protokolü paket filtre kurallarını korumak için kullanılan araç. VM'ler için güvenlik duvarı hizmetleri sağlamak için Hesapma'daki iptables, ebtables ve ip6tables ile birlikte kullanılır.

source: Tool used in OpenStack development to ensure correctly ordered testing of changes in parallel.
tr_tr: Paralel değişikliklerin doğru bir şekilde test edilmesini sağlamak için OpenStack geliştirmesinde kullanılan araç.

source: Tool used to set up, maintain, and inspect the tables of IPv6 packet filter rules in the Linux kernel. In OpenStack Compute, ip6tables is used along with arptables, ebtables, and iptables to create firewalls for both nodes and VMs.
id: Alat yang digunakan untuk mengatur, menjaga, dan memeriksa tabel IPv6 aturan packet filter di kernel Linux. Dalam OpenStack Compute, ip6tables digunakan bersama dengan arptables, ebtables, dan iptables untuk membuat firewall untuk kedua node dan VMS.
tr_tr: Linux çekirdeğinde IPv6 paket filtre kurallarının tablolarını oluşturmak, korumak ve incelemek için kullanılan araç. OpenStack Compute'de, ip6tables hem düğümler hem de VM'ler için güvenlik duvarları oluşturmak için arptables, ebtables ve iptables ile birlikte kullanılır.

source: Tracks the inventory and usage of each provider. For details, see `Placement API <https://docs.openstack.org/developer/nova/placement.html>`__.
tr_tr: Her bir sağlayıcının envanterini ve kullanımını takikp eder. Ayrıntılar için `Yerleştirme API'sine <https://docs.openstack.org/developer/nova/placement.html>`__ göz atın.

source: Transfer a volume
id: Mentransfer volume
tr_tr: Bir birimi aktarın

source: Troubleshoot image creation
id: Masalah penciptaan gambar
tr_tr: İmaj oluşturmada sorun giderme

source: Type of Compute scheduler that evenly distributes instances among available hosts.
tr_tr: Var olan bilgisayarlar arasında örnekleri eşit şekilde dağıtan Hesaplama zamanlayıcı türü.

source: UUID for each Compute or Image service VM flavor or instance type.
id: UUID untuk setiap komputer atau Image layanan VM rasa atau jenis contoh.
tr_tr: Her Hesaplama veya İmaj hizmetinin VM flavor'ı veya sunucu türü için UUID.

source: UUID used by Image service to uniquely identify each VM image.
id: UUID digunakan oleh layanan Image untuk secara unik mengidentifikasi setiap gambar VM.
tr_tr: UUID, her VM imajını benzersiz şekilde tanımlamak için İmaj servisi tarafından kullanılır.

source: Under the Compute distributed scheduler, this is calculated by looking at the capabilities of each host relative to the flavor of the VM instance being requested.
id: Di bawah scheduler Compute didistribusikan, ini dihitung dengan melihat kemampuan masing-masing tuan rumah relatif terhadap rasa contoh VM yang diminta.
tr_tr: Hesaplama'nın dağıtık zamanlayıcısı altında, stenen VM sunucunun flavor'ı ile alakalı her sunucunun kapasitesine bakılarak hesaplanır.

source: Unified command-line client
tr_tr: Birleştirilmiş komut satırı istemcisi

source: Unique ID applied to each storage volume under the Block Storage control.
tr_tr: Blok Depolama alanı kontrolü altındaki her depolama hacmine benzersiz kimlik uygulanır.

source: Unique ID assigned to each Networking VIF.
tr_tr: Her Ağ Oluşturma VIF'sine atanan benzersiz kimlik.

source: Unique ID assigned to each Object Storage request; used for debugging and tracing.
tr_tr: Her bir Nesne Depolama isteğine atanan benzersiz kimlik; Hata ayıklama ve izleme için kullanılır.

source: Unique ID assigned to each guest VM instance.
id: Unik ID ditugaskan untuk setiap tamu VM instance.
tr_tr: Her misafir VM sunucuya atanan biricik kimlik.

source: Unique ID assigned to each network segment within Networking. Same as network UUID.
tr_tr: Ağ içinde her ağ kesimine ayrılmış benzersiz kimlik. Ağ UUID'si ile aynı.

source: Unique ID assigned to each project by the Identity service.
tr_tr: Kimlik hizmeti tarafından her projeye atanan benzersiz kimlik.

source: Unique ID assigned to each request sent to Compute.
tr_tr: Hesaplama'ya gönderilen her isteğe atanan benzersiz kimlik.

source: Unique ID assigned to each service that is available in the Identity service catalog.
tr_tr: Kimlik hizmeti katalogunda bulunan her bir hizmete atanan benzersiz kimlik.

source: Unique ID for a Networking VIF or vNIC in the form of a UUID.
id: Unik ID untuk VIF Networking atau vNIC dalam bentuk UUID.
tr_tr: Bir UUID şeklinde bir Ağ VIF veya vNIC için benzersiz kimlik.

source: Unique ID for a Networking network segment.
tr_tr: Bir Ağ ağı dilimi için benzersiz kimlik.

source: Unique ID for a Networking port.
tr_tr: Bir Ağ bağlantı noktası için benzersiz kimlik.

source: Unique ID for an Object Storage object.
tr_tr: Nesne Depolama nesnesi için benzersiz kimlik.

source: Unique numeric ID associated with each user in Identity, conceptually similar to a Linux or LDAP UID.
id: numerik ID unik yang terkait dengan setiap pengguna di Identity, konseptual mirip dengan Linux atau LDAP UID.
tr_tr: Kimlik içindeki her kullanıcıyla ilişkili, kavramsal olarak bir Linux veya LDAP UID'sine benzeyen benzersiz sayısal kimlik.

source: Unix-like computer operating system assembled under the model of free and open-source software development and distribution.
tr_tr: Unix benzeri bir bilgisayar işletim sistemi, ücretsiz ve açık kaynaklı yazılım geliştirme ve dağıtımı modeli altında toplandı.

source: Unless the unified OpenStack Client (**python-openstackclient**) is used, the following table lists the command-line client for each OpenStack service with its package name and description.
tr_tr: Birleştirilmiş OpenStack İstemcisi (**python-openstackclient**) kullanılmıyorsa, aşağıdaki tablo her bir OpenStack servisi için paket ismi ve tanımıyla birlikte komut satırı istemcilerini listeler.

source: Unmanage a snapshot
id: Unmanage snapshot
tr_tr: Bir anlık görüntüyü yönetmeyi bırakın

source: Unmanage a snapshot with the :command:`openstack volume snapshot unset` command:
tr_tr: :command:`openstack volume snapshot unset` komutuyla bir anlık görüntüyü yönetmeyi bırakın:

source: Upgrade or remove clients
id: Upgrade atau menghapus klien
tr_tr: İstemcileri güncelleyin veya kaldırın
