Repository: 25hours/openstack-manuals
Catalog: doc/common/source/locale/*/LC_MESSAGES/common.po
Languages: id, tr_tr

source: You are not prompted for the password with this method. The password lives in clear text format in the ``PROJECT-openrc.sh`` file. Restrict the permissions on this file to avoid security problems. You can also remove the ``OS_PASSWORD`` variable from the file, and use the ``--password`` parameter with OpenStack client commands instead.
tr_tr: Bu yöntemle size parola sorulmaz. Parola ``PROJE-openrc.sh`` dosyasında açık metin biçiminde durur. Güvenlik sorunlarını önlemek için bu dosyaya erişimi kısıtlayın. Ayrıca ``OS_PASSWORD`` değişkenini dosyadan çıkarabilir ve OpenStack istemci komutlarını ``--password`` parametresiyle kullanabilirsiniz.

source: You can install pip and use it to manage client installation:
id: Anda dapat menginstal pip dan menggunakannya untuk mengelola instalasi klien:
tr_tr: Pip kurabilir ve istemci kurulumlarını yönetmek için kullanabilirsiniz:

source: You can run the commands from the command line, or include the commands within scripts to automate tasks. If you provide OpenStack credentials, such as your user name and password, you can run these commands on any computer.
id: Anda dapat menjalankan perintah dari baris perintah, atau menyertakan perintah dalam skrip untuk mengotomatisasi tugas-tugas. Jika Anda memberikan OpenStack kredensial, seperti nama pengguna dan password, Anda dapat menjalankan perintah ini di komputer manapun.
tr_tr: Komutları komut satırından çalıştırabilir, veya görevleri otomatikleştirmek için komutları betiklere dahil edebilirsiniz. OpenStack kimlik bilgilerini sağlarsanız, örneğin kullanıcı adınız ve parolanızı, bu komutları herhangi bir bilgisayarda çalıştırabilirsiniz.

source: You can show basic statistics on resource usage for hosts and instances.
tr_tr: Sunucular ve makineler için kaynak kullanımına ait temel istatistikleri gösterebilirsiniz.

source: You can transfer a volume from one owner to another by using the :command:`openstack volume transfer request create` command. The volume donor, or original owner, creates a transfer request and sends the created transfer ID and authorization key to the volume recipient. The volume recipient, or new owner, accepts the transfer by using the ID and key.
tr_tr: Bir birimi sahibinden başka bir sahibe :command:`openstack volume transfer request create` komutuyla aktarabilirsiniz. Birimi veren, asıl sahibi, bir aktarım isteği oluşturur ve oluşturulan aktarım kimliğini ve yetkilendirme anahtarını birimi alan tarafa gönderir. Birimi alan, veya yeni sahip, kimlik ve anahtarı kullanarak aktarımı kabul eder.

source: You can upload ISO images to the Image service (glance). You can subsequently boot an ISO image using Compute.
id: Anda dapat meng-upload gambar ISO ke layanan Image (pandangan). Anda kemudian dapat boot image ISO menggunakan Compute.
tr_tr: ISO imajlarını İmaj servisine (glance) yükleyebilirsiniz. Ardından Hesaplama ile bir ISO imajından ön yükleme yapabilirsiniz.

source: You can upload images through the ``glance`` client or the Image service API. You can use the ``nova`` client for the image management. The latter provides mechanisms to list and delete images, set and delete image metadata, and create images of a running instance or snapshot and backup types.
id: Anda dapat meng-upload gambar melalui `` klien glance`` atau layanan Gambar API. Anda dapat menggunakan `` klien nova`` untuk manajemen gambar. Yang terakhir memberikan mekanisme untuk daftar dan menghapus gambar, mengatur dan menghapus metadata gambar, dan membuat gambar dari contoh menjalankan atau snapshot dan jenis cadangan.
tr_tr: İmajları ``glance`` istemcisi veya İmaj servisi API'si aracılığıyla yükleyebilirsiniz. İmaj yönetimi için ``nova`` istemcisini kullanabilirsiniz. Nova imajları listeleme ve silme, imaj metaverisi ayarlama ve silme ev çalışan sunucudan veya anlık görüntü ve yedek türlerinden imajlar oluşturmayı sağlar.

source: You can use the unified ``openstack`` command (**python-openstackclient**) for the most of OpenStack services. For more information, see `OpenStackClient document <https://docs.openstack.org/developer/python-openstackclient/>`_.
tr_tr: OpenStack servislerinin çoğu için birleştirilmiş ``openstack`` komutunu (**python-openstackclient**) kullanabilirsiniz. Daha fazla bilgi için, `OpenStack İstemci belgelendirmesine <https://docs.openstack.org/developer/python-openstackclient/>`_ göz atın.

source: You must set the ``OS_CACERT`` environment variable when using the https protocol in the ``OS_AUTH_URL`` environment setting because the verification process for the TLS (HTTPS) server certificate uses the one indicated in the environment. This certificate will be used when verifying the TLS (HTTPS) server certificate.
id: Anda harus mengatur `` variabel lingkungan OS_CACERT`` ketika menggunakan protokol https di `` lingkungan OS_AUTH_URL`` pengaturan karena proses verifikasi untuk server sertifikat TLS (HTTPS) menggunakan satu ditunjukkan dalam lingkungan. Sertifikat ini akan digunakan saat verifikasi sertifikat server TLS (HTTPS).
tr_tr: ``OS_AUTH_URL`` ortam ayarında https iletişim kuralını kullanırken ``OS_CACERT`` çevre değişkenini ayarlamalısınız çünkü TLS (HTTPS) sunucu sertifikası için doğrulama süreci ortamda gösterileni kullanır. Bu sertifika TLS (HTTPS) sunucu sertifikasını onaylarken kullanılacaktır.

source: `API Guide <https://developer.openstack.org/api-guide/quick-start/>`_
tr_tr: `API Kılavuzu <https://developer.openstack.org/api-guide/quick-start/>`_

source: `Administrator Guide <https://docs.openstack.org/admin-guide/>`_
tr_tr: `Yönetici Kılavuzu <https://docs.openstack.org/admin-guide/>`_

source: `Architecture Design Guide <https://docs.openstack.org/arch-design/>`_
tr_tr: `Mimari Tasarım Kılavuzu <https://docs.openstack.org/arch-design/>`_

source: `Block Storage service <https://www.openstack.org/software/releases/ocata/components/cinder>`__
tr_tr: `Blok Depolama servisi <https://www.openstack.org/software/releases/ocata/components/cinder>`__

source: `Bugs: Application catalog (murano) <https://bugs.launchpad.net/murano>`_
tr_tr: `Hatalar: Uygulama kataloğu (murano) <https://bugs.launchpad.net/murano>`_

source: `Bugs: Bare metal service (ironic) <https://bugs.launchpad.net/ironic>`_
tr_tr: `Hatalar: Açık metal servisi (ironic) <https://bugs.launchpad.net/ironic>`_

source: `Bugs: Clustering service (senlin) <https://bugs.launchpad.net/senlin>`_
tr_tr: `Hatalar: Dağıtık sistem servisi (senlin) <https://bugs.launchpad.net/senlin>`_

source: `Bugs: Container Infrastructure Management service (magnum) <https://bugs.launchpad.net/magnum>`_
tr_tr: `Hatalar: Konteyner Yapı Yönetim servisi (magnum) <https://bugs.launchpad.net/magnum>`_

source: `Bugs: DNS service (designate) <https://bugs.launchpad.net/designate>`_
tr_tr: `Hatalar: DNS servisi (designate) <https://bugs.launchpad.net/designate>`_

source: `Bugs: Data processing service (sahara) <https://bugs.launchpad.net/sahara>`_
tr_tr: `Hatalar: Veri işleme servisi (sahara) <https://bugs.launchpad.net/sahara>`_

source: `Bugs: Database service (trove) <https://bugs.launchpad.net/trove>`_
tr_tr: `Hatalar: Veri tabanı servisi (trove) <https://bugs.launchpad.net/trove>`_

source: `Bugs: Deployment service (fuel) <https://bugs.launchpad.net/fuel>`_
tr_tr: `Hatalar: Kurulum servisi (fuel) <https://bugs.launchpad.net/fuel>`_

source: `Bugs: Key Manager Service (barbican) <https://bugs.launchpad.net/barbican>`_
tr_tr: `Hatalar: Anahtar Yönetim Servisi (barbican) <https://bugs.launchpad.net/barbican>`_

source: `Bugs: Messaging service (zaqar) <https://bugs.launchpad.net/zaqar>`_
tr_tr: `Hatalar: Mesajlaşma servisi (zaqar) <https://bugs.launchpad.net/zaqar>`_

source: `Bugs: Monitoring (monasca) <https://bugs.launchpad.net/monasca>`_
tr_tr: `Hatalar: Gözetleme (monasca) <https://bugs.launchpad.net/monasca>`_

source: `Bugs: OpenStack API Documentation (developer.openstack.org) <https://bugs.launchpad.net/openstack-api-site>`_
tr_tr: `Hatalar: OpenStack API Belgelendirme (developer.openstack.org) <https://bugs.launchpad.net/openstack-api-site>`_

source: `Bugs: OpenStack Block Storage (cinder) <https://bugs.launchpad.net/cinder>`_
tr_tr: `Hatalar: OpenStack Blok Depolama (cinder) <https://bugs.launchpad.net/cinder>`_

source: `Bugs: OpenStack Compute (nova) <https://bugs.launchpad.net/nova>`_
tr_tr: `Hatalar: OpenStack Hesaplama (nova) <https://bugs.launchpad.net/nova>`_

source: `Bugs: OpenStack Dashboard (horizon) <https://bugs.launchpad.net/horizon>`_
tr_tr: `Hatalar: OpenStack Gösterge Paneli (horizon) <https://bugs.launchpad.net/horizon>`_

source: `Bugs: OpenStack Documentation (docs.openstack.org) <https://bugs.launchpad.net/openstack-manuals>`_
tr_tr: `Hatalar: OpenStack Belgelendirme (docs.openstack.org) <https://bugs.launchpad.net/openstack-manuals>`_

source: `Bugs: OpenStack Identity (keystone) <https://bugs.launchpad.net/keystone>`_
tr_tr: `Hatalar: OpenStack Kimlik (keystone) <https://bugs.launchpad.net/keystone>`_

source: `Bugs: OpenStack Image service (glance) <https://bugs.launchpad.net/glance>`_
tr_tr: `Hatalar: OpenStack İmaj servisi (glance) <https://bugs.launchpad.net/glance>`_

source: `Bugs: OpenStack Networking (neutron) <https://bugs.launchpad.net/neutron>`_
tr_tr: `Hatalar: OpenStack Ağ Yönetimi (neutron) <https://bugs.launchpad.net/neutron>`_

source: `Bugs: OpenStack Object Storage (swift) <https://bugs.launchpad.net/swift>`_
tr_tr: `Hatalar: OpenStack Nesne Depolama (swift) <https://bugs.launchpad.net/swift>`_

source: `Bugs: Orchestration (heat) <https://bugs.launchpad.net/heat>`_
tr_tr: `Hatalar: Orkestrasyon (heat) <https://bugs.launchpad.net/heat>`_

source: `Bugs: Rating (cloudkitty) <https://bugs.launchpad.net/cloudkitty>`_
tr_tr: `Hatalar: Derecelendirme (cloudkitty) <https://bugs.launchpad.net/cloudkitty>`_

source: `Bugs: Shared file systems (manila) <https://bugs.launchpad.net/manila>`_
tr_tr: `Hatalar: Paylaşımlı dosya sistemleri (manila) <https://bugs.launchpad.net/manila>`_

source: `Bugs: Telemetry (ceilometer) <https://bugs.launchpad.net/ceilometer>`_
tr_tr: `Hatalar: Telemetri (ceilometer) <https://bugs.launchpad.net/ceilometer>`_

source: `Bugs: Telemetry v3 (gnocchi) <https://bugs.launchpad.net/gnocchi>`_
tr_tr: `Hatalar: Telemetri s3 (gnocchi) <https://bugs.launchpad.net/gnocchi>`_

source: `Bugs: Workflow service (mistral) <https://bugs.launchpad.net/mistral>`_
tr_tr: `Hatalar: İş akışı servisi (mistral) <https://bugs.launchpad.net/mistral>`_

source: `Command-Line Interface Reference <https://docs.openstack.org/cli-reference/>`_
tr_tr: `Komut-Satırı Arayüz Kaynakçası <https://docs.openstack.org/cli-reference/>`_

source: `Compute service <https://www.openstack.org/software/releases/ocata/components/nova>`__
tr_tr: `Hesaplama servisi <https://www.openstack.org/software/releases/ocata/components/nova>`__

source: `Configuration Reference <https://docs.openstack.org/ocata/config-reference/>`_
tr_tr: `Yapılandırma Kaynak Belgesi <https://docs.openstack.org/ocata/config-reference/>`_

source: `Dashboard <https://www.openstack.org/software/releases/ocata/components/horizon>`__
tr_tr: `Kontrol Panosu <https://www.openstack.org/software/releases/ocata/components/horizon>`__

source: `Data Processing service <https://www.openstack.org/software/releases/ocata/components/sahara>`__
tr_tr: `Veri İşleme servisi <https://www.openstack.org/software/releases/ocata/components/sahara>`__

source: `Database service <https://www.openstack.org/software/releases/ocata/components/trove>`__
tr_tr: `Veritabanı servisi <https://www.openstack.org/software/releases/ocata/components/trove>`__

source: `Documentation Contributor Guide <https://docs.openstack.org/contributor-guide/>`_
tr_tr: `Belgelendirme Katkıcısı Kılavuzu <https://docs.openstack.org/contributor-guide/>`_

source: `End User Guide <https://docs.openstack.org/user-guide/>`_
tr_tr: `Son Kullanıcı Kılavuzu <https://docs.openstack.org/user-guide/>`_

source: `High Availability Guide <https://docs.openstack.org/ha-guide/>`_
tr_tr: `Yüksek Erişilebilirlik Kılavuzu <https://docs.openstack.org/ha-guide/>`_

source: `Identity service <https://www.openstack.org/software/releases/ocata/components/keystone>`__
tr_tr: `Kimlik servisi <https://www.openstack.org/software/releases/ocata/components/keystone>`__

source: `Image service <https://www.openstack.org/software/releases/ocata/components/glance>`__
tr_tr: `İmaj servisi <https://www.openstack.org/software/releases/ocata/components/glance>`__

source: `Installation Tutorial for Red Hat Enterprise Linux 7 and CentOS 7 <https://docs.openstack.org/ocata/install-guide-rdo/>`_
tr_tr: `Red Hat Enterprise Linux 7 ve CentOS 7 için Kurulum Kılavuzu <https://docs.openstack.org/ocata/install-guide-rdo/>`_

source: `Installation Tutorial for Ubuntu 16.04 (LTS) <https://docs.openstack.org/ocata/install-guide-ubuntu/>`_
tr_tr: `Ubuntu 16.04 (LTS) için Kurulum Kılavuzu <https://docs.openstack.org/ocata/install-guide-ubuntu/>`_

source: `Installation Tutorial for openSUSE Leap 42.2 and SUSE Linux Enterprise Server 12 SP2 <https://docs.openstack.org/ocata/install-guide-obs/>`_
tr_tr: `openSUSE Leap 42.2 ve SUSE Linux Enterprise Server 12 SP2 için Kurulum Kılavuzu <https://docs.openstack.org/ocata/install-guide-obs/>`_

source: `Networking Guide <https://docs.openstack.org/ocata/networking-guide>`_
tr_tr: `Ağ Kılavuzu <https://docs.openstack.org/ocata/networking-guide>`_

source: `Networking service <https://www.openstack.org/software/releases/ocata/components/neutron>`__
tr_tr: `Ağ servisi <https://www.openstack.org/software/releases/ocata/components/neutron>`__

source: `Object Storage service <https://www.openstack.org/software/releases/ocata/components/swift>`__
tr_tr: `Nesne Depolama servisi <https://www.openstack.org/software/releases/ocata/components/swift>`__

source: `Operations Guide <https://docs.openstack.org/ops-guide/>`_
tr_tr: `İşlem Kılavuzu <https://docs.openstack.org/ops-guide/>`_

source: `Orchestration service <https://www.openstack.org/software/releases/ocata/components/heat>`__
tr_tr: `Orkestrasyon servisi <https://www.openstack.org/software/releases/ocata/components/heat>`__

source: `Security Guide <https://docs.openstack.org/security-guide/>`_
tr_tr: `Güvenlik Kılavuzu <https://docs.openstack.org/security-guide/>`_

source: `Telemetry service <https://www.openstack.org/software/releases/ocata/components/ceilometer>`__
tr_tr: `Telemetri servisi <https://www.openstack.org/software/releases/ocata/components/ceilometer>`__

source: `Virtual Machine Image Guide <https://docs.openstack.org/image-guide/>`_
tr_tr: `Sanal Makina Imaj Kılavuzu<https://docs.openstack.org/image-guide/>`_

source: ``--description <description>``
tr_tr: ``--description <tanımlama>``

source: ``--name <name>``
tr_tr: ``--name <isim>``

source: ``--property <key=value>``
tr_tr: ``--property <anahtar=değer>``

source: ``--property <key>``
tr_tr: ``--property <anahtar>``

source: ``--state <state>``
tr_tr: ``--state <durum>``

source: ``<snapshot>``
tr_tr: ``<anlık görüntü>``

source: ``barbican`` - Key Manager Service API
id: `` Barbican`` - Key Manager Layanan API
tr_tr: ``barbican`` - Anahtar Yönetim Servisi API'si

source: ``ceilometer`` - Telemetry API
tr_tr: ``ceilometer`` - Telemetri API'si

source: ``cinder`` - Block Storage API and extensions
id: `` Cinder`` - API Block Storage dan ekstensi
tr_tr: ``cinder`` - Blok Depolama API'si ve uzantıları

source: ``cloudkitty`` - Rating service API
id: `` Cloudkitty`` - Penilaian layanan API
tr_tr: ``cloudkitty`` - Oylama servisi API'si

source: ``designate`` - DNS service API
id: `` Designate`` - layanan DNS API
tr_tr: ``designate`` - DNS servis API'si

source: ``filesystem_store_metadata_file = filePath``
tr_tr: ``filesystem_store_metadata_file = dosyaYolu``

source: ``fuel`` - Deployment service API
id: `` Fuel`` - Deployment layanan API
tr_tr: ``fuel`` - Kurulum servisi API'si

source: ``glance`` - Image service API
id: `` Glance`` - Gambar layanan API
tr_tr: ``glance`` - İmaj servisi API'si

source: ``gnocchi`` - Telemetry API v3
tr_tr: ``gnocchi`` - Telemetri API'si v3

source: ``heat-api-cfn`` component
tr_tr: ``heat-api-cfn`` bileşeni

source: ``heat-api`` component
tr_tr: ``heat-api``bileşeni

source: ``heat`` - Orchestration API
id: `` Heat`` - Orkestrasi API
tr_tr: ``heat`` - Orkestrasyon API'si

source: ``heat`` command-line client
tr_tr: ``heat`` komut satırı istemcisi

source: ``magnum`` - Container Infrastructure Management service API
id: `` Magnum`` - Kontainer Infrastruktur layanan Manajemen API
tr_tr: ``magnum`` - Kapsayıcı Altyapı Yönetim servisi API'si

source: ``manila`` - Shared file systems API
id: `` Manila`` - Bersama berkas sistem API
tr_tr: ``manila`` - Paylaşımlı dosya sistemleri API'si

source: ``mistral`` - Workflow service API
id: `` Mistral`` - Workflow layanan API
tr_tr: ``mistral`` - İş akışı servis API'si

source: ``monasca`` - Monitoring API
id: `` Monasca`` - Pemantauan API
tr_tr: ``monasca`` - İzleme API'si

source: ``murano`` - Application catalog API
id: `` Murano`` - katalog Aplikasi API
tr_tr: ``murano`` - Uygulama kataloğu API'si

source: ``neutron`` - Networking API
id: `` Neutron`` - API Jaringan
tr_tr: ``neutron`` - Ağ API'si

source: ``nova-api-metadata`` service
tr_tr: ``nova-api-metadata`` servisi

source: ``nova-api`` service
tr_tr: ``nova-api`` servisi

source: ``nova-cert`` module
tr_tr: ``nova-cert`` modülü

source: ``nova-compute`` service
tr_tr: ``nova-compute`` servisi

source: ``nova-conductor`` module
tr_tr: ``nova-conductor`` modülü

source: ``nova-consoleauth`` daemon
tr_tr: ``nova-consoleauth`` artalan işi

source: ``nova-novncproxy`` daemon
tr_tr: ``nova-novncproxy`` artalan işi

source: ``nova-placement-api`` service
tr_tr: ``nova-placement-api`` servisi

source: ``nova-scheduler`` service
tr_tr: ``nova-scheduler`` servisi

source: ``nova-spicehtml5proxy`` daemon
tr_tr: ``nova-spicehtml5proxy`` artalan işi

source: ``nova-xvpvncproxy`` daemon
tr_tr: ``nova-xvpvncproxy`` artalan işi

source: ``nova`` - Compute API and extensions
tr_tr: ``nova`` - Hesaplama API'si ve uzantıları

source: ``python-troveclient`` command-line client
tr_tr: ``python-troveclient`` komut-satırı istemcisi

source: ``senlin`` - Clustering service API
id: `` Senlin`` - Layanan Clustering API
tr_tr: ``senlin`` - Kümeleme servis API'si

source: ``swift`` - Object Storage API
id: `` Swift`` - Penyimpanan API Obyek
tr_tr: ``swift`` - Nesne Depolama API'si

source: ``trove-api`` component
tr_tr: ``trove-api`` bileşeni

source: ``trove-conductor`` service
tr_tr: ``trove-conductor`` servisi

source: ``trove-guestagent`` service
tr_tr: ``trove-guestagent`` servisi

source: ``trove-taskmanager`` service
tr_tr: ``trove-taskmanager`` servisi

source: ``trove`` - Database service API
id: `` Trove`` - layanan database API
tr_tr: ``trove`` - Veritabanı servisi API'si

source: absolute limit
tr_tr: mutlak sınır

source: access control list (ACL)
tr_tr: erişim kontrolü listesi (ACL)

source: access key
tr_tr: erişim anahtarı

source: account
tr_tr: hesap

source: account auditor
tr_tr: hesap denetçisi

source: account database
tr_tr: hesap veritabanı

source: account reaper
tr_tr: hesap makinesi

source: account server
tr_tr: hesap sunucusu

source: account service
tr_tr: hesap servisi

source: accounting
tr_tr: muhasebe

source: active/active configuration
tr_tr: aktif/aktif yapılandırma

source: active/passive configuration
tr_tr: aktif/pasif yapılandırma

source: address pool
tr_tr: adres havuzu

source: admin API
tr_tr: yönetim API'si

source: admin server
tr_tr: yönetici sunucu

source: administrator
tr_tr: yönetici

source: alert
tr_tr: uyarı

source: allocate
tr_tr: yer ayır

source: applet
tr_tr: gereç

source: application server
tr_tr: uygulama sunucusu

source: attach
id: attach (hubung/tempel)
tr_tr: ekle

source: attachment (network)
tr_tr: ek (ağ)

source: auditing
tr_tr: denetleme

source: auditor
tr_tr: denetleyici

source: auth node
tr_tr: yetkilendirme düğümü

source: authentication
tr_tr: kimlik doğrulama

source: authentication token
tr_tr: kimlik denetim jetonu

source: authorization
tr_tr: yetkilendirme

source: authorization node
tr_tr: yetkilendirme düğümü

source: auto declare
tr_tr: otomatik bildir

source: availability zone
tr_tr: kullanılabilirlik bölgesi

source: back end
tr_tr: arka plan

source: back-end catalog
tr_tr: arka plan katalog

source: back-end store
tr_tr: arkaplan deposu

source: bandwidth
tr_tr: bant genişliği

source: base image
tr_tr: ana imaj

source: binary
tr_tr: ikili değer

source: bits per second (BPS)
tr_tr: saniyedeki bit sayısı (BPS)

source: block device
tr_tr: blok aygıtı

source: block migration
tr_tr: blok göçü

source: bootable disk image
tr_tr: ön yüklenebilir disk imajı

source: browser
tr_tr: tarayıcı

source: builder file
tr_tr: oluşturucu dosya

source: bursting
tr_tr: patlama

source: button class
tr_tr: düğme sınıfı

source: byte
tr_tr: bayt

source: cache pruner
tr_tr: önbellek budaması

source: capability
tr_tr: kapasite

source: capacity cache
tr_tr: kapasite ön belleği

source: capacity updater
id: kapasitas updater
tr_tr: kapasite güncelleyici

source: catalog
tr_tr: katalog

source: catalog service
tr_tr: katalog servisi

source: cell
tr_tr: hücre

source: cell forwarding
tr_tr: hücre yönlendirme

source: cell manager
tr_tr: hücre yöneticisi

source: certificate authority (CA)
tr_tr: sertifika yetkilendiricisi (CA)

source: chance scheduler
tr_tr: şans zamanlayıcı

source: changes since
tr_tr: son değişiklikler

source: child cell
tr_tr: alt hücre

source: cinder-backup daemon
tr_tr: cinder-backup artalan işlemi

source: cinder-scheduler daemon
tr_tr: cinder-scheduler artalan işlemi

source: cinder_img_volume_type (via glance image metadata)
tr_tr: cinder_img_volume_type (glance imaj metaverisi aracılığıyla)

source: cloud architect
tr_tr: bulut mimarı

source: cloud computing
tr_tr: bulut hesaplama

source: cloud controller
tr_tr: bulut denetleyici

source: cloud controller node
tr_tr: bulut denetim düğümü

source: cloudpipe image
tr_tr: cloudpipe imajı

source: command filter
tr_tr: komut filtresi

source: community project
tr_tr: topluluk projesi

source: compression
tr_tr: sıkıştırma

source: compute controller
tr_tr: hesaplama denetleyicisi

source: compute host
tr_tr: hesaplama sunucusu

source: compute node
tr_tr: hesaplama düğümü

source: compute worker
tr_tr: hesaplama işçisi

source: concatenated object
tr_tr: birleştirilmiş nesne

source: conductor
tr_tr: kondüktör

source: consistency window
tr_tr: bütünlük penceresi

source: console log
tr_tr: konsol günlüğü

source: container
tr_tr: kap

source: container auditor
tr_tr: kap denetleyicisi

source: container database
tr_tr: kap veritabanı

source: container format
tr_tr: kap biçemi

source: container server
tr_tr: kap sunucusu

source: container service
tr_tr: kap servisi

source: content delivery network (CDN)
tr_tr: içerik dağıtım ağı (CDN)

source: controller node
tr_tr: denetci düğüm

source: core API
tr_tr: çekirdek API

source: core service
tr_tr: çekirdek servis

source: cost
tr_tr: maliyet

source: credentials
tr_tr: kimlik bilgileri

source: current workload
tr_tr: mevcut iş yükü

source: customer
tr_tr: müşteri

source: customization module
tr_tr: özelleştirme modülü

source: daemon
tr_tr: artalan işlemi

source: data encryption
tr_tr: veri şifreleme

source: data store
tr_tr: veri deposu

source: database ID
tr_tr: veritabanı ID

source: database replicator
tr_tr: veritabanı kopyalayıcı

source: deallocate
tr_tr: serbest bırak

source: deduplication
tr_tr: tekilleştirme

source: default panel
tr_tr: varsayılan panel

source: default project
tr_tr: varsayılan proje

source: default token
tr_tr: varsayılan jeton

source: default_volume_type (via cinder.conf)
tr_tr: default_volume_type (cinder.conf aracılığıyla)
