Repository: 25hours/openstack-manuals
Catalog: doc/common/source/locale/*/LC_MESSAGES/common.po
Languages: id, tr_tr

source: A model that enables access to a shared pool of configurable computing resources, such as networks, servers, storage, applications, and services, that can be rapidly provisioned and released with minimal management effort or service provider interaction.
id: Sebuah model yang memungkinkan akses ke kolam renang bersama sumber daya komputasi dikonfigurasi, seperti jaringan, server, penyimpanan, aplikasi, dan layanan, yang dapat dengan cepat ditetapkan dan dirilis dengan upaya manajemen yang minimal atau interaksi penyedia layanan.
tr_tr: Ağlar, sunucular, depolama, uygulamalar ve hizmetler gibi, yapılandırılabilir bilgi işlem kaynaklarının paylaşılan bir havuzuna, minimum düzeyde yönetim çabası veya servis sağlayıcı etkileşimi ile hızla tedarik edilebilen ve serbest bırakılabilen bir havuza erişim sağlayan bir model.

source: A network authentication protocol which works on the basis of tickets. Kerberos allows nodes communication over a non-secure network, and allows nodes to prove their identity to one another in a secure manner.
tr_tr: Biletler temelinde çalışan bir ağ kimlik doğrulama protokolü. Kerberos, düğümlerin güvenli olmayan bir ağ üzerinden iletişim kurmasını sağlar ve düğümlerin kimliğini birbirlerine güvenli bir şekilde kanıtlamalarını sağlar.

source: A network protocol that configures devices that are connected to a network so that they can communicate on that network by using the Internet Protocol (IP). The protocol is implemented in a client-server model where DHCP clients request configuration data, such as an IP address, a default route, and one or more DNS server addresses from a DHCP server. A method to automatically configure networking for a host at boot time. Provided by both Networking and Compute.
tr_tr: Bir ağa bağlı aygıtları, Internet Protokolünü (IP) kullanarak bu ağda iletişim kuracak şekilde yapılandıran bir ağ protokolü. Protokol, DHCP istemcilerinin bir IP adresi, varsayılan rota ve bir DHCP sunucusundan bir veya daha fazla DNS sunucusu adresi gibi yapılandırma verilerini talep ettiği bir istemci-sunucu modelinde uygulanır. Önyükleme sırasında bir ana bilgisayarın ağını otomatik olarak yapılandırmak için kullanılan bir yöntem. Hem Ağ hem de Hesaplama tarafından sağlanır.

source: A network protocol used by a network client to obtain an IP address from a configuration server. Provided in Compute through the dnsmasq daemon when using either the FlatDHCP manager or VLAN manager network manager.
id: Sebuah protokol jaringan yang digunakan oleh klien jaringan untuk mendapatkan alamat IP dari server konfigurasi. Tersedia di Hitunglah melalui daemon dnsmasq saat menggunakan baik manajer FlatDHCP atau VLAN manajer jaringan manager.
tr_tr: Bir yapılandırma sunucusundan bir IP adresi almak için bir ağ istemcisi tarafından kullanılan bir ağ protokolü. FlatDHCP yöneticisi veya VLAN yöneticisi ağ yöneticisini kullanırken Hesaplama'da dnsmasq arka plan programı aracılığıyla sağlanır.

source: A network protocol used by network devices for control messages. For example, :command:`ping` uses ICMP to test connectivity.
tr_tr: Kontrol mesajları için ağ cihazları tarafından kullanılan bir ağ protokolüdür. Örneğin, :command:`ping` bağlantıyı test etmek için ICMP kullanır.

source: A network segment typically used for instance Internet access.
id: Sebuah segmen jaringan biasanya digunakan untuk akses misalnya Internet.
tr_tr: Genellikle sunucunun İnternet erişimi için kullanılan bir ağ bölümü.

source: A network segment used for administration, not accessible to the public Internet.
tr_tr: Yönetim için kullanılan, kamuya açık olmayan İnternet erişimi olmayan bir ağ bölümü.

source: A network segment used for instance traffic tunnels between compute nodes and the network node.
id: Segmen jaringan yang digunakan untuk terowongan misalnya lalu lintas antara node komputasi dan node jaringan.
tr_tr: Sunucunun, hesaplama düğümleri ve ağ düğümü arasındaki trafik tünelleri için kullanılan bir ağ bölümü.

source: A network virtualization technology that attempts to reduce the scalability problems associated with large cloud computing deployments. It uses a VLAN-like encapsulation technique to encapsulate Ethernet frames within UDP packets.
tr_tr: Büyük bulut hesaplama dağıtımlarıyla ilişkili ölçeklenebilirlik sorunlarını azaltmaya çalışan bir ağ sanallaştırma teknolojisi. Ethernet çerçevelerini UDP paketleri içinde kapsüllemek için VLAN benzeri bir kapsülleme tekniği kullanır.

source: A node that provides the Object Storage proxy service.
tr_tr: Nesne Deposu vekil hizmeti sağlayan bir düğüm.

source: A node that runs Object Storage account, container, and object services.
tr_tr: Nesne Deposu hesap, kap ve nesne hizmetleri çalıştıran bir düğüm.

source: A node that runs network, volume, API, scheduler, and image services. Each service may be broken out into separate nodes for scalability or availability.
id: Sebuah node yang menjalankan layanan jaringan, volume, API, scheduler, dan gambar. Setiap layanan dapat dipecah menjadi node terpisah untuk skalabilitas dan ketersediaan.
tr_tr: Ağ, hacim, API, zamanlayıcı ve imaj hizmetlerini çalıştıran bir düğüm. Her hizmet, ölçeklenebilirlik veya kullanılabilirlik için ayrı düğümlere bölünebilir.

source: A node that runs the nova-compute daemon that manages VM instances that provide a wide range of services, such as web applications and analytics.
id: Sebuah node yang menjalankan daemon nova-compute yang mengelola VM contoh yang menyediakan berbagai layanan, seperti aplikasi web dan analisis.
tr_tr: Web uygulamaları ve analitik gibi geniş bir hizmet yelpazesi sergileyen VM örneklerini yöneten nova-compute artalan programını çalıştıran bir düğüm.

source: A notification agent (``ceilometer-agent-notification``)
id: Seorang agen pemberitahuan (`` ceilometer-agen-notification``)
tr_tr: Bir bildirim aracısı (``ceilometer-agent-notification``)

source: A notification driver that monitors VM instances and updates the capacity cache as needed.
id: Seorang pengemudi pemberitahuan yang memantau VM contoh dan update cache kapasitas yang diperlukan.
tr_tr: VM örneklerini izleyen ve kapasite önbelleklerini gerektiği gibi güncelleyen bir bildirim sürücüsü.

source: A notification listener (``aodh-listener``)
id: Seorang pendengar pemberitahuan (`` aodh-listener``)
tr_tr: Bir bildirim dinleyici (``aodh-listener``)

source: A number of periodic processes run on the OpenStack Image service to support caching. Replication services ensure consistency and availability through the cluster. Other periodic processes include auditors, updaters, and reapers.
id: Sejumlah proses periodik berjalan pada layanan Gambar OpenStack untuk mendukung caching. jasa replikasi memastikan konsistensi dan ketersediaan melalui cluster. Proses berkala lainnya termasuk auditor, updaters, dan mesin pemanen.
tr_tr: Önbelleklemeyi desteklemek için bir takım dönemsel süreç OpenStack İmaj servisinde çalışır. Yedekleme servisleri küme boyunca tutarlılığı ve kullanılabilirliği sağlar. Denetçiler, güncelleyiciler, biçiciler diğer dönemsel süreçleri oluşturur.

source: A number within a database that is incremented each time a change is made. Used by Object Storage when replicating.
tr_tr: Her değişiklik yapıldıkça artan bir veritabanı içindeki sayı. Nesne Depolama Birimi çoğaltılırken kullanılır.

source: A package commonly installed in VM images that performs initialization of an instance after boot using information that it retrieves from the metadata service, such as the SSH public key and user data.
id: Sebuah paket yang biasa dipasang di gambar VM yang melakukan inisialisasi dari sebuah contoh setelah boot menggunakan informasi yang mengambil dari layanan metadata, seperti SSH kunci publik dan data pengguna.
tr_tr: Meta veri servisinden SSH genel anahtarı ve kullanıcı verileri gibi bilgileri kullanarak önyüklemeden sonra bir sunucudaki başlatmayı yapan VM imajlarına sıkça yüklenen bir paket.

source: A packaged version available in `the Open Build Service <https://build.opensuse.org/package/show?package=python-pip&project=Cloud:OpenStack:Master>`__ enables you to use YaST or zypper to install the package.
id: Sebuah versi dikemas tersedia di `Open Build Service <https://build.opensuse.org/package/show?package=python-pip&project=Cloud:OpenStack:Master>` __ memungkinkan Anda untuk menggunakan YaST atau zypper untuk menginstal paket .
tr_tr: `Açık İnşa Servisinde <https://build.opensuse.org/package/show?package=python-pip&project=Cloud:OpenStack:Master>`__ bulunan paketli bir sürüm paketi kurmak için YaST veya zypper kullanmanızı sağlar.

source: A packaged version enables you to use :command:`dnf` to install the package:
tr_tr: Paketli sürüm paketi kurmak için :command:`dnf` kullanmanızı sağlar:

source: A packaged version enables you to use yum to install the package:
id: Sebuah versi dikemas memungkinkan Anda untuk menggunakan yum untuk menginstal paket:
tr_tr: Paketli bir sürüm paketi kurmak için yum kullanmanızı sağlar:

source: A persistent storage method supported by XenAPI, such as iSCSI or NFS.
tr_tr: XenAPI tarafından iSCSI veya NFS gibi desteklenen kalıcı bir depolama yöntemi.

source: A person who plans, designs, and oversees the creation of clouds.
id: Seseorang yang berencana, desain, dan mengawasi penciptaan awan.
tr_tr: Bulutların yaratılmasını planlayan, tasarlayan ve denetleyen bir kişi.

source: A personality that a user assumes to perform a specific set of operations. A role includes a set of rights and privileges. A user assuming that role inherits those rights and privileges.
tr_tr: Kullanıcının belirli bir operasyon dizisini gerçekleştirmeyi varsaydığı bir kişilik. Bir rol, bir dizi haklar ve ayrıcalıklar içerir. Rolü varsayan bir kullanıcı bu hak ve ayrıcalıkları devralır.

source: A physical computer, not a VM instance (node).
id: Sebuah komputer fisik, bukan contoh VM (node).
tr_tr: Fiziksel bilgisayar, bir VM sunucu değil (düğüm).

source: A physical or virtual device that provides connectivity to another device or medium.
id: Sebuah perangkat fisik atau virtual yang menyediakan konektivitas ke perangkat lain atau media.
tr_tr: Başka bir aygıta veya ortama bağlantı sağlayan fiziksel veya sanal bir aygıt.

source: A physical or virtual network device that passes network traffic between different networks.
tr_tr: Farklı ağlar arasında ağ trafiğini ileten bir fiziksel veya sanal ağ aygıtı.

source: A piece of software that makes available another piece of software over a network.
id: Sebuah software yang membuat tersedia software lain melalui jaringan.
tr_tr: Bir ağ üzerinden başka bir yazılımın parçası olan bir yazılım parçası.

source: A platform that provides a suite of desktop environments that users access to receive a desktop experience from any location. This may provide general use, development, or even homogeneous testing environments.
id: Sebuah platform yang menyediakan paket lingkungan desktop yang pengguna mengakses menerima pengalaman desktop dari lokasi manapun. Ini dapat memberikan penggunaan umum, pembangunan, atau bahkan lingkungan pengujian homogen.
tr_tr: Kullanıcıların herhangi bir yerden masaüstü deneyimi elde etmek için eriştiği bir masaüstü ortamı paketi sağlayan bir platform. Bu genel kullanım, geliştirme veya hatta homojen test ortamları sağlayabilir.

source: A plug-in for the OpenStack Dashboard (horizon).
tr_tr: OpenStack Gösterge Paneli (horizon) için bir eklenti.

source: A point-in-time copy of an OpenStack storage volume or image. Use storage volume snapshots to back up volumes. Use image snapshots to back up data, or as "gold" images for additional servers.
tr_tr: OpenStack depolama birimi veya görüntüsünün zaman zaman bir kopyası. Birimleri yedeklemek için depolama hacmi anlık görüntüleri kullanın. Verileri yedeklemek için imaj anlık görüntülerini veya ek sunucular için "gold" imajlar kullanın.

source: A pre-made VM image that serves as a cloudpipe server. Essentially, OpenVPN running on Linux.
id: Sebuah pra-dibuat VM gambar yang berfungsi sebagai server cloudpipe. Pada dasarnya, OpenVPN berjalan di Linux.
tr_tr: Önceden yapılmış bir VM görüntüsü, bir cloudpipe sunucusu görevi görür. Esasen, Linux üzerinde çalışan bir OpenVPN.

source: A process that is created when a RPC call is executed; used to push the message to the topic exchange.
tr_tr: Bir RPC çağrısı yürütüldüğünde oluşturulan bir işlem; mesajı konu alışverişine iletmek için kullanılır.

source: A process that runs in the background and waits for requests. May or may not listen on a TCP or UDP port. Do not confuse with a worker.
id: Sebuah proses yang berjalan di latar belakang dan menunggu permintaan. Mungkin atau mungkin tidak mendengarkan pada TCP atau port UDP. Jangan bingung dengan pekerja.
tr_tr: Arka planda çalışan ve istekleri bekleyen bir süreç. Bir TCP veya UDP bağlantı noktasını dinleyebilir veya dinlemeyebilirsiniz. Bir işçiyle karıştırmayın.

source: A program that keeps the Image service VM image cache at or below its configured maximum size.
id: Sebuah program yang membuat layanan Gambar VM gambar cache pada atau di bawah ukuran maksimumnya dikonfigurasi.
tr_tr: İmaj hizmeti VM sunucu önbelleğini yapılandırılmış en büyük boyutta veya altında tutan bir program.

source: A programming language that is used to create systems that involve more than one computer by way of a network.
tr_tr: Bir ağ yoluyla birden fazla bilgisayarı içeren sistemler oluşturmak için kullanılan bir programlama dili.

source: A project that is not officially endorsed by the OpenStack Foundation. If the project is successful enough, it might be elevated to an incubated project and then to a core project, or it might be merged with the main code trunk.
id: Sebuah proyek yang tidak secara resmi didukung oleh OpenStack Foundation. Jika proyek ini cukup berhasil, mungkin akan diangkat ke sebuah proyek diinkubasi dan kemudian ke sebuah proyek inti, atau mungkin digabung dengan batang kode utama.
tr_tr: OpenStack Vakfı tarafından resmen onaylanmayan bir proje. Proje yeterince başarılıysa, kuluçkalanmış bir projeye yükseltilebilir ve daha sonra çekirdek bir projeye dönüşebilir veya ana kod gövde ile birleşebilir.

source: A project that ports the shell script-based project named DevStack to Python.
id: Sebuah proyek yang port proyek berbasis shell script bernama DevStack untuk Python.
tr_tr: DevStack adlı kabuk betiği tabanlı projeyi Python'a bağlayan bir proje.

source: A recommended architecture for an OpenStack cloud.
tr_tr: OpenStack bulutu için önerilen bir mimari.

source: A record that specifies information about a particular domain and belongs to the domain.
id: Sebuah catatan yang menentukan informasi tentang domain tertentu dan milik domain.
tr_tr: Belirli bir alan adı hakkında bilgi belirten ve alan adına ait olan bir kayıt.

source: A remote, mountable file system in the context of the :term:`Shared File Systems service<Shared File Systems service (manila)>`. You can mount a share to, and access a share from, several hosts by several users at a time.
tr_tr: :term:`Paylaşımlı Dosya Sistemleri servisi<Shared File Systems service (manila)>` bağlamında uzaktan, bağlanabilir dosya sistemi. Çeşitli sunuculardan sunuculara çeşitli kullanıcılar tarafından aynı zamanda bir paylaşım bağlayabilir ve bir paylaşıma erişebilirsiniz.

source: A routing algorithm in the Compute RabbitMQ.
id: Sebuah algoritma routing yang di Hitung RabbitMQ.
tr_tr: Hesaplama RabbitMQ'da yönlendirme algoritması.

source: A routing table that is created within the Compute RabbitMQ during RPC calls; one is created for each RPC call that is invoked.
id: Sebuah tabel routing yang dibuat dalam Compute RabbitMQ selama panggilan RPC; satu dibuat untuk setiap panggilan RPC yang dipanggil.
tr_tr: RPC çağrılarında Hesaplama RabbitMQ içinde oluşturulmuş bir yönlendirme tablosu; çağrılan her RPC çağrısı için bir tane oluşturulur.

source: A running VM, or a VM in a known state such as suspended, that can be used like a hardware server.
id: Sebuah menjalankan VM, atau VM dalam keadaan terkenal seperti ditangguhkan, yang dapat digunakan seperti server hardware.
tr_tr: Çalışan bir VM veya askıda olduğu bilinen bir durumda bir VM gibi, bir donanım sunucusu gibi kullanılabilir.

source: A scheduling method used by Compute that randomly chooses an available host from the pool.
id: Sebuah metode penjadwalan yang digunakan oleh komputer yang secara acak memilih sebuah host yang tersedia dari kolam.
tr_tr: Hesap tarafından kullanılan, havuzdan rasgele kullanılabilir bir ana makine seçen bir zamanlama yöntemi.

source: A scripting language that is used to build web pages.
tr_tr: Web sayfalarını oluşturmak için kullanılan bir komut dosyası dili.

source: A security model that focuses on data confidentiality and controlled access to classified information. This model divides the entities into subjects and objects. The clearance of a subject is compared to the classification of the object to determine if the subject is authorized for the specific access mode. The clearance or classification scheme is expressed in terms of a lattice.
id: Sebuah model keamanan yang berfokus pada kerahasiaan data dan dikendalikan akses ke informasi rahasia. Model ini membagi entitas menjadi subyek dan obyek. Clearance subjek dibandingkan dengan klasifikasi objek untuk menentukan apakah subjek berwenang untuk modus akses khusus. Clearance atau klasifikasi skema yang dinyatakan dalam kisi.
tr_tr: Veri gizliliğine ve gizli bilgilere kontrollü olarak erişime odaklanan bir güvenlik modeli. Bu model, varlıkları öznelere ve nesnelere böler. Öznenin belirli erişim modu için yetkilendirilmiş olup olmadığını belirlemek için bir öznenin temizlenmesi nesne sınıflandırmasıyla karşılaştırılır. Boşluk veya sınıflandırma şeması bir kafes cinsinden ifade edilir.

source: A server daemon that serves the Nova Cert service for X509 certificates. Used to generate certificates for ``euca-bundle-image``. Only needed for the EC2 API.
id: Sebuah daemon server yang melayani layanan Nova Cert untuk X 509 sertifikat. Digunakan untuk menghasilkan sertifikat untuk `` euca-bundle-image``. Hanya dibutuhkan untuk EC2 API.
tr_tr: X509 sertifikaları için Nova Cert servisini sunan bir sunucu artalan işi. ``euca-bundle-image`` için sertifika üretmekte kullanılır. Yalnızca EC2 API için gereklidir.

source: A set of OpenStack resources created and managed by the Orchestration service according to a given template (either an AWS CloudFormation template or a Heat Orchestration Template (HOT)).
tr_tr: Verilen bir şablona göre (bir AWS CloudFormation şablonu veya Heat Orkestrasyon Şablonu (HOT) olabilir) Orkestrasyon servisi tarafından oluşturulan ve yönetilen OpenStack kaynaklarının bir kümesidir.

source: A set of network traffic filtering rules that are applied to a Compute instance.
tr_tr: Bir Hesaplama sunucusuna uygulanan bir dizi ağ trafiği filtreleme kuralları.

source: A set of segment objects that Object Storage combines and sends to the client.
id: Sebuah set objek segmen Object yang menggabungkan Penyimpanan dan mengirim ke klien.
tr_tr: Nesne Depolama Biriminin birleştirip istemciye gönderdiği bir dizi nesne.

source: A snapshot is a point in time version of a volume. As an administrator, you can manage and unmanage snapshots.
id: Sebuah snapshot adalah titik dalam versi saat volume. Sebagai administrator, Anda dapat mengelola dan snapshot unmanaged.
tr_tr: Anlık görüntü bir birimin zamanda bir noktadaki sürümüdür. Yönetici olarak, anlık görüntüleri yönetebilir ya da yönetmeyi bırakabilirsiniz.

source: A special Object Storage object that contains the manifest for a large object.
tr_tr: Büyük bir nesnenin manifestosunu içeren özel bir Nesne Depolama nesnesi.

source: A special type of VM image that is booted when an instance is placed into rescue mode. Allows an administrator to mount the file systems for an instance to correct the problem.
tr_tr: Bir sunucu kurtarma moduna geçirildiğinde önyüklenen özel bir VM imajı türü. Bir yöneticinin sorunu düzeltmek için bir dosya sistemini bağlamasına izin verir.

source: A specification that, when implemented by a physical PCIe device, enables it to appear as multiple separate PCIe devices. This enables multiple virtualized guests to share direct access to the physical device, offering improved performance over an equivalent virtual device. Currently supported in OpenStack Havana and later releases.
tr_tr: Fiziksel bir PCIe aygıtı tarafından gerçekleştirildiğinde, birden fazla ayrı PCIe aygıtı olarak görünmesini sağlayan bir belirtim. Bu, birden fazla sanal konukların fiziksel aygıta doğrudan erişimi paylaşmalarını sağlar ve eşdeğer bir sanal aygıt üzerinde gelişmiş performans sunar. Halen OpenStack Havana'da ve daha sonraki sürümlerde desteklenmektedir.

source: A standalone service whose purpose is to receive requests, process data operations such as copying, share migration or backup, and send back a response after an operation has been completed.
id: Sebuah layanan mandiri yang tujuannya adalah untuk menerima permintaan, proses operasi data seperti menyalin, share migrasi atau cadangan, dan mengirim kembali respon setelah operasi telah selesai.
tr_tr: Amacı istekleri almak, kopyalama, paylaşım göçü ya da yedekleme gibi veri işlemlerini işlemek, ve işlem bittikten sonra geriye bir yanıt göndermek olan bağımsız bir servis.

source: A standardized interface for managing compute, data, and network resources, currently unsupported in OpenStack.
tr_tr: Hesaplama, veri ve ağ kaynaklarını yönetmek için standartlaştırılmış bir arayüz, şu an OpenStack'te desteklenmiyor.

source: A string of text provided to the client after authentication. Must be provided by the user or process in subsequent requests to the API endpoint.
id: Sebuah string teks yang diberikan kepada klien setelah otentikasi. Harus disediakan oleh pengguna atau proses permintaan berikutnya ke API endpoint.
tr_tr: Kimlik doğrulamasından sonra müşteriye verilen bir metin dizesi. Sonraki isteklerde API uç noktasına kullanıcı veya işlem tarafından sağlanmalıdır.

source: A subset of API calls that are accessible to authorized administrators and are generally not accessible to end users or the public Internet. They can exist as a separate service (keystone) or can be a subset of another API (nova).
id: Sebuah subset dari panggilan API yang dapat diakses administrator yang berwenang dan umumnya tidak dapat diakses oleh pengguna akhir atau Internet publik. Mereka bisa eksis sebagai layanan terpisah (keystone) atau dapat menjadi bagian dari API lain (nova).
tr_tr: Yetkili yöneticilerin erişebileceği ve genellikle son kullanıcıların veya genel İnternet'in erişemediği API çağrılarının bir alt kümesidir. Ayrı bir servis (keystoneı) olarak mevcut olabilirler veya başka bir API'nin (nova) alt kümesi olabilirler.
