Repository: 25hours/openstack-manuals
Catalog: doc/common/source/locale/*/LC_MESSAGES/common.po
Languages: id, tr_tr

source: Part of the OpenStack :term:`Telemetry service <Telemetry service (telemetry)>`; provides alarming functionality.
tr_tr: OpenStack :term:`Telemetry servisi <Telemetry service (telemetry)>`;'nin alarm işlevselliği sağlayan bir parçası.

source: Part of the OpenStack :term:`Telemetry service <Telemetry service (telemetry)>`; provides an indexer and time-series database.
tr_tr: OpenStack :term:`Telemetry servisi <Telemetry service (telemetry)>`'nin bir parçası; bir dizinleyici ve zaman serisi veritabanı sağlar.

source: Part of the OpenStack :term:`Telemetry service <Telemetry service (telemetry)>`; provides event storage.
tr_tr: OpenStack :term:`Telemetry servisi <Telemetry service (telemetry)>`nin bir parçası; olay deposu sağlar.

source: Passed to API requests and used by OpenStack to verify that the client is authorized to run the requested operation.
id: Lulus permintaan API dan digunakan oleh OpenStack untuk memverifikasi bahwa klien berwenang untuk menjalankan operasi yang diminta.
tr_tr: API isteklerine verilir ve istemcinin istenen işlemi çalıştırmaya yetkili olduğunu doğrulamak için OpenStack tarafından kullanılır.

source: Passes requests from clients to the appropriate workers and returns the output to the client after the job completes.
tr_tr: Müşterilerden gelen istekleri uygun işçilere aktarır ve iş tamamlandıktan sonra çıktıyı müşteriye döndürür.

source: Performs housekeeping tasks on the large data store. The replication services ensure consistency and availability through the cluster. Other periodic processes include auditors, updaters, and reapers.
id: Melakukan tugas-tugas rumah tangga di toko data yang besar. Layanan replikasi memastikan konsistensi dan ketersediaan melalui cluster. Proses berkala lainnya termasuk auditor, updaters, dan mesin pemanen.
tr_tr: Büyük veri deposunda toparlama işlerini yapar. Yedekleme servisleri küme içinde tutarlılığı ve kullanılabilirliği sağlar. Denetçiler, güncelleyiciler ve biçiciler diğer dönemsel süreçlerdir.

source: Persists until VM is terminated
id: Berlanjut sampai VM dihentikan
tr_tr: VM sonlandırılana kadar kalıcıdır

source: Persists until deleted
id: Berlanjut sampai dihapus
tr_tr: Silinene kadar kalır

source: Physical host dedicated to running compute nodes.
id: host fisik yang didedikasikan untuk menjalankan menghitung node.
tr_tr: Hesaplama düğümlerini çalıştırmaya adanmış fiziksel bilgisayar.

source: Plans deployments.
tr_tr: Kurulumları planlar.

source: Platform-as-a-Service (PaaS)
tr_tr: Hizmet-olarak-Platform (PaaS)

source: Plug and unplug ports, create networks or subnets, and provide IP addressing. These plug-ins and agents differ depending on the vendor and technologies used in the particular cloud. OpenStack Networking ships with plug-ins and agents for Cisco virtual and physical switches, NEC OpenFlow products, Open vSwitch, Linux bridging, and the VMware NSX product.
tr_tr: Bağlantı noktalarını takın ya da çıkarın, ağlar veya alt ağlar oluşturun ve IP adresleme sağlayın. Bu eklentiler ve aracılar üretici ve belirli bulutta kullanılan teknolojilere göre değişiklik gösterirler. OpenStack Ağı Cisco sanal ve fiziksel anahtarlı, NEC OpenFlow ürünler, Open vSwitch, Linux köprüleme ve VMware NSX ürününe göre aracı ve eklentilerle birlikte gelir.

source: Pluggable system of Hadoop installation engines.
id: Sistem pluggable mesin instalasi Hadoop.
tr_tr: Hadoop kurulum motorlarının takıp çıkarılabilen sistemi.

source: Point in time since the last container and accounts database sync among nodes within Object Storage.
tr_tr: Nihai Depolama Alanı içindeki düğümler arasındaki son kapsayıcı ve hesap veritabanının senkronize edilmesinden bu yana geçen zamanda bir nokta.

source: Possible use cases for data migration include:
id: kasus penggunaan mungkin untuk migrasi data meliputi:
tr_tr: Veri göçü için muhtemel kullanım durumları şunlardır:

source: Predefined templates of Hadoop configurations with the ability to modify parameters.
id: template standar konfigurasi Hadoop dengan kemampuan untuk mengubah parameter.
tr_tr: Parametrelerin değiştirilebildiği öntanımlı Hadoop yapılandırmaları.

source: Prerequisite
id: Prasyarat
tr_tr: Ön koşul

source: Principal communications protocol in the internet protocol suite for relaying datagrams across network boundaries.
id: protokol komunikasi utama di internet protokol untuk menyampaikan datagram melintasi batas-batas jaringan.
tr_tr: Ağ sınırları boyunca veri iletisi geçirmek için internet protokol paketindeki asıl iletişim protokolü.

source: Process of modifying IP address information while in transit. Supported by Compute and Networking.
tr_tr: Aktarma sırasında IP adres bilgilerini değiştirme süreci. Hesaplama ve Ağ Oluşturma tarafından desteklenir.

source: Process whereby the system firmware validates the authenticity of the code involved in the boot process.
tr_tr: Sistem üretici yazılımı, önyükleme işleminde yer alan kodun doğruluğunu doğrular.

source: Processing is fairly complex. Basically, the daemon accepts actions from the queue and performs a series of system commands such as launching a KVM instance and updating its state in the database.
id: Pengolahan ini cukup rumit. Pada dasarnya, daemon menerima tindakan dari antrian dan melakukan serangkaian perintah sistem seperti meluncurkan contoh KVM dan memperbarui negara dalam database.
tr_tr: İşleme hayli karmaşıktır. Temelde, artalan işi kuyruktan işleri kabul eder ve bir KVM sunucusu başlatmak ve veritabanında durumunu güncellemek gibi bir takım sistem komutlarını gerçekleştirir.

source: Programming language used extensively in OpenStack.
tr_tr: OpenStack'te yaygın kullanılan programlama dili.

source: Project name
id: Nama Proyek
tr_tr: Proje ismi

source: Project name for OpenStack Network Information Service. To be merged with Networking.
tr_tr: OpenStack Ağ Bilgi Servisi için proje adı. Ağ servisi ile birleştirilecek.

source: Projects
id: proyek
tr_tr: Projeler

source: Projects represent the base unit of “ownership” in OpenStack, in that all resources in OpenStack should be owned by a specific project. In OpenStack Identity, a project must be owned by a specific domain.
tr_tr: OpenStack'deki tüm kaynakların belirli bir projeye ait olması gerektiği için, projeler OpenStack'deki “sahiplik” temel birimini temsil eder. OpenStack Kimlik'de, bir projenin belirli bir alan adına ait olması gerekir.

source: Property to add or modify for this snapshot (repeat option to set multiple properties)
tr_tr: Bu anlık görüntü için eklenecek ya da değiştirlecek özellik (birden fazla özellik ayarlamak için seçeneği tekrarlayın)

source: Property to remove from snapshot (repeat option to remove multiple properties)
tr_tr: Anlık görüntüden kaldırılacak özellik (birden çok özellik kaldırmak için seçeneği tekrarlayın)

source: Protocol that encapsulates a wide variety of network layer protocols inside virtual point-to-point links.
id: Protokol yang merangkum berbagai protokol lapisan jaringan dalam link point-to-point virtual.
tr_tr: Sanal noktadan noktaya bağlantılar içindeki çok çeşitli ağ katmanı protokollerini kapsayan protokol.

source: Provide as much detail as possible in the description. Paste in your command output or stack traces, links to screen shots, and any other information which might be useful.
id: Menyediakan detail sebanyak mungkin dalam deskripsi. Tempel di output perintah atau tumpukan jejak, link Anda ke layar tembakan, dan informasi lainnya yang mungkin berguna.
tr_tr: Açıklamada olabildiğince çok ayrıntı sağlayın. Komut çıktısına veya yığın izlerine, ekran görüntülerine bağlantılar ve yararlı olabilecek diğer tüm bilgileri yapıştırın.

source: Provided by Compute in the form of cloudpipes, specialized instances that are used to create VPNs on a per-project basis.
tr_tr: Hesaplama hizmeti tarafından cloudpipe şeklinde sunulmaktadır, VPN'leri proje bazında oluşturmak için kullanılan özel sunucular.

source: Provided in Compute through the system usage data facility.
id: Tersedia di Komputer melalui fasilitas data penggunaan sistem.
tr_tr: Hesaplama'da sistem kullanım veri tesisi ile sağlanır.

source: Provides Shared File System service via nfs, cifs, glusterfs, or hdfs protocol
id: Menyediakan layanan Sistem Bersama Berkas melalui nfs, cifs, GlusterFS, vs protokol HDFS
tr_tr: Nfs, cifs, glusterfs, veya hdfs iletişim kuralı aracılığıyla Paylaşımlı Dosya Sistemi servisi sağlar

source: Provides a high availability load balancer and proxy server for TCP and HTTP-based applications that spreads requests across multiple servers.
tr_tr: TCP ve HTTP tabanlı uygulamalar için istekleri birden çok sunucu arasında dağıtarak yüksek kullanılabilir yük dengeleyici ve vekil sunucu sağlar.

source: Provides a mechanism for metadata exchange along the instantiated service path.
tr_tr: Örneklenmiş servis yolu boyunca üst veri değişimi için bir mekanizma sağlar.

source: Provides a mechanism to implement packet forwarding and routing according to the policies defined by the network administrator.
tr_tr: Paket yönlendirmeyi ve iletmeyi, ağ yöneticisi tarafından tanımlanan ilkelere göre uygulamak için bir mekanizma sağlar.

source: Provides a method of allocating space on mass-storage devices that is more flexible than conventional partitioning schemes.
tr_tr: Konvansiyonel bölme şemalarından daha esnek olan yığın depolama aygıtlarında yer ayırma yöntemi sunar.

source: Provides a predefined list of actions that the user can perform, such as start or stop VMs, reset passwords, and so on. Supported in both Identity and Compute and can be configured using the dashboard.
tr_tr: Kullanıcıların gerçekleştirebileceği, VM'leri başlatmak veya durdurmak, parolaları sıfırlamak vb. Gibi önceden tanımlanmış bir eylem listesi sağlar. Hem Kimlik hem de Hesaplamada desteklenir ve gösterge paneli kullanarak yapılandırılabilir.

source: Provides a proxy for accessing running instances through a SPICE connection. Supports browser-based HTML5 client.
id: Menyediakan proxy untuk mengakses contoh berjalan melalui koneksi SPICE. Mendukung browser berbasis HTML5 klien.
tr_tr: Bir SPICE bağlantısı üzerinden çalışan sunuculara erişim için vekil sağlar. Tarayıcı tabanlı HTML5 istemcileri destekler.

source: Provides a proxy for accessing running instances through a VNC connection. Supports an OpenStack-specific Java client.
id: Menyediakan proxy untuk mengakses contoh berjalan melalui koneksi VNC. Mendukung klien OpenStack khusus Java.
tr_tr: Bir VNC bağlantısı üzerinden çalışan sunuculara erişim için vekil sağlar. OpenStack'e özel bir Java istemcisini destekler.

source: Provides a proxy for accessing running instances through a VNC connection. Supports browser-based novnc clients.
id: Menyediakan proxy untuk mengakses contoh berjalan melalui koneksi VNC. Mendukung novnc klien berbasis browser.
tr_tr: VNC bağlantısı üzerinden çalışan sunuculara erişim için vekil sağlar. Tarayıcı tabanlı novnc istemcilerini destekler.

source: Provides a web-based self-service portal to interact with underlying OpenStack services, such as launching an instance, assigning IP addresses and configuring access controls.
id: Menyediakan portal layanan mandiri berbasis web untuk berinteraksi dengan layanan OpenStack yang mendasari, seperti meluncurkan sebuah contoh, menetapkan alamat IP dan konfigurasi kontrol akses.
tr_tr: Sunucu başlatma, IP adresleri atama, erişim kontrollerini yapılandırma gibi altta yatan OpenStack servisleriyle etkileşim için web tabanlı bir kendine servis kapısı sağlar.

source: Provides an OpenStack-native RESTful API that supports JSON to provision and manage Trove instances.
id: Menyediakan API tenang OpenStack-pribumi yang mendukung JSON untuk penyediaan dan mengelola kasus Trove.
tr_tr: Trove sunucularını hazırlamak ve yönetmek için OpenStack'e özgü JSON destekleyen RESTful API sağlar.

source: Provides an approach for network administrators to manage computer network services through abstraction of lower-level functionality.
tr_tr: Alt düzey işlevselliğin soyutlanması yoluyla bilgisayar ağ hizmetlerini yönetmek için ağ yöneticilerine bir yaklaşım sağlar.

source: Provides an authentication and authorization service for other OpenStack services. Provides a catalog of endpoints for all OpenStack services.
id: Menyediakan otentikasi dan otorisasi layanan untuk layanan OpenStack lainnya. Menyediakan katalog endpoint untuk semua layanan OpenStack.
tr_tr: Diğer OpenStack servisleri için kimlik doğrulama ve yetkilendirme servisi sağlar. Tüm OpenStack servisleri için bir uç nokta kataloğu sağlar.

source: Provides an interface to the underlying Open vSwitch service for the Networking plug-in.
tr_tr: Ağ Eklentisi için Altta Açık vSwitch hizmetine bir arabirim sağlar.

source: Provides capabilities to provision and scale Hadoop clusters in OpenStack by specifying parameters like Hadoop version, cluster topology and nodes hardware details.
id: Menyediakan kemampuan untuk penyediaan dan skala cluster Hadoop di OpenStack dengan menentukan parameter seperti versi Hadoop, topologi cluster dan node rincian hardware.
tr_tr: Hadoop sürümü, küme topolojisi ve düğüm donanım ayrıntıları gibi parametreleri belirterek OpenStack'de Hadoop kümelerini hazırlama ve ölçekleme yeteneği sağlar.

source: Provides data redundancy and fault tolerance by creating copies of Object Storage objects, accounts, and containers so that they are not lost when the underlying storage fails.
tr_tr: Nesne Depolama nesnelerin, hesapların ve kapların kopyalarını oluşturarak veri yedekliliği ve hata toleransı sağlar; böylece temel depolama alanı başarısız olduğunda kaybolmazlar.

source: Provides logical partitioning of Compute resources in a child and parent relationship. Requests are passed from parent cells to child cells if the parent cannot provide the requested resource.
id: Memberikan partisi logis dari sumber daya komputer dalam hubungan anak dan orang tua. Permintaan diwariskan dari sel induk ke sel anak jika orang tua tidak dapat memberikan sumber daya yang diminta.
tr_tr: Hesaplama kaynaklarının bir alt ve üst ilişkide mantıksal bölümlemesini sağlar. Ebeveynden istenen kaynağı sağlayamıyorsa, istekler üst hücrelerden alt hücrelere iletilir.

source: Provides persistent block storage to running instances. Its pluggable driver architecture facilitates the creation and management of block storage devices.
id: Menyediakan penyimpanan blok gigih untuk menjalankan contoh. Its pluggable arsitektur sopir memfasilitasi penciptaan dan pengelolaan perangkat penyimpanan blok.
tr_tr: Çalışan sunuculara kalıcı blok depolama sağlar. Tak çıkar sürücü mimarisi blok depolama aygıtlarının oluşturulmasını ve yönetimini kolaylaştırır.

source: Provides scalable and reliable Cloud Database-as-a-Service functionality for both relational and non-relational database engines.
id: Memberikan scalable dan dapat diandalkan Cloud fungsi database-as-a-Service untuk kedua mesin database relasional dan non-relasional.
tr_tr: Hem ilişkisel hem ilişkisel olmayan veritabanı motorları için ölçeklenebilir ve güvenilir Servis olarak Bulut Veritabanı işlevselliği sağlar.

source: Provides support for NexentaStor devices in Compute.
tr_tr: Hesaplama servisi içerisinde NexentaStor aygıtları için destek sağlar.

source: Provides support for Open vSwitch in Networking.
tr_tr: Ağ servisinde Open vSwitch için destek sağlar.

source: Provides support for VMware NSX in Neutron.
tr_tr: Neutron'da VMware NSX için destek sağlar.

source: Provides support for new and specialized types of back-end storage for the Block Storage volume manager.
tr_tr: Blok Depolama birim yöneticisi için yeni ve uzmanlaşmış arka uç depolama türü desteği sağlar.

source: Provides to the consumer the ability to deploy applications through a programming language or tools supported by the cloud platform provider. An example of Platform-as-a-Service is an Eclipse/Java programming platform provided with no downloads required.
tr_tr: Tüketiciye bulut platform sağlayıcısı tarafından desteklenen programlama dili veya araçları aracılığıyla uygulamalar kurma yeteneği sağlar. Servis olarak Platform'a bir örnek hiçbir indirmenin gerekmediği Eclipse/Java programlama platformudur.

source: Proxy servers (swift-proxy-server)
tr_tr: Vekil sunucular (swift-proxy-server)

source: Publishes collected data to various targets including data stores and message queues.
id: Menerbitkan data yang dikumpulkan untuk berbagai sasaran termasuk menyimpan data dan antrian pesan.
tr_tr: Toplanan veriyi veri merkezleri ve ileti kuyrukları gibi hedeflere yayınlarlar.

source: Python 2.7 or later
id: Python 2.7 atau yang lebih baru
tr_tr: Python 2.7 veya sonrası

source: QEMU Copy On Write 2 (QCOW2)
tr_tr: Write 2 Üzerinde QEMU Kopyası (QCOW2)

source: QEMU is a generic and open source machine emulator and virtualizer. One of the hypervisors supported by OpenStack, generally used for development purposes.
tr_tr: QEMU, genel ve açık kaynaklı bir makine emülatörü ve sanallaştırıcısıdır. OpenStack tarafından desteklenen hipervizörlerden biri, genellikle geliştirme amaçlı kullanılır.

source: Quality of Service (QoS)
tr_tr: Servis Kalitesi (QoS)

source: RADOS Block Device (RBD)
tr_tr: RADOS Blok Aygıtı (RBD)

source: RAM filter
tr_tr: RAM filtresi

source: RAM overcommit
tr_tr: RAM aşırı yükleme

source: RDO, openSUSE, SUSE Linux Enterprise, Debian, and Ubuntu have client packages that can be installed without pip.
tr_tr: RDO, openSUSE, SUSE Linux Kurumsal, Debian, ve Ubuntu pip olmadan kurulabilecek istemci paketlerine sahiptir.

source: RPC driver
tr_tr: RPC sürücüsü

source: RXTX quota
tr_tr: RXTX kota

source: Rackspace Cloud Files
tr_tr: Rackspace Bulut Dosyaları

source: Rating service
id: Peringkat layanan
tr_tr: Oylama servisi

source: Rating service.
id: Peringkat layanan.
tr_tr: Oylama servisi.

source: Reducing the size of files by special encoding, the file can be decompressed again to its original content. OpenStack supports compression at the Linux file system level but does not support compression for things such as Object Storage objects or Image service VM images.
id: Mengurangi ukuran file dengan encoding khusus, file dapat didekompresi lagi untuk konten aslinya. OpenStack mendukung kompresi pada tingkat sistem file Linux tetapi tidak mendukung kompresi untuk hal-hal seperti benda Object Storage atau layanan Gambar gambar VM.
tr_tr: Özel kodlama yöntemiyle dosyaların boyutunu düşürürseniz, dosya özgün içeriğine yeniden sıkıştırılabilir. OpenStack, Linux dosya sistemi düzeyinde sıkıştırmayı destekler, ancak Nesne Depolama nesneleri veya İmaj servis VM imajları gibi şeylerde sıkıştırmayı desteklemez.

source: Released as open source by NASA in 2010 and is the basis for Compute.
tr_tr: 2010 yılında NASA tarafından açık kaynak olarak yayınlandı ve Hesaplama için temel oluşturuyor.

source: Released as open source by Rackspace in 2010; the basis for Object Storage.
tr_tr: 2010 yılında Rackspace tarafından açık kaynak olarak çıkarıldı; Nesne Deposu için temel.

source: Reliable, Autonomic Distributed Object Store
tr_tr: Güvenilir, Otonom Dağıtılmış Nesne Deposu

source: Remote Procedure Call (RPC)
tr_tr: Uzaktan Yordam Çağrısı (RPC)

source: Remove all properties from <snapshot> (specify both --no-property and --property to remove the current properties before setting new properties.)
tr_tr: Tüm özellikleri <anlık görüntü>den kaldırın (yeni özellik ayarlamadan önce hem --no-property hem --property belirterek mevcut özellikleri kaldırın.)

source: Removes all data on the server and replaces it with the specified image. Server ID and IP addresses remain the same.
tr_tr: Sunucudaki tüm verileri kaldırır ve belirtilen imajla değiştirir. Sunucu kimliği ve IP adresleri aynı kalır.

source: Represents a virtual, isolated OSI layer-2 subnet in Networking.
tr_tr: Ağda sanal olarak izole edilmiş OSI katman-2 alt ağını temsil eder.

source: Resize a volume
id: Mengubah ukuran volume
tr_tr: Bir birimi yeniden boyutlandırın

source: Resize the volume by passing the volume ID and the new size (a value greater than the old one) as parameters:
id: Mengubah ukuran volume dengan melewati ID volume dan ukuran baru (nilai yang lebih besar dari yang lama) sebagai parameter:
tr_tr: Birim kimliği ve yeni boyutu (eskisinden büyük bir değer) parametre olarak vererek birimi yeniden boyutlandırın:

source: Responsible for managing Shared File System Service devices, specifically the back-end devices.
tr_tr: Paylaşılan Dosya Sistemi Hizmet cihazlarını, özellikle arka uç cihazlarını yönetmekle sorumludur.

source: Role Based Access Control (RBAC)
tr_tr: Rol Bazlı Erişim Kontrolü (RBAC)

source: Root Cause Analysis (RCA) service (Vitrage)
tr_tr: Sorun Kaynağı Çözümlemesi (RCA) servisi (Vitrage)

source: Routes information between the Block Storage processes.
id: -Rute informasi antara proses Block Storage.
tr_tr: Blok Depolama süreçleri arasında bilgi yönlendirir.

source: Routes information between the Shared File Systems processes.
id: -Rute informasi antara Sistem File Bersama diproses.
tr_tr: Paylaşımlı Dosya Sistemleri süreçleri arasında bilgi yönlendirir.

source: Run the following command to discover the version number for a client:
id: Jalankan perintah berikut untuk menemukan nomor versi untuk klien:
tr_tr: Bir istemci için sürüm numarasını keşfetmek için aşağıdaki komutu çalıştırın:

source: Runs automated tests against the core OpenStack API; written in Rails.
tr_tr: Çekirdek OpenStack API'sine karşı otomatik testler yapar; Rails'de yazılmış.

source: Runs on a central management server and determines when to fire alarms. The alarms are generated based on defined rules against events, which are captured by the Telemetry Data Collection service's notification agents.
id: Berjalan pada server manajemen pusat dan menentukan kapan harus memecat alarm. Alarm dihasilkan berdasarkan aturan yang ditetapkan terhadap peristiwa, yang ditangkap oleh agen pemberitahuan layanan Data telemetri Collection.
tr_tr: Merkezi bir yönetim sunucusunda çalışır ve uyarıların ne zaman gönderileceğini belirler. Uyarılar olaylara karşı belirlenen kurallara göre üretilir, bu da Telemetri Veri Toplama servisi bildirim aracıları tarafından toplanır.

source: Runs on a central management server to poll for resource utilization statistics for resources not tied to instances or compute nodes. Multiple agents can be started to scale service horizontally.
id: Berjalan pada server manajemen pusat untuk polling untuk statistik pemanfaatan sumber daya untuk sumber daya tidak terikat dengan contoh pada node komputasi. Beberapa agen dapat mulai untuk skala pelayanan horizontal.
tr_tr: Merkezi yönetim sunucusunda çalışarak sunuculara ve hesaplama düğümlerine bağlı olmayan kaynaklar için kullanım istatistiklerini çeker. Servisi yatay olarak ölçeklemek için birden fazla aracı başlatılabilir.

source: Runs on a central management server(s) and consumes messages from the message queue(s) to build event and metering data.
id: Berjalan pada server manajemen pusat (s) dan mengkonsumsi pesan dari antrian pesan (s) untuk membangun acara dan metering data.
tr_tr: Merkezi yönetim sunucu(ları)nda çalışır ve ileti kuyruk(lar)ından iletileri tüketerek olay ve ölçü verisi inşa eder.

source: Runs on central management server(s) and dispatches collected telemetry data to a data store or external consumer without modification.
id: Berjalan pada server manajemen pusat) dan kiriman mengumpulkan data telemetri untuk menyimpan data atau konsumen eksternal tanpa modifikasi.
tr_tr: Merkezi yönetim sunucu(lar)ında çalışır ve toplanan telemetri verisini bir veri deposuna veya harici tüketiciye değiştirmeden gönderir.
