Repository: 25hours/openstack-manuals
Catalog: doc/common/source/locale/*/LC_MESSAGES/common.po
Languages: id, tr_tr

source: An Amazon EC2 concept of an isolated area that is used for fault tolerance. Do not confuse with an OpenStack Compute zone or cell.
id: Konsep Amazon EC2 dari daerah terisolasi yang digunakan untuk toleransi kesalahan. Jangan bingung dengan zona OpenStack Compute atau sel.
tr_tr: Arıza toleransı için kullanılan izole edilmiş bir alanın Amazon EC2 konsepti. Bir OpenStack Hesaplama bölgesi veya hücresi ile karıştırmayın.

source: An HTTP and reverse proxy server, a mail proxy server, and a generic TCP/UDP proxy server.
tr_tr: Bir HTTP ve ters vekil sunucusu, bir posta vekil sunucusu ve genel bir TCP/UDP vekil sunucusu.

source: An IP address that a project can associate with a VM so that the instance has the same public IP address each time that it boots. You create a pool of floating IP addresses and assign them to instances as they are launched to maintain a consistent IP address for maintaining DNS assignment.
id: Sebuah alamat IP yang proyek dapat mengaitkan dengan VM sehingga contoh memiliki alamat IP yang sama publik setiap kali boot. Anda membuat kolam dari alamat IP mengambang dan menetapkan mereka untuk kasus seperti yang diluncurkan untuk menjaga alamat IP yang konsisten untuk mempertahankan DNS tugas.
tr_tr: Bir projenin bir VM ile ilişkilendirilebileceği ve böylece her önyüklemede aynı ortak IP adresine sahip olduğu bir IP adresi. DNS atamasını sürdürmek için tutarlı bir IP adresi sağlamak için yüzen IP adresleri havuzu oluşturup bunları başlatıldığı gibi sunuculara atarsınız.

source: An IP address that can be assigned to a VM instance within the shared IP group. Public IP addresses can be shared across multiple servers for use in various high-availability scenarios. When an IP address is shared to another server, the cloud network restrictions are modified to enable each server to listen to and respond on that IP address. You can optionally specify that the target server network configuration be modified. Shared IP addresses can be used with many standard heartbeat facilities, such as keepalive, that monitor for failure and manage IP failover.
tr_tr: Paylaşılan IP grubundaki bir VM örneğine atanabilen bir IP adresi. Genel IP adresleri, çeşitli yüksek kullanılabilirlik senaryolarında kullanılmak üzere birden çok sunucuda paylaşılabilir. Bir IP adresi başka bir sunucuya paylaşıldığında, bulut ağı kısıtlamaları her bir sunucuyu bu IP adresini dinleyip bu IP adresinde yanıt verecek şekilde değiştirilir. İsteğe bağlı olarak hedef sunucu ağ yapılandırmasının değiştirilebileceğini belirtebilirsiniz. Paylaşılan IP adresleri, keepalive, başarısızlığı izleyen ve IP yük devretmesini yöneten birçok standart anlık işlevler ile kullanılabilir.

source: An IP address that is accessible to end-users.
tr_tr: Son kullanıcının erişebildiği IP adresi.

source: An IP address that is associated with the same instance each time that instance boots, is generally not accessible to end users or the public Internet, and is used for management of the instance.
id: Sebuah alamat IP yang berhubungan dengan contoh yang sama setiap kali contoh sepatu bot, umumnya tidak dapat diakses oleh pengguna akhir atau Internet publik, dan digunakan untuk pengelolaan misalnya.
tr_tr: Aynı sunucuya, uygulamanın her başlatılışında eşleşen bir IP adresi genellikle son kullanıcıların veya genel İnternetin erişimine açık değildir ve sunucuyu yönetmek için kullanılır.

source: An IP address used for management and administration, not available to the public Internet.
tr_tr: Yönetim ve yönetim için kullanılan, kamuya açık olmayan İnternet'te kullanılamayan bir IP adresi.

source: An IP address, typically assigned to a router, that passes network traffic between different networks.
id: Alamat IP, biasanya ditugaskan untuk router, yang lewat lalu lintas jaringan antara jaringan yang berbeda.
tr_tr: Genellikle bir yönlendiriciye atanan ve farklı ağlar arasında ağ trafiğini geçiren bir IP adresi.

source: An Identity API v3 entity. Represents a collection of projects, groups and users that defines administrative boundaries for managing OpenStack Identity entities. On the Internet, separates a website from other sites. Often, the domain name has two or more parts that are separated by dots. For example, yahoo.com, usa.gov, harvard.edu, or mail.yahoo.com. Also, a domain is an entity or container of all DNS-related information containing one or more records.
id: API Identitas v3 entitas. Merupakan koleksi proyek, kelompok dan pengguna yang mendefinisikan batas-batas administratif untuk mengelola entitas OpenStack Identity. Di Internet, memisahkan sebuah website dari situs lain. Seringkali, nama domain memiliki dua atau lebih bagian yang dipisahkan oleh titik. Misalnya, yahoo.com, usa.gov, harvard.edu, atau mail.yahoo.com. Juga, domain adalah suatu entitas atau wadah dari semua informasi yang terkait DNS yang mengandung satu atau lebih catatan.
tr_tr: Bir Kimlik API v3 öğesi. OpenStack Kimlik varlıklarını yönetmek için yönetim sınırlarını tanımlayan projeler, gruplar ve kullanıcılar topluluğunu temsil eder. Internet'te bir web sitesini diğer sitelerden ayırır. Çoğu zaman, alan adı nokta ile ayrılmış iki veya daha fazla parçaya sahiptir. Örneğin, yahoo.com, usa.gov, harvard.edu veya mail.yahoo.com. Ayrıca, etki alanı, bir veya daha fazla kayıt içeren DNS ile ilgili bilgilerin bir varlık veya kapsayıcısıdır.

source: An Identity service API access token that is associated with a specific project.
tr_tr: Belirli bir proje ile ilişkili Kimlik hizmeti API erişim jetonu.

source: An Identity service API endpoint that is associated with one or more projects.
tr_tr: Bir veya daha fazla proje ile ilişkili bir Kimlik hizmeti API bitiş noktası.

source: An Identity service component that manages and validates tokens after a user or project has been authenticated.
tr_tr: Bir kullanıcı veya proje doğrulandıktan sonra jetonları yöneten ve doğrulayan bir Kimlik hizmeti bileşeni.

source: An Identity service feature that enables services, such as Compute, to automatically register with the catalog.
tr_tr: Hesaplama gibi hizmetlerin kataloğa otomatik olarak kayıt olmasını sağlayan bir Kimlik hizmeti özelliği.

source: An Identity service that lists API endpoints that are available to a user after authentication with the Identity service.
id: Layanan Identity yang berisi daftar endpoint API yang tersedia untuk pengguna setelah otentikasi dengan layanan Identity.
tr_tr: Kimlik servisiyle kimlik doğrulamasından sonra bir kullanıcı tarafından kullanılabilen API bitiş noktalarını listeleyen bir Kimlik hizmeti.

source: An Identity service token that is not associated with a specific project and is exchanged for a scoped token.
tr_tr: Belirli bir projeyle ilişkili olmayan ve kapsamlı bir simge için değiştirilen bir Kimlik hizmeti jetonudur.

source: An Identity v3 API entity. Represents a collection of users that is owned by a specific domain.
id: Sebuah v3 Identity API entitas. Merupakan kumpulan pengguna yang dimiliki oleh domain tertentu.
tr_tr: Bir Kimlik v3 API öğesi. Belirli bir alana ait olan bir kullanıcı koleksiyonunu temsil eder.

source: An Image service VM image that is available to all projects.
tr_tr: Tüm projeler için kullanılabilen bir İmaj hizmeti VM imajı.

source: An Image service VM image that is only available to specified projects.
tr_tr: Yalnızca belirli projeler için kullanılabilen bir İmaj hizmeti VM imajı.

source: An Image service container format that indicates that no container exists for the VM image.
id: Layanan Gambar format kontainer yang menunjukkan bahwa tidak ada wadah ada untuk gambar VM.
tr_tr: VM imajı için hiç kap olmadığını belirten bir İmaj servis kabıdır.

source: An Image service that provides VM image metadata information to clients.
tr_tr: Müşterilere VM imajı üst veri bilgisi sağlayan bir İmaj hizmeti.

source: An Internet Protocol (IP) address configured on the load balancer for use by clients connecting to a service that is load balanced. Incoming connections are distributed to back-end nodes based on the configuration of the load balancer.
tr_tr: Yük dengeleyicisi olan bir hizmete bağlanan istemciler tarafından kullanılmak üzere yük dengeleyicisinde yapılandırılmış bir Internet Protokolü (IP) adresi. Gelen bağlantılar, yük dengeleyici konfigürasyonuna dayalı olarak arka uç düğümlere dağıtılır.

source: An L2 network segment within Networking.
tr_tr: Ağ içinde bir L2 ağ bölümü.

source: An Object Storage component that collects meters.
tr_tr: Ölçüleri toplayan Nesne Depolama bileşeni.

source: An Object Storage component that copies an object to remote partitions for fault tolerance.
tr_tr: Hata toleransı için bir nesneyi uzaktaki bölümlere kopyalayan bir Nesne Depolama bileşeni.

source: An Object Storage component that copies changes in the account, container, and object databases to other nodes.
id: Komponen Storage Obyek yang salinan perubahan dalam akun, kontainer, dan database objek ke node lain.
tr_tr: Hesap, kap ve nesne veritabanlarındaki değişiklikleri diğer düğümlere kopyalayan Nesne Deposu bileşeni.

source: An Object Storage component that is responsible for managing objects.
tr_tr: Nesneleri yönetmekten sorumlu bir Nesne Depolama bileşenidir.

source: An Object Storage component that provides account services such as list, create, modify, and audit. Do not confuse with OpenStack Identity service, OpenLDAP, or similar user-account services.
id: Komponen Storage Obyek yang menyediakan layanan akun seperti daftar, membuat, memodifikasi, dan audit. Jangan bingung dengan layanan OpenStack Identity, OpenLDAP, atau layanan user-akun yang sama.
tr_tr: Liste oluşturma, değiştirme ve denetim gibi hesap hizmetlerini sağlayan bir Nesne Depolama bileşenidir. OpenStack Kimlik hizmeti, OpenLDAP veya benzeri kullanıcı hesabı hizmetleri ile karıştırmayın.

source: An Object Storage large object that has been broken up into pieces. The re-assembled object is called a concatenated object.
tr_tr: Parçalara bölünmüş bir Nesne Depolama büyük nesnesi. Yeniden bir araya getirilen nesneye birleştirilmiş nesne denir.

source: An Object Storage middleware component that enables creation of URLs for temporary object access.
tr_tr: Geçici nesne erişimi için URL'lerin oluşturulmasını sağlayan bir Nesne Deposu ara katmanı bileşeni.

source: An Object Storage node that provides authorization services.
id: Node Storage Obyek yang menyediakan layanan otorisasi.
tr_tr: Yetkilendirme hizmetleri sağlayan bir Nesne Depolama düğümü.

source: An Object Storage node that provides container services, account services, and object services; controls the account databases, container databases, and object storage.
tr_tr: Kap hizmetleri, hesap hizmetleri ve nesne hizmetleri sağlayan bir Nesne Depolama düğümü; Hesap veritabanlarını, kap veritabanlarını ve nesne depolama alanını denetler.

source: An Object Storage server that manages containers.
id: Server Object Storage yang mengelola kontainer.
tr_tr: Kapları yöneten Nesne Depolama sunucusu.

source: An Object Storage worker that scans for and deletes account databases and that the account server has marked for deletion.
id: Seorang pekerja Storage Obyek yang memindai dan menghapus database account dan bahwa server akun telah ditandai untuk penghapusan.
tr_tr: Hesap veritabanlarını tarayan ve silen ve hesap sunucularının silmek için işaretlediği Nesne Depolama işçisi.

source: An OpenStack grouped release of projects that came out in the spring of 2011. It included Compute (nova), Object Storage (swift), and the Image service (glance). Cactus is a city in Texas, US and is the code name for the third release of OpenStack. When OpenStack releases went from three to six months long, the code name of the release changed to match a geography nearest the previous summit.
id: Sebuah rilis OpenStack dikelompokkan proyek yang keluar pada musim semi 2011. Ini termasuk Compute (nova), Object Storage (cepat), dan layanan Image (pandangan). Kaktus adalah sebuah kota di Texas, AS dan adalah nama kode untuk rilis ketiga dari OpenStack. Ketika OpenStack rilis pergi dari tiga sampai enam bulan lama, nama kode rilis berubah untuk mencocokkan geografi terdekat KTT sebelumnya.
tr_tr: Bir grup 2011 yılının ilkbaharında çıkan OpenStack projeleri. Compute (nova), Nesne Depolama (swift) ve İmaj hizmetini (glance) içeriyordu. Cactus, Texas, ABD'de bir şehirdir ve OpenStack'in üçüncü sürümünün kod adıdır. OpenStack bültenleri üçten altı ay uzunluğa çıktıklarında, sürümün kod adı önceki zirveye en yakın coğrafya ile eşleşecek şekilde değişti.

source: An OpenStack service, such as Compute, Object Storage, or Image service. Provides one or more endpoints through which users can access resources and perform operations.
tr_tr: Hesaplama, Nesne Depolama Alanı veya İmaj hizmeti gibi bir OpenStack hizmeti. Kullanıcıların kaynaklarınıza erişebilecekleri ve operasyonları gerçekleştirebilecekleri bir veya daha fazla son nokta sağlar.

source: An OpenStack-native REST API that processes API requests by sending them to the ``heat-engine`` over :term:`Remote Procedure Call (RPC)`.
id: Sebuah OpenStack-native API REST yang memproses permintaan API dengan mengirimkan mereka ke `` panas engine`` lebih: istilah: `Remote Procedure Call (RPC)`.
tr_tr: API isteklerini :term:`Uzak Yordam Çağrısı (RPC)` üzerinden ``heat-engine``'ye göndererek işleyen OpenStack'e özel bir REST API.

source: An OpenStack-provided image.
id: Sebuah OpenStack-menyediakan gambar.
tr_tr: OpenStack tarafından sağlanan imaj.

source: An OpenStack-supported hypervisor.
id: Sebuah OpenStack didukung hypervisor.
tr_tr: OpenStack-destekli hiper yönetici.

source: An OpenStack-supported hypervisor. KVM is a full virtualization solution for Linux on x86 hardware containing virtualization extensions (Intel VT or AMD-V), ARM, IBM Power, and IBM zSeries. It consists of a loadable kernel module, that provides the core virtualization infrastructure and a processor specific module.
tr_tr: OpenStack destekli bir hipervizör. KVM, sanallaştırma uzantıları (Intel VT veya AMD-V), ARM, IBM Power ve IBM zSeries içeren x86 donanımında Linux için tam bir sanallaştırma çözümüdür. Çekirdek sanallaştırma altyapısını ve işlemciye özel bir modülü sağlayan yüklenebilir bir çekirdek modülünden oluşur.

source: An administrator who has access to all hosts and instances.
tr_tr: Tüm ana makinelere ve örneklere erişimi olan bir yönetici.

source: An administrator-defined token used by Compute to communicate securely with the Identity service.
tr_tr: Kimlik servisiyle güvenli bir şekilde iletişim kurmak için Hesaplama tarafından kullanılan yönetici tanımlı bir jeton.

source: An alarm evaluator (``aodh-evaluator``)
id: Evaluator alarm (`` aodh-evaluator``)
tr_tr: Bir uyarı değerlendirici (``aodh-evaluator``)

source: An alarm notifier (``aodh-notifier``)
id: Sebuah notifier alarm (`` aodh-notifier``)
tr_tr: Uyarı bilgilendiricisi (``aodh-notifier``)

source: An alpha-numeric string of text used to access OpenStack APIs and resources.
tr_tr: OpenStack API'lerine ve kaynaklara erişmek için kullanılan alfanümerik bir metin dizesi.

source: An alternative name for :term:`Networking API <Networking API (Neutron API)>`.
tr_tr: :term:`Ağ API <Networking API (Neutron API)>` için alternatif isim.

source: An alternative term for :term:`project ID`.
tr_tr: :term:`proje ID`sine alternatif bir terim.

source: An application protocol for accessing and maintaining distributed directory information services over an IP network.
tr_tr: Bir IP ağı üzerinden dağıtılmış dizin bilgi servislerine erişmek ve bunları korumak için bir uygulama protokolü.

source: An application protocol for distributed, collaborative, hypermedia information systems. It is the foundation of data communication for the World Wide Web. Hypertext is structured text that uses logical links (hyperlinks) between nodes containing text. HTTP is the protocol to exchange or transfer hypertext.
id: Protokol aplikasi untuk didistribusikan, kolaboratif, sistem informasi hypermedia. Ini adalah dasar dari komunikasi data untuk World Wide Web. Hypertext terstruktur teks yang menggunakan link logis (hyperlink) antara node yang berisi teks. HTTP adalah protokol untuk bertukar atau hypertext transfer.
tr_tr: Dağıtık, işbirliğine dayalı, hipermedya bilgi sistemleri için bir uygulama protokolü. Bu, World Wide Web için veri iletişiminin temelidir. Bağlantılı metni, metin içeren düğümler arasındaki mantıksal bağlantılar (köprüler) kullanan yapılandırılmış bir metindir. HTTP, bağlantılı metni değiştiren veya aktaran protokoldür.

source: An application that runs on the back-end server in a load-balancing system.
tr_tr: Bir yük dengeleme sisteminde arka uç sunucusunda çalışan bir uygulama.

source: An authentication and authorization service for Object Storage, implemented through WSGI middleware; uses Object Storage itself as the persistent backing store.
tr_tr: Nesne Depolama Alanı için kimlik doğrulama ve yetkilendirme servisi, WSGI katmanıyla uygulanır; Nesne depolama biriminin kendisini kalıcı destekleme deposu olarak kullanmaktadır.

source: An authentication facility within Object Storage that enables Object Storage itself to perform authentication and authorization. Frequently used in testing and development.
tr_tr: Nesne Depolama Alanı'nda, Nesne Depolama Birimi'nin kimlik doğrulama ve yetkilendirme yapmasını sağlayan bir kimlik doğrulama özelliği. Test ve geliştirmede sıklıkla kullanılır.

source: An easy method to create a local LDAP directory for testing Identity and Compute. Requires Redis.
id: Metode yang mudah untuk membuat direktori LDAP lokal untuk pengujian Identitas dan Komputer. Membutuhkan Redis.
tr_tr: Kimlik ve Hesaplama testi için yerel bir LDAP dizini oluşturmak için kolay bir yöntem. Redis gerektirir.

source: An element of the Compute RabbitMQ that comes to life when a RPC call is executed. It connects to a direct exchange through a unique exclusive queue, sends the message, and terminates.
id: Sebuah elemen dari Compute RabbitMQ yang datang untuk hidup ketika panggilan RPC dijalankan. Menghubungkan ke pertukaran langsung melalui antrian eksklusif yang unik, mengirim pesan, dan berakhir.
tr_tr: RPC çağrısı yürütüldüğünde hayata gelen Compute RabbitMQ öğesi. Eşsiz bir özel kuyruk aracılığıyla doğrudan bir alışverişe bağlanır, iletiyi gönderir ve sona erer.

source: An element of the Compute capacity cache that is calculated based on the number of build, snapshot, migrate, and resize operations currently in progress on a given host.
id: Unsur cache kapasitas Compute yang dihitung berdasarkan jumlah build, snapshot, bermigrasi, dan mengubah ukuran operasi sedang berlangsung pada host yang diberikan.
tr_tr: Belirli bir ana bilgisayarda halen devam etmekte olan oluşturma, anlık görüntü, taşıma ve yeniden boyutlandırma işlemlerinin sayısına dayalı olarak hesaplanan Hesaplama kapasitesi önbellek öğesi.

source: An encrypted communications protocol for secure communication over a computer network, with especially wide deployment on the Internet. Technically, it is not a protocol in and of itself; rather, it is the result of simply layering the Hypertext Transfer Protocol (HTTP) on top of the TLS or SSL protocol, thus adding the security capabilities of TLS or SSL to standard HTTP communications. Most OpenStack API endpoints and many inter-component communications support HTTPS communication.
id: Protokol komunikasi terenkripsi untuk komunikasi yang aman melalui jaringan komputer, dengan penyebaran terutama luas di Internet. Secara teknis, itu bukan protokol di dan dari dirinya sendiri; bukan, itu adalah hasil dari hanya layering Hypertext Transfer Protocol (HTTP) di atas TLS atau SSL protokol, sehingga menambah kemampuan keamanan TLS atau SSL untuk komunikasi HTTP standar. Kebanyakan API endpoint OpenStack dan banyak komunikasi antar-komponen mendukung HTTPS komunikasi.
tr_tr: Bir bilgisayar ağı üzerinden güvenli iletişimi sağlamak için şifrelenmiş bir iletişim protokolü, özellikle de İnternet'te yaygın olarak kullanılması. Teknik olarak, kendi içinde ve dışında bir protokol değildir; Bunun yerine, Bağlantılı metin Aktarım Protokolü'nün (HTTP) TLS veya SSL protokolünün üstüne yerleştirilmesinin bir sonucudur, böylece TLS veya SSL'nin güvenlik özelliklerini standart HTTP iletişimlerine ekler. Çoğu OpenStack API uç noktası ve birçok bileşenler arası iletişim, HTTPS iletişimini destekler.

source: An entity in the context of the :term:`Shared File Systems service<Shared File Systems service (manila)>` that encapsulates interaction with the Networking service. If the driver you selected runs in the mode requiring such kind of interaction, you need to specify the share network to create a share.
tr_tr: Ağ servisi ile etkileşimi kapsülleyen :term:`Paylaşımlı Dosya Sistemi servisi <Shared File Systems service (manila)>` bağlamında bir öğe. Eğer, seçtiğiniz sürücü bu tarz etkileşim gerektiren bir kipte ise bir paylaşım oluşturmak için paylaşım ağı tanımlamanız gerekir.

source: An entity that maps Object Storage data to partitions. A separate ring exists for each service, such as account, object, and container.
tr_tr: Nesne Depolama Birimi verilerini bölümlere eşleyen bir varlık. Her bir hizmet için hesap, nesne ve kap gibi ayrı bir halka bulunur.

source: An extra but helpful piece of practical advice.
id: Tambahan tapi bermanfaat nasihat praktis.
tr_tr: Fazladan ama yardımcı bir takım pratik tavsiyeler.

source: An iSCSI authentication method supported by Compute.
id: Metode otentikasi iSCSI didukung oleh Komputer.
tr_tr: Compute tarafından desteklenen bir iSCSI kimlik doğrulama yöntemi.

source: An in-progress specification for cloud management. Currently unsupported in OpenStack.
id: Sebuah in-progress spesifikasi untuk manajemen cloud. Saat ini tidak didukung di OpenStack.
tr_tr: Bulut yönetimi için devam eden bir özellik. Şu anda OpenStack'te desteklenmiyor.

source: An integrated project that provides scalable and reliable Cloud Database-as-a-Service functionality for both relational and non-relational database engines.
tr_tr: İlişkisel ve ilişkisiz veritabanı motorları için ölçeklenebilir ve güvenilir Hizmer-olarak-bulut-veritabanı işlevselliği sağlayan entegre bir projedir.

source: An interface that is plugged into a port in a Networking network. Typically a virtual network interface belonging to a VM.
tr_tr: Ağ servisi ağı içindeki bir bağlantı noktasına takılı bir arabirim. Genellikle, bir VM'ye ait sanal bir ağ arabirimi.

source: An object state in Object Storage where a new replica of the object is automatically created due to a drive failure.
id: Negara objek dalam Object Storage mana replika baru dari objek secara otomatis dibuat karena kegagalan drive.
tr_tr: Nesne Depolama alanındaki nesne durumu, burada bir sürücü arızası nedeniyle nesnenin yeni bir kopyası otomatik olarak oluşturulur.

source: An object within Object Storage that is larger than 5 GB.
tr_tr: Nesne Depolama Alanı içinde 5 GB'dan büyük bir nesne.

source: An official OpenStack service defined as core by DefCore Committee. Currently, consists of Block Storage service (cinder), Compute service (nova), Identity service (keystone), Image service (glance), Networking service (neutron), and Object Storage service (swift).
id: Layanan OpenStack resmi didefinisikan sebagai inti oleh Komite DefCore. Saat ini, terdiri dari layanan Block Storage (bara), Hitung layanan (nova), layanan Identity (keystone), layanan Image (pandangan), layanan Networking (neutron), dan Object layanan Storage (cepat).
tr_tr: DefCore Komitesi tarafından çekirdek olarak tanımlanan resmi bir OpenStack hizmeti. Şu anda, Blok Depolama hizmeti (cinder), Hesaplama hizmeti (nova), Kimlik hizmeti (keystone), Görüntü servisi (glance), Ağ hizmeti (neutron) ve Nesne Depolama hizmetini (swift) içermektedir.
