Repository: 25hours/openstack-manuals
Catalog: doc/common/source/locale/*/LC_MESSAGES/common.po
Languages: id, tr_tr

source: When you use OpenStack with VMware vCenter Server, you need to specify the ``vmware_disktype`` and ``vmware_adaptertype`` properties with :command:`glance image-create`. Also, we recommend that you set the ``hypervisor_type="vmware"`` property. For more information, see `Images with VMware vSphere <http://docs.openstack.org/mitaka/config-reference/compute/hypervisor-vmware.html#images-with-vmware-vsphere>`_ in the OpenStack Configuration Reference.
id: Bila Anda menggunakan OpenStack dengan VMware vCenter Server, Anda perlu menentukan `` vmware_disktype`` dan `` sifat vmware_adaptertype`` dengan: perintah: `sekilas gambar-create`. Juga, kami sarankan Anda mengatur `` hypervisor_type = "vmware" `` properti. Untuk informasi lebih lanjut, lihat `Gambar dengan VMware vSphere<http://docs.openstack.org/mitaka/config-reference/compute/hypervisor-vmware.html#images-with-vmware-vsphere>`_ di OpenStack Konfigurasi Referensi.

source: While the ``auth_key`` property is visible in the output of ``cinder transfer-create VOLUME_ID``, it will not be available in subsequent ``cinder transfer-show TRANSFER_ID`` commands.
id: Sementara `` properti auth_key`` terlihat dalam output dari `` Transfer-buat cinder VOLUME_ID``, itu tidak akan tersedia di `` cinder Transfer-show perintah TRANSFER_ID`` berikutnya.

source: While you can install the ``keystone`` client for interacting with version 2.0 of the service's API, you should use the ``openstack`` client for all Identity interactions. Identity API v2 is deprecated in the Mitaka release.
id: Meskipun Anda dapat menginstal `` klien keystone`` untuk berinteraksi dengan versi 2.0 dari layanan API, Anda harus menggunakan `` klien openstack`` untuk semua interaksi Identity. API Identitas v2 sudah ditinggalkan dalam rilis Mitaka.

source: You are not prompted for the password with this method. The password lives in clear text format in the ``PROJECT-openrc.sh`` file. Restrict the permissions on this file to avoid security problems. You can also remove the ``OS_PASSWORD`` variable from the file, and use the :option:`--password` parameter with OpenStack client commands instead.
id: Anda tidak diminta untuk password dengan metode ini. password tinggal dalam format teks yang jelas dalam `` berkas PROJECT-openrc.sh``. Membatasi hak akses pada file ini untuk menghindari masalah keamanan. Anda juga dapat menghapus `` variabel OS_PASSWORD`` dari file, dan menggunakan: option: `parameter --password` dengan OpenStack klien perintah sebaliknya.

source: You can transfer a volume from one owner to another by using the :command:`cinder transfer*` commands. The volume donor, or original owner, creates a transfer request and sends the created transfer ID and authorization key to the volume recipient. The volume recipient, or new owner, accepts the transfer by using the ID and key.
id: Anda dapat mentransfer volume dari satu pemilik yang lain dengan menggunakan: perintah: `Transfer cinder *` perintah. Volume donor, atau pemilik asli, menciptakan permintaan transfer dan mengirimkan mentransfer ID dan otorisasi kunci diciptakan untuk penerima volume. Volume penerima, atau pemilik baru, menerima transfer dengan menggunakan ID dan kunci.

source: `API Complete Reference (HTML) <http://developer.openstack.org/api-ref.html>`__
id: `API Lengkap Referensi (HTML) <http://developer.openstack.org/api-ref.html>` __

source: `API Complete Reference (PDF) <http://developer.openstack.org/api-ref-guides/bk-api-ref.pdf>`__
id: `API Lengkap Referensi (PDF) <http://developer.openstack.org/api-ref-guides/bk-api-ref.pdf>` __

source: `API Guide <http://developer.openstack.org/api-guide/quick-start/>`__
id: `Panduan API <http://developer.openstack.org/api-guide/quick-start/>` __

source: `Administrator Guide <http://docs.openstack.org/admin-guide/>`__
id: `Administrator Panduan <http://docs.openstack.org/admin-guide/>` __

source: `Architecture Design Guide <http://docs.openstack.org/arch-design/>`__
id: `Desain Arsitektur Gratis <http://docs.openstack.org/arch-design/>` __

source: `Bugs: Application catalog (murano) <https://bugs.launchpad.net/murano>`__
id: `Bugs: Katalog Application (murano) <https://bugs.launchpad.net/murano>` __

source: `Bugs: Bare metal service (ironic) <https://bugs.launchpad.net/ironic>`__
id: `Bugs: layanan logam Bare (ironis) <https://bugs.launchpad.net/ironic>` __

source: `Bugs: Clustering service (senlin) <https://bugs.launchpad.net/senlin>`__
id: `Bugs: layanan Clustering (senlin) <https://bugs.launchpad.net/senlin>` __

source: `Bugs: Container Infrastructure Management service (magnum) <https://bugs.launchpad.net/magnum>`__
id: `Bugs: Kontainer layanan Manajemen Infrastruktur (magnum) <https://bugs.launchpad.net/magnum>` __

source: `Bugs: DNS service (designate) <https://bugs.launchpad.net/designate>`__
id: `Bugs: layanan DNS (menunjuk) <https://bugs.launchpad.net/designate>` __

source: `Bugs: Data processing service (sahara) <https://bugs.launchpad.net/sahara>`__
id: `Bugs: layanan pemrosesan data (sahara) <https://bugs.launchpad.net/sahara>` __

source: `Bugs: Database service (trove) <https://bugs.launchpad.net/trove>`__
id: `Bugs: layanan database (harta) <https://bugs.launchpad.net/trove>` __

source: `Bugs: Deployment service (fuel) <https://bugs.launchpad.net/fuel>`__
id: `Bugs: layanan Deployment (BBM) <https://bugs.launchpad.net/fuel>` __

source: `Bugs: Messaging service (zaqar) <https://bugs.launchpad.net/zaqar>`__
id: `Bugs: Layanan pesan (zaqar) <https://bugs.launchpad.net/zaqar>` __

source: `Bugs: Monitoring (monasca) <https://bugs.launchpad.net/monasca>`__
id: `Bugs: Pemantauan (monasca) <https://bugs.launchpad.net/monasca>` __

source: `Bugs: OpenStack API Documentation (developer.openstack.org) <https://bugs.launchpad.net/openstack-api-site>`__
id: `Bugs: OpenStack API Dokumentasi (developer.openstack.org) <https://bugs.launchpad.net/openstack-api-site>` __

source: `Bugs: OpenStack Block Storage (cinder) <https://bugs.launchpad.net/cinder>`__
id: `Bugs: OpenStack Block Storage (abu) <https://bugs.launchpad.net/cinder>` __

source: `Bugs: OpenStack Documentation (docs.openstack.org) <https://bugs.launchpad.net/openstack-manuals>`__
id: `Bugs: OpenStack Dokumentasi (docs.openstack.org) <https://bugs.launchpad.net/openstack-manuals>` __

source: `Bugs: OpenStack Image service (glance) <https://bugs.launchpad.net/glance>`__
id: `Bugs: OpenStack layanan Gambar (pandangan) <https://bugs.launchpad.net/glance>` __

source: `Bugs: OpenStack Networking (neutron) <https://bugs.launchpad.net/neutron>`__
id: `Bugs: OpenStack Jaringan (neutron) <https://bugs.launchpad.net/neutron>` __

source: `Bugs: OpenStack Object Storage (swift) <https://bugs.launchpad.net/swift>`__
id: `Bugs: OpenStack Object Storage (cepat) <https://bugs.launchpad.net/swift>` __

source: `Bugs: Orchestration (heat) <https://bugs.launchpad.net/heat>`__
id: `Bugs: orkestrasi (panas) <https://bugs.launchpad.net/heat>` __

source: `Bugs: Rating (cloudkitty) <https://bugs.launchpad.net/cloudkitty>`__
id: `Bugs: Penilaian (cloudkitty) <https://bugs.launchpad.net/cloudkitty>` __

source: `Bugs: Shared file systems (manila) <https://bugs.launchpad.net/manila>`__
id: `Bugs: file sistem Bersama (manila) <https://bugs.launchpad.net/manila>` __

source: `Bugs: Telemetry (ceilometer) <https://bugs.launchpad.net/ceilometer>`__
id: `Bugs: Telemetri (ceilometer) <https://bugs.launchpad.net/ceilometer>` __

source: `Bugs: Telemetry v3 (gnocchi) <https://bugs.launchpad.net/gnocchi>`__
id: `Bugs: Telemetri v3 (gnocchi) <https://bugs.launchpad.net/gnocchi>` __

source: `Bugs: Workflow service (mistral) <https://bugs.launchpad.net/mistral>`__
id: `Bugs: layanan Workflow (mistral) <https://bugs.launchpad.net/mistral>` __

source: `Command-Line Interface Reference <http://docs.openstack.org/cli-reference/>`__
id: `Command-Line Interface Referensi <http://docs.openstack.org/cli-reference/>` __

source: `Configuration Reference <http://docs.openstack.org/mitaka/config-reference/>`__
id: `Konfigurasi Referensi <http://docs.openstack.org/mitaka/config-reference/>` __

source: `Documentation Contributor Guide <http://docs.openstack.org/contributor-guide/>`__
id: `Dokumentasi Kontributor Gratis <http://docs.openstack.org/contributor-guide/>` __

source: `End User Guide <http://docs.openstack.org/user-guide/>`__
id: `Panduan Pengguna Akhir <http://docs.openstack.org/user-guide/>` __

source: `High Availability Guide <http://docs.openstack.org/ha-guide/>`__
id: `Panduan Ketersediaan Tinggi <http://docs.openstack.org/ha-guide/>` __

source: `Installation Guide for Red Hat Enterprise Linux 7 and CentOS 7 <http://docs.openstack.org/mitaka/install-guide-rdo/>`__
id: `Panduan Instalasi untuk Red Hat Enterprise Linux 7 dan CentOS 7 <http://docs.openstack.org/mitaka/install-guide-rdo/>` __

source: `Installation Guide for Ubuntu 14.04 (LTS) <http://docs.openstack.org/mitaka/install-guide-ubuntu/>`__
id: `Panduan Instalasi untuk Ubuntu 14.04 (LTS) <http://docs.openstack.org/mitaka/install-guide-ubuntu/>` __

source: `Installation Guide for openSUSE Leap 42.1 and SUSE Linux Enterprise Server 12 SP1 <http://docs.openstack.org/mitaka/install-guide-obs/>`__
id: `Panduan Instalasi openSUSE Leap 42.1 dan SUSE Linux Enterprise Server 12 SP1 <http://docs.openstack.org/mitaka/install-guide-obs/>` __

source: `Networking Guide <http://docs.openstack.org/mitaka/networking-guide>`__
id: `Panduan Jaringan <http://docs.openstack.org/mitaka/networking-guide>` __

source: `Security Guide <http://docs.openstack.org/sec/>`__
id: `Panduan Keamanan <http://docs.openstack.org/sec/>` __

source: `Virtual Machine Image Guide <http://docs.openstack.org/image-guide/>`__
id: `Panduan Virtual Machine Gambar <http://docs.openstack.org/image-guide/>` __

source: ``--copy-from IMAGE_URL``
id: `` --copy-Dari IMAGE URL``

source: ``--is-protected [True|False]``
id: `` --is Dilindungi [Benar | Salah] ``

source: ``--is-public [True|False]``
id: `` --is-Publik [Benar | Salah] ``

source: ``keystone`` - Identity service API and extensions
id: `` Keystone`` - Identitas layanan API dan ekstensi

source: ``sahara`` - Data Processing API
id: `` Sahara`` - Pengolahan Data API

source: ``show_multiple_locations = True``
id: `` Menunjukkan beberapa lokasi = True``

source: iSCSI Qualified Name (IQN) is the format most commonly used for iSCSI names, which uniquely identify nodes in an iSCSI network. All IQNs follow the pattern iqn.yyyy-mm.domain:identifier, where 'yyyy-mm' is the year and month in which the domain was registered, 'domain' is the reversed domain name of the issuing organization, and 'identifier' is an optional string which makes each IQN under the same domain unique. For example, 'iqn.2015-10.org.openstack.408ae959bce1'.
id: iSCSI Nama Berkualitas (IQN) adalah format yang paling umum digunakan untuk nama iSCSI, yang unik mengidentifikasi node dalam jaringan iSCSI. Semua IQNs mengikuti pola iqn.yyyy-mm.domain: identifier, di mana 'yyyy-mm' adalah tahun dan bulan di mana domain terdaftar, 'domain' adalah nama dibalik domain dari organisasi penerbitan, dan 'identifier' adalah string opsional yang membuat setiap IQN bawah domain yang sama yang unik. Misalnya, 'iqn.2015-10.org.openstack.408ae959bce1'.
