Repository: 25hours/openstack-manuals
Catalog: doc/common-rst/source/locale/*/LC_MESSAGES/common-rst.po
Languages: fr, pt_br

source: A string of text provided to the client after authentication. Must be provided by the user or process in subsequent requests to the API endpoint.
fr: Une chaine de caractères fournie au client après l'authentification. Elle doit être fournie par l'utilisateur ou le processus lors de ses prochaines requêtes au point de terminaison API.

source: A subset of API calls that are accessible to authorized administrators and are generally not accessible to end users or the public Internet. They can exist as a separate service (keystone) or can be a subset of another API (nova).
fr: Un sous-ensemble d'appels API qui sont accessibles par les administrateurs authorisés et qui ne sont généréralement pas accessibles aux utilisateurs finaux ou sur l'internet public. Ils peuvent exister sous forme de service séparé (keystone) ou comme sous-ensemble d'une autre API (nova).

source: A system by which Internet domain name-to-address and address-to-name resolutions are determined. DNS helps navigate the Internet by translating the IP address into an address that is easier to remember. For example, translating 111.111.111.1 into www.yahoo.com. All domains and their components, such as mail servers, utilize DNS to resolve to the appropriate locations. DNS servers are usually set up in a master-slave relationship such that failure of the master invokes the slave. DNS servers might also be clustered or replicated such that changes made to one DNS server are automatically propagated to other active servers.
fr: Un système par lequel les résolutions de nom-vers-adresse et adresse-vers-nom de domaine d'Internet sont déterminées. DNS permet de naviguer sur Internet en traduisant l'adresse IP en une adresse plus simple à retenir. Par exemple, il traduit 111.111.111.1 en www.yahoo.com. Tous les domaines et leurs composants, tels que les serveurs de messagerie, utilisent DNS pour résoudre vers les emplacements appropriés. Les serveurs DNS sont généralement installés en relation master-esclave, de façon à ce que toute défaillance du master invoque l'esclave. Les serveurs DNS peuvent également être clusterisés ou répliqués de façon à ce que les modifications apportées à un serveur DNS soient automatiquement propagées à d'autres serveurs actifs.

source: A system that provides services to other system entities. In case of federated identity, OpenStack Identity is the service provider.
fr: Système qui fournit des services à d'autres entités de système. En cas d'identité fédérée, Identité d'Openstack est le fournisseur de service.

source: A tool to automate system configuration and installation on Debian-based Linux distributions.
fr: Outil d'installation et de configuration de système automatique sur les distributions Linux basées Debian.

source: A tool to automate system configuration and installation on Red Hat, Fedora, and CentOS-based Linux distributions.
fr: Outil d'installation et de configuration de systèmes automatiques sur les distributions Red Hat, Fedora, et Linux basées CentOS.

source: A type of VM image that exists as a single, bootable file.
fr: Un type d'image VM qui existe en tant que fichier simple, amorçable.

source: A type of image file that is commonly used for animated images on web pages.
fr: Un type d'image communément utilisé pour les images animées de pages web.

source: A type of reboot where a physical or virtual power button is pressed as opposed to a graceful, proper shutdown of the operating system.
fr: Un type de redémarrage quand un bouton marche-arrêt physique ou virtuel est pressé pour remplacer une fermeture plus gracieuse et correcte du système d'exploitation.

source: A unique ID given to each replica of an Object Storage database.
fr: ID unique donné à chaque réplique de base de données d'Object Storage.

source: A unit of storage within Object Storage used to store objects. It exists on top of devices and is replicated for fault tolerance.
fr: Unité de stockage dans Object Storage utilisée pour stocker les objets. Se trouve au dessus de périphériques et est répliquée pour la tolérance de pannes.

source: A user-created Python module that is loaded by horizon to change the look and feel of the dashboard.
fr: Un modèle Python créé-utilisateur chargé par horizon de changer l'apparence du tableau de bord.

source: A virtual network port within Networking; VIFs / vNICs are connected to a port.
fr: Port de réseau virtuel de Networking : VIF / vNIC connectés à un port.

source: A virtual network that provides connectivity between entities. For example, a collection of virtual ports that share network connectivity. In Networking terminology, a network is always a layer-2 network.
fr: Un réseau virtuel qui fournit la connectivité entre les entités, comme par exemple, un ensemble de ports virtuels qui partagent une connectivité de réseau. En terminologie de réseautage, un réseau est un layer-2 network.

source: A web framework used extensively in horizon.
fr: Framework web largement utilisé dans horizon.

source: A worker daemon that creates and terminates virtual machine instances through hypervisor APIs. For example:
fr: Un démon de worker qui crée et termine des instances de machines virtuelles par l'intermédiaire d'API d'hyperviseur. Par exemple :
pt_br: Um daemon funcional que cria e termina instâncias de máquinas virtuais através das APIs do hypervisor. Por exemplo:

source: A worker process that verifies the integrity of Object Storage objects, containers, and accounts. Auditors is the collective term for the Object Storage account auditor, container auditor, and object auditor.
fr: Un processus de worker qui vérifie l'intégrité d'objets du Stockage d'objets, de conteneurs, et de comptes. Le terme « auditeurs » rassemble à la fois l'auditeur de compte de Stockage d'objets, l'auditeur de conteneurs, et l'auditeur d'objets.

source: A wrapper used by the Image service that contains a VM image and its associated metadata, such as machine state, OS disk size, and so on.
fr: Un wrapper utilisé par le service Image contenant l'image VM et ses métadonnées associées, comme l'état de la machine, la taille du disque du SE, etc.

source: API endpoint
fr: Point de terminaison d'API

source: API extension
fr: Extension d'API

source: API extension plug-in
fr: Greffon d'extension d'API

source: API key
fr: Clé d'API

source: API server
fr: Serveur d'API
pt_br: Servidor de API

source: API token
fr: Jeton d'API

source: API used to access OpenStack Networking. Provides an extensible architecture to enable custom plug-in creation.
fr: API utilisé pour accéder au réseautage d'OpenStack. Fournit une architecture extensible qui permet la création de plug-ins personnalisées.

source: API used to access OpenStack Object Storage.
fr: API utilisé pour accéder au Stockage d'objets d'OpenStack.

source: API version
fr: Version d'API

source: ATA over Ethernet (AoE)
fr: ATA sur Ethernet (AoE)

source: AWS CloudFormation allows AWS users to create and manage a collection of related resources. The Orchestration service supports a CloudFormation-compatible format (CFN).
fr: AWS CloudFormation permet aux utilisateurs AWS de créer et de gérer un ensemble de ressources liées entre elles. Le service Orchestration est compatible avec le format CFN de CloudFormation.

source: AWS CloudFormation template
fr: Modèle AWS CloudFormation

source: Absolute limit on the amount of network traffic a Compute VM instance can send and receive.
fr: Limite absolue du montant de trafic réseau qu'une instance de VM de Compute peut envoyer ou recevoir.

source: Accepts API requests, and routes them to the cinder-volume for action.
fr: Accepte les requêtes d'API, et les redirige vers cinder-volume pour toute action.

source: Accepts Image API calls for image discovery, retrieval, and storage.
fr: Accepte les appels d'API d'images pour la découverte d'images, leur extraction, et leur stockage.

source: Accepts OpenStack Object Storage API and raw HTTP requests to upload files, modify metadata, and create containers. It also serves file or container listings to web browsers. To improve performance, the proxy server can use an optional cache that is usually deployed with memcache.
fr: Accepte l'API OpenStack Object Storage et les requêtes brutes HTTP de chargement de fichiers, de modification des métadonnées, et de création de conteneurs. Il sert également au listing de conteneurs ou de fichiers dans les navigateurs web. Pour améliorer la performance, le serveur proxy peut utiliser, en option, un cache que est habituellement déployé avec memcache.

source: Accepts and responds to end user compute API calls. The service supports the OpenStack Compute API, the Amazon EC2 API, and a special Admin API for privileged users to perform administrative actions. It enforces some policies and initiates most orchestration activities, such as running an instance.
fr: Accepte et répond aux appels d'API Compute. Le service prend en charge l'API OpenStack Compute, l'API d'Amazon EC2 et une API Admin spéciale pour utilisateurs privilégiés pour l'exécution des actions administratives. Il applique des politiques et initie la plupart des activités d'orchestration, comme les exécutions d'instance.
pt_br: Aceita e responde às chamadas de API de Computação do usuário final. O serviço suporta a API da Computação OpenStack, a API do Amazon EC2, e uma API especial de Admin para usuários privilegiados para realizar ações administrativas. Ele força algumas políticas e inicializa a maioria das atividades de orquestração, tais como executar uma instância.

source: Accepts and routes API requests to the appropriate OpenStack Networking plug-in for action.
fr: Accepte et dirige les demandes d'API vers le plug-in d'OpenStack Networking qui convient pour commencer une action.

source: Accepts metadata requests from instances. The nova-api-metadata service is generally used when you run in multi-host mode with nova-network installations. For details, see `Metadata service <http://docs.openstack.org/admin-guide-cloud/compute-networking-nova.html#metadata-service>`__ in the OpenStack Cloud Administrator Guide.
fr: Accepte les demandes de métadonnées en provenance d'instances. Le service nova-api-metadata est généralement utilisé lorsque vous exécutez en mode multi-hôtes dans des installations nova-network. Pour plus de détails, voir `Metadata service <http://docs.openstack.org/admin-guide-cloud/compute-networking-nova.html#metadata-service>`__ dans le Guide d'administrateur de Cloud OpenStack.

source: Account servers (swift-account-server)
fr: Serveurs de comptes (swift-account-server)

source: Acts as the gatekeeper to Object Storage and is responsible for authenticating the user.
fr: Agit comme contrôleur du Stockage d'objets et est responsable de l'authentification de l'utilisateur.

source: Address Resolution Protocol (ARP)
fr: Protocole de résolution d'adresse (ARP) (de l'anglais Address Resolution Protocol)

source: Advanced Message Queuing Protocol (AMQP)
fr: Protocole avancé de mise en file d'attente de messages (AMQP) (de l'anglais Advanced Message Queuing Protocol)

source: All OpenStack core projects are provided under the terms of the Apache License 2.0 license.
fr: Tous les projets principaux d'OpenStack sont proposés selon les termes de la licence Apache License 2.0.

source: Allows a user to set a flag on an Object Storage container so that all objects within the container are versioned.
fr: Autorise l'utilisateur à mettre un drapeau sur un conteneur de stockage d'objet, de façon à ce que tous les objets qui se trouvent dans le conteneur puissent être associés à une version.

source: Alphanumeric ID assigned to each Identity service role.
fr: ID alphanumérique assigné à chaque rôle de service d'Identité.

source: Alternative name for the Block Storage API.
fr: Autre nom pour l'API de stockage par blocs.

source: Alternative name for the glance image API.
fr: Autre nom pour l'API d'image glance.

source: Alternative term for a Networking plug-in or Networking API extension.
fr: Terme alternatif pour un greffon de réseau ou une extension d'API de réseau.

source: Alternative term for a RabbitMQ message exchange.
fr: Autre terme pour « échange de message de RabbitMQ »

source: Alternative term for a VM image.
fr: Autre expression pour se référer à une image de VM.

source: Alternative term for a VM instance type.
fr: Autre expression pour un type d'instance de VM

source: Alternative term for a VM or guest.
fr: Autre expression pour une VM ou un invité.

source: Alternative term for a cloud controller node.
fr: Autre terme pour nœud contrôleur de cloud.

source: Alternative term for a cloudpipe.
fr: Autre terme désignant un cloudpipe.

source: Alternative term for a fixed IP address.
fr: Autre expression pour une adresse IP fixe.

source: Alternative term for a flavor ID.
fr: Autre expression pour ID de gabarit

source: Alternative term for a non-durable queue.
fr: Autre expression pour une brève file d'attente.

source: Alternative term for a paused VM instance.
fr: Autre expression pour une instance de VM en attente.

source: Alternative term for a virtual network.
fr: Autre expression pour un réseau virtuelle.

source: Alternative term for a volume plug-in.
fr: Autre terme désignant un plug-in de volume.

source: Alternative term for an API extension or plug-in. In the context of Identity service, this is a call that is specific to the implementation, such as adding support for OpenID.
fr: Terme alternatif pour plug-in ou extension d'API. En ce qui concerne le service Identity, c'est un appel spécifique à une implémentation, comme ajouter un support à OpenID.

source: Alternative term for an API token.
fr: Autre terme désignant un jeton d'API

source: Alternative term for an Amazon EC2 access key. See EC2 access key.
fr: Autre terme utilisé pour une clé d'accès Amazon EC2. Voir la clé d'accès EC2.

source: Alternative term for an Identity service catalog.
fr: Autre terme utilisé pour un catalogue de services d'Identity.

source: Alternative term for an Identity service default token.
fr: Autre terme pour un jeton par défaut du service d'Identité.

source: Alternative term for an Object Storage authorization node.
fr: Autre mot pour nœud d'autorisation de Stockage Objet.

source: Alternative term for an admin API.
fr: Autre expression pour un API admin.

source: Alternative term for an ephemeral volume.
fr: Autre expression pour un volume éphémère.

source: Alternative term for an image.
fr: Autre expression pour une image.

source: Alternative term for instance UUID.
fr: Autre expression pour instance UUID.

source: Alternative term for non-durable.
fr: Autre expression pour bref.

source: Alternative term for tenant.
fr: Autre terme pour client.

source: Alternative term for the Compute API.
fr: Autre expression pour un API Compute.

source: Alternative term for the Identity service API.
fr: Autre terme utilisé pour l'API du service Identity.

source: Alternative term for the Identity service catalog.
fr: Autre terme utilisé pour le catalogue de services d'Identity.

source: Alternative term for the Image service image registry.
fr: Autre terme utilisé pour le registre d'images du service Image.

source: Alternative term for the Image service registry.
fr: Autre terme utilisé pour le registre d'images du service Registry.

source: An API endpoint used for both service-to-service communication and end-user interactions.
fr: Un point de terminaison d'API à la fois pour la communication de service à servie et avec l'utilisateur final.

source: An API on a separate endpoint for attaching, detaching, and creating block storage for compute VMs.
fr: Une API sur un point de terminaison séparé pour attacher, détacher, et créer du stockage par blocs pour les VMs de Compute.

source: An API server (``ceilometer-api``)
fr: Un serveur d'API (``ceilometer-api``)

source: An API that is accessible to tenants.
fr: Une API qui est accessible aux clients.

source: An AWS Query API that is compatible with AWS CloudFormation. It processes API requests by sending them to the heat-engine over RPC.
fr: Une API de requête AWS compatible avec AWS CloudFormation. Gère les demandes d'API en les dirigeant vers le heat-engine via RPC.

source: An Amazon EBS storage volume that contains a bootable VM image, currently unsupported in OpenStack.
fr: Volume de stockage EBS d'Amazon qui contient une image de VM bootable, actuellement prise en charge par OpenStack.

source: An Amazon EC2 concept of an isolated area that is used for fault tolerance. Do not confuse with an OpenStack Compute zone or cell.
fr: Concept Amazon EC2 d'une zone isolée utilisée pour la tolérance de panne. Ne pas confondre avec les zones Compute ou les cellules d'OpenStack.

source: An IP address that a project can associate with a VM so that the instance has the same public IP address each time that it boots. You create a pool of floating IP addresses and assign them to instances as they are launched to maintain a consistent IP address for maintaining DNS assignment.
fr: Adresse IP qu'un projet peut associer à une VM, pour l'instance puisse avoir la même adresse IP publique à chaque démarrage. Vous créez un pool d'adresses IP flottantes et vous les assignez à des instances au fur et à mesure qu'elles sont lancées afin de maintenir une adresse IP consistante pour maintenir l'attribution DNS.

source: An IP address that can be assigned to a VM instance within the shared IP group. Public IP addresses can be shared across multiple servers for use in various high-availability scenarios. When an IP address is shared to another server, the cloud network restrictions are modified to enable each server to listen to and respond on that IP address. You can optionally specify that the target server network configuration be modified. Shared IP addresses can be used with many standard heartbeat facilities, such as keepalive, that monitor for failure and manage IP failover.
fr: Une adresse IP qui peut être assignée à une instance de machine virtuelle dans le groupe d'IP partagées. Les adresses IP publiques peuvent être partagées entre plusieurs serveurs pour une utilisation dans divers scénarios de haute disponibilité. Lorsqu'une adresse IP est partagée sur un autre serveur, les restrictions réseau du cloud sont modifiées pour permettre à chaque serveur d'écouter et de répondre sur cette adresse IP. Vous pouvez éventuellement spécifier que la configuration réseau du serveur cible doit être modifiée. Les adresses IP partagées peuvent être utilisées avec de nombreux équipements heartbeat standards, comme keepalive, qui surveillent les défaillances et gèrent les échecs d'IP.

source: An IP address that is accessible to end-users.
fr: Une adresse IP accessible aux utilisateurs finaux.

source: An IP address that is associated with the same instance each time that instance boots, is generally not accessible to end users or the public Internet, and is used for management of the instance.
fr: Adresse IP qui associe la même instance à chaque fois qu'une instance démarre, qui n'est généralement pas accessible aux utilisateurs finaux ou au public Internet, et qui est utilisé pour la gestion de l'instance.

source: An IP address used for management and administration, not available to the public Internet.
fr: Adresse IP utilisée pour la gestion et l'administration, non disponible sur l'internet public.

source: An IP address, typically assigned to a router, that passes network traffic between different networks.
fr: Adresse IP, normalement assignée à un routeur, qui fait circuler le trafic réseau entre plusieurs réseaux.

source: An Identity API v3 entity. Represents a collection of projects, groups and users that defines administrative boundaries for managing OpenStack Identity entities. On the Internet, separates a website from other sites. Often, the domain name has two or more parts that are separated by dots. For example, yahoo.com, usa.gov, harvard.edu, or mail.yahoo.com. Also, a domain is an entity or container of all DNS-related information containing one or more records.
fr: Entité d'Identity API v3. Représente une collection de projets, de groupes et d'utilisateurs qui définissent des limites administratives pour la gestion des entités du service Identity d'OpenStack. Sur Internet, sépare un site Web d'autres sites. Souvent, le nom de domaine a deux ou plusieurs parties qui sont séparées par des points. Par exemple, yapo.com, usa.gov, harvard.edu ou mail.yahoo.com. Aussi, un domaine est une entité ou un conteneur comprenant tous les renseignements DNS avec un ou plusieurs enregistrements.

source: An Identity service API access token that is associated with a specific tenant.
fr: Jeton d'accès à l'API du service Identité associé à un client particulier.

source: An Identity service component that manages and validates tokens after a user or tenant has been authenticated.
fr: Composant du service d'Identité qui gère et valide les jetons après qu'un utilisateur ou un tenant ait été authentifié.

source: An Identity service feature that enables services, such as Compute, to automatically register with the catalog.
fr: Fonctionnalité de service d'Identity qui permet aux services comme Compute d'être automatiquement enregistrés dans le catalogue.

source: An Identity service that lists API endpoints that are available to a user after authentication with the Identity service.
fr: Un service d'Identité qui liste les API disponibles pour un utilisateur après son authentification auprès du service d'identité.

source: An Identity service token that is not associated with a specific tenant and is exchanged for a scoped token.
fr: Un jeton du service Identity qui n'est pas associé à un client particulier et qui est échangé pour un jeton scoped.

source: An Identity v3 API entity. Represents a collection of users that is owned by a specific domain.
fr: Entité API v3 d'Identity. Représente un ensemble d’utilisateurs qui possèdent un domaine particulier.

source: An Image service VM image that is available to all tenants.
fr: Une image VM de service Image disponibles à tous les clients.

source: An Image service VM image that is only available to specified tenants.
fr: Une image VM de service Image uniquement disponibles pour des clients particuliers

source: An Image service container format that indicates that no container exists for the VM image.
fr: Format de conteneur du service d'Image qui indique qu'aucun conteneur n'existe pour cette image de VM.

source: An Image service that provides VM image metadata information to clients.
fr: Un service d'Image qui fournit des renseignements sur les métadonnées d'images de VM aux clients.

source: An Internet Protocol (IP) address configured on the load balancer for use by clients connecting to a service that is load balanced. Incoming connections are distributed to back-end nodes based on the configuration of the load balancer.
fr: Adresse IP (Internet Protocol) configurée sur le load balancer pour être utilisée par les clients se connectant au service qui est load balancé. La distribution des connexions entrantes aux noeuds en arrière plan est basée sur la configuration du load balancer.

source: An Object Storage component that collects meters.
fr: Composant de stockage d'objets qui collecte les métriques.

source: An Object Storage component that copies an object to remote partitions for fault tolerance.
fr: Composant de Stockage d'objets qui copie un objet dans des partitions distantes pour la tolérance de fautes.

source: An Object Storage component that copies changes in the account, container, and object databases to other nodes.
fr: Composant d'Object Storage qui copie les changements à un compte, conteneur, ou bases de données d'objet à d'autres nœuds.
