Repository: 25hours/openstack-manuals
Catalog: doc/common-rst/source/locale/*/LC_MESSAGES/common-rst.po
Languages: fr, pt_br

source: data encryption
fr: chiffrement des données

source: database ID
fr: ID de base de données

source: database replicator
fr: réplicateur de base de données

source: deallocate
fr: désallouer, désassocier

source: deduplication
fr: déduplication

source: default panel
fr: page par défaut

source: default tenant
fr: client par défaut

source: default token
fr: jeton par défaut

source: delayed delete
fr: suppression retardée

source: delivery mode
fr: mode de livraison

source: denial of service (DoS)
fr: Déni de service (DoS)

source: developer
fr: développeur

source: device ID
fr: ID du Périphérique

source: direct consumer
fr: consommateur direct

source: direct exchange
fr: échange direct

source: disassociate
fr: dissocier

source: disk encryption
fr: chiffrement de disque

source: disk format
fr: format du disque

source: distributed virtual router (DVR)
fr: DVR (Distibuted Virtuel Router)

source: domain
fr: domaine

source: download
fr: téléchargement

source: durable exchange
fr: échange durable

source: durable queue
fr: file d'attente durable

source: east-west traffic
fr: trafic est-ouest

source: encryption
fr: chiffrement

source: endpoint
fr: Point de terminaison

source: endpoint registry
fr: registre de points de terminaison

source: endpoint template
fr: modèle de point de terminaison

source: entity
fr: entité

source: ephemeral image
fr: image éphémère

source: ephemeral volume
fr: volume éphémère

source: evacuate
fr: évacuer

source: exchange type
fr: type d'échange

source: exclusive queue
fr: file d'attente exclusive

source: extended attributes (xattr)
fr: attributs étendus (xattr)

source: external network
fr: réseau externe

source: extra specs
fr: spécifications supplémentaires

source: filter
fr: filtre

source: firewall
fr: pare-feu

source: fixed IP address
fr: adresse IP fixe.

source: flat mode injection
fr: Injection flat mode

source: flavor
fr: gabarit

source: flavor ID
fr: ID du gabarit

source: floating IP address
fr: adresse IP flottante

source: gateway
fr: passerelle

source: generic receive offload (GRO)
fr: GRO (Generic Receive Offload)

source: generic routing encapsulation (GRE)
fr: GRE (Generic Routing Encapsulation)

source: glance API server
fr: Serveur d'API glance

source: glance registry
fr: registre glance

source: global endpoint template
fr: modèle de point de terminaison global

source: hard reboot
fr: redémarrage matériel

source: health monitor
fr: moniteur d'intégrité

source: high availability (HA)
fr: haute disponibilité (HA)

source: horizon plug-in
fr: plug-in horizon

source: host
fr: hôte

source: host aggregate
fr: agrégat d'hôtes

source: hybrid cloud
fr: cloud hybride

source: hyperlink
fr: lien hypertexte

source: hypervisor
fr: hyperviseur

source: hypervisor pool
fr: pool d'hyperviseurs

source: iSCSI Qualified Name (IQN) is the format most commonly used for iSCSI names, which uniquely identify nodes in an iSCSI network. All IQNs follow the pattern iqn.yyyy-mm.domain:identifier, where 'yyyy-mm' is the year and month in which the domain was registered, 'domain' is the reversed domain name of the issuing organization, and 'identifier' is an optional string which makes each IQN under the same domain unique. For example, 'iqn.2015-10.org.openstack.408ae959bce1'.
fr: L'IQN (de l'anglais iSCSI Qualified Name) est le format couramment utilisé pour les noms iSCSI, qui identifient des nœuds dans un réseau iSCSI. Tous les IQN suivent le modèle iqn.yyyy-mm.domain:identifier, où « yyyy-mm » correspondent à l'année et au mois pendant lequel le domaine a été enregistré, le « domaine » est le nom de domaine inversé de l'organisation émettrice et « identificateur » est une chaîne facultative qui rend chaque IQN unique sous le même domaine. Par exemple, « iqn.2015-10.org.openstack.408ae959bce1'.

source: identity provider
fr: fournisseur d'identité

source: image ID
fr: ID d'image

source: image UUID
fr: UUID de l'image

source: image cache
fr: cache d'image

source: image membership
fr: membres d'une image

source: image owner
fr: propriétaire de l'image

source: image registry
fr: Registre des images

source: image status
fr: statut de l'image

source: incubated project
fr: projet incubé

source: ingress filtering
fr: filtrage des entrants

source: instance ID
fr: ID de l'instance

source: instance UUID
fr: UUID de l'instance

source: instance state
fr: statut de l'instance

source: instance tunnels network
fr: réseau de tunnels d'instances

source: instance type
fr: type d'instance

source: instance type ID
fr: ID type d'instance

source: interface ID
fr: ID interface

source: kernel-based VM (KVM)
fr: KVM (kernel-based VM)

source: large object
fr: objet volumineux

source: libvirt for KVM or QEMU
fr: libvirt pour KVM ou QEMU
pt_br: libvirt para KVM ou QEMU

source: live migration
fr: migration à chaud

source: load balancer
fr: répartiteur de charge

source: load balancing
fr: répartition de charge

source: management API
fr: API de gestion

source: management network
fr: réseau de gestion

source: manager
fr: gestionnaire

source: manifest
fr: manifeste

source: manifest object
fr: Objet de manifeste

source: mechanism driver
fr: pilote de mécanisme

source: membership
fr: membre

source: membership list
fr: liste de membres

source: message queue
fr: File de messages

source: multi-factor authentication
fr: authentification multi-facteurs

source: network ID
fr: ID de réseau

source: network UUID
fr: UUID Réseau
pt_br: UUID de rede

source: network controller
fr: contrôleur de réseau

source: network namespace
fr: Espace nom de réseau

source: network worker
fr: worker réseau

source: neutron API
fr: API neutron

source: neutron manager
fr: Gestionnaire neutron

source: neutron plug-in
fr: plugin neutron

source: node
fr: nœud
pt_br: Nó

source: non-durable exchange
fr: échange non durable

source: non-durable queue
fr: file d'attente non durable

source: non-persistent volume
fr: volume non persistant

source: north-south traffic
fr: trafic nord-sud

source: object
fr: objet

source: object auditor
fr: auditeur d'objet

source: object expiration
fr: expiration d'objet

source: object hash
fr: Hachage d'objet

source: object path hash
fr: hachage de chemin d'objet

source: object replicator
fr: réplicateur d'objet

source: object server
fr: serveur d'objet

source: object versioning
fr: mise en version d'objets

source: operator
fr: opérateur

source: orphan
fr: orphelin

source: parent cell
fr: cellule parent

source: partition index
fr: indexe de partition

source: partition shift value
fr: valeur d'ajustement de partition

source: path MTU discovery (PMTUD)
fr: PMTUD (path MTU discovery)

source: persistent message
fr: message persistant

source: persistent volume
fr: volume persistant

source: personality file
fr: fichier personnalisé

source: pool member
fr: membre d'un pool

source: port UUID
fr: UUID Port

source: private IP address
fr: adresse IP privée

source: private image
fr: image privée

source: private network
fr: réseau privé

source: project
fr: projet
pt_br: projeto

source: project ID
fr: ID Projet

source: project VPN
fr: VPN Projet

source: promiscuous mode
fr: mode de promiscuité

source: protected property
fr: propriété protégée

source: provider
fr: fournisseur

source: proxy node
fr: nœud proxy

source: proxy server
fr: serveur proxy

source: public API
fr: API publique

source: public IP address
fr: adresse IP publique

source: public image
fr: image publique

source: public key authentication
fr: authentification par clé publique

source: public network
fr: réseau public

source: quarantine
fr: quarantaine

source: rebalance
fr: rééquilibrage

source: rebuild
fr: reconstruction

source: record
fr: enregistrement

source: record ID
fr: ID enregistrement

source: reference architecture
fr: architecture de référence

source: region
fr: région

source: registry
fr: registre

source: replica count
fr: Nombre de replicata

source: replication
fr: réplication

source: replicator
fr: réplicateur

source: request ID
fr: ID de requête

source: rescue image
fr: image de secours

source: resize
fr: redimensionner

source: ring
fr: anneau

source: role
fr: rôle

source: role ID
fr: ID de rôle

source: round-robin scheduler
fr: programme round-robin

source: routing key
fr: clé de routage

source: secret key
fr: clé secrète

source: security group
fr: groupe de sécurité

source: segmented object
fr: objet segmenté

source: server UUID
fr: UUID Serveur

source: server image
fr: image de serveur

source: service ID
fr: ID du service

source: service catalog
fr: Catalogue de services

source: service provider
fr: fournisseur de service

source: service registration
fr: enregistrement de service

source: service tenant
fr: client de services

source: service token
fr: jeton de service

source: session back end
fr: back-end de session

source: session persistence
fr: persistance de session

source: session storage
fr: stockage de session

source: shared IP address
fr: adresse IP partagée

source: shared IP group
fr: groupe IP partagées

source: shared storage
fr: stockage partagé

source: snapshot
fr: instantané

source: soft reboot
fr: redémarrage logiciel

source: spread-first scheduler
fr: programme spread-first

source: stack
fr: pile

source: static IP address
fr: adresse IP statique

source: storage back end
fr: back-end de stockage

source: storage manager
fr: gestionnaire de stockage

source: storage manager back end
fr: back-end de gestionnaire de stockage

source: storage node
fr: nœud de stockage

source: storage services
fr: services de stockage

source: strategy
fr: stratégie

source: subdomain
fr: sous domaine

source: subnet
fr: sous-réseau

source: suspend
fr: suspendre

source: swift client
fr: client swift

source: swift proxy server
fr: serveur de proxy rapide

source: swift storage node
fr: nœud de stockage rapide

source: sync point
fr: point de synchro

source: tenant
fr: client

source: tenant ID
fr: ID du projet

source: tenant endpoint
fr: point d'accès du client

source: token
fr: jeton

source: token services
fr: services de jeton

source: topic publisher
fr: éditeur de sujet

source: transaction ID
fr: ID de la transaction

source: transient
fr: transitoire

source: transient exchange
fr: échange transitoire

source: transient message
fr: message transitoire

source: transient queue
fr: File d'attente transitoire

source: unscoped token
fr: jeton hors-scope

source: updater
fr: actualiseur

source: user
fr: utilisateur
pt_br: usuário

source: user data
fr: donnée utilisateur

source: virtual IP
fr: IP virtuel

source: virtual VLAN
fr: VLAN virtuel

source: virtual machine (VM)
fr: machine virtuel (VM)

source: virtual network
fr: réseau virtuel

source: virtual networking
fr: réseau virtuel

source: virtual port
fr: port virtuel

source: virtual server
fr: serveur virtuel

source: virtual switch (vSwitch)
fr: commutateur virtuel (vSwitch)

source: volume ID
fr: ID du volume

source: volume controller
fr: contrôleur de volume

source: volume driver
fr: pilote de volume

source: volume manager
fr: gestionnaire de volume

source: volume node
fr: nœud d'un volume

source: volume worker
fr: worker volume

source: weight
fr: poids

source: weighted cost
fr: coût pondéré

source: weighting
fr: pondération

source: x509 certificates.
fr: certificats x509
pt_br: Certificados x509.

source: **openSUSE and SUSE Linux Enterprise Server:** https://en.opensuse.org/Portal:OpenStack
pt_br: **openSUSE e SUSE Linux Enterprise Server:** https://en.opensuse.org/Portal:OpenStack

source: Compute
pt_br: Computação

source: Conventions
pt_br: Convenções

source: Documentation
pt_br: Documentação

source: Identity
pt_br: Identidade

source: Networking
pt_br: Rede

source: Orchestration
pt_br: Orquestração

source: To provide feedback on documentation, join and use the openstack-docs@lists.openstack.org mailing list at `OpenStack Documentation Mailing List <http://lists.openstack.org/cgi-bin/mailman/listinfo/openstack-docs>`__, or `report a bug <https://bugs.launchpad.net/openstack-manuals/+filebug>`__.
pt_br: Para prover feedback sobre a documentação, junte-se e use a lista de distribuição openstack-docs@lists.openstack.org em `OpenStack Documentation Mailing List <http://lists.openstack.org/cgi-bin/mailman/listinfo/openstack-docs>`__, ou `reporte um problema <https://bugs.launchpad.net/openstack-manuals/+filebug>`__.

source: `Bugs: OpenStack Block Storage (cinder) <https://bugs.launchpad.net/cinder>`__
pt_br: `Bugs: Armazenamento em Blocos do OpenStack (cinder) <https://bugs.launchpad.net/cinder>`__

source: `Bugs: OpenStack Compute (nova) <https://bugs.launchpad.net/nova>`__
pt_br: `Bugs: Módulo de Computação do OpenStack (nova) <https://bugs.launchpad.net/nova>`__

source: `Bugs: OpenStack Dashboard (horizon) <https://bugs.launchpad.net/horizon>`__
pt_br: `Bugs: Interface do OpenStack (horizon) <https://bugs.launchpad.net/horizon>`__

source: image
pt_br: Imagem

source: instance
pt_br: instância

source: network
pt_br: rede

source: network segment
pt_br: segmento de rede

source: pause
pt_br: Interromper

source: service
pt_br: serviço
