Repository: 25hours/openstack-manuals
Catalog: doc/common-rst/source/locale/*/LC_MESSAGES/common-rst.po
Languages: fr, pt_br

source: Mediates interactions between the nova-compute service and the database. It eliminates direct accesses to the cloud database made by the nova-compute service. The nova-conductor module scales horizontally. However, do not deploy it on nodes where the nova-compute service runs. For more information, see `Configuration Reference Guide <http://docs.openstack.org/liberty/config-reference/content/ section_conductor.html>`__.
fr: Intervient en tant que médiateur pour les interactions entre le service nova-calcul et la base de données. Il élimine les accès directs à la base de données cloud effectués par le service nova-compute. Le module nova-conductor met à l'échelle horizontalement. Toutefois, ne le déployez pas sur des nœuds où le service nova-calcul est actif. Pour plus d'informations, consulter `Configuration Reference Guide <http://docs.openstack.org/liberty/config-reference/content/ section_conductor.html>`__.

source: Message exchange that is cleared when the service restarts. Its data is not written to persistent storage.
fr: Échange de message qui disparaît quand le service démarre à nouveau. Ses données ne paraîtront pas dans le stockage persistant.

source: Message queue software supported by OpenStack. An alternative to RabbitMQ. Also spelled 0MQ.
fr: Logiciel de mise en file de messages supporté par OpenStack. Une alternative à RabbitMQ. Également épelé 0MQ.

source: Message queue software supported by OpenStack; an alternative to RabbitMQ.
fr: Logiciel de mise en file de messages supporté par OpenStack : une alternative à RabbitMQ.

source: Message queue that is cleared when the service restarts. Its data is not written to persistent storage.
fr: File d'attente de messages qui est vide quand le service démarre à nouveau. Ses données ne sont pas écrites dans le stockage persistant.

source: Message service
fr: Service Message

source: Messaging queue
fr: File d'attente de messagerie
pt_br: Fila de mensagens

source: Metadata agent
fr: Agent metadata

source: Method to access VM instance consoles using a web browser. Supported by Compute.
fr: Méthode pour accéder aux consoles d'instance VM en utilisant un navigateur. Supporté par Compute.

source: Middleware modules run in the address space of the OpenStack component that is using the Identity service. These modules intercept service requests, extract user credentials, and send them to the centralized server for authorization. The integration between the middleware modules and OpenStack components uses the Python Web Server Gateway Interface.
fr: Les modules de middleware exécutent dans l'espace d'adressage du composant OpenStack qui utilise le service d'Identité. Ces modules interceptent des demandes de service, extraient des informations d'identification utilisateur et les envoient vers le serveur centralisé pour obtenir l'autorisation. L'intégration entre les middleware modules et composants OpenStack fait usage de l'interface Python Web Server Gateway.

source: Modular Layer 2 (ML2) neutron plug-in
fr: Plugin Modular Layer 2 (ML2)

source: Modular system that allows the underlying message queue software of Compute to be changed. For example, from RabbitMQ to ZeroMQ or Qpid.
fr: Système modulaire qui permet à un logiciel de mise en file d'attente sous-jacent de Compute d'être modifié. Exemples: RabbitMQ, ZeroMQ ou Qpid.

source: Name for the Compute component that manages VMs.
fr: Nom du composant de Compute qui gère les VM.

source: NetApp volume driver
fr: Pilote de volume NetApp

source: Network Address Translation; Process of modifying IP address information while in transit. Supported by Compute and Networking.
fr: Translation d'Adresse Réseau (NAT); Processus de modification des informations d'adresse IP en cours de transport. Supporté par Compute et Réseau.

source: Network Time Protocol; Method of keeping a clock for a host or node correct via communication with a trusted, accurate time source.
fr: NTP (Network Time Protocol) Méthode qui consiste à conserver une horloge exacte pour un hôte ou un nœud par voie de communication avec une source d'horaire précise et fiable.

source: Network traffic between a user or client (north) and a server (south), or traffic into the cloud (south) and out of the cloud (north). See also east-west traffic.
fr: Trafic réseau entre un utilisateur et un client (nord) et un serveur (sud), ou un trafic allant du cloud (sud), en provenance du cloud (nord). Voir également trafic est-ouest.

source: Network traffic between servers in the same cloud or data center. See also north-south traffic.
fr: Trafic réseau entre les serveurs dans un même cloud ou centre de données. Voir également trafic nord-sud.

source: Networking API
fr: API de réseautage

source: New users are assigned to this tenant if no tenant is specified when a user is created.
fr: Des nouveaux utilisateurs sont assignés à ce client si aucun client n'est spécifié quand un utilisateur est créé.

source: Nexenta volume driver
fr: Pilote de volume Nexenta

source: Notices
fr: Notifications

source: Notices take these forms:
fr: Les notifications prennent les formes suivantes :

source: Nova API
fr: API Nova

source: Number that is unique to every computer system on the Internet. Two versions of the Internet Protocol (IP) are in use for addresses: IPv4 and IPv6.
fr: Numéro propre à chaque système informatique sur l'Internet. Il existe deux versions d'IP (Internet Protocol) pour l'adressage : IPv4 et IPv6.

source: Object Storage API
fr: API du Stockage d'Objets

source: Object Storage middleware that uploads (posts) an image through a form on a web page.
fr: Middleware d'Object Storage qui télécharge (affiche) une image sous forme de formulaire sur une page web.

source: Object servers (swift-object-server)
fr: Serveurs d'objects (swift-object-server)

source: Object storage service by Amazon; similar in function to Object Storage, it can act as a back-end store for Image service VM images.
fr: Service de stockage d'objets d'Amazone ; similaire au niveau fonction au Stockage d'objets, peut servir de store de sauvegarde pour les images de VM du service Image.

source: One of the RPC primitives used by the OpenStack message queue software. Sends a message and does not wait for a response.
fr: Une des primitives RPC utilisées par le logiciel de mise en file d'attente d'OpenStack. Envoie un message et n'attend pas la réponse.

source: One of the RPC primitives used by the OpenStack message queue software. Sends a message and waits for a response.
fr: Une des primitives RPC utilisées par le logiciel de mise en file d'attente d'OpenStack. Envoie un message et attend la réponse.

source: One of the VM image disk formats supported by Image service.
fr: Un des formats de disque d'image de VM supporté par le service Image.

source: One of the VM image disk formats supported by Image service; an unstructured disk image.
fr: Un des formats de disque d'image de VM supporté par le service Image ; une image de disque non structurée.

source: One of the default roles in the Compute RBAC system and the default role assigned to a new user.
fr: Un des rôles par défaut du système RBAC de Compute et le rôle par défaut assigné à un nouvel utilisateur.

source: One of the default roles in the Compute RBAC system. Enables the user to allocate publicly accessible IP addresses to instances and change firewall rules.
fr: Un des rôles par défaut dans le système RBAC de Compute. Permet à l'utilisateur d'allouer des adresses IP accessibles publiquement à des instances ou de changer les règles de pare-feux.

source: One of the default roles in the Compute RBAC system. Grants complete system access.
fr: Un des rôles par défaut dans le système RBAC de Compute. Donne les accès complets au système.

source: One of the hypervisors supported by OpenStack.
fr: Un des hyperviseurs supportés par OpenStack.

source: One of the supported response formats in OpenStack.
fr: Une des formats de réponses autorisés par OpenStack.

source: Open source GUI and CLI tools used for remote console access to VMs. Supported by Compute.
fr: Outils GUI et CLI open source utilisés pour l'accès distant aux consoles des VMs. Supportés par Compute.

source: Open source tool used to access remote hosts through an encrypted communications channel, SSH key injection is supported by Compute.
fr: Outil opensource utilisé pour accéder à des hôtes éloignés par un canal de communication codifié. L'injection de clés SSH est pris en charge par Compute.

source: Open vSwitch (OVS) agent
fr: Agent Open vSwitch (OVS)

source: Open vSwitch is a production quality, multilayer virtual switch licensed under the open source Apache 2.0 license. It is designed to enable massive network automation through programmatic extension, while still supporting standard management interfaces and protocols (for example NetFlow, sFlow, SPAN, RSPAN, CLI, LACP, 802.1ag).
fr: Open VSwitch est un produit de qualité multicouches virtuel sous licence open source Apache 2.0. Il est conçu pour faciliter l'automatisation de réseau massive par extension programmatique, tout en supportant encore les interfaces de gestion et les protocoles standards (comme, NetFlow, sFlow, SPAN, RSPAN, CLI, LACP, 802.1ag).

source: Open vSwitch neutron plug-in
fr: Plug-in neutron OpenvSwitch

source: OpenStack Block Storage
fr: Stockage en blocs d'OpenStack
pt_br: Armazenamento em Blocos do OpenStack

source: OpenStack Compute consists of the following areas and their components:
fr: OpenStack Compute est composé des zones et éléments suivants :
pt_br: A Computação OpenStack consiste nas seguintes áreas e seus componentes:

source: OpenStack Compute interacts with OpenStack Identity for authentication, OpenStack Image service for disk and server images, and OpenStack dashboard for the user and administrative interface. Image access is limited by projects, and by users; quotas are limited per project (the number of instances, for example). OpenStack Compute can scale horizontally on standard hardware, and download images to launch instances.
fr: OpenStack Compute interagit avec le service Identity d'OpenStack pour l'authentification, le service Image d'OpenStack avec les disques et les images de serveur, et le tableau de bord d'OpenStack pour l'utilisateur et l'interface d'administration. L'accès à l'image est limité par projet et par utilisateur ; les quotas sont limités par projet (au nombre d'instances, par exemple). OpenStack Compute peut évoluer horizontalement sur du matériel standard et télécharger des images pour lancer les instances.

source: OpenStack Image service
fr: service OpenStack Image

source: OpenStack Networking (neutron) allows you to create and attach interface devices managed by other OpenStack services to networks. Plug-ins can be implemented to accommodate different networking equipment and software, providing flexibility to OpenStack architecture and deployment.
fr: OpenStack Networking (neutron) vous permet de créer et de connecter des périphériques d'interface gérés par d'autres services d'OpenStack aux réseaux. Les plug-ins peuvent être mis en place afin d'accueillir différents logiciels et équipements de réseautage, fournissant ainsi une flexibilité à l'architecture et au déploiement d'OpenStack.

source: OpenStack Networking agent that provides DHCP services for virtual networks.
fr: Agent réseau OpenStack qui fournit les services DHCP pour les réseaux virtuels.

source: OpenStack Networking agent that provides layer-2 connectivity for virtual networks.
fr: Agent réseau OpenStack qui fournit une connectivité layer-2 aux réseaux virtuels.

source: OpenStack Networking agent that provides layer-3 (routing) services for virtual networks.
fr: Agent réseau OpenStack qui fournit les services layer-3 (routage) pour les réseaux virtuels.

source: OpenStack Networking agent that provides metadata services for instances.
fr: Agent de réseautage d'OpenStack qui fournit des services de métadonnées pour des instances.

source: OpenStack Networking mainly interacts with OpenStack Compute to provide networks and connectivity for its instances.
fr: OpenStack Networking converse principalement avec OpenStack Compute pour fournir des réseaux et de la connectivité à ses instances.

source: OpenStack Networking plug-ins and agents
fr: Plug-ins et agents d'OpenStack Networking

source: OpenStack Orchestration service
fr: service OpenStack Orchestration

source: OpenStack Telemetry service
fr: Le service Telemetry d'Openstack

source: OpenStack code name
fr: Nom de code d'OpenStack

source: OpenStack distribution packages
fr: Packages de distribution d'Openstack
pt_br: Pacotes da distribuição OpenStack

source: OpenStack is a cloud operating system that controls large pools of compute, storage, and networking resources throughout a data center, all managed through a dashboard that gives administrators control while empowering their users to provision resources through a web interface. OpenStack is an open source project licensed under the Apache License 2.0.
fr: OpenStack est un système d'exploitation cloud qui contrôle de larges quantités de ressources de réseautage, de stockage et de traitement à travers un centre de données, gérées ensemble via un tableau de bord qui en donne aux administrateurs le contrôle, tout en habilitant les utilisateurs à mettre des ressources par l'intermédiaire d'une interface web. OpenStack est un projet open source sous licence Apache 2.0.

source: OpenStack mailing lists
fr: Listes de diffusion d'OpenStack
pt_br: Listas de discussão OpenStack

source: OpenStack project that aims to make cloud services easier to consume and integrate with application development process by automating the source-to-image process, and simplifying app-centric deployment. The project name is solum.
fr: Projet OpenStack dont le but est de rendre les services cloud plus faciles à consommer et à intégrer avec des processus de développement d'applications en automatisant le processus de source à image, tout en simplifiant le déploiement app-centric. Le nom du projet est solum.

source: OpenStack project that aims to produce an OpenStack messaging service that affords a variety of distributed application patterns in an efficient, scalable and highly-available manner, and to create and maintain associated Python libraries and documentation. The code name for the project is zaqar.
fr: Projet OpenStack qui fournit un service de messagerie OpenStack, qui comprend un ensemble varié de modèles d'applications distribuées, d'une manière efficace, adaptable et hautement disponible, et qui crée et maintient des librairies et documentations Python. Le nom de code du projet est zaqar.

source: OpenStack project that produces a secret storage and generation system capable of providing key management for services wishing to enable encryption features. The code name of the project is barbican.
fr: Projet OpenStack qui fournit un stockage secret et un système de génération capable de fournir une gestion des clés pour les services qui souhaitent activer les fonctionnalités de codification. Le code du projet est barbican.

source: OpenStack project that produces a set of Python libraries containing code shared by OpenStack projects.
fr: Projet OpenStack qui produit un ensemble de bibliothèques Python contenant un code partagé par des projets OpenStack.

source: OpenStack project that provides a Clustering service.
fr: Projet OpenStack qui fournit le service Clustering.

source: OpenStack project that provides a Monitoring service.
fr: Projet OpenStack qui fournit un service de Monitoring.

source: OpenStack project that provides a Software Development Lifecycle Automation service.
fr: Projet OpenStack qui fournit un service d'automation du cycle de vie de développement de logiciels.

source: OpenStack project that provides a dashboard, which is a web interface.
fr: Projet OpenStack qui fournit un tableau de bord, sous forme d'interface web.

source: OpenStack project that provides a framework for performance analysis and benchmarking of individual OpenStack components as well as full production OpenStack cloud deployments. The code name of the project is rally.
fr: Projet OpenStack qui fournit un framework pour l'analyse de performance et le benchmarking de composant individuels d'OpenStack aussi bien que de déploiement d'un cloud de production complet d'OpenStack. Le nom de code du projet est rally.

source: OpenStack project that provides a message service to applications.
fr: Projet OpenStack fournissant un service de messages aux applications.

source: OpenStack project that provides a scalable data-processing stack and associated management interfaces.
fr: Projet OpenStack qui fournit une pile adaptable de traitement des données et les interfaces de gestion associées.

source: OpenStack project that provides a scalable data-processing stack and associated management interfaces. The code name for the project is sahara.
fr: Projet OpenStack qui fournit une pile de traitement de données évolutive et des interfaces de gestion associées. Le nom de code du projet est sahara.

source: OpenStack project that provides a set of services for management of application containers in a multi-tenant cloud environment. The code name of the project name is magnum.
fr: Projet OpenStack qui fournit un ensemble de services pour la gestion de conteneurs d'applications dans un environnement cloud multi-clients. Le nom de code du projet est magnum.

source: OpenStack project that provides an Application catalog.
fr: Projet OpenStack qui fournit un catalogue d'applications.

source: OpenStack project that provides an application catalog service so that users can compose and deploy composite environments on an application abstraction level while managing the application lifecycle. The code name of the project is murano.
fr: Projet OpenStack qui fournit un service de catalogue d'applications qui permet à l'utilisateur de composer et de déployer des environnements composites à un niveau d'abstraction d'application, tout en gérant le cycle de vie d'une application. Le nom de code de ce projet est murano.

source: OpenStack project that provides backup restore and disaster recovery as a service.
fr: Projet OpenStack qui fournit la restauration de sauvegarde et la récupération d'urgence en tant que service

source: OpenStack project that provides compute services.
fr: Projet OpenStack qui fournit les services compute.

source: OpenStack project that provides database services to applications.
fr: Le projet OpenStack qui fournit des services de base de données à des applications.

source: OpenStack project that provides scalable, on demand, self service access to authoritative DNS services, in a technology-agnostic manner. The code name for the project is designate.
fr: Projet OpenStack qui fournit un accès en self service, à la demande et évolutif à des services DNS faisant autorité, indépendamment des technologies. Le nom de code du projet est designate.

source: OpenStack project that provides shared file systems as service to applications.
fr: Projet OpenStack qui fournit des systèmes de fichiers partagés comme service à des applications.

source: OpenStack project that provides the Benchmark service.
fr: Projet OpenStack qui fournit le service Benchmark.

source: OpenStack project that provides the Governance service.
fr: Projet OpenStack qui fournit le service de Gouvernance.

source: OpenStack project that provides the Workflow service.
fr: Projet OpenStack qui fournit le service Workflow.

source: OpenStack project that provisions bare metal, as opposed to virtual, machines.
fr: Projet OpenStack de service bare metal, et non pas de machines virtuelles.

source: OpenStack project that provisions bare metal, as opposed to virtual, machines. The code name for the project is ironic.
fr: Projet OpenStack pour provisionner des machines physiques à partir de zéro, par opposition aux machines virtuelles. Le nom de code du projet est ironic.

source: OpenStack project to provide Governance-as-a-Service across any collection of cloud services in order to monitor, enforce, and audit policy over dynamic infrastructure. The code name for the project is congress.
fr: Le projet OpenStack qui fournit Governance-as-a-Service à travers tout groupement de services cloud en vue de surveiller, enforcer, et procéder à l'audit de stratégies dans une infrastructure dynamique. Le nom de code de ce projet est congress.

source: OpenStack supports accessing the Amazon EC2 API through Compute.
fr: OpenStack supporte l'accès à l'API EC2 d'Amazon via Compute.

source: OpenStack supports encryption technologies such as HTTPS, SSH, SSL, TLS, digital certificates, and data encryption.
fr: OpenStack supporte les technologies d'encodage comme HTTPS, SSH, SSL, TLS, les certificats numériques, et l'encodage de données.

source: OpenStack-on-OpenStack program. The code name for the OpenStack Deployment program.
fr: Programme OpenStack-on-OpenStack. Le nom de code pour le programme OpenStack Deployment.

source: Opens all objects for an object server and verifies the MD5 hash, size, and metadata for each object.
fr: Ouvre tous les objets pour un serveur d'objets et vérifie les métadonnées, la taille et le hachage MD5 pour chaque objet.

source: Orchestrates the launching of templates and provides events back to the API consumer.
fr: Organise le lancement des modèles et fournit des événements retour au consommateur d'API.

source: Organizes and stores objects in Object Storage. Similar to the concept of a Linux directory but cannot be nested. Alternative term for an Image service container format.
fr: Organise et stocke des objets dans Object Storage. Ressemble au concept de répertoire de linux mais ne peut pas être imbriqué. Autre terme pour le format du conteneur du service Image.

source: Pages that use HTML, JavaScript, and Cascading Style Sheets to enable users to interact with a web page or show simple animation.
fr: Pages qui utilisent HTML, JavaScript, et les feuilles de style Cascading Style Sheets pour permettre aux utilisateurs un interaction avec une page web ou pour une simple animation.

source: Passed to API requests and used by OpenStack to verify that the client is authorized to run the requested operation.
fr: Passé dans des requêtes à une API et utilisé par OpenStack pour vérifier que les clients sont autorisés à exécuter l'opération demandée.

source: Passes requests from clients to the appropriate workers and returns the output to the client after the job completes.
fr: Envoie des requêtes de clients aux workers appropriés et renvoie les résultats au client, une fois que la tâche est complétée.

source: Performs housekeeping tasks on the large data store. The replication services ensure consistency and availability through the cluster. Other periodic processes include auditors, updaters, and reapers.
fr: Effectue des tâches de maintenance sur les stores de données volumineuses. Les services de réplication assurent l'homogénéité et la disponibilité disponibilité dans l'ensemble du cluster. D'autres processus périodiques existent comme les processus d'auditing (auditor), de mise à jour (updater) ou de collection (reaper).

source: Physical host dedicated to running compute nodes.
fr: Serveur physique dédié pour exécuter des nœuds de Compute.
