Repository: 25hours/openstack-manuals
Catalog: doc/common-rst/source/locale/*/LC_MESSAGES/common-rst.po
Languages: fr, pt_br

source: Extension to iptables that allows creation of firewall rules that match entire "sets" of IP addresses simultaneously. These sets reside in indexed data structures to increase efficiency, particularly on systems with a large quantity of rules.
fr: Extension d'iptables qui permettent la création de règles de pare-feux qui correspondent à des ensembles ou "sets" complets d'IP de façon simultanée. Ces ensembles se trouvent dans des structures de données pour augmenter leur efficacité, et particulièrement, sur des systèmes ayant de grandes quantités de règles.

source: Facility in Compute that allows each virtual machine instance to have more than one VIF connected to it.
fr: Fonctionnalité de Compute qui permet à chaque instance de machine virtuelle d'avoir plus un VIF connecté.

source: Facility in Compute that enables a virtual machine instance to have more than one VIF connected to it.
fr: Fonctionnalité de Compute qui permet à une instance de machine virtuelle d'avoir plus d'un VIF connectés.

source: Feature in modern Ethernet networks that supports frames up to approximately 9000 bytes.
fr: Fonctionnalité qui se trouve dans les réseaux Ethernet modernes, supportant jusqu'à 9000 octets approximativement.

source: Feature of certain network interface drivers that combines many smaller received packets into a large packet before delivery to the kernel IP stack.
fr: Fonctionnalité propre à certains pilotes d'interface de réseau qui combine plusieurs paquets de moindre taille en un grand paquet avant de le livrer à la pile d'IP du noyau.

source: File system option that enables storage of additional information beyond owner, group, permissions, modification time, and so on. The underlying Object Storage file system must support extended attributes.
fr: Option de système de fichiers qui permet le stockage d'informations supplémentaires au delà des permissions utilisateur, groupe, heure de modification, etc.. Le système de fichiers d'Object Storage sous-jacent supporte les extensions d'attributs.

source: Filtering tool for a Linux bridging firewall, enabling filtering of network traffic passing through a Linux bridge. Used in Compute along with arptables, iptables, and ip6tables to ensure isolation of network communications.
fr: Outil de filtrage pour pare-feu de Linux, permettant le filtrage de trafic de réseau passant à travers un pont de Linux. Utilisé dans Compute avec arptables, iptables, et ip6tables pour veiller l'isolation des communications de réseaux.

source: Finally, from the ``/var/lib/nova/instances`` directory for the instance, see if this command returns an error:
fr: Enfin, à partir du répertoire ``/var/lib/nova/instances`` pour l'instance, voir si cette commande retourne une erreur:

source: For IaaS, ability for a regular (non-privileged) account to manage a virtual infrastructure component such as networks without involving an administrator.
fr: Dans IaaS, c'est la possibilité pour un compte normal (non privilégié) de gérer un composant d'infrastructure virtuelle sommes des réseaux sans impliquer d'administrateur.

source: For the available OpenStack documentation, see `docs.openstack.org <http://docs.openstack.org>`__.
fr: Pour avoir accès à la documentation d'OpenStack disponible, consulter `docs.openstack.org <http://docs.openstack.org>`__.
pt_br: Para a documentação disponível de OpenStack, veja `docs.openstack.org <http://docs.openstack.org>`__.

source: Generally, extra properties on an Image service image to which only cloud administrators have access. Limits which user roles can perform CRUD operations on that property. The cloud administrator can configure any image property as protected.
fr: Réfère normalement à des propriétés supplémentaires d'images de service Image auxquelles les administrateurs cloud uniquement ont accès. Limitent quels rôles utilisateurs peuvent effectuer des opérations CRUD sur cette propriété. L'administrateur cloud peut configurer n'importe quelle propriété d'image comme étant protégée.

source: Give a clear, concise summary.
fr: Faîtes un récapitulatif clair et succinct.
pt_br: Dê um resumo claro e conciso.

source: Gives guest VMs exclusive access to a PCI device. Currently supported in OpenStack Havana and later releases.
fr: Donne aux invités un accès exclusif au périphérique PCI. Supporté actuellement dans OpenStack Havana et versions ultérieures.

source: Glossary
fr: Glossaire
pt_br: Glossário

source: Governance service
fr: Service Governance

source: Graphic Interchange Format (GIF)
fr: GIF (Graphic Interchange Format)

source: Graphics Processing Unit (GPU)
fr: GPU (Graphics Processing Unit)

source: Hadoop Distributed File System (HDFS)
fr: HDFS (Hadoop Distributed File System)

source: Handles authentication and is usually OpenStack Identity.
fr: Gère l'authentification, correspond normalement au service d'Identité d'OpenStack.

source: Heat Orchestration Template (HOT)
fr: HOT (Heat Orchestration Template)

source: Heat input in the format native to OpenStack.
fr: Entrée Heat dans le format natif d'OpenStack.

source: High-availability mode for legacy (nova) networking. Each compute node handles NAT and DHCP and acts as a gateway for all of the VMs on it. A networking failure on one compute node doesn't affect VMs on other compute nodes.
fr: Mode de haute disponibilité pour l'ancien réseautage (nova). Chaque nœud de compute gère NAT et DHCP et agit comme passerelle pour toutes les machines virtuelles dessus. En cas d'échec sur un nœud compute, les autres VM des autres nœuds ne sont pas affectées.

source: High-performance 64-bit file system created by Silicon Graphics. Excels in parallel I/O operations and data consistency.
fr: Système de fichier haute performance créé par Silicon Graphics. Excelle dans les opérations d'I/O parallèles et la consistance des données.

source: Host Bus Adapter (HBA)
fr: HBA (Host Bus Adapter)

source: Hypertext Transfer Protocol (HTTP)
fr: HTTP (Hypertext Transfer Protocol)

source: Hypertext Transfer Protocol Secure (HTTPS)
fr: HTTPS (Hypertext Transfer Protocol Secure)

source: Hypertext Transfer Protocol Secure (HTTPS) is a communications protocol for secure communication over a computer network, with especially wide deployment on the Internet. Technically, it is not a protocol in and of itself; rather, it is the result of simply layering the Hypertext Transfer Protocol (HTTP) on top of the SSL/TLS protocol, thus adding the security capabilities of SSL/TLS to standard HTTP communications.
fr: Le protocole sécurisé HTTPS (Hypertext Transfer) est un protocole de communication pour sécuriser les communications sur un réseau informatique, au déploiement particulièrement large sur Internet. Techniquement, ce n'est pas un protocole en soi ; plutôt, c'est le résultat de la superposition du protocole HTTP (Hypertext Transfer) au dessus du protocole SSL/TLS, ajoutant ainsi les fonctionnalités de sécurité SSL/TLS pour les communications HTTP standards.

source: Hypertext Transfer Protocol. HTTP is an application protocol for distributed, collaborative, hypermedia information systems. It is the foundation of data communication for the World Wide Web. Hypertext is structured text that uses logical links (hyperlinks) between nodes containing text. HTTP is the protocol to exchange or transfer hypertext.
fr: Protocole de transfert hypertexte. HTTP est un protocole d'application pour systèmes d'informations hypermédia, distribués, et collaboratifs. C'est le fondement de la communication de données pour le World Wide Web. L'hypertexte est une forme de texte structuré qui utilise des liaisons logiques (liens hypertextes) entre des nœuds de contenu. HTTP est le protocole d'échange ou transfert hypertexte.

source: ID number
fr: Numéro ID

source: IOPS (Input/Output Operations Per Second) are a common performance measurement used to benchmark computer storage devices like hard disk drives, solid state drives, and storage area networks.
fr: Les IOPS (de l'anglais Input/Output Operations Per Second) sont des mesures de performances courants pour évaluer les périphériques de stockage d'ordinateurs, comme les disques durs, les disques SSD et les réseaux de zone de stockage.

source: IP Address Management (IPAM)
fr: IPAM (IP Address Management)

source: IP address
fr: Adresse IP
pt_br: Endereço IP

source: Identity API
fr: API Identity

source: Identity service API
fr: API du service Identity

source: If Object Storage finds objects, containers, or accounts that are corrupt, they are placed in this state, are not replicated, cannot be read by clients, and a correct copy is re-replicated.
fr: Si le Stockage d'objets, les conteneurs, et les comptes sont corrompus, ils sont mis dans cet état, ne sont pas répliqués, ne peuvent être lus par les clients, et une copie avec un correctif sera reproduite.

source: If a requested resource such as CPU time, disk storage, or memory is not available in the parent cell, the request is forwarded to its associated child cells. If the child cell can fulfill the request, it does. Otherwise, it attempts to pass the request to any of its children.
fr: Si une ressource demandée comme le temps CPU, le stockage disque, ou la mémoire n'est pas disponible dans la cellule parent, la requête est transférée aux cellules enfants associées. Si la cellule enfant peut répondre à la requête, elle le fait. Sinon, elle essaie de passer la requête à un de ses enfants.

source: If a requested resource, such as CPU time, disk storage, or memory, is not available in the parent cell, the request is forwarded to associated child cells.
fr: Si une ressource demandée comme le temps CPU, le stockage disque, ou la mémoire n'est pas disponible dans la cellule parent, la requête est transférée aux cellules enfants associées.

source: If an instance remains in an intermediate state, such as ``deleting``, you can use the :command:`nova reset-state` command to manually reset the state of an instance to an error state. You can then delete the instance. For example:
fr: Si une instance est bloquée dans un état intermédiaire ``deleting``, vous prouver réinitialiser manuellement l'état d'une instance en utilisant la commande `nova reset-state` . Cela va le réinitialiser à l'état d'erreur, que vous pouvez ensuite supprimer. Par exemple :

source: If instances do not boot or boot slowly, investigate file injection as a cause.
fr: Si vous diagnostiquez un problème avec des instances qui ne démarrent pas, ou lentement, considérez le fichier injection la cause et vérifiez le.

source: If you use libvirt version ``1.2.2``, you may experience problems with live snapshots creation. Occasionally, libvirt of the specified version fails to perform the live snapshotting under load that presupposes a concurrent creation of multiple snapshots.
fr: Si vous utilisez la version de libvirt ``1.2.2``, vous risquez d'expérimenter des problèmes avec la création d'instantanés. Parfois, le libvirt d'une version spécifiée ne parvient pas à créer d'instantanés live sous une charge de travail qui présuppose la création simultanée de plusieurs instantanés.

source: Image API
fr: API Image

source: Image service
fr: Service Image

source: Image service API
fr: API du Service Image

source: Impassable limits for guest VMs. Settings include total RAM size, maximum number of vCPUs, and maximum disk size.
fr: Limites maximum pour les VMs hôtes. Les paramètres comprennent la taille totale de la RAM, le nombre maximum de vCPUs et la taille disque maximum.

source: In Compute and Block Storage, the ability to set resource limits on a per-project basis.
fr: Dans Compute et dans Block Storage, c'est la possibilité de définir les limites des ressources sur la base d'un projet.

source: In Compute, conductor is the process that proxies database requests from the compute process. Using conductor improves security because compute nodes do not need direct access to the database.
fr: Dans Compute, le conductor est le processus qui proxifie les requêtes vers la base de données. Utiliser le conductor améliore la sécurité parce que les nœuds de Compute n'ont pas besoin d'accès direct à la base de donnée.

source: In Compute, the support that enables associating DNS entries with floating IP addresses, nodes, or cells so that hostnames are consistent across reboots.
fr: Dans Compute, le support qui permet d'associer des entrées DNS aux adresses IP flottantes, aux nœuds, et aux cellules de façon à ce que les noms d'hôtes correspondent entre les redémarrages.

source: In Object Storage, tools to test and ensure dispersion of objects and containers to ensure fault tolerance.
fr: Dans Object Storage, outils qui servent à tester et assurer la dispersion d'objets et de conteneurs pour assurer la tolérance de fautes.

source: In OpenStack, the API version for a project is part of the URL. For example, :file:`example.com/nova/v1/foobar`.
fr: Dans OpenStack, la version d'API d'un projet est une partie de l'URL. Par exemple, :file:`example.com/nova/v1/foobar`.

source: In a high-availability setup with an active/active configuration, several systems share the load together and if one fails, the load is distributed to the remaining systems.
fr: Dans un environnement haute-disponibilité avec une configuration actif/actif, la charge est répartie sur plusieurs systèmes, si l'un d'entre eux fait défaut, la charge sera répartie sur les systèmes restants.

source: In a high-availability setup with an active/passive configuration, systems are set up to bring additional resources online to replace those that have failed.
fr: Dans un environnement haute-disponibilité avec une configuration actif/actif, les systèmes sont configurés pour fournir des ressources supplémentaires pour remplacer celles qui seraient indisponibles.

source: In order to benefit from the Identity service, other OpenStack services need to collaborate with it. When an OpenStack service receives a request from a user, it checks with the Identity service whether the user is authorized to make the request.
fr: Pour pouvoir bénéficier du service Identity, d'autres services d'OpenStack ont besoin de collaborer avec. Quand un service OpenStack reçoit une demande de la part d'un utilisateur, il vérifie, grâce au service Identity, si l'utilisateur est autorisé à faire la demande.

source: In the context of Object Storage, this is a process that is not terminated after an upgrade, restart, or reload of the service.
fr: Dans le contexte de stockage d'objets, il s'agit d'un processus qui ne prend pas fin après une mise à niveau, un redémarrage, ou un rechargement de service.

source: In the context of the Identity service, the worker process that provides access to the admin API.
fr: Dans le contexte du service d'Identité, le processus de worker qui fournit l'accès à l'API administrateur.

source: Information that consists solely of ones and zeroes, which is the language of computers.
fr: Information composée uniquement de zéros et de uns, ce qui est le langage des ordinateurs.

source: Infrastructure-as-a-Service. IaaS is a provisioning model in which an organization outsources physical components of a data center, such as storage, hardware, servers, and networking components. A service provider owns the equipment and is responsible for housing, operating and maintaining it. The client typically pays on a per-use basis. IaaS is a model for providing cloud services.
fr: IaaS (Infrastructure-as-a-Service) est un modèle de mise en service, pour lequel une organisation se procure en externe des composants physiques de centres de données, comme le stockage, le matériel, les serveurs ou les composants de réseautage. Un fournisseur de service possède l'équipement et est responsable de l'héberger, de l'opérer et de le maintenir. Le client paie normalement un coût basé sur le nombre d'utilisations. IaaS est un modèle de procuration de services cloud.

source: Injection problems
fr: Problèmes avec Injection

source: Instances in use
fr: Les instances en service
pt_br: Instâncias em uso

source: Intelligent Platform Management Interface. IPMI is a standardized computer system interface used by system administrators for out-of-band management of computer systems and monitoring of their operation. In layman's terms, it is a way to manage a computer using a direct network connection, whether it is turned on or not; connecting to the hardware rather than an operating system or login shell.
fr: De l'anglais Intelligent Platform Management Interface. IPMI est une interface de système d'ordinateur normalisée utilisée par les administrateurs système pour la gestion out-of-band de systèmes informatiques et la surveillance de leur fonctionnement. En d'autres termes, c'est une façon de gérer un ordinateur à l'aide d'une connexion réseau directe, qu'elle soit activée ou non ; se connectant à du matériel plutôt qu'à un système d'exploitation ou au shell de connexion.

source: Interactions and processes that are obfuscated from the user, such as Compute volume mount, data transmission to an iSCSI target by a daemon, or Object Storage object integrity checks.
fr: Interactions et processus qui sont cachés à l'utilisateur, comme le montage des volumes Compute, la transmission des données à une cible iSCSI par un démon, ou les vérifications d'intégrité d'un objet du Stockage d'objets.

source: Interacts directly with the Block Storage service, and processes such as the cinder-scheduler. It also interacts with these processes through a message queue. The cinder-volume service responds to read and write requests sent to the Block Storage service to maintain state. It can interact with a variety of storage providers through a driver architecture.
fr: Interagit directement avec le service de Stockage en blocs et les processus comme cinder-scheduler. Il interagit aussi avec ces processus par le biais d'une file d'attente de messages. Le service cinder-scheduler répond aux requêtes de lecture et d'écriture envoyées au service de Stockage en blocs pour maintenir l'état. Peut interagir avec une variété de fournisseurs de stockage par l'intermédiaire d'une architecture de pilote.

source: Interface within Networking that enables organizations to create custom plug-ins for advanced features, such as QoS, ACLs, or IDS.
fr: Interface de Networking qui permet à des organisations de créer des plug-ins personnalisés pour les fonctions avancées, telles que QoS, ACL, ou IDS.

source: Internet Control Message Protocol, used by network devices for control messages. For example, :command:`ping` uses ICMP to test connectivity.
fr: Internet Control Message Protocol. Utilisé par des périphériques de réseautage pour contrôler les messages. Par exemple, :command:`ping` utilise ICMP pour tester la connectivité.

source: Intrusion Detection System.
fr: IDS (Intrusion Detection System)

source: It includes the following components:
fr: Il comprend les éléments suivants :

source: JavaScript Object Notation (JSON)
fr: JSON (JavaScript Object Notation)

source: Key management service
fr: Service de gestion des clés

source: LBaaS feature that provides availability monitoring using the `ping` command, TCP, and HTTP/HTTPS GET.
fr: Fonctionnalité LBaas qui fournit des possibilités de monitoring par la commande « ping », TCP, et HTTP/HTTPS GET.

source: Lightweight Directory Access Protocol (LDAP)
fr: LDAP (Lightweight Directory Access Protocol)

source: Linux Bridge neutron plug-in
fr: Plug-in Linux Bridge pour Neutron

source: Linux bridge
fr: Linux brigge

source: Linux containers (LXC)
fr: LXC (Linux Containers)

source: Linux kernel feature that provides independent virtual networking instances on a single host with separate routing tables and interfaces. Similar to virtual routing and forwarding (VRF) services on physical network equipment.
fr: Composant du noyau Linux, qui fournit des instances de réseautage virtuelles indépendantes sur un hôte unique, avec des interfaces et des tables de routage séparées. Similaire aux services VRF (Virtual Routing and Forwarding) des équipements de réseau physiques.

source: Linux kernel security module that provides the mechanism for supporting access control policies.
fr: Module de sécurité du noyau Linux qui fournit le mécanisme qui permet de supporter les stratégies de contrôle d'accès.

source: Lists allowed commands within the Compute rootwrap facility.
fr: Fait la liste des commandes autorisées par la fonctionnalité rootwrap de Compute.

source: Lists containers in Object Storage and stores container information in the account database.
fr: Liste les conteneurs d'Object Storage et contient les informations de conteneurs dans la base de données du compte.
pt_br: Lista containers no Object Storage e armazena informação do container na base de dados da conta.

source: Logical groupings of related code, such as the Block Storage volume manager or network manager.
fr: Regroupements logiques de codes relatifs, comme le gestionnaire de volumes de stockage en blocs ou le gestionnaire de réseaux.

source: Logical subdivision of an IP network.
fr: Sous division logique d'un réseau IP.

source: Lower power consumption CPU often found in mobile and embedded devices. Supported by OpenStack.
fr: Microprocesseur (CPU) basse consommation souvent trouvé dans les périphériques mobiles ou intégrés. Supporté par OpenStack.

source: MD5 hash of an object within Object Storage, used to ensure data integrity.
fr: MD5 est un objet d'Object Storage, utilisé pour assurer l'intégrité des données.

source: Manages accounts defined with Object Storage.
fr: Gère les comptes définis dans Object Storage.

source: Manages actual objects, such as files, on the storage nodes.
fr: Gère des objets, comme des fichiers, sur les nœuds de stockage.

source: Manages the mapping of containers or folders, within Object Storage.
fr: Gère le mappage des conteneurs ou des dossiers, dans le Stockage d'objets.

source: Maps Object Storage partitions to physical storage devices.
fr: Mappe les partitions d'Object Storage à des périphériques de stockage physiques.

source: Massively scalable distributed storage system that consists of an object store, block store, and POSIX-compatible distributed file system. Compatible with OpenStack.
fr: Système de stockage distribué extrêmement adaptable qui consiste en un stockage d'objets, un stockage de blocs, et un système de fichiers distribué compatible avec POSIX. Compatible avec OpenStack.

source: Maximum frame or packet size for a particular network medium. Typically 1500 bytes for Ethernet networks.
fr: Taille de paquet ou d'image maximum pour un médium de réseau particulier. Correspond normalement à 1500 octets pour les réseaux Ethernet.

source: Mechanism for highly-available multi-host routing when using OpenStack Networking (neutron).
fr: Mécanisme de routage multi-hôtes hautement disponible quand on utilise OpenStack Networking (neutron).

source: Mechanism in IP networks to detect end-to-end MTU and adjust packet size accordingly.
fr: Mécanisme de réseaux IP pour détecter le MTU end-to-end et ajuster la taille des paquets en fonction.
