Repository: 25hours/openstack-manuals
Catalog: doc/common-rst/source/locale/*/LC_MESSAGES/common-rst.po
Languages: fr, pt_br

source: A grouped release of projects related to OpenStack that came out in the fall of 2012, the sixth release of OpenStack. It includes Compute (nova), Object Storage (swift), Identity (keystone), Networking (neutron), Image service (glance), and Volumes or Block Storage (cinder). Folsom is the code name for the sixth release of OpenStack. The design summit took place in San Francisco, California, US and Folsom is a nearby city.
fr: Livraison groupée de projets liès à OpenStack sortis pendant l'automne 2012, la sixième sortie d'OpenStack. Elle incluait Compute (nova 2012.1), Object Storage (swift 1.4.3), Image (glance), et Identity (keytone), Networking (neutron), Volumes ou Block Storage (cinder). Folsom est le nom de code de la sixième sortie d'OpenStack. Le sommet de design a eu lieu à San Francisco, en Californie, USA et Folsom est une ville qui se trouve non loin de cet endroit.

source: A handy tip or reminder.
fr: Astuce ou rappel utile :
pt_br: Uma dica útil ou lembrete.

source: A high availability system design approach and associated service implementation ensures that a prearranged level of operational performance will be met during a contractual measurement period. High availability systems seeks to minimize system downtime and data loss.
fr: Une approche de conception de système à haute disponibilité et la mise en œuvre du service associé fait qu'un niveau préétabli de performance opérationnelle sera maintenu pendant une période contractuelle de mesure. Les systèmes à haute disponibilité visent à minimiser la perte de données et les temps d'arrêt système.

source: A horizon component that stores and tracks client session information. Implemented through the Django sessions framework.
fr: Un composant d'horizon qui stocke et assure le suivi des informations de sessions clients. Fait partie du framework de sessions Django.

source: A hybrid cloud is a composition of two or more clouds (private, community or public) that remain distinct entities but are bound together, offering the benefits of multiple deployment models. Hybrid cloud can also mean the ability to connect colocation, managed and/or dedicated services with cloud resources.
fr: Un cloud hybride se compose de deux ou plusieurs clouds (privé, communautaire ou public), qui restent des entités distinctes mais liées ensemble, offrant les avantages de plusieurs modèles de déploiement. Cloud hybride peut également se référer à la possibilité de connecter la colocation, les services gérés et/ou dédiés aux ressources cloud.

source: A kind of web service API that uses REST, or Representational State Transfer. REST is the style of architecture for hypermedia systems that is used for the World Wide Web.
fr: Une sorte d'API de service web qui utilise TEST ou le transfert d'état de représentation. REST est le style d'architecture des systèmes d'hypermedia qui sont utilisés dans la toile.

source: A lightweight SQL database, used as the default persistent storage method in many OpenStack services.
fr: Base de données SQL légère, utilisée comme méthode de stockage persistant par défaut dans plusieurs services d'OpenStack.

source: A list of API endpoints that are available to a user after authentication with the Identity service.
fr: Liste des points de terminaison d'API disponibles pour un utilisateur après son authentification auprès du service d'identité.

source: A list of URL and port number endpoints that indicate where a service, such as Object Storage, Compute, Identity, and so on, can be accessed.
fr: Liste d'URL et de points de terminaisons de numéros de ports qui indiquent où on peut accéder à un service, comme Object Storage, Compute, Identity, etc..

source: A list of VM images that are available through Image service.
fr: Une liste des images de VM disponibles via le service Image.

source: A list of permissions attached to an object. An ACL specifies which users or system processes have access to objects. It also defines which operations can be performed on specified objects. Each entry in a typical ACL specifies a subject and an operation. For instance, the ACL entry `(Alice, delete)` for a file gives Alice permission to delete the file.
fr: La liste des autorisations associées à un objet. Une ACL spécifie quels utilisateurs ou processus du système ont accès aux objets. Elle définit également les opérations qui peuvent être effectuées sur des objets spécifiés. Chaque entrée d'ACL typique spécifie un sujet et une opération. Par exemple, l'entrée d'ACL « (Alice, delete) » d'un fichier donne la permission à Alice de supprimer le fichier.

source: A list of tenants that can access a given VM image within Image service.
fr: Liste de clients pouvant accéder à une image de VM donnée dans le service Image.

source: A load balancer is a logical device that belongs to a cloud account. It is used to distribute workloads between multiple back-end systems or services, based on the criteria defined as part of its configuration.
fr: Un équilibreur de charges est un périphérique logique qui appartient à un compte cloud. Il est utilisé pour distribuer des charges de travail entre plusieurs services ou systèmes de back-end, selon un critère défini dans le cadre de sa configuration.

source: A logical set of devices, such as web servers, that you group together to receive and process traffic. The load balancing function chooses which member of the pool handles the new requests or connections received on the VIP address. Each VIP has one pool.
fr: Un ensemble de périphériques, comme des serveurs web, regroupés pour recevoir et traiter le trafic.

source: A mechanism that allows IPv6 packets to be transmitted over an IPv4 network, providing a strategy for migrating to IPv6.
fr: Un mécanisme permettant aux paquets IPv6 d'être transmis sur un réseau IPv4 qui fournit une stratégie de migration vers IPv6.

source: A mechanism that allows many resources (for example, fonts, JavaScript) on a web page to be requested from another domain outside the domain from which the resource originated. In particular, JavaScript's AJAX calls can use the XMLHttpRequest mechanism.
fr: Un mécanisme qui permet à plusieurs ressources (par exemple, les polices, ou JavaScript) d'une page web d'être demandées par un domaine qui se trouve en dehors du domaine d'origine de la ressource. En particulier, les appels AJAX de JavaScript peuvent utiliser le mécanisme XMLHttpRequest.

source: A message that is stored both in memory and on disk. The message is not lost after a failure or restart.
fr: Message stocké à la fois en mémoire et sur un disque. Le message n'est ainsi pas perdu en cas d'échec ou au redémarrage.

source: A message that is stored in memory and is lost after the server is restarted.
fr: Un message qui stocké dans la mémoire et qui est perdu après un redémarrage du serveur.

source: A method for making file systems available over the network. Supported by OpenStack.
fr: Une méthode pour rendre des systèmes de fichiers disponibles à travers le réseau. Supporté par OpenStack.

source: A method of VM live migration used by KVM to evacuate instances from one host to another with very little downtime during a user-initiated switchover. Does not require shared storage. Supported by Compute.
fr: Méthode de déplacement live des VM utilisées par KVM pour évacuer les instances d'un hôte vers un autre, avec très peu d'indisponibilité lors d'une bascule initiée par l'utilisateur. Ne nécessite pas de stockage partagé. Supporté par Compute.

source: A method of operating system installation where a finalized disk image is created and then used by all nodes without modification.
fr: Une méthode d'installation de système d'exploitation pour laquelle une image de disque est créée, puis utilisée par tous les nœuds sans modification.

source: A method to automatically configure networking for a host at boot time. Provided by both Networking and Compute.
fr: Méthode pour configurer un réseautage automatiquement au démarrage pour un hôte. Fourni par les services Networking et Compute à la fois.

source: A method to establish trusts between identity providers and the OpenStack cloud.
fr: Méthode pour établir la relation de confiance entre les fournisseurs d'identités et le cloud OpenStack.

source: A method to further subdivide availability zones into hypervisor pools, a collection of common hosts.
fr: Méthode de sub-division plus poussée des zones disponibles en pools d'hyperviseurs, une collection d'hôtes standards.

source: A minimal Linux distribution designed for use as a test image on clouds such as OpenStack.
fr: Une distribution Linux minimale conçue pour utiliser une image test sur clouds comme OpenStack.

source: A model that enables access to a shared pool of configurable computing resources, such as networks, servers, storage, applications, and services, that can be rapidly provisioned and released with minimal management effort or service provider interaction.
fr: Modèle qui permet l'accès à un ensemble de ressources informatiques partagées configurables, comme des réseaux, des serveurs, du stockage, des applications, et des services, qui peuvent être provisionnées et libérées rapidement avec un minimum d'effort de gestion ou d'interaction avec le fournisseur de service.

source: A network authentication protocol which works on the basis of tickets. Kerberos allows nodes communication over a non-secure network, and allows nodes to prove their identity to one another in a secure manner.
fr: Protocole d'authentification de réseau qui fonctionne sur la base de tickets. Kerberos permet aux nœuds de communiquer sur un réseau non sécurisé, et permet aux nœuds de faire preuve de leur identité à un autre de façon sécurisée.

source: A network protocol used by a network client to obtain an IP address from a configuration server. Provided in Compute through the dnsmasq daemon when using either the FlatDHCP manager or VLAN manager network manager.
fr: Un protocole de réseau utilisé par un client réseau pour obtenir une adresse IP d'un serveur de configuration. Fourni dans Compute par le démon dnsmasq lorsque l'on utilise le gestionnaire FlatDHCP ou le gestionnaire de réseau VLAN.

source: A network segment typically used for instance Internet access.
fr: Segment de réseau normalement utilisé pour l'accès Internet d'instances.

source: A network segment used for administration, not accessible to the public Internet.
fr: Un segment de réseau utilisé pour l'administration, et non accessible dans l'internet public.

source: A network segment used for instance traffic tunnels between compute nodes and the network node.
fr: Un segment de réseau utilisé pour les tunnels de trafic d'instances entre les nœuds compute et les nœuds de réseau.

source: A node that provides the Object Storage proxy service.
fr: Un nœud qui fournit un service proxy de stockage d'objets.

source: A node that runs Object Storage account, container, and object services.
fr: Un nœud qui exécute le compte Object Storage, conteneur et les services d'objet.

source: A node that runs network, volume, API, scheduler, and image services. Each service may be broken out into separate nodes for scalability or availability.
fr: Un nœud qui fait tourner les services réseau, volume, API, schéduler et image. Chaque service peut être éclaté sur des nœuds séparés pour l'évolutivité ou la disponibilité.

source: A node that runs the nova-compute daemon that manages VM instances that provide a wide range of services, such as web applications and analytics.
fr: Nœud qui exécute le démon nova-compute, qui s'occupe de gérer les instances de VM qui fournissent un grand nombre de services, comme les analyses ou les applications web.

source: A notification agent (``ceilometer-agent-notification``)
fr: Un agent de notification (``ceilometer-agent-notification``)

source: A notification driver that monitors VM instances and updates the capacity cache as needed.
fr: Un driver de notification qui supervise les instances de VM et met à jour le cache de capacité au besoin.

source: A number of periodic processes run on the OpenStack Image service to support caching. Replication services ensure consistency and availability through the cluster. Other periodic processes include auditors, updaters, and reapers.
fr: Un certain nombre de processus périodiques exécutent sur le service OpenStack Image pour assurer le support de la mise en cache. Des services de réplication assurent l'homogénéité et la disponibilité dans l'ensemble du cluster. D'autres processus périodiques existent comme les processus d'auditing (auditor), de mise à jour (updater) ou de collection (reaper).

source: A number within a database that is incremented each time a change is made. Used by Object Storage when replicating.
fr: Numéro de base de données incrémenté à chaque fois d'un changement est fait. Utilisé par Object Storage en cas de réplication.

source: A package commonly installed in VM images that performs initialization of an instance after boot using information that it retrieves from the metadata service, such as the SSH public key and user data.
fr: Package fréquemment installé dans les images de VM qui effectue l'initialisation d'une instance après son boot en utilisant les informations récupérées du service metadata, comme la clé publique SSH et les données utilisateur.

source: A persistent storage method supported by XenAPI, such as iSCSI or NFS.
fr: Méthode de stockage persistante supportée par XenAPI, comme iSCSI ou NFS.

source: A person who plans, designs, and oversees the creation of clouds.
fr: Une personne qui planifie, conçoit et supervise la création d'un cloud.

source: A personality that a user assumes to perform a specific set of operations. A role includes a set of rights and privileges. A user assuming that role inherits those rights and privileges.
fr: Personnalité qu'un utilisateur assume pour réaliser un ensemble particulier d'opérations. Un rôle inclut un ensemble de droits et de privilèges. Un utilisateur qui assume ce rôle hérite de ces droits et de ces privilèges.

source: A physical computer, not a VM instance (node).
fr: Ordinateur physique, et non pas une instance de VM (nœud).

source: A physical or virtual device that provides connectivity to another device or medium.
fr: Un périphérique physique ou virtuel qui fournit de la connectivité à un autre périphérique ou medium.

source: A physical or virtual network device that passes network traffic between different networks.
fr: Périphérique physique ou de réseau virtuel qui fait passer le trafic réseau entre les différents réseaux.

source: A piece of software that makes available another piece of software over a network.
fr: Morceau de logiciel qui rend accessible un autre morceau de logiciel à travers le réseau.

source: A platform that provides a suite of desktop environments that users access to receive a desktop experience from any location. This may provide general use, development, or even homogeneous testing environments.
fr: Plateforme qui fournit une suite d'environnements de bureau auxquels les utilisateurs peuvent accéder pour recevoir une expérience de bureau à partir de n'importe quel endroit. Peut fournir des environnements d'utilisation standard, de développement ou de testing homogènes.

source: A plug-in for the OpenStack dashboard (horizon).
fr: Extension au tableau de bord (horizon) d'OpenStack.

source: A point-in-time copy of an OpenStack storage volume or image. Use storage volume snapshots to back up volumes. Use image snapshots to back up data, or as "gold" images for additional servers.
fr: Une copie d'image ou de volume de stockage d'OpenStack liée à un point dans le temps. Utilise des instantanés de volumes de stockage pour sauvegarder les volumes. Utilise des instantanés d'images pour sauvegarder les données, ou en tant qu'images « gold » pour des serveurs supplémentaires.

source: A pre-made VM image that serves as a cloudpipe server. Essentially, OpenVPN running on Linux.
fr: Une image de VM pré-fabriquée qui sert de serveur de cloudpipe. En un mot, OpenVPN exécutant sous Linux.

source: A process that runs in the background and waits for requests. May or may not listen on a TCP or UDP port. Do not confuse with a worker.
fr: Processus qui exécute en arrière-plan et qui attend vos requêtes. Écoute sans doute sur un port TCP ou UDP. À ne pas confondre avec un worker.

source: A program that keeps the Image service VM image cache at or below its configured maximum size.
fr: Un programme qui conserve le cache d'image de VM du service Image à une valeur égale ou inférieure à sa taille configurée maximum.

source: A programming language that is used to create systems that involve more than one computer by way of a network.
fr: Langage de programmation qui créaient des systèmes comprenant plus d'un ordinateur par le moyen d'un réseau.

source: A project that is not officially endorsed by the OpenStack Foundation. If the project is successful enough, it might be elevated to an incubated project and then to a core project, or it might be merged with the main code trunk.
fr: Projet qui n'est pas officiellement approuvé par la Fondation OpenStack. Si le projet réussit assez, il pourra être élevé au rang de projet incubé, puis de projet principal, ou bien il peut être fusionné avec le tronc de code principal.

source: A project that ports the shell script-based project named DevStack to Python.
fr: Un projet de réécriture de DevStack, écrit en shell-script, en Python.

source: A recommended architecture for an OpenStack cloud.
fr: Architecture conseillée pour un cloud OpenStack.

source: A record that specifies information about a particular domain and belongs to the domain.
fr: Enregistrement qui indique des informations à propos d'un domaine particulier et qui appartient au domaine.

source: A remote, mountable file system in the context of the Shared File Systems. You can mount a share to, and access a share from, several hosts by several users at a time.
fr: Un système de fichiers montable, distant en contexte de Système de fichiers partagés. Vous pouvez monter une share, ou accéder à une share, à partir de plusieurs hôtes avec plusieurs utilisateurs à la fois.

source: A routing algorithm in the Compute RabbitMQ.
fr: Algorithme de routage de Compute RabbitMQ.

source: A routing table that is created within the Compute RabbitMQ during RPC calls; one is created for each RPC call that is invoked.
fr: Une table de routage créée dans Compute RabbitMQ pendant les appels RPB ; une table est créée pour chaque appel RPC invoqué.

source: A running VM, or a VM in a known state such as suspended, that can be used like a hardware server.
fr: Une VM en cours d'exécution, ou une VM dans un statut connu comme « en attente », qui puisse être utilisée comme serveur hardware.

source: A scheduling method used by Compute that randomly chooses an available host from the pool.
fr: Méthode de planification utilisée par Compute qui choisit aléatoirement un host disponible dans le pool.

source: A scripting language that is used to build web pages.
fr: Langage de script utilisé pour construire les pages web.

source: A security model that focuses on data confidentiality and controlled access to classified information. This model divide the entities into subjects and objects. The clearance of a subject is compared to the classification of the object to determine if the subject is authorized for the specific access mode. The clearance or classification scheme is expressed in terms of a lattice.
fr: Un modèle de sécurité qui met l'accent sur la confidentialité des données et l'accès limité aux informations classifiées. Ce modèle divise les entités en sujets et en objets. L'acceptation d'un sujet est comparable à la classification de cet objet pour déterminer s'il est autorisé à un mode d'accès spécifique. Le schéma de classification ou d'acceptation est exprimé en termes de treillis.

source: A server daemon that serves the Nova Cert service for X509 certificates. Used to generate certificates for ``euca-bundle-image``. Only needed for the EC2 API.
fr: Un démon de serveur qui sert le service Nova Cert pour les certificats X509. Utilisé pour générer les certificats de ``euca-bundle-image``. Uniquement utilisé pour l'API EC2.

source: A set of OpenStack resources created and managed by the Orchestration service according to a given template (either an AWS CloudFormation template or a Heat Orchestration Template (HOT)).
fr: Un ensemble de ressources OpenStack créées et gérées par le service Orchestration suivant un modèle donné (soit un modèle AWS CludFormation ou un modèle Heat Orchestration Template (HOT)).

source: A set of command-line interpreter commands for managing cloud resources. Although it is not an OpenStack module, you can configure nova-api to support this EC2 interface. For more information, see the `Eucalyptus 3.4 Documentation <https://www.eucalyptus.com/docs/eucalyptus/3.4/index.html>`__.
fr: Un ensemble de commandes de l'interpréteur de ligne de commandes pour la gestion de ressources cloud. Bien qu'il ne s'agisse pas d'un module OpenStack, vous pouvez configurer le nova-api pour qu'il puisse prendre en charge cette interface EC2. Pour plus d'informations, consulter `Eucalyptus 3.4 Documentation <https://www.eucalyptus.com/docs/eucalyptus/3.4/index.html>`__.

source: A set of network traffic filtering rules that are applied to a Compute instance.
fr: Un ensemble de règles de filtrage de trafic réseau appliquées à une instance de Compute.

source: A set of segment objects that Object Storage combines and sends to the client.
fr: Un ensemble d'objets de segments qu'Object Storage combine et envoie au client.

source: A simple certificate authority provided by Compute for cloudpipe VPNs and VM image decryption.
fr: Une simple autorité de certification fournie par Compute pour les VPN cloudpipe et le décodage d'images de VM.

source: A special Object Storage object that contains the manifest for a large object.
fr: Un objet spécial du Stockage d'objets qui contient le manifeste d'une objet volumineux.

source: A special type of VM image that is booted when an instance is placed into rescue mode. Allows an administrator to mount the file systems for an instance to correct the problem.
fr: Type d'image spéciale amorcée quand une instance est en mode de secours (rescue). Permet à l'administrateur de monter le système de fichiers d'une instance pour corriger le problème.

source: A specification that, when implemented by a physical PCIe device, enables it to appear as multiple separate PCIe devices. This enables multiple virtualized guests to share direct access to the physical device, offering improved performance over an equivalent virtual device. Currently supported in OpenStack Havana and later releases.
fr: Spécification qui, une fois implémentée par un périphérique PCIe physique, lui permet d'apparaître sous forme de périphériques multiples PCIe séparés. Cela permet à plusieurs invités virtualisés de partager un accès direct au périphérique physique, offrant ainsi une meilleure performance par rapport à un périphérique virtuel équivalent. N'est pas actuellement pris en charge dans OpenStack Havana et versions ultérieures.

source: A standardized interface for managing compute, data, and network resources, currently unsupported in OpenStack.
fr: Interface standard de gestion de ressources de réseau, de données, compute non actuellement prises en charge par OpenStack.
