Repository: 25hours/openstack-manuals
Catalog: doc/common-rst/source/locale/*/LC_MESSAGES/common-rst.po
Languages: fr, pt_br

source: The Compute component that chooses suitable hosts on which to start VM instances.
fr: Composant de Compute qui choisit les hôtes adéquats pour démarrer les instances des VM.

source: The Compute component that contains a list of the current capabilities of each host within the cell and routes requests as appropriate.
fr: Le composant Compute qui contient une liste des capacités courantes de chaque hôte à l'intérieur d'une cellule et dirige les requêtes en fonction.

source: The Compute component that gives IP addresses to authorized nodes and assumes DHCP, DNS, and routing configuration and services are provided by something else.
fr: Composant de Compute qui donne les adresses IP à des noeuds autorisés et qui s'assure que DHCP, DNS et autres services et configurations de routage sont fournis par quelque-chose d'autre.

source: The Compute component that manages various network components, such as firewall rules, IP address allocation, and so on.
fr: Le composant Compute qui gère plusieurs composants réseau, comme les règles firewall, l'allocation d'adresse IP, etc.

source: The Compute component that provides dnsmasq (DHCP, DNS, BOOTP, TFTP) and radvd (routing) services.
fr: Composant de Compute qui fournit les services dnsmasq (DHCP, DNS, BOOTP, TFTP) et radvd (routing).

source: The Compute component that runs on each compute node and manages the VM instance life cycle, including run, reboot, terminate, attach/detach volumes, and so on. Provided by the nova-compute daemon.
fr: Composant de Compute qui exécute sur chaque nœud de Compute et qui gère le cycle de vie de l'instance de VM, c'est à dire l'exécution, les redémarrage, terminer, attacher/détacher les volumes, etc. Fourni par le démon nova-compute.

source: The Compute direct exchanges, fanout exchanges, and topic exchanges use this key to determine how to process a message; processing varies depending on exchange type.
fr: Les échanges directs de Compute, les échanges fanout, et les échanges de sujets (topics) utilisent cette clé pour déterminer comment traiter un message ; le traitement varie suivant le type d'échange.

source: The Compute scheduling method that attempts to fill a host with VMs rather than starting new VMs on a variety of hosts.
fr: La méthode de planification de Compute qui tente de remplir l'hôte de VM plutôt que de démarrer de nouvelles VM dans un ensemble varié d'hôtes.

source: The Compute service can send alerts through its notification system, which includes a facility to create custom notification drivers. Alerts can be sent to and displayed on the horizon dashboard.
fr: Le service Compute peut envoyer des alertes via son système de notification, qui inclut un système de création de pilotes de notification personnalisés. Les alertes peuvent être envoyées et affichées sur le tableau de bord d'horizon.

source: The Compute service provides accounting information through the event notification and system usage data facilities.
fr: Le service Compute fournit des informations de comptabilité par le biais de notifications d'événements et de fonctionnalités pour obtenir des données sur l'utilisation du système.

source: The Compute setting that enables or disables RAM overcommitment.
fr: La paramètre de configuration de Compute qui active ou désactive les excès de validation de mémoire (RAM).

source: The Identity component that provides high-level authorization services.
fr: Composant de gestion des identités qui fournit les services d'autorisation de haut niveau.

source: The Identity service component that provides authentication services.
fr: Le composant service d'identité qui fournit les services d'authentification.

source: The Identity service contains these components:
fr: Le service d'Identité contient les composants suivants :

source: The Identity service endpoint template that contains services available to all tenants.
fr: Le modèle de point de terminaison du service Identity qui contient les services disponibles à tous les clients.

source: The Image service API endpoint for management of VM images.
fr: Le point de terminaison d'API du service Image pour gérer les images de VM.

source: The Launchpad Bugs area
fr: La zone Launchpad Bugs
pt_br: A área de Bugs do Launchpad

source: The Network Controller provides virtual networks to enable compute servers to interact with each other and with the public network. All machines must have a public and private network interface. A private network interface can be a flat or VLAN network interface. A flat network interface is controlled by the flat_interface with flat managers. A VLAN network interface is controlled by the `vlan_interface` option with VLAN managers.
fr: Le contrôleur réseau fournit des réseaux virtuels pour permettre aux serveurs de Compute d'interagir les uns avec les autres et avec le réseau public. Toutes les machines doivent avoir une interface de réseaux publics et privés. Une interface de réseau privé peut correspondre à une interface de réseau VLAN ou flat. Une interface de réseau flat est contrôlée par la flat_interface avec des gestionnaires flat. Une interface de réseau VLAN est contrôlée par l'option « vlan_interface » avec des gestionnaires de réseau local virtuel (VLAN).

source: The Network Controller provides virtual networks to enable compute servers to interact with each other and with the public network. All machines must have a public and private network interface. The public network interface is controlled by the `public_interface` option.
fr: Le contrôleur réseau fournit des réseaux virtuels pour permettre aux serveurs de Compute d'interagir les uns avec les autres et avec le réseau public. Toutes les machines doivent avoir une interface de réseaux publics et privés.L'interface de réseau publique est contrôlée par l'option « public_interface ».

source: The Object Storage back-end process that creates and manages object replicas.
fr: Le processus de back-end du Stockage d'objets pour créer et gérer les replicata d'objets.

source: The Object Storage component that provides container services, such as create, delete, list, and so on.
fr: Composant d'Object Storage qui fournit les services de conteneur, comme créer, supprimer, lister, etc...

source: The Object Storage context of an account. Do not confuse with a user account from an authentication service, such as Active Directory, /etc/passwd, OpenLDAP, OpenStack Identity, and so on.
fr: Le contexte Object Storage d'un compte. Ne pas confondre avec un compte utilisateur venant d'un service d'authentification, comme Active Directory, /etc/passwd, OpenLDAP, OpenStack Identity, ou autre.

source: The OpenStack :term:`Identity service <Identity>` provides a single point of integration for managing authentication, authorization, and service catalog services. Other OpenStack services use the Identity service as a common unified API. Additionally, services that provide information about users but that are not included in OpenStack (such as LDAP services) can be integrated into a pre-existing infrastructure.
fr: OpenStack :term:`Identity service <Identity>` fournit un point unique d'intégration pour la gestion de l'authentification, de l'autorisation et des services de catalogue de services. D'autres services OpenStack utilisent le service d'Identité comme API unifiée commune. De plus, les services qui fournissent des informations sur les utilisateurs, mais qui ne sont pas inclus dans OpenStack (comme les services LDAP), peuvent être intégrés à une infrastructure préexistante.

source: The OpenStack Block Storage service (cinder) adds persistent storage to a virtual machine. Block Storage provides an infrastructure for managing volumes, and interacts with OpenStack Compute to provide volumes for instances. The service also enables management of volume snapshots, and volume types.
fr: Le service de stockage en blocks OpenStack (cinder) ajoute un stockage persistant à une machine virtuelle. Le Stockage en blocs fournit une infrastructure pour la gestion des volumes et interagit avec OpenStack Compute pour fournir une quantité d'instances. Le service permet également la gestion des instantanés de volume et des types de volumes.

source: The OpenStack IRC channel
fr: Le canal IRC d'OpenStack
pt_br: O canal OpenStack no IRC

source: The OpenStack Image service includes the following components:
fr: Le service OpenStack Image inclut les composants suivants :

source: The OpenStack Image service is central to Infrastructure-as-a-Service (IaaS) as shown in :ref:`get_started_conceptual_architecture`. It accepts API requests for disk or server images, and image metadata from end users or OpenStack Compute components. It also supports the storage of disk or server images on various repository types, including OpenStack Object Storage.
fr: Le service d'images OpenStack est au cœur de l'Infrastructure-as-a-Service (IaaS) comme le montre :ref:`get_started_conceptual_architecture`. Il accepte les demandes d'API pour les images de serveurs ou de disques et les métadonnées d'image d'utilisateurs finaux ou des composants d'OpenStack Compute. Il prend également en charge le stockage des images de disques ou de serveurs sur différents types de référentiels, y compris OpenStack Object Storage.

source: The OpenStack Object Storage is a multi-tenant object storage system. It is highly scalable and can manage large amounts of unstructured data at low cost through a RESTful HTTP API.
fr: OpenStack Object Storage est un système de stockage d'objets mutualisé. Il est très évolutif et peut gérer de larges volumes de données non structurées à moindre coût par une API HTTP RESTful.

source: The OpenStack community lives in the #openstack IRC channel on the Freenode network. You can hang out, ask questions, or get immediate feedback for urgent and pressing issues. To install an IRC client or use a browser-based client, go to `https://webchat.freenode.net/ <https://webchat.freenode.net>`__. You can also use Colloquy (Mac OS X, http://colloquy.info/), mIRC (Windows, http://www.mirc.com/), or XChat (Linux). When you are in the IRC channel and want to share code or command output, the generally accepted method is to use a Paste Bin. The OpenStack project has one at http://paste.openstack.org. Just paste your longer amounts of text or logs in the web form and you get a URL that you can paste into the channel. The OpenStack IRC channel is ``#openstack`` on ``irc.freenode.net``. You can find a list of all OpenStack IRC channels at https://wiki.openstack.org/wiki/IRC.
fr: La communauté OpenStack communique sur le canal IRC #openstack du réseau Freenode. Vous pouvez y enregistrer votre présence, poser des questions ou obtenir des informations immédiates au sujet de problèmes urgents ou pressants. Pour installer un client IRC ou utiliser un client basé navigateur, allez à 'https://webchat.freenode.net/ <https://webchat.freenode.net>`__. Vous pouvez également utiliser XChat (Linux), mIRC (Windows, http://www.mirc.com/) ou colloque (MacOSX, http://colloquy.info/). Lorsque vous êtes sur le canal IRC et que vous voulez partager un extrait de code ou une commande, la méthode généralement acceptée est d'utiliser une Paste Bin. Le projet OpenStack en possède une http://paste.openstack.org. Il suffit de coller vos plus grands montants de texte ou de journalisation sous format web, et vous obtienderez une URL que vous pourrez coller dans le canal. Le canal IRC OpenStack est '' #openstack'' sur '' irc.freenode.net. ''. Vous pouvez trouver une liste de tous les canaux IRC OpenStack à l'adresse suivante : https://wiki.openstack.org/wiki/IRC.

source: The OpenStack community values your set up and testing efforts and wants your feedback. To log a bug, you must sign up for a Launchpad account at https://launchpad.net/+login. You can view existing bugs and report bugs in the Launchpad Bugs area. Use the search feature to determine whether the bug has already been reported or already been fixed. If it still seems like your bug is unreported, fill out a bug report.
fr: La communauté OpenStack valorise vos efforts d'installation et de testing, et souhaite donc recevoir vos commentaires. Pour signaler un bogue, vous devrez ouvrir un compte sur le Launchpad à https://launchpad.net/+login. Vous pouvez visualiser les bogues existants ou rapporter des bogues dans la zone réservée aux bogues dans Launchpad. Utilisez la fonction de recherche pour déterminer si le bogue a déjà été signalé ou a déjà été corrigé. Si votre bogue n'a pas encore été signalé, remplir un rapport de bogue.

source: The OpenStack configuration files use an INI format to describe options and their values. It consists of sections and key value pairs.
fr: Les fichiers de configuration d'OpenStack utilisent un format INI pour décrire les options et leurs valeurs. Se composent de sections et de valeurs de clés (paires).

source: The OpenStack core project that enables management of volumes, volume snapshots, and volume types. The project name of Block Storage is cinder.
fr: Le projet clé d'OpenStack pour la gestion des volumes, des instantanés de volume et des types de volume. Le nom du projet de stockage par block est cinder.

source: The OpenStack core project that provides a central directory of users mapped to the OpenStack services they can access. It also registers endpoints for OpenStack services. It acts as a common authentication system. The project name of Identity is keystone.
fr: Projet OpenStack core qui fournit un répertoire central d'utilisateurs mappés aux services OpenStack qu'ils peuvent accéder. Enregistre également les points de terminaison des services OpenStack. Agit comme système d'authentification en commun. Le nom du projet est keystone.

source: The OpenStack core project that provides compute services. The project name of Compute service is nova.
fr: Le projet OpenStack qui fournit les services de Compute. Le nom du projet de Compute est nova.

source: The OpenStack core project that provides eventually consistent and redundant storage and retrieval of fixed digital content. The project name of OpenStack Object Storage is swift.
fr: Le projet OpenStack qui fournit un stockage consistant et redondant et l'accès à un contenu digital fixe. Le nom du projet de Stockage d'objets d'OpenStack est swift.

source: The OpenStack documentation uses several typesetting conventions.
fr: La documentation OpenStack possède plusieurs conventions de mise en page.

source: The OpenStack project that OpenStack project that implements clustering services and libraries for the management of groups of homogeneous objects exposed by other OpenStack services. The project name of Clustering service is senlin.
fr: Le projet OpenStack qui implémente le regroupement des services et des bibliothèques pour la gestion des groupes d'objets homogènes exposés par d'autres services d'OpenStack. Le nom de projet du service Clustering est senlin.

source: The OpenStack project that provides a multi-tenant, highly scalable, performant, fault-tolerant Monitoring-as-a-Service solution for metrics, complex event processing, and logging. It builds an extensible platform for advanced monitoring services that can be used by both operators and tenants to gain operational insight and visibility, ensuring availability and stability. The project name is monasca.
fr: Le projet OpenStack fournit une solution performante, multi-clients, très adaptable, résistante aux erreurs de Monitoring en tant que service pour les statistiques, le traitement des événements complexes et la journalisation. C'est une plate-forme extensible pour des services avancés de monitoring pouvant être utilisés par les opérateurs et les clients à la fois, en vue d'acquérir un aperçu opérationnel et une meilleure visibilité, d'assurer la disponibilité et la stabilité du système. Le nom du projet est monasca.

source: The OpenStack project that provides integrated tooling for backing up, restoring, and recovering file systems, instances, or database backups. The project name is freezer.
fr: Projet OpenStack qui fournit des outils intégrés pour sauvegarder, restaurer, et récupérer des systèmes de fichiers, des instances ou conserver des bases de données. Le nom du projet est freezer.

source: The OpenStack wiki
fr: Le wiki OpenStack
pt_br: Wiki OpenStack

source: The Orchestration service consists of the following components:
fr: Le service Orchestration comporte les éléments suivants :

source: The Orchestration service provides a template-based orchestration for describing a cloud application by running OpenStack API calls to generate running cloud applications. The software integrates other core components of OpenStack into a one-file template system. The templates allow you to create most OpenStack resource types, such as instances, floating IPs, volumes, security groups and users. It also provides advanced functionality, such as instance high availability, instance auto-scaling, and nested stacks. This enables OpenStack core projects to receive a larger user base.
fr: Le service Orchestration fournit une orchestration basée sur un modèle pour décrire une application cloud en exécutant des appels d'API OpenStack en vue de générer des applications cloud. Le logiciel intègre d'autres éléments de base d'OpenStack dans un système de modèle en un seul fichier. Les modèles vous permettent de créer la plupart des types de ressources d'OpenStack, comme des instances, des IP flottants, des volumes, des groupes de sécurité et des utilisateurs. Il offre également des fonctionnalités avancées telles que la haute disponibilité d'instances, la mise à échelle d'instances (auto-scaling) et les piles imbriquées. Cela permet de recevoir une plus grande base d'utilisateurs pour les projets de base d'OpenStack.

source: The POSIX-compliant file system provided by Ceph.
fr: Le système de fichiers compatible POSIX fournit par Ceph.

source: The SCSI disk protocol tunneled within Ethernet, supported by Compute, Object Storage, and Image service.
fr: Le protocole de disque SCSI tunnelé à travers Ethernet, pris en charge par Compute, Object Storage, et le service Image.

source: The Simple Protocol for Independent Computing Environments (SPICE) provides remote desktop access to guest virtual machines. It is an alternative to VNC. SPICE is supported by OpenStack.
fr: SPICE (Simple Protocol for Independent Computing Environments) fournit l'accès à des machines virtuelles pour des bureau distants. Alternative à VNC. SPICE et pris en charge par OpenStack.

source: The Telemetry service consists of the following components:
fr: Le service de Telemetrie comporte les éléments suivants :

source: The Telemetry service performs the following functions:
fr: Le service Telemetry fait office de fonctions suivantes :

source: The Xen administrative API, which is supported by Compute.
fr: API d'administration de Xen, supportée par Compute.

source: The `OpenStack wiki <https://wiki.openstack.org/>`__ contains a broad range of topics but some of the information can be difficult to find or is a few pages deep. Fortunately, the wiki search feature enables you to search by title or content. If you search for specific information, such as about networking or OpenStack Compute, you can find a large amount of relevant material. More is being added all the time, so be sure to check back often. You can find the search box in the upper-right corner of any OpenStack wiki page.
fr: OpenStack wiki <https://wiki.openstack.org/>`__ contient un large éventail de sujets, mais certaines des informations peuvent être difficiles à trouver ou peuvent être enfouies. Heureusement, la fonction de recherche de wiki vous permet de rechercher par titre ou par contenu. Si vous recherchez des informations spécifiques, telles que des informations sur le réseautage ou OpenStack Compute, vous trouverez une grande quantité de renseignements pertinents. Les informations sont ajoutées en continu, donc vérifiez régulièrement. Vous pouvez trouver la case de recherche dans le coin supérieur droit de n'importe quelle page de wiki OpenStack.

source: The ``root`` user must run commands that are prefixed with the ``#`` prompt. You can also prefix these commands with the :command:`sudo` command, if available, to run them.
fr: L'utilisateur ``root`` doit exécuter des commandes qui commencent par ``#``. Vous pouvez également faire précéder ces commandes de la :command: `sudo`, si disponible, pour les exécuter.

source: The `nova-network` worker daemon; provides services such as giving an IP address to a booting nova instance.
fr: Le daemon worker `nova-network`; fournit des services comme par exemple attribuer une adresse IP à une instance nova en cours de démarrage.

source: The ability to encrypt data at the file system, disk partition, or whole-disk level. Supported within Compute VMs.
fr: La possibilité d'encoder des données dans le système fichiers, la partition de disque, ou au niveau du disque tout entier. Pris en charge dans les VM de Compute.

source: The ability to start new VM instances based on the actual memory usage of a host, as opposed to basing the decision on the amount of RAM each running instance thinks it has available. Also known as RAM overcommit.
fr: La possibilité de démarrer de nouvelles instances de VM basées sur l'utilisation de mémoire d'un hôte, et non pas basé sur la décision de montant de RAM que chaque instance en cours d'exécution pense qu'elle a de disponible. Aussi connu sous le terme RAM overcommit.

source: The ability to start new VM instances based on the actual memory usage of a host, as opposed to basing the decision on the amount of RAM each running instance thinks it has available. Also known as memory overcommit.
fr: La possibilité de démarrer de nouvelles instances de VM sur la base de l'utilisation de mémoire d'un hôte, et non pas basé sur le montant de RAM que chaque instance en cours d'exécution pense qu'elle a de disponible. Aussi connu sous le terme Memory overcommit.

source: The ability within Compute to move running virtual machine instances from one host to another with only a small service interruption during switchover.
fr: La possibilité de déplacer des instances de machines virtuelles d'un hôte à l'autre dans Compute, avec une toute petite interruption de service lors du basculement.

source: The act of verifying that a user, process, or client is authorized to perform an action.
fr: L'action de vérifier qu'un utilisateur, un processus, ou un client est autorisé à réaliser une action.

source: The amount of available data used by communication resources, such as the Internet. Represents the amount of data that is used to download things or the amount of data available to download.
fr: Le montant de données disponibles utilisées par les ressources de communication, comme l'internet. Représente le montant de données utilisées pour télécharger ou le montant de données disponibles de téléchargement.

source: The amount of time it takes for a new Object Storage object to become accessible to all clients.
fr: Temps qu'il faut pour qu'un nouvel objet d'Object Storage devienne accessible à tous les clients.

source: The back-end store used by Image service to store VM images, options include Object Storage, local file system, S3, or HTTP.
fr: Back-en store utilisé par le service Image pour stocker des images de VM. Les options incluent Object Storage, le système de fichiers local, S3 ou HTTP.
