Repository: 25hours/openstack-manuals
Catalog: doc/common-rst/source/locale/*/LC_MESSAGES/common-rst.po
Languages: fr, pt_br

source: The cinder-backup service provides backing up volumes of any type to a backup storage provider. Like the cinder-volume service, it can interact with a variety of storage providers through a driver architecture.
fr: Le service cinder-backup fournit des volumes de sauvegarde de n'importe quel type à un fournisseur de stockage de sauvegarde. Tout comme le service cinder-volume, il peut interagir avec divers fournisseurs de stockage par l'intermédiaire d'une architecture de pilote.

source: The code name for the eighth release of OpenStack. The design summit took place in Portland, Oregon, US and Havana is an unincorporated community in Oregon.
fr: Nom de code de la huitième sortie d'OpenStack. Le sommet de design a eu lieu à Portland, dans l'état d'Orégon, USA, et Havana est le nom d'une communauté non incorporée de cet état.

source: The code name for the eleventh release of OpenStack. The design summit took place in Paris, France. Due to delays in the name selection, the release was known only as K. Because `k` is the unit symbol for kilo and the reference artifact is stored near Paris in the Pavillon de Breteuil in Sèvres, the community chose Kilo as the release name.
fr: Le nom de code de la onzième sortie d'OpenStack. Le sommet de design a eu lieu à Paris, en France. En raison des délais pour la sélection du nom, cette sortie fût nommée K car `k`est le symbole de l'unité kilo et l'artefact de référence est stocké aux alentours de Paris, dans le pavillon de Breteuil, à Sèvres, donc la communauté a choisi kilo comme nom de sortie.

source: The code name for the initial release of OpenStack. The first design summit took place in Austin, Texas, US.
fr: Nom de code de la première sortie d'OpenStack. Le premier sommet de design a eu lieu à Austin, au Texas, USA.

source: The code name for the ninth release of OpenStack. The design summit took place in Hong Kong and Ice House is a street in that city.
fr: Nom de code de la neuvième sortie d'OpenStack. Le sommet de design a eu lieu à Honk Kong et Ice House est une rue de cette ville.

source: The code name for the seventh release of OpenStack. The design summit took place in San Diego, California, US and Grizzly is an element of the state flag of California.
fr: Nom de code pour la septième sortie d'OpenStack. Le sommet de design a eu lieu à San Diego, Californie, US et le Grizzly est l’emblème du drapeau de l'état de Californie.

source: The code name for the tenth release of OpenStack. The design summit took place in Atlanta, Georgia, US and Juno is an unincorporated community in Georgia.
fr: Nom de code de la dixième sortie d'OpenStack. Le sommet de design a eu lieu à Atlanta, dans l'état de Georgia, USA, et Juno est le nom d'une communauté non incorporée de cet état.

source: The code name for the thirteenth release of OpenStack. The design summit will take place in Tokyo, Japan. Mitaka is a city in Tokyo.
fr: Nom de code de la treizième sortie d'OpenStack. Le sommet de design se tiendra à Tokyo, au Japon. Mitaka est une cité de Tokyo.

source: The code name for the twelfth release of OpenStack. The design summit took place in Vancouver, Canada and Liberty is the name of a village in the Canadian province of Saskatchewan.
fr: Nom de code de la douzième sortie d'OpenStack. Le sommet de design a eu lieu à Vancouver, au Canada, et Liberty est le nom d'un village dans la province canadienne de Saskatchewan.

source: The collaboration site for OpenStack.
fr: Le site de collaboration pour OpenStack.

source: The common agents are L3 (layer 3), DHCP (dynamic host IP addressing), and a plug-in agent.
fr: Les agents les plus communs sont L3 (layer 3), DHCP (dynamic host IP addressing), et un agent de plug-in.

source: The cooperative threading model used by Python; reduces race conditions and only context switches when specific library calls are made. Each OpenStack service is its own thread.
fr: Modèle de thread utilisé dans Python. Il réduit la concurrence critique et ne change de contexte que quand des appels de bibliothèques spécifiques sont fait. Chaque service d'OpenStack a son propre thread.

source: The current state of a guest VM image.
fr: Le statut actuel d'une image de VM d'invité.

source: The current status of a VM image in Image service, not to be confused with the status of a running instance.
fr: Statut actuel de l'image de VM dans le service Image, à ne pas confondre avec le statut de l'instance en cours d'exécution.

source: The daemon, worker, or service that a client communicates with to access an API. API endpoints can provide any number of services, such as authentication, sales data, performance meters, Compute VM commands, census data, and so on.
fr: Le démon, worker, ou service avec lequel un client communique pour accéder à un API. Les points de terminaison de l'API peuvent fournir un certain nombre de services, comme l'authentification, les données de vente, des métriques de performance, des commandes Compute VM, census data, etc..

source: The default message queue software used by OpenStack.
fr: Logiciel de mise en file de message par défaut utilisée par OpenStack.

source: The default panel that is displayed when a user accesses the horizon dashboard.
fr: Le volet qui s'affiche par défaut quand un utilisateur accède au tableau de bord d'horizon.

source: The fibre channel protocol tunneled within Ethernet.
fr: Protocol fibre channel tunnelé à travers Ethernet.

source: The following Launchpad Bugs areas are available:
fr: Les zones de Launchpad Bugs suivantes sont à votre disposition :
pt_br: As seguintes áreas de Bugs do Launchpad estão disponíveis:

source: The following Linux distributions provide community-supported packages for OpenStack:
fr: Les distributions Linux suivantes fournissent des packages pour Openstack, qui sont pris en charge par la communauté :
pt_br: As seguintes distribuições Linux fornecem pacotes OpenStack suportados pela comunidade:

source: The following books explain how to configure and run an OpenStack cloud:
fr: Les guides suivants expliquent comment configurer et exécuter un cloud OpenStack :
pt_br: Os seguintes livros explicam como configurar e executar uma nuvem OpenStack:

source: The following books explain how to install an OpenStack cloud and its associated components:
fr: Les guides suivants expliquent comment installer un cloud OpenStack avec ses composants associés :
pt_br: Os seguintes livros explicam como instalar uma nuvem OpenStack e seus componentes associados:

source: The following books explain how to use the OpenStack dashboard and command-line clients:
fr: Les guides suivants expliquent comment utiliser le tableau de bord d'OpenStack et les clients de lignes de commandes :
pt_br: Os seguintes livros explicam como utilizar o dashboard do OpenStack e os clientes de linha de comando:

source: The following diagram shows the relationships among the OpenStack services:
fr: Le diagramme suivant montre les relations entre les services OpenStack :

source: The following documentation provides reference and guidance information for the OpenStack APIs:
fr: La documentation suivante vous donne des informations de référence et d'orientation sur les API d'OpenStack :
pt_br: A seguinte documentação fornece informações de referência e orientação para as APIs do OpenStack:

source: The following resources are available to help you run and use OpenStack. The OpenStack community constantly improves and adds to the main features of OpenStack, but if you have any questions, do not hesitate to ask. Use the following resources to get OpenStack support, and troubleshoot your installations.
fr: Les ressources suivantes sont là pour vous aider à exécuter et à utiliser OpenStack. La communauté OpenStack améliore et ajoute constamment de nouvelles fonctionnalités à OpenStack, mais si vous avez des questions, n'hésitez pas à nous les poser. Utiliser les ressources suivantes pour obtenir le support Openstack, et pour solutionner vos problèmes d'installation.
pt_br: Os seguintes recursos estão disponíveis para ajudá-lo a executar e utilizar o OpenStack. A comunidade OpenStack constantemente melhora e acrescenta as principais características do OpenStack, mas se você tiver quaisquer questões, não hesite em perguntar. Utilize os seguintes recursos para obter suporte ao OpenStack, e resolver problemas em suas instalações.

source: The main virtual communication line used by all AMQP messages for inter-cloud communications within Compute.
fr: La ligne de communication virtuelle principale utilisée par tous les messages AMQP pour les communications inter-cloud dans Compute.

source: The method of storage used by horizon to track client sessions, such as local memory, cookies, a database, or memcached.
fr: Méthode de stockage utilisée par horizon pour garder la trace des sessions de clients, comme la mémoire locale, les cookies, une base de données ou memcached.

source: The method that a service uses for persistent storage, such as iSCSI, NFS, or local disk.
fr: La méthode qu'un service utilise pour le stockage persistant, comme iSCSI, NFS ou un disque local.

source: The method used by the Compute RabbitMQ for intra-service communications.
fr: Méthode utilisée par Compute RabbitMQ pour les communications internes au service.

source: The most common web server software currently used on the Internet.
fr: Le logiciel de serveur web le plus couramment utilisé sur Internet.
pt_br: O software de servidor web mais usado na Internet.

source: The nova-api daemon provides access to nova services. Can communicate with other APIs, such as the Amazon EC2 API.
fr: Le démon nova-api donne un accès aux services de nova. Il peut communiquer avec d'autres API, comme l'API EC2 d'Amazone.

source: The number of replicas of the data in an Object Storage ring.
fr: Le nombre de replicata de données dans un anneau de Stockage de données.

source: The open standard messaging protocol used by OpenStack components for intra-service communications, provided by RabbitMQ, Qpid, or ZeroMQ.
fr: Protocole ouvert et standard d'échange de messages utilisé par les composants d'OpenStack pour les communications à l'intérieur même des services, fournis par RabbitMQ, Qpid, ou ZeroMQ.

source: The persistent data store used to save and retrieve information for a service, such as lists of Object Storage objects, current state of guest VMs, lists of user names, and so on. Also, the method that the Image service uses to get and store VM images. Options include Object Storage, local file system, S3, and HTTP.
fr: Magasin de données persistantes utilisé pour sauvegarder et récupérer des informations pour un service, comme la liste des objets d'Object Storage, l'état actuel des VM, la liste des utilisateurs, etc... Désigne aussi la méthode qu'utilise le service Image pour obtenir et stocker les images des VM. Les options possibles incluent Object Storage, système de fichier local, S3, et HTTP.

source: The person responsible for planning and maintaining an OpenStack installation.
fr: La personne responsable de l'organisation et de la maintenance d'une installation OpenStack.

source: The point where a user interacts with a service; can be an API endpoint, the horizon dashboard, or a command-line tool.
fr: Point d'interaction entre un utilisateur et un service ; peut correspondre à un point de terminaison d'API, au tableau de bord d'horizon, ou d'un outil de ligne de commande.

source: The practice of placing one packet type within another for the purposes of abstracting or securing data. Examples include GRE, MPLS, or IPsec.
fr: Pratique qui consiste à mettre un type de paquet dans un autre dans le but d'extraire ou de sécuriser des données. Exemples: GRE, MPLS, ou IPsec.

source: The practice of utilizing a secondary environment to elastically build instances on-demand when the primary environment is resource constrained.
fr: Le fait d'utiliser un second environnement pour démarrer des instances à la demande de façon élastique quand le premier environnement est à court de ressources.

source: The process associating a Compute floating IP address with a fixed IP address.
fr: Le processus associant une adresse IP flottante de Compute avec une adresse IP fixe.

source: The process of automating IP address allocation, deallocation, and management. Currently provided by Compute, melange, and Networking.
fr: Le processus d'automatisation pour la distribution des adresses IP, leur dés-allocation et leur gestion. Actuellement fourni par Compute, melange et Networking.

source: The process of connecting a VIF or vNIC to a L2 network in Networking. In the context of Compute, this process connects a storage volume to an instance.
fr: Le processus de connexion d'un VIF ou d'un vNIC à un réseau L2 dans Networking. Dans le contexte de Compute, le processus connecte un volume de stockage à une instance.

source: The process of copying data to a separate physical device for fault tolerance and performance.
fr: Processus de copie des données sur un périphérique physique séparé à des buts de performance et pour la tolérance de fautes.

source: The process of distributing Object Storage partitions across all drives in the ring; used during initial ring creation and after ring reconfiguration.
fr: Le processus de distribution de partitions d'Object Storage à travers tous les pilotes de l'anneau : utilisé lors de la création initiale d'un anneau et après la reconfiguration d'un anneau.

source: The process of filtering incoming network traffic. Supported by Compute.
fr: Processus de filtrage du trafic de réseau entrant. Pris en charge par Compute.

source: The process of finding duplicate data at the disk block, file, and/or object level to minimize storage use—currently unsupported within OpenStack.
fr: Le processus de recherche de données dupliquées au niveau du bloc de disque, du fichier, et/ou de l'objet pour minimiser l'utilisation du stockage - non supporté actuellement dans OpenStack.

source: The process of migrating one or all virtual machine (VM) instances from one host to another, compatible with both shared storage live migration and block migration.
fr: Le processus qui consiste à migrer une ou plusieurs instances de machines virtuelles (VM) d'un hôte à l'autre, à la fois compatible avec la migration live de stockage partagé et la migration en blocs.

source: The process of moving a VM instance from one host to another.
fr: Le processus qui consiste à déplacer une instance de VM d'un hôte à un autre.

source: The process of putting a file into a virtual machine image before the instance is started.
fr: Le fait de mettre un fichier dans une machine virtuelle avant que l'instance ne démarre.

source: The process of removing the association between a floating IP address and a fixed IP address. Once this association is removed, the floating IP returns to the address pool.
fr: Le processus de suppression de l'association entre l'adresse IP flottante et une adresse IP fixe. Une fois que cette association est supprimée, l'IP flottante retourne au pool d'adresses.

source: The process of removing the association between a floating IP address and fixed IP and thus returning the floating IP address to the address pool.
fr: Le processus de suppression de l'association entre l'adresse IP flottante et une adresse IP fixe : ainsi, l'adresse IP flottante retourne au pool d'adresses.

source: The process of spreading client requests between two or more nodes to improve performance and availability.
fr: Le processus de distribution des requêtes clients entre deux ou plusieurs nœuds pour améliorer la performance et la disponibilité.

source: The process of taking a floating IP address from the address pool so it can be associated with a fixed IP on a guest VM instance.
fr: Processus qui consiste à prendre une adresse IP flottante du pool d'adresses pour l'associer avec une IP fixe sur une VM invitée.

source: The process that confirms that the user, process, or client is really who they say they are through private key, secret token, password, fingerprint, or similar method.
fr: Processus qui confirme que l'utilisateur, le processus ou le client est vraiment qui il dit qu'il est, grâce à une clé privée, un jeton secret, un mot de passe, une empreinte digitale ou une méthode similaire.

source: The project name for the Telemetry service, which is an integrated project that provides metering and measuring facilities for OpenStack.
fr: Nom du projet du service Telemetry, projet intégré qui fournit les outils de mesures pour OpenStack.

source: The project that provides OpenStack Identity services.
fr: Le projet qui fournit les services d'Identité d'Openstack.

source: The protocol by which layer-3 IP addresses are resolved into layer-2 link local addresses.
fr: Protocole par lequel les adresses IP de niveau-3 sont résolues en lien d'adresses locales de niveau-2.

source: The protocol that tells browsers where to go to find information.
fr: Protocol qui indique aux navigateurs où aller pour trouver l'information.

source: The queue
fr: La file d'attente
pt_br: A fila

source: The registry is a private internal service meant for use by OpenStack Image service. Do not expose this service to users.
fr: Le registre est un service interne privé qui est sensé être utilisé par le service OpenStack Image. N'exposez pas ce service aux utilisateurs.

source: The router advertisement daemon, used by the Compute VLAN manager and FlatDHCP manager to provide routing services for VM instances.
fr: Le démon d'annonces du router, utilisé par le gestionnaire VLAN de Compute et par le gestionnaire FlatDHCP afin de fournir des services aux instances de VM.

source: The service enables deployers to integrate with the Orchestration service directly or through custom plug-ins.
fr: Le service permet aux responsables de déploiement d'intégrer le service Orchestration directement ou par l'intermédiaire de plug-ins personnalisés.

source: The software package used to provide AMQP messaging capabilities within Compute. Default package is RabbitMQ.
fr: Le package de logiciel utilisé pour fournir des fonctionnalités de messagerie dans Compute. Le package par défaut est RabbitMQ.

source: The source used by Identity service to retrieve user information; an OpenLDAP server, for example.
fr: La source utilisée par le service Identity pour extraire des informations utilisateur ; un serveur OpenLDAP, par exemple.

source: The step in the Compute scheduling process when hosts that cannot run VMs are eliminated and not chosen.
fr: Étape du processus de planification de Compute quand les hôtes qui ne peuvent pas exécuter de VM sont éliminés et non pas choisis.

source: The storage method used by the Identity service catalog service to store and retrieve information about API endpoints that are available to the client. Examples include a SQL database, LDAP database, or KVS back end.
fr: Méthode de stockage utilisée par le service de catalogue du service d'Identité pour stocker et récupérer les informations sur les points de terminaison API qui sont disponibles pour le client. Par exemple, une base de donnée SQL, une base de donnée LDAP, ou un back-end KVS.

source: The sum of each cost used when deciding where to start a new VM instance in Compute.
fr: Sommes de tous les coûts utilisée pour décider où démarrer une nouvelle instance de VM dans Compute.

source: The tenant who owns an Image service virtual machine image.
fr: Le client à qui appartient l'image de machine virtuelle du service Image.

source: The transfer of data, usually in the form of files, from one computer to another.
fr: Transfert de données, en général sous forme de fichiers, d'une ordinateur à un autre.

source: The underlying format that a disk image for a VM is stored as within the Image service back-end store. For example, AMI, ISO, QCOW2, VMDK, and so on.
fr: Format sous-jacent dans lequel une image de disque de VM est stocké dans le store de back-end du service Image. Exemple: AMI, ISO, QCOW2, VMDK, etc..

source: The universal measurement of how quickly data is transferred from place to place.
fr: La mesure universelle de vitesse de transfert des données d'un endroit à un autre.

source: The web-based management interface for OpenStack. An alternative name for horizon.
fr: L'interface de gestion basée web d'OpenStack. Autre nom pour horizon.

source: Theoretically, OpenStack Compute can support any database that SQL-Alchemy supports. Common databases are SQLite3 for test and development work, MySQL, and PostgreSQL.
fr: Théoriquement, OpenStack Compute peut prendre en charge les bases de données prises en charge par SQL-Alchemy. Voici des exemples de bases de données connues : SQLite3 pour les tests, MySQL et PostgreSQL pour les travaux de développement.
pt_br: Teoricamente, a Computação OpenStack pode suportar qualquer banco de dados que o SQL-Alchemy suporta. Bancos de dados comuns são o SQLite3 para teste e trabalhos de desenvolvimento, MySQL, e PostgreSQL.

source: These services communicate by using the OpenStack messaging bus. Only the collector and API server have access to the data store.
fr: Ces services communiquent en utilisant le bus de messagerie OpenStack. Seuls le serveur d'API et le collecteur ont accès à ce magasin de données.

source: This glossary offers a list of terms and definitions to define a vocabulary for OpenStack-related concepts.
fr: Ce glossaire offre une liste de termes et de définitions pour définir un vocabulaire relatif aux concepts OpenStack.

source: This occurs when the Compute service attempts to retrieve the log output of the instance via a serial console while the instance itself is not configured to send output to the console. To rectify this, append the following parameters to kernel arguments specified in the instance's boot loader:
fr: Cela a lieu quand le service Compute tente de faire sortir le résultat de journalisation de l'instance via une console en série, tandis que l'instance elle-même n'est pas configurée pour envoyer des sorties vers la console. Pour rectifier ce problème, ajouter les paramètres suivants dans les arguments de noyau spécifiés dans le chargeur de démarrage de l'instance :

source: To add to OpenStack glossary, clone the `openstack/openstack-manuals repository <https://git.openstack.org/cgit/openstack/openstack-manuals>`__ and update the source file :file:`doc/glossary/glossary-terms.xml` through the OpenStack contribution process.
fr: Pour faire un ajout au glossaire OpenStack, cloner `openstack/openstack-manuals repository <https://git.openstack.org/cgit/openstack/openstack-manuals>`__ et ajouter le fichier source :file:`doc/glossary/glossary-terms.xml` par le biais du processus de contribution d'OpenStack.

source: To disable injection in libvirt, set the following in ``nova.conf``:
fr: Pour désactiver une injection dans libvirt, définir ce qui suit dans ``nova.conf``:

source: To effectively disable the libvirt live snapshotting, until the problem is resolved, configure the ``disable_libvirt_livesnapshot`` option. You can turn off the live snapshotting mechanism by setting up its value to ``True`` in the ``[workarounds]`` section of the ``nova.conf`` file:
fr: Pour désactiver le mécanisme de prise d'instantanés live de libvirt live, jusqu'à ce que le problème puisse être résolu, configurer l'option ``disable_libvirt_livesnapshot``. Vous pouvez fermer le mécanisme de prises d'instantanés live en définissant sa valeur à ``True`` dans la section ``[workarounds]`` du fichier ``nova.conf` :
