Repository: 25hours/openstack-manuals
Catalog: doc/common-rst/source/locale/*/LC_MESSAGES/common-rst.po
Languages: fr, pt_br

source: Certificate Authority or Certification Authority. In cryptography, an entity that issues digital certificates. The digital certificate certifies the ownership of a public key by the named subject of the certificate. This enables others (relying parties) to rely upon signatures or assertions made by the private key that corresponds to the certified public key. In this model of trust relationships, a CA is a trusted third party for both the subject (owner) of the certificate and the party relying upon the certificate. CAs are characteristic of many public key infrastructure (PKI) schemes.
fr: Autorité de certification (CA). En cryptographie, une entité qui émet des certificats numériques. Le certificat numérique atteste la propriété d'une clé publique suivant le sujet nommé du certificat. Cela permet à d'autres (parties de confiance) de se fonder sur les signatures ou les affirmations faites par la clé privée qui correspond à la clé publique certifiée. Dans ce modèle de relations de confiance, une autorité de certification est un tiers de confiance à la fois pour le sujet (propriétaire) du certificat et la partie qui dépend du certificat. Les autorités de certification (CA) sont caractéristique de nombreux schémas d'infrastructure à clé publique (PKI) (Public Key Infrastructure).

source: Changes to these types of disk volumes are saved.
fr: Les changements à ces types de volumes de disque sont sauvegardés.

source: Checks for and deletes unused VMs; the component of Image service that implements delayed delete.
fr: Vérifie et supprime les VM non utilisées. Composant du service Image qui implémente la suppression retardée.

source: Checks for missing replicas and incorrect or corrupted objects in a specified Object Storage account by running queries against the back-end SQLite database.
fr: Recherche des replicas manquants et des objets incorrects ou corrompus dans un compte spécifique de stockage d'objets en interrogeant la base de donnée SQLite.

source: Checks for missing replicas or incorrect objects in specified Object Storage containers through queries to the SQLite back-end database.
fr: Vérifie les replicas manquants et les objets incorrects dans les conteneurs d'Object Storage indiqués par interrogations dans la base de données de SQLite back-end.

source: Choosing a host based on the existence of a GPU is currently unsupported in OpenStack.
fr: Choisir un hôte sur la base de l'existence d'un GPU n'est pas normalement pris en charge dans OpenStack.

source: Cisco neutron plug-in
fr: Extension Cisco pour neutron

source: Cloud Auditing Data Federation (CADF) is a specification for audit event data. CADF is supported by OpenStack Identity.
fr: Cloud Auditing Data Federation (CADF) correspond à une spécification de données d'événement d'audit. CADF est supporté par le service Identity d'OpenStack.

source: Cloud Data Management Interface (CDMI)
fr: (CDMI) Cloud Data Management Interface

source: Code name for the DNS service project for OpenStack.
fr: Nom de code du projet de service DNS d'OpenStack.

source: Code name for the OpenStack project that provides the Containers Service.
fr: Nom de code pour le projet OpenStack qui fournit le service Containers.

source: Code name of the key management service for OpenStack.
fr: Nom de code du service de gestion des clés d'OpenStack.

source: Collection of Compute components that represent the global state of the cloud; talks to services, such as Identity authentication, Object Storage, and node/storage workers through a queue.
fr: Ensemble de composants de Compute qui représentent l'état global du cloud; communique avec les services, comme le service d'authentification Identity, Object Storage et les workers de nœud/stockage via une file d'attente.

source: Collective name for the Object Storage object services, container services, and account services.
fr: Nom collectif pour les services d'objets Stockage d'objets, les services de conteneur et les services de comptes.

source: Collective term for Object Storage components that provide additional functionality.
fr: Expression commune pour le stockage d'objets qui fournit une fonctionnalité supplémentaire.

source: Collects event and metering data by monitoring notifications sent from services.
fr: Collecte des événements et des données des contrôle en vérifiant les notifications envoyées en provenance de services.

source: Combination of a URI and UUID used to access Image service VM images through the image API.
fr: Combinaison d'une URI et d'un UUID pour accéder à des images de VM du service Image par l'API Image.

source: Command prompts
fr: Invites de commande

source: Common Internet File System (CIFS)
fr: CIFS (Common Internet File System)

source: Common errors and fixes for Compute
fr: Erreurs Fréquentes et Solutions pour Compute

source: Community project that captures Compute AMQP communications; useful for debugging.
fr: Projet communautaire qui capture les communications AMQP de Compute ; utile pour le débogage.

source: Community project that uses shell scripts to quickly build complete OpenStack development environments.
fr: Projet communautaire qui utilise les scripts shell pour construire rapidement des environnements de développement OpenStack.

source: Community support
fr: Soutien communautaire
pt_br: Suporte da comunidade

source: Companies that rent specialized applications that help businesses and organizations provide additional services with lower cost.
fr: Compagnies qui louent des applications spécialisées pour aider les entreprises et les organisations à fournir des services additionnels à moindre coût.

source: Component of Identity that provides a rule-management interface and a rule-based authorization engine.
fr: Composant du service Identité qui fournit une interface de gestion des règles et un moteur d'autorisation basé sur des règles.

source: Compute API
fr: API Compute

source: Compute service
fr: service de Compute

source: Computer that provides explicit services to the client software running on that system, often managing a variety of computer operations. A server is a VM instance in the Compute system. Flavor and image are requisite elements when creating a server.
fr: Machine qui fournit les services explicites au logiciel client sur ce système, gérant souvent une variété d'opérations de traitement. Un serveur est une instance de VM du système Compute. On a besoin des gabarits et des images pour créer un serveur.

source: Conceptual architecture
fr: Principe de l’architecture
pt_br: Arquitetura conceitual

source: Configurable option within Object Storage to limit database writes on a per-account and/or per-container basis.
fr: Option configurable d'Object Storage qui limite les écritures dans les bases de données sur la base compte et/ou conteneur.

source: Configuration Management Database.
fr: Configuration de la base de données de gestion.

source: Configuration setting within RabbitMQ that enables or disables message acknowledgment. Enabled by default.
fr: Paramètre de configuration dans RabbitMQ qui active ou désactive la fonction d'accusé de réception des messages. Activé par défaut.

source: Connected to by a direct consumer in RabbitMQ—Compute, the message can be consumed only by the current connection.
fr: Connecté

source: Container servers (swift-container-server)
fr: Serveurs de conteneurs (swift-container-server)

source: Containers service
fr: Service de conteneurs

source: Contains configuration information that Object Storage uses to reconfigure a ring or to re-create it from scratch after a serious failure.
fr: Contient des informations de configuration que le Stockage d'objets utilise pour reconfigurer un anneau ou pour le créer à nouveau après un échec grave.

source: Contains information about a user as provided by the identity provider. It is an indication that a user has been authenticated.
fr: Contient des renseignements sur un utilisateur de la même façon que par le fournisseur d'identité. C'est une indication que l'utilisateur a bien été authentifié.

source: Contains the locations of all Object Storage partitions within the ring.
fr: Contient les emplacements des partitions de stockage d'objets dans l'anneau.

source: Contains the output from a Linux VM console in Compute.
fr: Contient la sortie console d'une VM Linux dans Compute.

source: Converts an existing server to a different flavor, which scales the server up or down. The original server is saved to enable rollback if a problem occurs. All resizes must be tested and explicitly confirmed, at which time the original server is removed.
fr: Convertit un serveur existant en gabarit différent, pour augmenter ou diminuer la taille du serveur. Le serveur d'origine est sauvegardé pour permettre un retour en arrière en cas de problème. Tous les redimensionnements doivent être testés et confirmés explicitement, quand le serveur d'origine est retiré.

source: Creates a full Object Storage development environment within a single VM.
fr: Crée un environnement de développement de stockage d'objets complet dans une VM unique.

source: Creates alarms when collected data breaks defined rules.
fr: Crée des mécanismes d'avertissement quand les données collectées enfreignent certaines règles.

source: Critical information about the risk of data loss or security issues.
fr: Information critique à propos du risque de sécurité ou de perte de données.

source: Cross-Origin Resource Sharing (CORS)
fr: (CORS) Cross-Origin Resource Sharing

source: Custom modules that extend some OpenStack core APIs.
fr: Modules personnalisés qui étendent les API principales d'OpenStack.

source: DHCP agent
fr: Agent de relais DHCP

source: DNS record
fr: enregistrement DNS

source: DNS service
fr: service DNS

source: Daemon that provides DNS, DHCP, BOOTP, and TFTP services for virtual networks.
fr: Démon qui fournit les services DNS, DHCP, BOOTP, et TFTP aux réseaux virtuels.

source: Data processing service
fr: Service de traitement des données

source: Data that is only known to or accessible by a user and used to verify that the user is who he says he is. Credentials are presented to the server during authentication. Examples include a password, secret key, digital certificate, and fingerprint.
fr: Donnée seulement connue ou accessible par un utilisateur et utilisée pour vérifier qu'un utilisateur est qui il dit qu'il est. Les informations d'identification sont présentées au serveur pendant l'authentification. Ça peut être, par exemple, un mot de passe, une clé secrétée, un certificat digital, et une empreinte digitale.

source: Database
fr: Base de données
pt_br: Base de dados

source: Database service
fr: Service de base de données

source: Defines resources for a cell, including CPU, storage, and networking. Can apply to the specific services within a cell or a whole cell.
fr: Définie les ressources allouées à une cellule, incluant CPU, stockage, et réseau. Peut s'appliquer à un service spécifique à l'intérieur d'une cellule ou à l'ensemble de la cellule.

source: Denial of service (DoS) is a short form for denial-of-service attack. This is a malicious attempt to prevent legitimate users from using a service.
fr: Le Déni de service (DoS) veut dire en abrégé attaque de déni de service. Il s'agit d'une tentative malicieuse d'empêcher des utilisateurs légitimes d'utiliser un service.

source: Depending on context, the core API is either the OpenStack API or the main API of a specific core project, such as Compute, Networking, Image service, and so on.
fr: En fonction du contexte, l'API core est soit l'API OpenStack ou l'API principale d'un projet spécifique, comme Compute, Networking, Image, etc...

source: Describes the parameters of the various virtual machine images that are available to users; includes parameters such as CPU, storage, and memory. Alternative term for flavor.
fr: Décrit les paramètres de plusieurs images de machines virtuelles disponibles aux utilisateurs ; inclut des paramètres comme le CPU, le stockage, et la mémoire. Autre expression pour le terme gabarit.

source: Determines whether back-end members of a VIP pool can process a request. A pool can have several health monitors associated with it. When a pool has several monitors associated with it, all monitors check each member of the pool. All monitors must declare a member to be healthy for it to stay active.
fr: Détermine si les membres de back-end d'un pool VIP peuvent traiter une requête. Un pool peut avoir plusieurs moniteurs d'intégrité lui étant associés. Quand un pool a plusieurs moniteurs qui lui sont associés, tous les moniteurs vérifient chaque membre du pool. Tous les moniteurs doivent déclarer qu'un membre est intègre pour que celui-ci puisse demeurer actif.

source: Device plugged into a PCI slot, such as a fibre channel or network card.
fr: Périphérique enfiché dans un emplacement PCI, comme fibre channel ou carte de réseau.

source: Disable live snapshotting
fr: Désactiver le mécanisme de prise d'instantanés live

source: Disables server-side message acknowledgment in the Compute RabbitMQ. Increases performance but decreases reliability.
fr: Désactive les récépissés de messagerie côté serveur dans Compute RabbitMQ. Augmente la performance, mais réduit la fiabilité.

source: Discretionary access control. Governs the ability of subjects to access objects, while enabling users to make policy decisions and assign security attributes. The traditional UNIX system of users, groups, and read-write-execute permissions is an example of DAC.
fr: De l'anglais Discretionary Access Control. Gouverne la possibilité des sujets à accéder des objets tout en permettant aux utilisateurs de prendre des décisions sur les règles et assigner des attributs de sécurité. Le système UNIX traditionnel d'autorisations Utilisateur, Groupes, lecture-écriture-exécute est un exemple de DAC.

source: Disk-based data storage generally represented as an iSCSI target with a file system that supports extended attributes; can be persistent or ephemeral.
fr: Stockage de donnée sur disque généralement représenté par une target iSCSI avec un système de fichier qui supporte les attributs étendus; peut être persistant ou éphémère.

source: Disk-based virtual memory used by operating systems to provide more memory than is actually available on the system.
fr: Mémoire virtuelle basée sur disque utilisée par le système d'exploitation pour fournir plus de mémoire qu'il y en a effectivement.

source: Distributed block storage system for QEMU, supported by OpenStack.
fr: Système de stockage en blocs distribué de QEMU, pris en charge par OpenStack.

source: Distributes partitions proportionately across Object Storage devices based on the storage capacity of each device.
fr: Distribue des partitions proportionnellement parmi les périphériques d'Object Storage selon la capacité de stockage de chaque périphérique.

source: Documentation feedback
fr: Commentaires sur la documentation
pt_br: Comentários sobre a documentação

source: Domain Name Server. A hierarchical and distributed naming system for computers, services, and resources connected to the Internet or a private network. Associates a human-friendly names to IP addresses.
fr: DNS (Domain Name Server). Un système de nommage distribué et hiérarchique destiné aux ordinateurs, services, et ressources connectés à l'Internet ou à un réseau privé. Associe des noms facilement lisibles par des humains à des adresses IP.

source: Drivers
fr: Pilotes

source: Drivers or a service back end are integrated to the centralized server. They are used for accessing identity information in repositories external to OpenStack, and may already exist in the infrastructure where OpenStack is deployed (for example, SQL databases or LDAP servers).
fr: Des pilotes ou un service de back-end sont intégrés au serveur centralisé. Ils sont utilisés pour accéder à des informations d'identité dans des référentiels externes à OpenStack et peuvent déjà exister dans l'infrastructure où OpenStack est déployée (par exemple, dans des bases de données SQL ou dans des serveurs LDAP).

source: During the set up or testing of OpenStack, you might have questions about how a specific task is completed or be in a situation where a feature does not work correctly. Use the `ask.openstack.org <https://ask.openstack.org>`__ site to ask questions and get answers. When you visit the https://ask.openstack.org site, scan the recently asked questions to see whether your question has already been answered. If not, ask a new question. Be sure to give a clear, concise summary in the title and provide as much detail as possible in the description. Paste in your command output or stack traces, links to screen shots, and any other information which might be useful.
fr: Pendant l'installation ou le testing d'OpenStack, vous pourriez avoir des questions sur la façon dont une tâche spécifique doit être complétée ou vous pourriez vous trouver dans une situation où une fonctionnalité ne fonctionne pas correctement. Utiliser le site ask.openstack.org <https://ask.openstack.org>`__ pour poser des questions et obtenir des réponses. Lorsque vous visitez le site https://ask.openstack.org, regardez les questions récemment posées pour voir si on a déjà répondu à votre question. Si ce n'est pas le cas, posez-la. N'oubliez pas de donner un résumé clair et succinct dans l'intitulé et de fournir autant de détails que possible dans la description. Collez votre sortie de commande ou les traces de la pile, les liens de captures d'écran et toute autre information qui pourrait être utile.
pt_br: Durante a configuração ou testes do OpenStack, você pode ter perguntas sobre como alguma tarefa específica é realizada ou estar em uma situação onde um recurso não funciona corretamente. Use o site `ask.openstack.org <https://ask.openstack.org>` para fazer perguntas e obter respostas. Ao visitar o site https://ask.openstack.org, verifique as perguntas feitas recentemente para ver se a sua dúvida já foi respondida. Se não, faça uma nova pergunta. Tenha o cuidado de escrever um resumo conciso e claro no título e prover o máximo de detalhes possíveis na descrição. Cole na sua saída dos comandos ou nos traces da pilha links para capturas da sua tela ou qualquer outra informação que possa ser útil.

source: Dynamic Host Configuration Protocol (DHCP)
fr: Protocole de configuration d'hôte dynamique (DHCP)

source: Dynamic Host Configuration Protocol. A network protocol that configures devices that are connected to a network so that they can communicate on that network by using the Internet Protocol (IP). The protocol is implemented in a client-server model where DHCP clients request configuration data, such as an IP address, a default route, and one or more DNS server addresses from a DHCP server.
fr: Dynamic Host Configuration Protocol. Un protocole réseau qui configure les périphériques qui sont connectés à un réseau afin qu'ils puissent communiquer sur ce réseau en utilisant le protocole Internet (IP). Le protocole est implémenté dans un modèle client-serveur, où les clients DHCP demandent des données de configuration, comme une adresse IP, un routage par défaut et une ou plusieurs adresses de serveur DNS d'un serveur DHCP.

source: EBS boot volume
fr: Volume boot EBS

source: EC2 API
fr: API EC2

source: EC2 Compatibility API
fr: API de compatibilité EC2

source: EC2 access key
fr: Clé d'accès EC2

source: EC2 secret key
fr: Clé secrète EC2

source: Each OpenStack release has a code name. Code names ascend in alphabetical order: Austin, Bexar, Cactus, Diablo, Essex, Folsom, Grizzly, Havana, Icehouse, Juno, Kilo, Liberty, and Mitaka. Code names are cities or counties near where the corresponding OpenStack design summit took place. An exception, called the Waldon exception, is granted to elements of the state flag that sound especially cool. Code names are chosen by popular vote.
fr: Chaque version d'OpenStack a un nom de code. Les noms de codes sont choisis suivant l'ordre alphabétique : Austin, Bexar, Cactus, Diablo, Essex, Folsom, Grizzly, Havana, Icehouse, Juno, Kilo, Liberty, et Mitaka. Les noms de code sont des villes ou des pays près desquels les sommets pour la conception d'OpenStack se sont tenus. Une licence, l'exception Waldon, est accordée pour des éléments des drapeaux nationaux particulièrement sympathiques. Les noms de codes sont choisis par un vote.

source: Efficiently polls metering data related to OpenStack services.
fr: Scrute efficacement les données de contrôle des services d'OpenStack.

source: Either a soft or hard reboot of a server. With a soft reboot, the operating system is signaled to restart, which enables a graceful shutdown of all processes. A hard reboot is the equivalent of power cycling the server. The virtualization platform should ensure that the reboot action has completed successfully, even in cases in which the underlying domain/VM is paused or halted/stopped.
fr: Redémarrage logiciel ou matériel d'un serveur. Avec un redémarrage logiciel (soft reboot), le système d'exploitation doit redémarrer, ce qui permet un arrêt progressif de tous les processus. Un redémarrage matériel (hard reboot) est l'équivalent d'alimenter le serveur de façon cyclique. La plate-forme de virtualisation doit s'assurer que l'action de redémarrage a réussi, même dans les cas où le domaine sous-jacent/VM est suspendu ou interrompu/arrêté.

source: Elastic Block Storage (EBS)
fr: Bloc de Stockage Élastique (EBS)

source: Element of RabbitMQ that provides a response to an incoming MQ message.
fr: Élément de RabbitMQ qui donne une réponse à un message entrant MQ.

source: Enables Compute and Networking integration, which enables Networking to perform network management for guest VMs.
fr: Permet l'intégration de Compute et de Networking, ce qui permet à Networking d'effectuer la gestion de réseau des VM d'invités.

source: Enables Compute to communicate with NetApp storage devices through the NetApp OnCommand Provisioning Manager.
fr: Permet à Compute de communiquer avec les périphériques de stockage par le NetApp OnCommand Provisioning Manager.

source: Enables a Linux bridge to understand a Networking port, interface attachment, and other abstractions.
fr: Permet à Linux Bridge de déciphérer un port de réseau, une pièce jointe d'interface, ou autre abstraction.

source: Enables users to submit commands as a tenant administrator or end user.
fr: Permet aux utilisateurs de soumettre des commandes en tant qu’administrateur client ou utilisateur final.
pt_br: Habilita os usuários a submeter comandos como administrador de tenant ou usuário final.

source: Enables users to submit commands to the REST API through a command-line client authorized as either a admin user, reseller user, or swift user.
fr: Permet à l'utilisateur de lancer des commandes à l'API REST par l'intermédiaire d'une ligne de commande (client). Ce client devra être soit un utilisateur admin, un revendeur ou un utilisateur swift.

source: Encrypted HTTP communications using SSL or TLS; most OpenStack API endpoints and many inter-component communications support HTTPS communication.
fr: Communications HTTP cryptées utilisant SSL ou TLS ; les points de terminaison d'API OpenStack API et de nombreuses communications inter composants prend en charge la communication HTTPS.
