Repository: 25hours/openstack-manuals
Catalog: doc/common-rst/source/locale/*/LC_MESSAGES/common-rst.po
Languages: fr, pt_br

source: An Object Storage component that is responsible for managing objects.
fr: Composant de Stockage d'objets responsable de gérer des objets.

source: An Object Storage component that provides account services such as list, create, modify, and audit. Do not confuse with OpenStack Identity service, OpenLDAP, or similar user-account services.
fr: Un composant du Stockage d'objets qui fournit des services de comptabilité comme lister, créer, modifier, et vérifier. Ne pas confondre avec le service d'Identité d'OpenStack, OpenLDAP ou similaire.

source: An Object Storage large object that has been broken up into pieces. The re-assembled object is called a concatenated object.
fr: Un objet volumineux réduit en pièces faisant partie du Stockage d'objets. L'objet, une fois réassemblé, s'appelle un objet concaténé.

source: An Object Storage node that provides authorization services.
fr: Noeud de stockage objet qui fournit les services d'autorisation.

source: An Object Storage node that provides container services, account services, and object services; controls the account databases, container databases, and object storage.
fr: Un nœud de stockage d'objets qui fournit des services de conteneur, des services de comptes, et des services d'objets ; contrôle les bases de données de compte, les bases de données de conteneurs et le stockage d'objets.

source: An Object Storage server that manages containers.
fr: Un serveur d'Object Storage qui gère des conteneurs.

source: An Object Storage worker that scans for and deletes account databases and that the account server has marked for deletion.
fr: Un worker Object Storage qui cherche et supprime des bases de données de comptes et que le serveur de comptes a marqué pour suppression.

source: An OpenStack core project that provides discovery, registration, and delivery services for disk and server images. The project name of the Image service is glance.
fr: Projet OpenStack core qui procure les services discovery, registration, delivery aux images de serveurs et de disques. Le nom du projet du service Image est glance.

source: An OpenStack core project that provides object storage services.
fr: Projet OpenStack qui fournit les services de stockage objets.

source: An OpenStack grouped release of projects that came out in the spring of 2011. It included Compute (nova), Object Storage (swift), and the Image service (glance). Cactus is a city in Texas, US and is the code name for the third release of OpenStack. When OpenStack releases went from three to six months long, the code name of the release changed to match a geography nearest the previous summit.
fr: Un ensemble de projets groupés d'OpenStack sortis au printemps 2011. Comprenait Compute (nova), Object Storage (swift) et le service Image (glance). Cactus est une ville du Texas, aux Etats-Unis et le nom de code pour la troisième sortie d'OpenStack. Lorsque les cycles de sortie d'OpenStack sont passés de trois à six mois de long, le nom de code de la version a été modifié pour correspondre à la géographie du sommet précédent.

source: An OpenStack service that provides a set of services for management of shared file systems in a multi-tenant cloud environment. The service is similar to how OpenStack provides block-based storage management through the OpenStack Block Storage service project. With the Shared File Systems service, you can create a remote file system and mount the file system on your instances. You can also read and write data from your instances to and from your file system. The project name of the Shared File Systems service is manila.
fr: Un service d'OpenStack qui fournit un ensemble de services pour la gestion des systèmes de fichiers partagés dans un environnement cloud avec plusieurs clients. Le service est semblable à la gestion de stockage basée blocs d'OpenStack du projet de service Stockage de blocs d'OpenStack. Avec le service de Systèmes de fichiers partagés, vous pouvez créer un système de fichiers distant et monter le système de fichiers sur vos instances. Vous pouvez également lire et écrire des données depuis vos instances en partance et allant vers votre système de fichiers. Le nom de projet du Service partagé de systèmes de fichiers est manila.

source: An OpenStack service, such as Compute, Object Storage, or Image service. Provides one or more endpoints through which users can access resources and perform operations.
fr: Un service d'OpenStack, comme Compute, Stockage de service, ou Image. Fournit un ou plusieurs points de terminaison à travers lesquels les utilisateurs peuvent accéder aux ressources ou effectuer des opérations.

source: An OpenStack-native REST API that processes API requests by sending them to the heat-engine over Remote Procedure Call (RPC).
fr: Un API REST natif d'Openstack qui traite les demandes d'API en les dirigeant vers le heat-engine via RPC (Remote Procedure Call).

source: An OpenStack-provided image.
fr: Une image fournie par OpenStack.

source: An OpenStack-supported hypervisor.
fr: Hyperviseur supporté par OpenStack

source: An OpenStack-supported hypervisor. KVM is a full virtualization solution for Linux on x86 hardware containing virtualization extensions (Intel VT or AMD-V), ARM, IBM Power, and IBM zSeries. It consists of a loadable kernel module, that provides the core virtualization infrastructure and a processor specific module.
fr: Un hyperviseur supporté par OpenStack. KVM est une solution de virtualisation complète pour Linux sur matériel x86 contenant les extensions de virtualisation (Intel VT ou AMD-V), ARM, IBM Power, et IBM zSeries. Il consiste en un module noyau chargeable, qui fournit l'infrastructure de virtualisation de base et d'un module spécifique au processeur.

source: An administrator who has access to all hosts and instances.
fr: Un administrateur qui a accès à tous les hôtes et toutes les instances.

source: An administrator-defined token used by Compute to communicate securely with the Identity service.
fr: Un jeton défini par l'administrateur et utilisé par Compute pour communiquer avec le service Identité de façon sécurisée.

source: An alarm evaluator (``ceilometer-alarm-evaluator``)
fr: Un évaluateur d'alarme (``ceilometer-alarm-evaluator``)

source: An alarm notifier (``ceilometer-alarm-notifier``)
fr: Un notificateur d'alarme(``ceilometer-alarm-notifier``)

source: An alpha-numeric string of text used to access OpenStack APIs and resources.
fr: Chaîne de texte alpha-numérique utilisée pour l'accès aux APIs et resources OpenStack.

source: An alternative name for Networking API.
fr: Un nom alternatif pour les API du service Réseau.

source: An application protocol for accessing and maintaining distributed directory information services over an IP network.
fr: Protocole d'application qui sert à accéder et à maintenir des service d'informations de répertoires distribués sur un réseau IP.

source: An application that runs on the back-end server in a load-balancing system.
fr: Application qui exécute sur le serveur de back-end dans un système d'équilibrage des charge.

source: An authentication and authorization service for Object Storage, implemented through WSGI middleware; uses Object Storage itself as the persistent backing store.
fr: Un service d'authentification ou d'autorisation de stockage d'objet, implémenté via WSGI middleware ; utilise le stockage d'objets lui-même comme magasin pour les sauvegardes persistantes.

source: An easy method to create a local LDAP directory for testing Identity and Compute. Requires Redis.
fr: Méthode facile de création de répertoire LDAP local pour tester Identity ou Compute. Nécessite Redis.

source: An element of the Compute RabbitMQ that comes to life when a RPC call is executed. It connects to a direct exchange through a unique exclusive queue, sends the message, and terminates.
fr: Élément de Compute RabbitMQ qui s'active quand un appel RPC est exécuté. Se connecte en échange direct par file d'attente exclusive, envoie un message et se termine.

source: An element of the Compute capacity cache that is calculated based on the number of build, snapshot, migrate, and resize operations currently in progress on a given host.
fr: Un élément du cache de capacité de Compute calculé sur la base du nombre de builds, instantanés, opérations de migration ou de redimensionnement actuellement en cours sur un hôte donné.

source: An entity in the context of the Shared File Systems that encapsulates interaction with the Networking service. If the driver you selected runs in the mode requiring such kind of interaction, you need to specify the share network to create a share.
fr: Entité en contexte de Système de fichiers partagés qui reflète l'interaction avec le service Networking. Si le pilote que vous avez sélectionné exécute dans un mode qui requiert ce type d'interaction, vous devrez indiquer le share network pour créer une share.

source: An entity that maps Object Storage data to partitions. A separate ring exists for each service, such as account, object, and container.
fr: Entité qui mappe les données de Stockage d'objets en partitions. Il a un anneau séparé pour chaque service, comme un compte, un objet ou un conteneur.

source: An iSCSI authentication method supported by Compute.
fr: Méthode d'authentification iSCSI supportée par Compute.

source: An in-progress specification for cloud management. Currently unsupported in OpenStack.
fr: Une spécification en cours de projet pour la gestion cloud. Non supporté actuellement dans OpenStack.

source: An integrated project that aims to orchestrate multiple cloud applications for OpenStack.
fr: Projet non intégré qui vise à l'orchestration de plusieurs applications cloud d'OpenStack.

source: An integrated project that orchestrates multiple cloud applications for OpenStack. The project name of Orchestration is heat.
fr: Projet non intégré qui vise à l'orchestration de plusieurs applications cloud d'OpenStack. Le nom du projet d'orchestration est heat.

source: An integrated project that provide scalable and reliable Cloud Database-as-a-Service functionality for both relational and non-relational database engines. The project name of Database service is trove.
fr: Projet intégré qui fournit une fonctionnalité Cloud Database-as-a-Service fiable et évolutive, à la fois pour les moteurs relationnels et pour ceux qui ne le sont pas. Le nom du projet du service de base de données est trove.

source: An object state in Object Storage where a new replica of the object is automatically created due to a drive failure.
fr: Un état d'objet dans Object Storage quand une réplique de l'objet est créée automatiquement à cause d'une défaillance de pilote.

source: An object within Object Storage that is larger than 5 GB.
fr: Un objet du Stockage Objet qui est plus grand que 5 Go.

source: An official OpenStack project. Currently consists of Compute (nova), Object Storage (swift), Image service (glance), Identity (keystone), Dashboard (horizon), Networking (neutron), and Block Storage (cinder), Telemetry (ceilometer), Orchestration (heat), Database service (trove), Bare Metal service (ironic), Data processing service (sahara). However, this definition is changing based on community discussions about the "Big Tent".
fr: Un projet Officiel OpenStack. Consiste actuellement en Compute (nova), Stockage d'Objet (swift), service d'Image (glance), Identité (keystone), Tableau de bord (horizon), Réseau (neutron), Stockage par Bloc (cinder), Télémétrie (ceilometer), Orchestration (heat), Base de Données (trove), service Bare Metal (ironic), service de Traitement des Données (sahara). Néanmoins, cette définition est en train de changer suite aux discussions de la communauté autour de "Big Tent".

source: An open source LDAP server. Supported by both Compute and Identity.
fr: Un serveur LDAP open source. Pris en charge à la fois par Compute et Identity.

source: An open source SQL toolkit for Python, used in OpenStack.
fr: Une boite à outil SQL open source pour Python, utilisé par OpenStack.

source: An open source community project by Dell that aims to provide all necessary services to quickly deploy clouds.
fr: Un projet communautaire open source de Dell dont le but est de fournir tous les services nécessaires au déploiement rapide de clouds.

source: An operating system configuration management tool supporting OpenStack deployments.
fr: Un outil de gestion de configuration d'un système d'exploitation prenant en charge les déploiements d'OpenStack.

source: An operating system configuration-management tool supported by OpenStack.
fr: Un outil de configuration du système d'exploitation supporté par OpenStack

source: An operating system instance running under the control of a hypervisor.
fr: Une instance de système d'exploitation exécutant sous le contrôle d'un hyperviseur.

source: An operating system instance that runs on top of a hypervisor. Multiple VMs can run at the same time on the same physical host.
fr: Instance d'un système d'exploitation qui tourne par dessus un hyperviseur. Plusieurs VMs peuvent tourner en même temps sur le même host physique.

source: An option within Compute that enables administrators to create and manage users through the `nova-manage` command as opposed to using the Identity service.
fr: Option de Compute qui permet aux administrateurs de créer ou gérer des utilisateurs par la commande `nova-manage`au lieu d'utiliser le service Identity.

source: An option within Image service so that an image is deleted after a predefined number of seconds instead of immediately.
fr: Option du service Image qui permet à une image d'être supprimée après un nombre de secondes prédéterminé et non pas immédiatement.

source: Any business that provides Internet access to individuals or businesses.
fr: Toute entreprise qui fournit un accès Internet à des individus ou à des entreprises.

source: Any client software that enables a computer or device to access the Internet.
fr: Tout client logiciel qui permet à un ordinateur ou à un périphérique d'accéder à internet.

source: Any compute node that runs the network worker daemon.
fr: Tout nœud compute qui fait tourner le daemon worker réseau.

source: Any deployment-specific information is helpful, such as whether you are using Ubuntu 14.04 or are performing a multi-node installation.
fr: Toute information spécifique au développement est utile, comme le fait que vous utilisiez Ubuntu 14.04 or si vous procédez à une installation multi-nodes.
pt_br: Qualquer informação específica de implantação é útil, por exemplo se você está usando Ubuntu 14.04 ou está realizando uma instalação multi-nodo.

source: Any kind of text that contains a link to some other site, commonly found in documents where clicking on a word or words opens up a different website.
fr: Tout texte qui contient un lien vers un autre site, texte communément trouvé dans les documents dans lesquels il s'agit de cliquer sur un mot ou un groupe de mots pour ouvrir un autre site web.

source: Any node running a daemon or worker that provides an API endpoint.
fr: Tout nœud exécutant un démon ou un worker qui fournit un point de terminaison d'API.

source: Any piece of hardware or software that wants to connect to the network services provided by Networking, the network connectivity service. An entity can make use of Networking by implementing a VIF.
fr: Toute pièce d'équipement hardware ou software qui souhaite se connecter à des services de réseau fournis par le service de connectivité Networking. Une entité peut utiliser Networking pour implémenter un VIF.

source: Any user, including the ``root`` user, can run commands that are prefixed with the ``$`` prompt.
fr: Tout utilisateur, y compris l'utilisateur ``root``, peut exécuter des commandes commençant par ``$``

source: Apache Hadoop is an open source software framework that supports data-intensive distributed applications.
fr: Apache Hadoop est un framework de logiciel open source qui supporte les applications hautement consommatrices de données distribuées.

source: Apache License 2.0
fr: Licence Apache 2.0

source: Apache Web Server
fr: Serveur Web Apache

source: Application Programming Interface (API)
fr: API (de l'anglais Application Programming Interface), interface de programmation d'application

source: Application Service Provider (ASP)
fr: Fournisseur de services d'applications (ASP) (de l'anglais Application Service Provider)

source: Application catalog
fr: Catalogue des applications

source: Application programming interface.
fr: Interface de programmation applicative.

source: Association of an interface ID to a logical port. Plugs an interface into a port.
fr: Association entre un ID d'interface et un port logique. Branche l'interface sur le port.

source: Asynchronous JavaScript and XML (AJAX)
fr: Asynchrone JavaScript et XML (AJAX)

source: Attachment point where a virtual interface connects to a virtual network.
fr: Point de jonction où une interface virtuelle se connecte à un réseau virtuel.

source: Authentication and identity service by Microsoft, based on LDAP. Supported in OpenStack.
fr: Service d'authentification et d'identité de Microsoft, basé sur LDAP. Pris en charge par OpenStack.

source: Authentication method that uses keys rather than passwords.
fr: Une méthode d'authentification par clé plutôt que par mots de passe.

source: Authentication method that uses two or more credentials, such as a password and a private key. Currently not supported in Identity.
fr: Méthode d'authentification qui utilise deux ou plusieurs modes d'identification, comme un mot de passe et une clé privée. Non pris en charge dans le service Identité actuellement.

source: Authorizes tokens for users that console proxies provide. See nova-novncproxy and nova-xvpvncproxy. This service must be running for console proxies to work. You can run proxies of either type against a single nova-consoleauth service in a cluster configuration. For information, see `About nova-consoleauth <http://docs.openstack.org/admin-guide-cloud/compute-remote-console-access.html#about-nova-consoleauth>`__.
fr: Autorise les jetons utilisateurs fournis par les proxys de console. Voir novncproxy et nova-xvpvncproxy. Ce service doit être en cours d'exécution pour que les proxys de console puissent fonctionner. Vous pouvez exécuter des proxys de n'importe quel type pour un service simple nova-consoleauth dans une configuration de cluster. Pour plus d'informations, voir `About nova-consoleauth <http://docs.openstack.org/admin-guide-cloud/compute-remote-console-access.html#about-nova-consoleauth>`__.

source: Available instance types
fr: Les types d'instances disponibles
pt_br: Tipos de instâncias disponíveis

source: Available networks
fr: Les réseaux disponibles
pt_br: Redes disponíveis

source: Bare metal service
fr: Service bare metal

source: Baseboard Management Controller. The intelligence in the IPMI architecture, which is a specialized micro-controller that is embedded on the motherboard of a computer and acts as a server. Manages the interface between system management software and platform hardware.
fr: De l'anglais Baseboard Management Controller. L'intelligence de l'architecture d'IPMI, qui est un microcontrôleur spécialisé intégré dans la carte mère d'un ordinateur et agit comme un serveur. Gère l'interface entre le logiciel de gestion du système et le matériel de plate-forme.

source: Be sure to include the software and package versions that you are using, especially if you are using a development branch, such as, ``"Kilo release" vs git commit bc79c3ecc55929bac585d04a03475b72e06a3208``.
fr: N'oubliez pas d'inclure les versions de logiciels et de package que vous utilisez, surtout dans le cas où vous avez une branche de développement comme ``"Kilo release" vs git commit bc79c3ecc55929bac585d04a03475b72e06a3208``.

source: Bell-LaPadula model
fr: modèle Bell-LaPadula

source: Belongs to a particular domain and is used to specify information about the domain. There are several types of DNS records. Each record type contains particular information used to describe the purpose of that record. Examples include mail exchange (MX) records, which specify the mail server for a particular domain; and name server (NS) records, which specify the authoritative name servers for a domain.
fr: Appartient à un domaine particulier et est utilisé pour spécifier des informations sur le domaine. Il existe plusieurs types d'enregistrements DNS. Chaque type d'enregistrement contient notamment les renseignements utilisés pour décrire le but de cet enregistrement. Les exemples incluent des enregistrements de messagerie exchange (MX), qui spécifient le serveur de messagerie pour un domaine particulier ; et les enregistrements de serveurs de noms (NS), qui précisent les serveurs de noms faisant autorité pour un domaine.

source: Benchmark service
fr: Service Benchmark

source: Block Storage
fr: Stockage de blocs

source: Block Storage API
fr: API de stockage par blocs

source: Block storage that is simultaneously accessible by multiple clients, for example, NFS.
fr: Stockage en blocs accessible par des clients multiples simultanément, par exemple, NFS.

source: Bootstrap Protocol (BOOTP)
fr: Protocole Bootstrap (BOOTP)

source: Both Image service and Compute support encrypted virtual machine (VM) images (but not instances). In-transit data encryption is supported in OpenStack using technologies such as HTTPS, SSL, TLS, and SSH. Object Storage does not support object encryption at the application level but may support storage that uses disk encryption.
fr: Le service Image et Compute supportent les images de machines virtuelles (VM) cryptées (mais pas les instances). Le cryptage des données en transit est pris en charge dans OpenStack grâce aux technologies comme SSH, HTTPS, SSL et TLS. Object Storage ne supporte pas le cryptage d'objet au niveau de l'application, mais peut prendre en charge le stockage qui utilise le chiffrement de disques.

source: Both a VM container format and disk format. Supported by Image service.
fr: A la fois un format de conteneur de VM et un format de disque. Supporté par le service d'Image.

source: Builds and manages rings within Object Storage, assigns partitions to devices, and pushes the configuration to other storage nodes.
fr: Forme et gère des anneaux dans le Stockage d'objets, assigne des partitions à des périphériques, et pousse la configuration vers d'autres nœuds de stockage.

source: Can concurrently use multiple layer-2 networking technologies, such as 802.1Q and VXLAN, in Networking.
fr: Peut à la fois utiliser plusieurs technologies de réseautage layer-2, comme 802.1Q et VXLAN, dans Networking.

source: Causes the network interface to pass all traffic it receives to the host rather than passing only the frames addressed to it.
fr: Entraîne l'interface de réseau à passer tout le trafic qu'elle reçoit à l'hôte au lieu de le passer aux images auxquelles il s'adresse uniquement.

source: Ceph component that enables a Linux block device to be striped over multiple distributed data stores.
fr: Composant Ceph qui permet au périphérique en bloc de Linux d'être agrégé par plusieurs stores de données distribués.
