Repository: 25hours/openstack-manuals
Catalog: doc/common-rst/source/locale/*/LC_MESSAGES/common-rst.po
Languages: fr, pt_br

source: Tool used for maintaining Address Resolution Protocol packet filter rules in the Linux kernel firewall modules. Used along with iptables, ebtables, and ip6tables in Compute to provide firewall services for VMs.
fr: Outils utilisés pour conserver les règles de filtrage de paquets ARP dans les modules de pare-feu du noyau de Linux. Utilisées en conjonction aux tables ip, eb et ip6 dans Compute pour fournir des services de pare-feu pour les VM.

source: Tool used to run jobs automatically for OpenStack development.
fr: Outil utilisé pour exécuter des tâches automatiquement dans le développement OpenStack.

source: Tool used to set up, maintain, and inspect the tables of IPv6 packet filter rules in the Linux kernel. In OpenStack Compute, ip6tables is used along with arptables, ebtables, and iptables to create firewalls for both nodes and VMs.
fr: Outil utilisé pour installer, maintenir, et inspecter les tables de règles de filtrage de paquets IPv6 dans le noyau Linux. Dans OpenStack Compute, les ip6tables sont utilisées avec les arptables, les ebtables, et les iptables pour créer des pare-feux pour les nœuds et les VM à la fois.

source: Troubleshoot Compute
fr: Résolution de problèmes dans Compute

source: Type of Compute scheduler that evenly distributes instances among available hosts.
fr: Type de programme de planification de Compute qui distribue les instances équitablement entre les hôtes disponibles.

source: UUID for each Compute or Image service VM flavor or instance type.
fr: UUID pour chaque gabarit de VM ou type d'instance de service Image ou Compute.

source: UUID used by Image service to uniquely identify each VM image.
fr: UUID utilisé par le service Image pour identifier de façon unique chaque image de VM.

source: Under the Compute distributed scheduler, this is calculated by looking at the capabilities of each host relative to the flavor of the VM instance being requested.
fr: Sous le schéduler distribué de Compute, cela est calculé en regardant les capacités de chaque hôte en fonction du type d'instance de VM demandée.

source: Unique ID applied to each storage volume under the Block Storage control.
fr: ID unique appliqué à chaque volume de stockage sous le contrôle du Stockage par Blocs.

source: Unique ID assigned to each Networking VIF.
fr: ID unique assignée à chaque Réseau VIF.

source: Unique ID assigned to each guest VM instance.
fr: ID unique assigné à chaque instance de VM d'invité.

source: Unique ID assigned to each network segment within Networking. Same as network UUID.
fr: ID unique assigné à chaque segment réseau à l'intérieur du service Réseau. Même chose que UUID réseau.

source: Unique ID assigned to each request sent to Compute.
fr: ID unique assigné à chaque requête envoyée à Compute.

source: Unique ID assigned to each service that is available in the Identity service catalog.
fr: ID unique assigné à chaque service existant dans le catalogue de service d'Identité.

source: Unique ID assigned to each tenant within the Identity service. The project IDs map to the tenant IDs.
fr: ID unique assigné à chaque tenant dans le service d'Identité. L'ID de projet correspond à l'ID du tenant.

source: Unique ID for a Networking VIF or vNIC in the form of a UUID.
fr: ID unique de Networking VIF ou vNIC sous la forme d'un UUID.

source: Unique ID for a Networking network segment.
fr: ID unique de segment de réseau de Networking.

source: Unique ID for a Networking port.
fr: ID unique de port de réseautage.

source: Unique numeric ID associated with each user in Identity, conceptually similar to a Linux or LDAP UID.
fr: Numéro unique ID associé à chaque utilisateur dans le service Identity ; semblable à un UID de Linux ou LDAP.

source: Uniquely ID for an Object Storage object.
fr: ID unique d'un objet de stockage d'objets.

source: Upon rebooting, the instance will be configured to send output to the Compute service.
fr: Au redémarrage, l'instance sera configurée pour envoyer le résultat au service Compute.

source: Use OpenStack Compute to host and manage cloud computing systems. OpenStack Compute is a major part of an Infrastructure-as-a-Service (IaaS) system. The main modules are implemented in Python.
fr: Utiliser OpenStack Compute pour héberger ou gérer des systèmes de cloud computing. OpenStack Compute est une partie importante d'un système IaaS (Infrastructure-as-a-Service). Les modules principaux sont implémentés en Python.
pt_br: Utilize a Computação OpenStack para hospedar e gerenciar sistemas de computação em nuvem. A Computação OpenStack é a parte principal de um sistema de Infraestrutura como Serviço (IaaS). Os módulos principais são implementados em Python.

source: Used along with an EC2 access key when communicating with the Compute EC2 API; used to digitally sign each request.
fr: Utilisée en conjonction à une clé d'accès EC2 pour communiquer avec l'API EC2 ; utilisée pour signer chaque demande de façon numérique.

source: Used along with an EC2 secret key to access the Compute EC2 API.
fr: Utilisée en conjonction à une clé secrète pour accéder à l'API EC2 de Compute.

source: Used along with an EKI to create an EMI.
fr: Utilisé avec EKI pour créer un EMI.

source: Used along with an ERI to create an EMI.
fr: Utilisé avec ERI pour créer un EMI.

source: Used along with arptables and ebtables, iptables create firewalls in Compute. iptables are the tables provided by the Linux kernel firewall (implemented as different Netfilter modules) and the chains and rules it stores. Different kernel modules and programs are currently used for different protocols: iptables applies to IPv4, ip6tables to IPv6, arptables to ARP, and ebtables to Ethernet frames. Requires root privilege to manipulate.
fr: En conjonction avec des arptables et des ebtables, les iptables créent des pare-feux dans Compute. Les iptables sont les tableaux fournis par le pare-feu du noyau Linux (implémentés sous forme de différents modules Netfilter), les chaînes et les règles qu'ils stockent. Différents programmes et modules de noyaux sont actuellement utilisés selon les protocoles : les iptables pour IPv4, les ip6tables pour IPv6, les arptables pour ARP et les ebtables pour les trames Ethernet. Requièrent les privilèges root pour pouvoir être manipulées.

source: Used by Image service to obtain images on the local host rather than re-downloading them from the image server each time one is requested.
fr: Utilisé par le service Image pour obtenir des images sur l'hôte local plutôt que de les télécharger à nouveau d'un serveur à chaque fois qu'une image est demandée.

source: Used by Object Storage to determine the location of an object in the ring. Maps objects to partitions.
fr: Utilisé pour le Stockage d'objets pour déterminer l'emplacement d'un objet dans l'anneau. Mappe des objets dans des partitions.

source: Used by Object Storage to determine which partition data should reside on.
fr: Utilisé par le stockage d'objets pour déterminer quelles données de partition doit subsister.

source: Used by Object Storage to push object replicas.
fr: Utilisé pour le Stockage d'objets pour pousser les replicata d'objets.

source: Used by most OpenStack Networking installations to route information between the neutron-server and various agents. Also acts as a database to store networking state for particular plug-ins.
fr: Utilisé par la plupart des installations OpenStack Networking pour faire circuler l'information entre le neutron-server et les divers agents. Agit également en tant que base de données pour stocker l'état de réseautage pour un certain nombre de plug-ins.

source: Used to mark Object Storage objects that have been deleted; ensures that the object is not updated on another node after it has been deleted.
fr: Utilisé pour marquer les objets de stockage d'objets qui ont été supprimés; afin de s'assurer que l'objet n'est pas mis à jour sur un autre nœud après sa suppression.

source: Used to restrict communications between hosts and/or nodes, implemented in Compute using iptables, arptables, ip6tables, and ebtables.
fr: Utilisé pour limiter les communications entre les hôtes et/ou les nœuds, implémenté dans Compute avec iptables, artables, ip6tables, et ebtables.

source: Used to track segments of a large object within Object Storage.
fr: Utilisé pour chercher des segments d'un objet volumineux dans le Stockage d'objets.

source: User-defined alphanumeric string in Compute; the name of a project.
fr: Chaîne alphanumérique définie par l'utilisateur dans Compute ; le nom d'un projet.

source: Users of Object Storage interact with the service through the proxy server, which in turn looks up the location of the requested data within the ring and returns the results to the user.
fr: Les utilisateurs d'Object Storage communiquent avec le service par l'intermédiaire du serveur proxy, qui, à son tour, cherche l'emplacement des données demandées dans l'anneau et renvoie les résultats à l'utilisateur.

source: VLAN manager
fr: gestionnaire VLAN

source: VLAN network
fr: réseau VLAN

source: VM disk (VMDK)
fr: disque VM (VMDK)

source: VM image
fr: image VM

source: VM image container format supported by Image service.
fr: Format de conteneur d'image de VM supporté par le service Image.

source: VMware API
fr: API VMware

source: VMware NSX Neutron plug-in
fr: Plug-in WMware NSX pour Neutron

source: VMwareAPI for VMware
fr: VMwareAPI pour VMware
pt_br: VMwareAPI para VMware

source: VNC proxy
fr: proxy VNC

source: Various periodic processes
fr: Plusieurs processus périodiques

source: Various repository types are supported including normal file systems, Object Storage, RADOS block devices, HTTP, and Amazon S3. Note that some repositories will only support read-only usage.
fr: Un certain nombre de types de référentiels sont pris en charge, comprenant les systèmes de fichiers, Object Storage, les périphériques de blocs RADOS' HTTP, et Amazon S3. Notez que certains référentiels ne supporteront que l'utilisation en lecture-seule.

source: Virtual Hard Disk (VHD)
fr: Disque dur virtuel (VHD)

source: Virtual network type that uses neither VLANs nor tunnels to segregate tenant traffic. Each flat network typically requires a separate underlying physical interface defined by bridge mappings. However, a flat network can contain multiple subnets.
fr: Type de réseau virtuel qui n'utilise ni les VLAN, ni les tunnels pour séparer le trafic client. Chaque flat network requiert normalement une interface physique sous-jacente séparée, définie par les mappages de pontage. Cependant, un flat network ne contient pas plusieurs sous-réseaux.

source: Virtualization API library used by OpenStack to interact with many of its supported hypervisors.
fr: Bibliothèque d'API de virtualisation utilisée par OpenStack pour interagir avec un grand nombre de ses hyperviseurs pris en charge.

source: Volume API
fr: API de volume

source: Volume that does not save the changes made to it and reverts to its original state when the current user relinquishes control.
fr: Volume qui ne sauvegarde pas les changements qui y sont fait, et qui retourne à son état d'origine quand l'utilisateur en cours abandonne le contrôle.

source: WSGI middleware component of Object Storage that serves container data as a static web page.
fr: Le composant WSGI Middleware du Stockage d'objets qui sert des données de conteneur de page web statique.

source: When installing OpenStack Identity service, you must register each service in your OpenStack installation. Identity service can then track which OpenStack services are installed, and where they are located on the network.
fr: Lors de l'installation du service OpenStack Identity, vous devez enregistrer chaque service dans votre installation OpenStack. Le service d'Identité peut ensuite ainsi assurer le suivi de quels services OpenStack sont installés, et où ils sont situés sur le réseau.

source: Within RabbitMQ and Compute, it is the messaging interface that is used by the scheduler service to receive capability messages from the compute, volume, and network nodes.
fr: Dans RabbitMQ et Compute, il s'agit de l'interface de messagerie qui est utilisée par le service scheduler pour recevoir des messages de capacités de l'ordinateur, du volume, ou des nœuds de réseau.

source: Workflow service
fr: Service de workflow

source: Xen API
fr: API Xen

source: Xen Storage Manager Volume Driver
fr: Pilote du Gestionnaire de Stockage Xen

source: Xen is a hypervisor using a microkernel design, providing services that allow multiple computer operating systems to execute on the same computer hardware concurrently.
fr: Xen est un hyperviseur qui utilise une conception micronoyau, fournissant des services qui permettent à plusieurs systèmes d'exploitation de s'exécuter de façon concurrentielle sur le même matériel.

source: XenAPI for XenServer/XCP
fr: XenAPI pour XenServer/XCP
pt_br: XenAPI para XenServer/XCP

source: You can also use the :option:`--active` parameter to force the instance back to an active state instead of an error state. For example:
fr: Vous pouvez également utiliser le paramètre --active pour forcer l'instance à retourner à un état actif au lieu d'un état d'erreur, par exemple :

source: You can view the log output of running instances from either the :guilabel:`Log` tab of the dashboard or the output of :command:`nova console-log`. In some cases, the log output of a running Linux instance will be empty or only display a single character (for example, the `?` character).
fr: Vous pouvez voir l'affichage log des instances en cours d'exécution soit à partir de l'onglet :guilabel:`Log` du dashboard ou bien de la sortie de la commande :command:`nova console-log`. Dans certains cas, l'affichage log d'un instance Linux en cours d'exécution sera vide ou affichera seulement un seul caractère (par exemple, le caractère `?`).

source: `API Complete Reference (PDF) <http://developer.openstack.org/api-ref-guides/bk-api-ref.pdf>`__
fr: Référentiel complet d'API (PDF) <http://developer.openstack.org/api-ref-guides/bk-api-ref.pdf>`__
pt_br: `API do OpenStack - Referência Completa (PDF) <http://developer.openstack.org/api-ref-guides/bk-api-ref.pdf>`__

source: `API Guide <http://developer.openstack.org/api-guide/quick-start/>`__
fr: Guide API <http://developer.openstack.org/api-guide/quick-start/>`__
pt_br: `Guia da API <http://developer.openstack.org/api-guide/quick-start/>`__

source: `Admin User Guide <http://docs.openstack.org/user-guide-admin/>`__
fr: Guide d'utilisateur admin <http://docs.openstack.org/user-guide-admin/>`__
pt_br: `Guia de Usuário Administrador <http://docs.openstack.org/user-guide-admin/>`__

source: `Architecture Design Guide <http://docs.openstack.org/arch-design/content/>`__
fr: Guide Design Architecture <http://docs.openstack.org/arch-design/content/>`__
pt_br: `Guia de Design de Arquitetura <http://docs.openstack.org/arch-design/content/>`__

source: `Cloud Administrator Guide <http://docs.openstack.org/admin-guide-cloud/>`__
fr: Guide d'administrateur cloud <http://docs.openstack.org/admin-guide-cloud/>`__
pt_br: `Guia de Administrador de Cloud <http://docs.openstack.org/admin-guide-cloud/>`__

source: `Command-Line Interface Reference <http://docs.openstack.org/cli-reference/content/>`__
fr: Guide de référence d'interface en ligne de commandes <http://docs.openstack.org/cli-reference/content/>`__
pt_br: `Referência da Interface de Linha de Comando <http://docs.openstack.org/cli-reference/content/>`__

source: `Configuration Reference <http://docs.openstack.org/liberty/config-reference/content/>`__
fr: Guide de référence de configuration <http://docs.openstack.org/liberty/config-reference/content/>`__
pt_br: `Referência de Configuração <http://docs.openstack.org/liberty/config-reference/content/>`__

source: `End User Guide <http://docs.openstack.org/user-guide/>`__
fr: Guide d'utilisateur final <http://docs.openstack.org/user-guide/>`__
pt_br: `Guia de Usuário Final <http://docs.openstack.org/user-guide/>`__

source: `High Availability Guide <http://docs.openstack.org/ha-guide/>`__
fr: Guide HA <http://docs.openstack.org/ha-guide/>`__
pt_br: `Guia de Alta Disponibilidade <http://docs.openstack.org/ha-guide/>`__

source: `Installation Guide for Red Hat Enterprise Linux 7 and CentOS 7 <http://docs.openstack.org/liberty/install-guide-rdo/>`__
fr: Guide d'installation Red Hat Enterprise Linux 7 et CentOS 7 <http://docs.openstack.org/liberty/install-guide-rdo/>`__
pt_br: `Guia de Instalação para Red Hat Enterprise Linux 7 e CentOS 7 <http://docs.openstack.org/liberty/install-guide-rdo/>`__

source: `Installation Guide for Ubuntu 14.04 <http://docs.openstack.org/liberty/install-guide-ubuntu/>`__
fr: Guide d'installation Ubuntu 14.04 <http://docs.openstack.org/liberty/install-guide-ubuntu/>`__
pt_br: `Guia de Instalação para Ubuntu 14.04 <http://docs.openstack.org/liberty/install-guide-ubuntu/>`__

source: `Installation Guide for openSUSE 13.2 and SUSE Linux Enterprise Server 12 <http://docs.openstack.org/liberty/install-guide-obs/>`__
fr: Guide d'installation openSUSE 13.2 et SUSE Linux Enterprise Server 12 <http://docs.openstack.org/liberty/install-guide-obs/>`__
pt_br: `Guia de instalação para openSUSE 13.2 e SUSE Linux Enterprise Server 12 <http://docs.openstack.org/liberty/install-guide-obs/>`__

source: `Networking Guide <http://docs.openstack.org/liberty/networking-guide>`__
fr: Guide de réseautage <http://docs.openstack.org/liberty/networking-guide>`__
pt_br: `Guia de Redes <http://docs.openstack.org/liberty/networking-guide>`__

source: `OpenStack API Complete Reference (HTML) <http://developer.openstack.org/api-ref.html>`__
fr: Référentiel complet des API d'OpenStack (HTML) <http://developer.openstack.org/api-ref.html>`__
pt_br: `API do OpenStack - Referência Completa (HTML) <http://developer.openstack.org/api-ref.html>`__

source: `Operations Guide <http://docs.openstack.org/ops/>`__
fr: Guide d'opérations <http://docs.openstack.org/ops/>`__
pt_br: `Guia de Operações <http://docs.openstack.org/ops/>`__

source: `Security Guide <http://docs.openstack.org/sec/>`__
fr: Guide de sécurité <http://docs.openstack.org/sec/>`__
pt_br: `Guia de Segurança <http://docs.openstack.org/sec/>`__

source: `Virtual Machine Image Guide <http://docs.openstack.org/image-guide/content/>`__
fr: Guide d'images de machines virtuelles <http://docs.openstack.org/image-guide/content/>`__
pt_br: `Guia de de Imagem de Máquina Virtual <http://docs.openstack.org/image-guide/content/>`__

source: ``euca2ools`` client
fr: client ``euca2ools``

source: ``heat-api-cfn`` component
fr: Le composant ``heat-api-cfn``

source: ``heat-api`` component
fr: Le composant ``heat-api``

source: ``heat`` command-line client
fr: la ligne de commande client ``heat``

source: ``nova-api-metadata`` service
fr: service ``nova-api-metadata``

source: ``nova-api`` service
fr: service ``nova-api``

source: ``nova-cert`` daemon
fr: démon ``nova-cert``

source: ``nova-cert`` module
fr: module ``nova-cert``
pt_br: módulo ``nova-cert``

source: ``nova-compute`` service
fr: service ``nova-compute``

source: ``nova-conductor`` module
fr: module ``nova-conductor``

source: ``nova-consoleauth`` daemon
fr: démon ``nova-consoleauth``

source: ``nova-network worker`` daemon
fr: démon ``nova-network worker``

source: ``nova-novncproxy`` daemon
fr: démon ``nova-novncproxy``

source: ``nova-scheduler`` service
fr: service ``nova-scheduler``

source: ``nova-spicehtml5proxy`` daemon
fr: démon ``nova-spicehtml5proxy``

source: ``nova-xvpvncproxy`` daemon
fr: démon ``nova-xvpvncproxy``

source: ``nova`` client
fr: client ``nova``

source: absolute limit
fr: limite absolue
pt_br: limite absoluto

source: access control list
fr: liste du contrôle d'accès
pt_br: lista de controle de acesso

source: access key
fr: clef d’accès
pt_br: chave de acesso

source: account
fr: compte
pt_br: conta

source: account auditor
fr: auditeur de compte

source: account database
fr: compte base de donnée

source: account reaper
fr: faucheur de compte

source: account server
fr: serveur de compte

source: account service
fr: service de compte
pt_br: serviço de conta

source: accounting
fr: comptabilisation

source: active/active configuration
fr: configuration actif/actif
pt_br: configuração ativo/ativo

source: active/passive configuration
fr: configuration active/passive
pt_br: configuração ativo/passivo

source: address pool
fr: groupe d'adresses
pt_br: pool de endereços

source: admin API
fr: API admin

source: admin server
fr: serveur administrateur

source: alert
fr: alerte
pt_br: alerta

source: allocate
fr: allouer

source: applet
fr: appliquette

source: application server
fr: Serveur d'applications

source: arptables
fr: tables arp

source: associate
fr: associer

source: attach
fr: attacher

source: attachment (network)
fr: attachement (réseau)
pt_br: anexo (rede)

source: auditor
fr: auditeur

source: auth node
fr: node d'authentification

source: authentication
fr: authentification

source: authentication token
fr: jeton d'authentification

source: authorization
fr: autorisation

source: authorization node
fr: nœud d'autorisation

source: availability zone
fr: zone de disponibilité

source: back-end catalog
fr: catalogue de back-end

source: backup restore and disaster recovery as a service
fr: récupération de sauvegarde et récupération d'urgence en tant que service

source: base image
fr: image de base

source: binary
fr: binaire

source: bits per second (BPS)
fr: bits par seconde (BPS)

source: block device
fr: périphérique de bloc

source: block migration
fr: migration de blocs

source: bootable disk image
fr: image de disque bootable

source: browser
fr: navigateur

source: builder file
fr: fichier générateur

source: button class
fr: classe de boutons

source: byte
fr: octet

source: capability
fr: capacité

source: capacity cache
fr: cache de capacité

source: capacity updater
fr: actualiseur de capacité

source: catalog
fr: catalogue

source: catalog service
fr: service de catalogue

source: cell
fr: cellule

source: cell forwarding
fr: envoi de cellule

source: cell manager
fr: gestionnaire de cellules

source: certificate authority
fr: autorité de certification

source: chance scheduler
fr: schéduler de chance

source: changes since
fr: changements depuis

source: child cell
fr: cellule enfant

source: cinder-backup daemon
fr: démon cinder-backup
pt_br: daemon cinder-backup

source: cinder-scheduler daemon
fr: démon cinder-scheduler
pt_br: daemon cinder-scheduler

source: cloud architect
fr: architecte cloud

source: cloud controller
fr: contrôleur de cloud

source: cloud controller node
fr: nœud de contrôleur de cloud

source: cloudpipe image
fr: image cloudpipe

source: command filter
fr: filtre de commande

source: community project
fr: projet communautaire

source: compute controller
fr: contrôleur de compute

source: compute host
fr: Hôte de compute

source: compute node
fr: nœud de compute

source: compute worker
fr: worker de Compute

source: concatenated object
fr: objet concaténé

source: console log
fr: journal de la console

source: container
fr: conteneur

source: container auditor
fr: auditeur de conteneur

source: container database
fr: base de donnée de conteneur

source: container format
fr: format de conteneur

source: container server
fr: serveur de conteneur

source: container service
fr: service de conteneur

source: content delivery network (CDN)
fr: CDN (content delivery network)

source: controller node
fr: nœud contrôleur

source: core API
fr: API principale

source: cost
fr: coût

source: credentials
fr: informations d'identification

source: current workload
fr: charge de travail actuelle

source: customer
fr: client

source: customization module
fr: module de personnalisation

source: dashboard
fr: tableau de bord
