Repository: 25hours/openstack-manuals
Catalog: doc/common-rst/source/locale/*/LC_MESSAGES/common-rst.po
Languages: fr, pt_br

source: **CentOS, Fedora, and Red Hat Enterprise Linux:** https://www.rdoproject.org/
fr: **CentOS, Fedora, et Red Hat Enterprise Linux:** https://www.rdoproject.org/
pt_br: **CentOS, Fedora, e Red Hat Enterprise Linux:** https://www.rdoproject.org/

source: **Credential errors, 401, and 403 forbidden errors**
fr: ''Image:Tableau de projet ''Erreurs d'instannce'' **MacOS** ""Exemple de proces de fluite''

source: A BLOB of data held by Object Storage; can be in any format.
fr: BLOB de données détenu par un Stockage d'objets ; peut être dans n'importe quel format.

source: A Block Storage component that creates, attaches, and detaches persistent storage volumes.
fr: Composant de stockage par blocs qui créé, attache, et détache des volumes de stockage persistants.

source: A Block Storage node that runs the cinder-volume daemon.
fr: Un nœud de Stockage par Bloc qui fait tourner le daemon cinder-volume.

source: A CLI that communicates with the heat-api to run AWS CloudFormation APIs. End developers can directly use the Orchestration REST API.
fr: Une interface CLI qui communique avec heat-api pour exécuter les API AWS CloudFormations. Les développeurs peuvent utiliser l'API REST d'Orchestration.

source: A Ceph component that communicates with external clients, checks data state and consistency, and performs quorum functions.
fr: Composant Ceph qui communique avec des clients externes, vérifie l'état et l'homogénéité des données, et qui effectue des fonctions de quorum.

source: A Compute API parameter that downloads changes to the requested item since your last request, instead of downloading a new, fresh set of data and comparing it against the old data.
fr: Un paramètre d'API de Compute qui télécharge les changements apportés à l'élément demandé depuis la dernière requête, au lieu de télécharger un nouvel ensemble de données actualisées en les comparant aux anciennes données.

source: A Compute RabbitMQ message queue that remains active when the server restarts.
fr: Une file d'attente de messages de Compute RabbitMQ qui demeure active quand le serveur démarre à nouveau.

source: A Compute RabbitMQ setting that determines whether a message exchange is automatically created when the program starts.
fr: Paramètre Compute RabbitMQ qui détermine si un échange de messages est créé automatiquement quand le programme démarre.

source: A Compute back-end database table that contains the current workload, amount of free RAM, and number of VMs running on each host. Used to determine on which VM a host starts.
fr: Un tableau de base de données de back-end de Compute qui contient la charge de travail actuelle, la quantité de RAM disponible, et le nombre de VM exécutant sur chaque hôte. Utilisé pour déterminer sur quelle VM l'hôte démarre.

source: A Compute component that determines where VM instances should start. Uses modular design to support a variety of scheduler types.
fr: Composant de Compute qui détermine quelles instances de VM doivent démarrer. Utilise un design modulaire pour supporter une variété de types de planificateurs.

source: A Compute component that enables OpenStack to communicate with Amazon EC2.
fr: Composant de Compute qui permet à OpenStack de communiquer avec Amazon EC2.

source: A Compute component that manages IP address allocation, firewalls, and other network-related tasks. This is the legacy networking option and an alternative to Networking.
fr: Un composant Compute qui gère l'allocation d'adresses IP, les pare-feux, et autres tâches liées au réseautage. Il s'agit d'une option de réseautage ancien, qui constitue une alternative à Networking.

source: A Compute component that provides users access to the consoles of their VM instances through VNC or VMRC.
fr: Composant Compute qui permet aux utilisateurs d’accéder aux consoles de leurs instances via VNC ou VMRC.

source: A Compute daemon that orchestrates the network configuration of nodes, including IP addresses, VLANs, and bridging. Also manages routing for both public and private networks.
fr: Démon de Compute qui orchestre la configuration des nœuds de réseau, y compris les adresses IP, les VLAN et le pontage. Gère également le routage des réseaux publiques et privés à la fois.

source: A Compute networking method where the OS network configuration information is injected into the VM image before the instance starts.
fr: Méthode de réseautage de Compute pour laquelle les informations de configuration de réseau SE sont injectées dans un image de VM avant que l'instance ne démarre.

source: A Compute option that enables parent cells to pass resource requests to child cells if the parent cannot provide the requested resource.
fr: Une option de Compute qui permet aux cellules parent de passer des requêtes de ressources à des cellules enfant si le parent ne peut pas fournir la ressource demandée.

source: A Compute process that determines the suitability of the VM instances for a job for a particular host. For example, not enough RAM on the host, too many CPUs on the host, and so on.
fr: Process Compute qui détermine l'aptitude des instances de VM pour un travail sur un host particulier. Par example, pas assez de RAM sur le host, trop de CPUs sur le host, et ainsi de suite.

source: A Debian-based Linux distribution.
fr: Une distribution Linux basé sur Debian.

source: A Java program that can be embedded into a web page.
fr: Un programme Java pouvant être embarqué dans une page web.

source: A Linux distribution compatible with OpenStack.
fr: Distribution Linux compatible avec OpenStack

source: A Linux distribution that is compatible with OpenStack.
fr: Distribution Linux compatible avec OpenStack.

source: A Networking extension that provides perimeter firewall functionality.
fr: Extension de Networking qui fournit la fonctionnalité de pare-feu de périmètre.

source: A Networking plug-in for Cisco devices and technologies, including UCS and Nexus.
fr: Un plug-in réseau pour les devices et technologies Cisco , incluant UCS et Nexus.

source: A SQLite database that contains Object Storage accounts and related metadata and that the accounts server accesses.
fr: Une base de données SQLite qui contient des comptes Object Storage et les métadonnées associées et auquelles le serveur de comptes accède.

source: A SQLite database that stores Object Storage containers and container metadata. The container server accesses this database.
fr: Base de données SQLite qui stocke des conteneurs d'Object Store et des métadonnées de conteneur. Le serveur du conteneur accède à cette base de donnée.

source: A Shared File Systems service that provides a stable RESTful API. The service authenticates and routes requests throughout the Shared File Systems service. There is python-manilaclient to interact with the API.
fr: Le service de Systèmes de fichiers partagés qui fournit un API RESTful stable. Le service authentifie et dirige les requêtes par le service de Systèmes de fichiers partagés. Un client python-manila communique avec l'API.

source: A VM image that does not save changes made to its volumes and reverts them to their original state after the instance is terminated.
fr: Image de VM qui ne sauvegarde pas les changements faits à ses volumes et les remet à leur état d'origine quand la VM est terminée.

source: A VM instance that runs on a host.
fr: Une instance de VM qui exécute sur un hôte.

source: A VM state where no changes occur (no changes in memory, network communications stop, etc); the VM is frozen but not shut down.
fr: L'état d'une VM où aucun changement ne s'exécute (aucune modification de la mémoire, arrêt des échanges réseau, etc.) ; la VM est gelée mais pas arrêtée.

source: A Windows project providing guest initialization features, similar to cloud-init.
fr: Projet windows permettant l'initialisation de VM guest, similaire à cloud-init.

source: A XenAPI component that provides a pluggable interface to support a wide variety of persistent storage back ends.
fr: Un composant XenAPI qui fournit une interface d'extension qui supporte un ensemble de backends de stockage persistant.

source: A bit is a single digit number that is in base of 2 (either a zero or one). Bandwidth usage is measured in bits per second.
fr: Un bit est un nombre a un seul chiffre en base 2 (soit zéro ou un). L'utilisation de la bande passante est mesurée en bits par seconde.

source: A central agent (``ceilometer-agent-central``)
fr: Un agent central (``ceilometer-agent-central``)

source: A central hub for passing messages between daemons. Usually implemented with `RabbitMQ <http://www.rabbitmq.com/>`__, but can be implemented with an AMQP message queue, such as `Apache Qpid <http://qpid.apache.org/>`__ or `Zero MQ <http://www.zeromq.org/>`__.
fr: Un point nodal pour la transmission des messages entre les démons. Généralement implémenté par `RabbitMQ <http://www.rabbitmq.com/>`__, mais peut aussi l'être par une file d'attente de messagerie `Apache Qpid <http://qpid.apache.org/>`__ ou `Zero MQ <http://www.zeromq.org/>`__.

source: A centralized server provides authentication and authorization services using a RESTful interface.
fr: Un serveur centralisé fournit des services d'authentification et d'autorisation par l'intermédiaire d'une interface RESTful.

source: A cli tool used to retrieve various metrics and telemetry information about a cluster that has been collected by the swift-recon middleware.
fr: Outil d'interface cli qui sert à extraire divers métriques ou informations télémétriques d'un cluster qui auront été recueillis par le middleware swift-recon.

source: A collection of command-line tools for administering VMs; most are compatible with OpenStack.
fr: Un ensemble d'outils de ligne de commande pour administrer les VM ; la plupart sont compatibles avec OpenStack.

source: A collection of components that provides object storage within Ceph. Similar to OpenStack Object Storage.
fr: Ensemble de composants qui procurent Ceph au stockage d'objets. Ressemble au Stockage d'objets d'OpenStack.

source: A collection of files for a specific operating system (OS) that you use to create or rebuild a server. OpenStack provides pre-built images. You can also create custom images, or snapshots, from servers that you have launched. Custom images can be used for data backups or as "gold" images for additional servers.
fr: Un ensemble de fichiers pour un système d'exploitation spécifique (SE) qui permet de créer ou de reconstruire un serveur. OpenStack fournit des images prédéfinies. Vous pouvez également créer des images personnalisées, ou des instantanés, de serveurs que vous avez créés. Des images personnalisées peuvent être utilisées pour les sauvegardes de données ou sous forme d'images « gold » pour des serveurs supplémentaires.

source: A collection of hypervisors grouped together through host aggregates.
fr: Collection d'hyperviseurs groupés ensemble par des agrégats d'hôtes.

source: A collection of servers that can share IPs with other members of the group. Any server in a group can share one or more public IPs with any other server in the group. With the exception of the first server in a shared IP group, servers must be launched into shared IP groups. A server may be a member of only one shared IP group.
fr: Une collection de serveurs qui peuvent partager des IP avec d'autres membres du groupe. N'importe quel serveur dans un groupe peut partager un ou plusieurs IP publiques avec les autres serveurs du groupe. À l'exception du premier serveur d'une groupe d'IP partagées, les serveurs doivent être lancés dans des groupes d'IP partagées. Un serveur peut être membre d'un seul groupe d'IP partagées.

source: A collection of specifications used to access a service, application, or program. Includes service calls, required parameters for each call, and the expected return values.
fr: Un ensemble de spécifications utilisées pour accéder à un service, une application ou un programme. Cela inclut les appels aux services, les paramètres requis sur chaque appel, ainsi que les valeurs renvoyées attendues.

source: A collector (``ceilometer-collector``)
fr: Un collecteur (``ceilometer-collector``)

source: A community project may be elevated to this status and is then promoted to a core project.
fr: Un projet communautaire pouvant être élevé à ce statut, et qui peut ensuite être promus comme projet de base principal.

source: A compute agent (``ceilometer-agent-compute``)
fr: Un agent de calcul (``ceilometer-agent-compute``)

source: A compute service that creates VPNs on a per-project basis.
fr: Service de compute qui créé des VPN par projet.

source: A configurable option within Object Storage to automatically delete objects after a specified amount of time has passed or a certain date is reached.
fr: Option configurable du Stockage d'objets qui supprime automatiquement les objets après une certaine durée ou après une certaine date.

source: A content delivery network is a specialized network that is used to distribute content to clients, typically located close to the client for increased performance.
fr: Un CDN est un réseau de distribution de contenu spécialisé qui est utilisé pour distribuer des contenus à des clients, et qui sont normalement situés proches du client pour des soucis de performance.

source: A controlled reboot where a VM instance is properly restarted through operating system commands.
fr: Redémarrage logiciel pour lequel une instance de VM est redémarrée correctement via les commandes du système d'exploitation.

source: A core OpenStack project that provides a network connectivity abstraction layer to OpenStack Compute.
fr: Projet de base d'OpenStack qui fournit une couche d'abstraction à la connectivité réseau de Compute d'OpenStack.

source: A core OpenStack project that provides block storage services for VMs.
fr: Projet OpenStack qui fournit les services de stockage par bloc pour les VM.

source: A core project that provides the OpenStack Image service.
fr: Projet qui fournit le service d'images OpenStack

source: A default role in the Compute RBAC system that can quarantine an instance in any project.
fr: Un rôle par défaut du système RBAC de Compute qui peut mettre une instance de projet en quarantaine.

source: A device that moves data in the form of blocks. These device nodes interface the devices, such as hard disks, CD-ROM drives, flash drives, and other addressable regions of memory.
fr: Un périphérique qui déplace les données sous forme de blocs. Ces nœuds de périphériques servent d'interface à des périphériques comme les disques durs, les lecteurs de CD-ROM, les lecteurs flash, et autres régions adressables de la mémoire.

source: A directory service, which allows users to login with a user name and password. It is a typical source of authentication tokens.
fr: Service de répertoire, qui permet aux utilisateurs de se connecter avec un nom d'utilisateur et un mot de passe. Source typique de jetons d'authentification.

source: A discrete OpenStack environment with dedicated API endpoints that typically shares only the Identity (keystone) with other regions.
fr: Environnement d'OpenStack discret composé de points de terminaison d'API, qui partage normalement l'Identité (keystone) uniquement avec d'autres régions.

source: A disk storage protocol tunneled within Ethernet.
fr: Protocole de stockage disque tunnelé à travers Ethernet.

source: A distributed memory object caching system that is used by Object Storage for caching.
fr: Un système de mise en cache d'objets de mémoire distribuée utilisé par le stockage d'objets pour la mise en cache.

source: A distributed, highly fault-tolerant file system designed to run on low-cost commodity hardware.
fr: Un système de fichiers distribués, à haute tolérance de pannes, conçu pour exécuter sur du matériel de moindre coût.

source: A domain within a parent domain. Subdomains cannot be registered. Subdomains enable you to delegate domains. Subdomains can themselves have subdomains, so third-level, fourth-level, fifth-level, and deeper levels of nesting are possible.
fr: Un domaine qui se trouve dans un domaine parent. Les sous-domaines ne peuvent pas être enregistrés. Les sous-domaines vous permettent de déléguer des domaines. Les sous-domaines peuvent avoir eux-mêmes des sous-domaines, sont des imbrications de tierce, quatrième ou cinquième niveau sont possibles.

source: A driver for the Modular Layer 2 (ML2) neutron plug-in that provides layer-2 connectivity for virtual instances. A single OpenStack installation can use multiple mechanism drivers.
fr: Pilote du plug-in neutron ML2 (Modular Layer 2), qui fournit la connectivité layer-2 aux instances virtuelles. Une simple installation OpenStack peut utiliser plusieurs pilotes de mécanismes.

source: A feature of Compute that allows the unprivileged "nova" user to run a specified list of commands as the Linux root user.
fr: Fonctionnalité de Compute qui permet à un utilisateur « nova » sans privilège d'exécuter une liste de commandes spécifiée en tant qu'utilisateur root.

source: A feature of the load-balancing service. It attempts to force subsequent connections to a service to be redirected to the same node as long as it is online.
fr: Fonctionnalité de service de répartition des charges. Il tente de forcer des connexions qui font suite à un service à être redirigées vers le même nœud tant que celui-ci est en ligne.

source: A file sharing protocol. It is a public or open variation of the original Server Message Block (SMB) protocol developed and used by Microsoft. Like the SMB protocol, CIFS runs at a higher level and uses the TCP/IP protocol.
fr: Protocole de partage de fichiers. Variation publique ou open du protocole d'origine SMB (Server Message Block) développé et utilisé par Microsoft. À la manière du protocole SMB, CIFS exécute à un niveau supérieur et utilise le protocole TCP/IP.

source: A file system designed to aggregate NAS hosts, compatible with OpenStack.
fr: Un système de fichiers qui combine les hôtes NAS, compatible avec OpenStack.

source: A file used to customize a Compute instance. It can be used to inject SSH keys or a specific network configuration.
fr: Fichier utilisé pour personnaliser une instance de Compute. Peut être utilisé pour injecter des clés SSH ou une configuration de réseau spécifique.

source: A great way to get answers and insights is to post your question or problematic scenario to the OpenStack mailing list. You can learn from and help others who might have similar issues. To subscribe or view the archives, go to http://lists.openstack.org/cgi-bin/mailman/listinfo/openstack. You might be interested in the other mailing lists for specific projects or development, which you can find `on the wiki <https://wiki.openstack.org/wiki/MailingLists>`__. A description of all mailing lists is available at https://wiki.openstack.org/wiki/MailingLists.
fr: Un excellent moyen d'obtenir des réponses ou des idées est de poster votre question ou votre problématique de scénario à la liste de diffusion OpenStack. Vous pouvez apprendre et aider d'autres personnes qui pourraient avoir des problèmes similaires. Pour vous abonner ou consulter les archives, conculter http://lists.openstack.org/cgi-bin/mailman/listinfo/openstack. Vous pourriez être intéressé par les autres listes de diffusion pour des projets spécifiques ou de développement, que vous pourrez trouver 'sur le wiki < d'https://wiki.openstack.org/wiki/MailingLists >' __. Vous trouverez une description de toutes les listes de diffusion à l'adresse suivante : https://wiki.openstack.org/wiki/MailingLists.

source: A group of fixed and/or floating IP addresses that are assigned to a project and can be used by or assigned to the VM instances in a project.
fr: Un groupe d'adresses IP fixes et/ou flottantes qui peuvent être assignées à un projet et qui peuvent être utilisées ou assignées aux instances de VM dans un projet.

source: A group of interrelated web development techniques used on the client-side to create asynchronous web applications. Used extensively in horizon.
fr: Un groupe de techniques de développement web inter-associées qui sont utilisées côté client pour créer des applications web asynchrones. Largement utilisé dans Horizon.

source: A group of related button types within horizon. Buttons to start, stop, and suspend VMs are in one class. Buttons to associate and disassociate floating IP addresses are in another class, and so on.
fr: Un groupe de types de boutons en rapport les uns avec les autres dans horizon. Les boutons pour démarrer, arrêter ou suspendre les VM appartiennent à une classe. Les boutons pour associer et dissocier les adresses IP sont dans une autre classe, et ainsi de suite.

source: A group of users; used to isolate access to Compute resources. An alternative term for a project.
fr: Un groupe d'utilisateurs; utilisé pour isoler l'accès aux ressources Compute. Une autre expression pour projet.

source: A grouped release of projects related to OpenStack that came out in April 2012, the fifth release of OpenStack. It included Compute (nova 2012.1), Object Storage (swift 1.4.8), Image (glance), Identity (keystone), and Dashboard (horizon). Essex is the code name for the fifth release of OpenStack. The design summit took place in Boston, Massachusetts, US and Essex is a nearby city.
fr: Livraison groupée de projets OpenStack sortis en avril 2012, la cinquième sortie d'OpenStack. Elle incluait Compute (nova 2012.1), Object Storage (swift 1.4.3), Image (glance), et Identity (keytone), et Dashboard (horizon). Essex est le nom de code de la cinquième sortie d'OpenStack. Le sommet de design a eu lieu à Boston, dans le Massachussetts, USA et Essex est une ville qui se trouve non loin de cet endroit.

source: A grouped release of projects related to OpenStack that came out in February of 2011. It included only Compute (nova) and Object Storage (swift). Bexar is the code name for the second release of OpenStack. The design summit took place in San Antonio, Texas, US, which is the county seat for Bexar county.
fr: Un ensemble de projets liés à OpenStack qui sont sortis en février 2011. Inclut seulement Compute (nova) et Object Storage (swift). Bexar est le nom de code de la deuxième sortie d'OpenStack. Le sommet de design a eu lieu à San Antonio, au Texas, qui est le siège de comté pour le comté du Bexar.

source: A grouped release of projects related to OpenStack that came out in the fall of 2011, the fourth release of OpenStack. It included Compute (nova 2011.3), Object Storage (swift 1.4.3), and the Image service (glance). Diablo is the code name for the fourth release of OpenStack. The design summit took place in in the Bay Area near Santa Clara, California, US and Diablo is a nearby city.
fr: Livraison groupée de projets OpenStack sortis à l'automne 2011, la quatrième version d'OpenStack. Elle incluait Compute (nova 2011.3), Object Storage (swift 1.4.3), et le service Image (glance). Diablo est le nom de code de la quatrième sortie d'OpenStack. Le sommet de conception a eu lieu dans la région Bay Area non loin de Santa Clara, en Californie, USA et Diablo est une ville qui se trouve non loin de cet endroit.
