Repository: 25hours/openstack-manuals
Catalog: doc/common-rst/source/locale/*/LC_MESSAGES/common-rst.po
Languages: fr, pt_br

source: Plugs and unplugs ports, creates networks or subnets, and provides IP addressing. These plug-ins and agents differ depending on the vendor and technologies used in the particular cloud. OpenStack Networking ships with plug-ins and agents for Cisco virtual and physical switches, NEC OpenFlow products, Open vSwitch, Linux bridging, and the VMware NSX product.
fr: Se connecte et se déconnecte de ports, crée des réseaux ou des sous-réseaux, et fournit l'adressage IP. Ces plug-ins et agents diffèrent selon le vendeur et les technologies utilisées selon le cloud. OpenStack Networking est livré avec des plug-ins et avec des agents pour commutateurs physiques et virtuels Cisco, les produits NEC OpenFlow, Open vSwitch, le pontage Linux et VMware NSX.

source: Point in time since the last container and accounts database sync among nodes within Object Storage.
fr: Dernière date de sync de la base de données des comptes et conteneurs parmi les noeuds du Stockage d'objets.

source: Principal communications protocol in the internet protocol suite for relaying datagrams across network boundaries.
fr: Protocole de communication principal faisant partie d'une suite de protocoles d'internet qui servent à relayer des datagrammes à travers tout le réseau.

source: Processes client requests for VMs, updates Image service metadata on the registry server, and communicates with the store adapter to upload VM images from the back-end store.
fr: Traite les requêtes des clients pour les VM, met à jour les métadonnées du service Image sur le serveur de registre, et communique avec l'adaptateur de store pour télécharger des images de VM du back-end store.

source: Processing is fairly complex. Basically, the daemon accepts actions from the queue and performs a series of system commands such as launching a KVM instance and updating its state in the database.
fr: Le traitement est assez complexe. Pour résumer, le démon accepte des actions en provenance d'une file d'attente et exécute une série de commandes système, comme lancer une instance KVM ou mettre à jour son état dans la base de données.
pt_br: O processamento é bastante complexo. Basicamente, o daemon aceita ações da fila e realiza uma série de comandos de sistema, tais como lançar uma instância de KVM e carregar seu status na base de dados.

source: Programming language used extensively in OpenStack.
fr: Le langage de programmation utilisé largement dans OpenStack.

source: Project name for OpenStack Network Information Service. To be merged with Networking.
fr: Nom de projet d'un Service d'informations de réseau OpenStack. À merger avec Networking.

source: Projects
fr: Les projets
pt_br: Projetos

source: Projects represent the base unit of “ownership” in OpenStack, in that all resources in OpenStack should be owned by a specific project. In OpenStack Identity, a project must be owned by a specific domain.
fr: Les projets constituent l'unité de base de « propriété » dans OpenStack, dans le sens, ou toutes les ressources d'OpenStack doivent faire partie d'un projet particulier. Dans le service Identité d'OpenStack, un projet doit appartenir à un domaine particulier.

source: Protocol that encapsulates a wide variety of network layer protocols inside virtual point-to-point links.
fr: Protocole qui comprend un grand nombre de protocoles de couches de réseaux dans des liens virtuels point-à-points.

source: Provide as much detail as possible in the description. Paste in your command output or stack traces, links to screen shots, and any other information which might be useful.
fr: Donner le plus de détails possibles dans la description. Coller votre sortie de commande ou les traces de pile, les liens d'instantanés, ou toute autre information qui puisse être utile.
pt_br: Forneça o máximo possível de detalhes na descrição. Cole sua saída de comando ou rastreamentos de pilha, links para capturas de tela, e qualquer outra informação que possa ser útil.

source: Provided in Compute through the system usage data facility.
fr: Fourni dans Compute par la fonctionnalité pour obtenir des données d'utilisation système.

source: Provides a method of allocating space on mass-storage devices that is more flexible than conventional partitioning schemes.
fr: Fournit une méthode d'allocation d'espaces sur les périphériques de stockage en masse de façon plus flexible que les schéma de partitionnement traditionnels.

source: Provides a predefined list of actions that the user can perform, such as start or stop VMs, reset passwords, and so on. Supported in both Identity and Compute and can be configured using the horizon dashboard.
fr: Fournit une liste prédéfinie d'actions à l'utilisateur, comme le démarrage ou l'arrêt des VM, le changement de mots de passe, etc. Pris en charge à la fois dans le service Identité et Compute ; peut être configuré avec le tableau de bord d'horizon.

source: Provides a proxy for accessing running instances through a SPICE connection. Supports browser-based HTML5 client.
fr: Fournit un proxy pour accéder aux instances en cours d'exécution par l'intermédiaire d'une connexion SPICE. Supporte les clients HTML5 basés navigateur.
pt_br: Fornece um proxy para acesso às instâncias em execução através de uma conexão SPICE. Suporta cliente HTML5 baseado em navegador web.

source: Provides a proxy for accessing running instances through a VNC connection. Supports an OpenStack-specific Java client.
fr: Fournit un proxy pour accéder aux instances en cours d'exécution par l'intermédiaire d'une connexion VNC. Supporte un client Java spécifique à OpenStack.
pt_br: Fornece um proxy para acesso às instâncias em execução através de uma conexão VNC. Suporta cliente Java especifico para OpenStack.

source: Provides a proxy for accessing running instances through a VNC connection. Supports browser-based novnc clients.
fr: Fournit un proxy pour accéder aux instances en cours d'exécution par l'intermédiaire d'une connexion VNC. Supporte les clients novnc basés navigateur.
pt_br: Fornece um proxy para acesso à instâncias em execução através de uma conexão VNC. Suporta clientes novnc baseados em navegador web.

source: Provides an interface to the underlying Open vSwitch service for the Networking plug-in.
fr: Fournit une interface au service Open vSwitch du plug-in Networking.

source: Provides data redundancy and fault tolerance by creating copies of Object Storage objects, accounts, and containers so that they are not lost when the underlying storage fails.
fr: Procure un redondance des données et une tolérance de fautes en créant des copies des objets d'Object Storage, des comptes et des conteneurs, de façon à ce qu'ils ne se perdent pas en cas d'échec du stockage sous-jacent.

source: Provides logical partitioning of Compute resources in a child and parent relationship. Requests are passed from parent cells to child cells if the parent cannot provide the requested resource.
fr: Fournit un partitionnement logique des ressources de Compute dans un relation parent et enfant. Les requêtes passent des cellules parent à enfant si le parent ne fournit pas la ressource demandée.

source: Provides support for NexentaStor devices in Compute.
fr: Fournit un support aux périphériques NexentaStor de Compute.

source: Provides support for Open vSwitch in Networking.
fr: Fournit un support pour Open vSwitch dans Networking.

source: Provides support for VMware NSX in Neutron.
fr: Fournit le support de VMware NSX dans Neutron.

source: Provides to the consumer the ability to deploy applications through a programming language or tools supported by the cloud platform provider. An example of Platform-as-a-Service is an Eclipse/Java programming platform provided with no downloads required.
fr: Donne au consommateur la possibilité de déployer des applications à travers un langage de programmation ou des outils supportés par le fournisseur de plateforme cloud. Exemple de plateforme en tant que service : la plateforme de programmation Eclipse/Java fournie pour les téléchargements demandés.

source: Proxy servers (swift-proxy-server)
fr: Serveurs proxy (swift-proxy-server)

source: Publishes collected data to various targets including data stores and message queues.
fr: Publie les données collectées pour un certain nombre de cibles, comme des magasins de données ou des files d'attente.

source: QEMU is a generic and open source machine emulator and virtualizer. One of the hypervisors supported by OpenStack, generally used for development purposes.
fr: QEMU est un émulateur et un virtualisateur open source standard. Un des hyperviseurs pris en charge par OpenStack, utilisé normalement à buts de développement.

source: RAM filter
fr: Filtre RAM

source: RPC driver
fr: pilote RPC

source: RXTX quota
fr: quota RXTX

source: Rackspace Cloud Files
fr: Fichiers Rackspace Cloud

source: Reducing the size of files by special encoding, the file can be decompressed again to its original content. OpenStack supports compression at the Linux file system level but does not support compression for things such as Object Storage objects or Image service VM images.
fr: Réduire la taille des fichiers par un encodage spécial. Le fichier peut ensuite être décompressé vers son contenu d'origine. OpenStack supporte la compression au niveau du système de fichier Linux mais ne supporte pas la compression pour des choses comme les objets d'Object Storage ou les images de VM du service Image.

source: Released as open source by NASA in 2010 and is the basis for Compute.
fr: Lancé en tant qu'open source par NASA en 2010, et à la base de Compute.

source: Released as open source by Rackspace in 2010; the basis for Object Storage.
fr: Lancé en tant qu'open source par Rackspace en 2010 : à la base d'Object Storage.

source: Reliable, Autonomic Distributed Object Store
fr: Magasin d'objets distribué, atonome et fiable

source: Removes all data on the server and replaces it with the specified image. Server ID and IP addresses remain the same.
fr: Supprime toutes les données du serveur et les remplace par une image spécifique. Les adresses IP et l'ID du serveur restent les mêmes.

source: Represents a virtual, isolated OSI layer-2 subnet in Networking.
fr: Représente un sous-réseau virtuel, OSI layer-2 isolé dans Networking.

source: Reset the state of an instance
fr: Réinitialiser l'état d'une instance

source: Routes information between the Block Storage processes.
fr: Redirige les informations entre les processus de Stockage en blocs.

source: Runs automated tests against the core OpenStack API; written in Rails.
fr: Exécute des test automatiques sur l'API de base d'OpenStack ; écrit en Rails.

source: Runs on a central management server to poll for resource utilization statistics for resources not tied to instances or compute nodes. Multiple agents can be started to scale service horizontally.
fr: Fonctionne sur un serveur de gestion central pour scruter les statistiques d'utilisation des ressources qui ne sont pas liés à des instances ou à des nœuds de Compute. Plusieurs agents peuvent être lancés pour mettre un service à échelle horizontalement.

source: Runs on a central management server(s) and consumes messages from the message queue(s) to build event and metering data.
fr: Exécute sur serveur(s) central de gestion et consomme des messages en provenance de file(s) d'attente pour créer un événement et des données de contrôle.

source: Runs on central management server(s) and dispatches collected telemetry data to a data store or external consumer without modification.
fr: Fonctionne sur serveur (s) central de gestion et dépêche les données de télémétrie recueillies dans un magasin de données ou au consommateur externe sans modification.

source: Runs on each compute node and polls for resource utilization statistics. There may be other types of agents in the future, but for now our focus is creating the compute agent.
fr: Exécute sur chaque nœud de calcul et scrute les statistiques d'utilisation des ressources. Il pourrait y avoir d'autres types d'agents dans le futur, mais pour l'instant, nous nous concentrons sur la création de l'agent de calcul.
pt_br: Executa em cada nodo de computação e pesquisa por estatísticas de utilização de recursos. Pode haver outros tipos de agentes no futuro, mas para agora nosso foco é criar o agente de Computação.

source: Runs on one or more central management servers to allow alarms to be set based on the threshold evaluation for a collection of samples.
fr: Exécute sur serveur(s) central de gestion pour permettre aux alarmes d'être définies sur la base de l'évaluation d'une limite pour un ensemble d'exemples.

source: Runs on one or more central management servers to determine when alarms fire due to the associated statistic trend crossing a threshold over a sliding time window.
fr: Exécute sur un ou plusieurs serveur(s) central de gestion pour déterminer quand une alarme se déclenche pour cause de tendance statistique associée dépassant une limite de plage d'horaire flexible.

source: Runs on one or more central management servers to provide data access from the data store.
fr: Exécute sur serveur(s) central de gestion pour fournir accès à des données en provenance de magasins de données.

source: SAML assertion
fr: Assertion SAML

source: SINA standard that defines a RESTful API for managing objects in the cloud, currently unsupported in OpenStack.
fr: Standard SINA qui définit un API RESTful pour gérer des objets dans le cloud, non supporté actuellement dans OpenStack.

source: SQL database
fr: Base de données SQL
pt_br: Banco de dados SQL

source: Script that initializes the building of the ring file, takes daemon names as parameter and offers commands. Documented in http://docs.openstack.org/developer/swift/admin_guide.html#managing-services.
fr: Script qui initialise la création du fichier d'anneaux, qui prend les noms du démon comme paramètres et qui propose des commandes. Documenté dans http://docs.openstack.org/developer/swift/admin_guide.html#managing-services.

source: See API endpoint.
fr: Voir le point de terminaison d'API

source: See access control list.
fr: Voir la liste du contrôle d'accès.
pt_br: Veja lista de controle de acesso

source: Selects the optimal storage provider node on which to create the volume. A similar component to the nova-scheduler.
fr: Sélectionner le nœud de fournisseur de stockage optimal sur lequel créer le volume. Composant similaire à nova-scheduler.

source: Server
fr: Serveur
pt_br: Servidor

source: Set of bits that make up a single character; there are usually 8 bits to a byte.
fr: Ensemble de bits composant un caractère; il y a en général 8 bits dans un octet.

source: Setting for the Compute RabbitMQ message delivery mode; can be set to either transient or persistent.
fr: Paramètre du mode de distribution de messages Compute RabbitMQ ; peut être défini à temporaire ou à persistant.

source: Shared File Systems API
fr: API de Systèmes de fichiers partagés

source: Shared File Systems service
fr: service Shared File Systems

source: Similar to the nova-compute service, accepts networking tasks from the queue and manipulates the network. Performs tasks such as setting up bridging interfaces or changing IPtables rules.
fr: Similaire au service nova-compute, accepte les tâches de réseautage de la file d'attente et manipule le réseau. Effectue des tâches comme la mise en place d'interfaces de pontage ou changer les règles d'iptables.

source: Simple Cloud Identity Management (SCIM)
fr: SCIM (Simple Cloud Identity Management )

source: Soft limit on the amount of network traffic a Compute VM instance can send and receive.
fr: Limite relative du montant de trafic réseau qu'une instance de VM de Compute peut envoyer ou recevoir.

source: Software Development Lifecycle Automation service
fr: Service Software Development Lifecycle Automation

source: Software component providing the actual implementation for Networking APIs, or for Compute APIs, depending on the context.
fr: Composants de logiciels fournissant l'implémentation des API de Networking, ou pour les API de Compute, selon le contexte.

source: Software that arbitrates and controls VM access to the actual underlying hardware.
fr: Logiciel qui arbitre et contrôle l'accès à la VM au matériel sous-jacent existant.

source: Software that enables multiple VMs to share a single physical NIC within Compute.
fr: Logiciel qui permet à plusieurs VM de partager un NIC physique unique dans Compute.

source: Software that runs on a host or node and provides the features and functions of a hardware-based network switch.
fr: Logiciel qui s’exécute sur un hôte ou un nœud et fournit les caractéristiques et fonctionnalités d'une switch réseau matériel.

source: SolidFire Volume Driver
fr: Pilote de volume SolidFire

source: Some tips:
fr: Quelques conseils :
pt_br: Algumas dicas:

source: Something you must be aware of before proceeding.
fr: Ce que vous devez savoir avant de commencer.
pt_br: Algo que você deve estar ciente antes de continuar.

source: Special tenant that contains all services that are listed in the catalog.
fr: Client spécial qui contient tous les services listés dans le catalogue.

source: Specification for managing identity in the cloud, currently unsupported by OpenStack.
fr: Spécification de gestion d'identités dans le cloud. N'est pas actuellement pris en charge par OpenStack.

source: Specifies additional requirements when Compute determines where to start a new instance. Examples include a minimum amount of network bandwidth or a GPU.
fr: Indique des conditions préalables supplémentaires quand Compute détermine où démarrer une nouvelle instance. Le montant miniium de bande passante ou un GPU en sont des exemples.

source: Specifies the authentication source used by Image service or Identity.
fr: Indique si la source de l'authentification est utilisée par le service Image ou Identité.

source: Standard for packaging VM images. Supported in OpenStack.
fr: Standard de packaging d'images de VM. Pris en charge par OpenStack.

source: Storage protocol similar in concept to TCP/IP; encapsulates SCSI commands and data.
fr: Protocole de stockage qui ressemble au concept de TCP/IP, et qui encapsule les commandes et les données SCSI.

source: Storage protocol that encapsulates SCSI frames for transport over IP networks.
fr: Protocole de stockage qui englobe les trames SCSI pour le transport sur réseaux IP.

source: Storage repository for image files
fr: Référentiel de stockage de fichiers d'images

source: Storage ring build and rebalance utility. Documented in http://docs.openstack.org/developer/swift/admin_guide.html#managing-the-rings.
fr: Utilitaire de rééquilibrage et de création d'anneaux de stockage. Documenté dans http://docs.openstack.org/developer/swift/admin_guide.html#managing-the-rings.

source: Stores CephFS metadata.
fr: Stocke des métadonnées CephFS

source: Stores image metadata and you can choose your database depending on your preference. Most deployments use MySQL or SQLite.
fr: Stocke les métadonnées d'image et vous pouvez choisir votre base de données selon vos préférences. La plupart des déploiements utilisent MySQL ou SQLite.

source: Stores most build-time and run-time states for a cloud infrastructure, including:
fr: Stocke la plupart des états de build-time et de run-time d'une infrastructure cloud, y compris :
pt_br: Armazena a maioria do status de tempo de construção e tempo de execução para uma infraestrutura de cloud, incluindo:

source: Stores, processes, and retrieves metadata about images. Metadata includes items such as size and type.
fr: Stocke, traite et extrait des métadonnées d'images. Les métadonnées incluent des éléments comme la taille ou le type.

source: String of text known only by the user; used along with an access key to make requests to the Compute API.
fr: Chaîne de texte connue par l'utilisateur. Utilisée avec une clé d'accès pour envoyer des requêtes à l'API de Compute.

source: Subdivides physical CPUs. Instances can then use those divisions.
fr: Subdivise des CPUs physiques. Les instances peuvent ensuite utiliser ces divisions.

source: Supports interaction with VMware products in Compute.
fr: Supporte l'intégration avec les produits VMware dans Compute.

source: Takes a virtual machine instance request from the queue and determines on which compute server host it runs.
fr: Prend une demande d'instance de machine virtuelle de la file d'attente et détermine sur quel hôte de serveur Compute elle exécute.
pt_br: Toma uma requisição de instância de máquina virtual e determina em qual host do servidor de computação ela roda.

source: Telemetry
fr: Télémétrie

source: Tenant API
fr: API Client

source: Term for an Object Storage process that runs for a long time. Can indicate a hung process.
fr: Terme qui fait référence au processus de stockage d'objets quand il exécute pendant un long moment. Peut faire allusion à un processus de blocage.

source: Term used in the OSI network architecture for the data link layer. The data link layer is responsible for media access control, flow control and detecting and possibly correcting errors that may occur in the physical layer.
fr: Terme utilisé par l'architecture de réseau OSI pour la couche de liaisons de données. La couche de liaisons de données est chargée du contrôle d'accès aux media, du contrôle des flux et de détecter, et potentiellement corriger les erreurs qui peuvent avoir lieu dans la couche physique.

source: Term used in the OSI network architecture for the network layer. The network layer is responsible for packet forwarding including routing from one node to another.
fr: Terme utilisé pour la couche de réseau dans l'architecture de réseau OSI. La couche de réseau est chargée d'envoyer les paquets (routage inclus) d'un nœud à l'autre.

source: The API used to access the OpenStack Identity service provided through keystone.
fr: API utilisé pour accéder au service Identity d'OpenStack fourni par keystone.

source: The Amazon commercial block storage product.
fr: Produit de stocakge en blocs commercial d'Amazon.

source: The Amazon commercial compute product, similar to Compute.
fr: Produit Compute commercial d'Amazon, similaire à Compute.

source: The Apache Software Foundation supports the Apache community of open-source software projects. These projects provide software products for the public good.
fr: La fondation Apache Software Foundation soutient les projets de logiciels open-source de la communauté Apache. Ces projets fournissent des produits qui bénéficient au public.

source: The Block Storage driver for the SolidFire iSCSI storage appliance.
fr: Le pilote de stockage en bloc du dispositif de stockage SolidFire iSCSI.

source: The Block Storage service consists of the following components:
fr: Le service de Stockage en blocs comporte les éléments suivants :

source: The Border Gateway Protocol is a dynamic routing protocol that connects autonomous systems. Considered the backbone of the Internet, this protocol connects disparate networks to form a larger network.
fr: Border Gateway Protocol est un protocole de routage dynamique, qui connecte des systèmes autonomes. Considéré comme le backbone d'internet, ce protocole connecte des réseaux disparates pour former un réseau plus large.

source: The Ceph storage daemon.
fr: Le démon de stockage de Ceph.

source: The Compute RabbitMQ message exchange that remains active when the server restarts.
fr: L'échange de messages de Compute RabbitMQ qui demeure actif quand le serveur démarre à nouveau.

source: The Compute VM scheduling algorithm that attempts to start a new VM on the host with the least amount of load.
fr: L’algorithme de programmation d'une VM de Compute qui tente de démarrer une nouvelle VM sur l'hôte avec une moindre charge.
